[{
    "name": "Παύλος Πέππας",
    "romanize name": "Pavlos Peppas",
    "School-Department": "Ηλεκτρολόγων Μηχανικών & Τεχνολογίας Υπολογιστών",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 19540,
    "Scholar name": "Pavlos Peppas",
    "Scholar id": "44G4locAAAAJ",
    "Affiliation": "University of Patras",
    "Citedby": 1185,
    "Interests": [
        "Belief Revision",
        "Knowledge Representation and Reasoning",
        "Artificial Intelligence"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=44G4locAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Belief revision and organisational knowledge dynamics",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1057/palgrave.jors.2601592",
            "Abstract": "It is widely accepted nowadays that the ability of a firm to display sustained competitive advantage, relies heavily on its efficiency in managing organisational knowledge, and keeping it up-to-date with internal and external developments. It is therefore imperative to develop a deeper understanding of organisational knowledge evolution. In this paper, we propose the use of methods and techniques from the area of Belief Revision in studying organisational knowledge dynamics. Belief Revision lies at the intersection of Formal Philosophy and Computer Science, and studies the process by which a rational agent changes her beliefs in the light of new information. The formal models that have been developed in this area are intuitive and elegant, and in this paper we show how they can be imported into the context of organisational knowledge management.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:5nxA0vEk-isC",
            "Publisher": "Palgrave Macmillan UK"
        },
        {
            "Title": "Weaker axioms, more ranges",
            "Publication year": 2002,
            "Publication url": "https://content.iospress.com/articles/fundamenta-informaticae/fi51-3-03",
            "Abstract": "In the family of many-valued modal languages proposed by M. Fitting in 1992, every modal language is based on an underlying Heyting algebra which provides the space of truth values. The lattice of truth values is explicitly represented in the language by a set of special constants and this allows for forming weak, generalized, many-valued analogs of all classical modal axioms. Weak axioms of this kind have been recently investigated from the canonicity, completeness and correspondence perspective. In this paper, we provide some results on the effect of adopting weak versions of the axioms D, T, 4, 5 and w5 in the family of many-valued modal non-monotonic logics, à la McDermott and Doyle, introduced in [4] and further investigated in [7]. For many-valued modal languages built on finite chains, we extend the results of [7] by proving two quite general range theorems. We then hint on the relation between the …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:WF5omc3nYNoC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Comparative possibility in set contraction",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10992-011-9199-x.pdf",
            "Abstract": "In a recent article, Zhang and Foo generalized the AGM postulates for contraction to include infinite epistemic input. The new type of belief change is called set contraction. Zhang and Foo also introduced a constructive model for set contraction, called nicely ordered partition, as a generalization of epistemic entrenchment. It was shown however that the functions induced from nicely ordered partitions do not quite match the postulates for set contraction. The mismatch was fixed with the introduction of an extra condition called the limit postulate. The limit postulate establishes a connection between contraction by infinite epistemic input and contraction by finite epistemic input (reducing the former to the latter) and it is appealing both on mathematical and on conceptual grounds. It is debatable however whether the limit postulate can be adopted as a general feature of rationality in set contraction. Instead we …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Event Boards as Tools for Holistic AI.",
            "Publication year": 2018,
            "Publication url": "http://ceur-ws.org/Vol-2418/paper1.pdf",
            "Abstract": "We propose a novel architecture for holistic AI systems that integrate machine learning and knowledge representation. We extend an earlier proposal to divide representations into symbolic, conceptual and subconceptual levels. The key idea is to use event boards representing components of events as an analogy to blackboards found in earlier AI systems. The event components are ‘thematic roles’ such as agent, patient, recipient, action, and result. They are represented in terms of vectors of conceptual spaces rather than in symbolic form that has been used previously. A control level, including an attention mechanism decides which processes are run",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An investigation of parametrized difference revision operators",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10472-019-09625-x",
            "Abstract": "In this article, we provide the epistemic-entrenchment and partial-meet characterizations of a new, important class of concrete revision operators (all of which satisfy the AGM postulates for revision), called Parametrized Difference revision operators (PD operators, for short). PD operators are natural generalizations of Dalal’s revision operator, with a much greater range of applicability, hence, the epistemic-entrenchment and partial-meet characterizations of the latter are also provided, as a by-product. Lastly, we prove that PD operators satisfy the strong version of Parikh’s relevance-sensitive axiom for belief revision, showing that they are fully compatible with the notion of relevance.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Systems Theory",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=7397832514608326483&hl=en&oi=scholarr",
            "Abstract": "The discipline of modelling and simulation (Mas) preceded artificial intelligence (AI) chronologically. Moreover, the workers in one unfamiliar with, and sometimes unsympathetic to, those in the other. One reason for this is that in MaS the formal tools tend to center around analysis and probability theory with statistics, while in Al there is extensive use of discrete mathematics of one form or another, particularly logic. Over the years however,",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:eflP2zaiRacC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "On the strong version of Parikh’s relevance-sensitive axiom for belief revision",
            "Publication year": 2019,
            "Publication url": "http://panhellenic-logic-symposium.org/12/slides/Day4_Aravanis.pdf",
            "Abstract": "ON THE STRONG VERSION OF PARIKH’S RELEVANCE-SENSITIVE AXIOM FOR BELIEF \nREVISION Page 1 ON THE STRONG VERSION OF PARIKH’S RELEVANCE-SENSITIVE \nAXIOM FOR BELIEF REVISION Theofanis Aravanis Pavlos Peppas Mary-Anne Williams Page \n2 STRUCTURE OF PRESENTATION ✓ Belief Revision ✓ The AGM Paradigm ✓ Parikh’s \nNotion of Relevance ✓ Weak and Strong Version of Axiom (P) ✓ Properties of Faithful-Preorder \nFilterings ✓ Economy Due to Strong (P) ✓ Conclusions Page 3 BELIEF REVISION [1/2] • Mary \nhas just discovered that George and Dimitra are not her true parents. • She was adopted when \nshe was 6 months old from an orphanage in Sao Paolo. • The news really shook Mary. • Much \nof what she used to believe about herself and her family was wrong. • She must, now, put her \nthoughts back in order. 3 T. Aravanis, P. Peppas, M.-A. Williams Page 4 BELIEF [2/2] • A (-…",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prolegomena to concise theories of action",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1010516501232",
            "Abstract": "A new methodology for developing theories of action has recently emerged which provides means for formally evaluating the correctness of such theories. Yet, for a theory of action to qualify as a solution to the frame problem, not only does it need to produce correct inferences, but moreover, it needs to derive these inferences from a concise representation of the domain at hand. The new methodology however offers no means for assessing conciseness. Such a formal account of conciseness is developed in this paper. Combined with the existing criterion for correctness, our account of conciseness offers a framework where proposed solutions to the frame problem can be formally evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:roLk4NBRz8UC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Incompatibilities between iterated and relevance-sensitive belief revision",
            "Publication year": 2020,
            "Publication url": "https://www.jair.org/index.php/jair/article/view/11871",
            "Abstract": "The AGM paradigm for belief change, as originally introduced by Alchourron, Gärdenfors and Makinson, lacks any guidelines for the process of iterated revision. One of the most influential work addressing this problem is Darwiche and Pearl's approach (DP approach, for short), which, despite its well-documented shortcomings, remains to this date the most dominant. In this article, we make further observations on the DP approach. In particular, we prove that the DP postulates are, in a strong sense, inconsistent with Parikh's relevance-sensitive axiom (P), extending previous initial conflicts. Immediate consequences of this result are that an entire class of intuitive revision operators, which includes Dalal's operator, violates the DP postulates, as well as that the Independence postulate and Spohn's conditionalization are inconsistent with axiom (P). The whole study, essentially, indicates that two fundamental aspects of the revision process, namely, iteration and relevance, are in deep conflict, and opens the discussion for a potential reconciliation towards a comprehensive formal framework for knowledge dynamics.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Belief change and semiorders",
            "Publication year": 2014,
            "Publication url": "https://www.aaai.org/ocs/index.php/KR/KR14/paper/viewPaper/8026",
            "Abstract": "A central result in the AGM framework for belief revision is the construction of revisionfunctions in terms of total preorders on possible worlds. These preorders encode comparative plausibility: r< r'states that the world r is at least as plausible as r'. Indifference in the plausibility of two worlds, r, r', denoted r~ r', is defined as the absence of a preference between r and r'. Herein we take a closer look at plausibility indifference. We contend that the transitivity of indifference assumed in the AGM framework is not always a desirable property for comparative plausibility. Our argument originates from similar concerns in preference modelling, where a structure weaker than a total preorder, called a semiorder, is widely consider to be a more adequate model of preference. In this paper we essentially re-construct revision functions using semiorders instead of total preorders. We formulate postulates to characterisethis new, wider, class of revision functions, and prove that the postulates are sound and complete with respect to the semiorder-based construction. The corresponding class of contraction functions (via theLevi and Harper Identities) is also characterised axiomatically.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "STAIRS 2006: Proceedings of the Third Starting AI Researchers' Symposium",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-IUX-HXjjkQC&oi=fnd&pg=PA3&dq=info:M0QFziDeAsQJ:scholar.google.com&ots=i3MsJMquYh&sig=k7yrKvEe7yYGPCyG2nUdZLf74OU",
            "Abstract": "\" STAIRS 2006 is the third European Starting AI Researcher Symposium, an international meeting aimed at AI researchers, from all countries, at the beginning of their career: PhD students or people holding a PhD for less than one year. The topics of the papers included range from traditional AI areas to AI applications, such as Agents, Automated Reasoning, Belief Revision, Case-based Reasoning, Constraints, Data Mining & Information Extraction, Genetic Algorithms, Human Computer Interaction, Interactive Sensory Systems (Speech, Multi-Model Processing), Knowledge Representation, Logic Programming, Machine Learning, Natural Language Processing, Neural Networks, Nonmonotonic Reasoning, Planning & Scheduling, Reasoning about Action and Change, Robotics, Search, Semantic Web, Spatial & Temporal Reasoning and Uncertainty.\"",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:maZDTaKrznsC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Kinetic consistency and relevance in belief revision",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48758-8_26",
            "Abstract": "A critical aspect of rational belief revision that has been neglected by the classical AGM framework is what we call the principle of kinetic consistency. Loosely speaking, this principle dictates that the revision policies employed by a rational agent at different belief sets, are not independent, but ought to be related in a certain way. We formalise kinetic consistency axiomatically and semantically, and we establish a representation result explicitly connecting the two. We then combine the postulates for kinetic consistency, with Parikh’s postulate for relevant change, and add them to the classical AGM postulates for revision; we call this augmented set the extended AGM postulates. We prove the consistency and demonstrate the scope of the extended AGM postulates by showing that a whole new class of concrete revision operators introduced hererin, called PD operators, satisfies all extended AGM postulates …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:f2IySw72cVMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Systems theory: melding the AI and simulation perspectives",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30583-5_2",
            "Abstract": "The discipline of modelling and simulation (MaS) preceded artificial intelligence (AI) chronologically. Moreover, the workers in one area are typically unfamiliar with, and sometimes unsympathetic to, those in the other. One reason for this is that in MaS the formal tools tend to center around analysis and probability theory with statistics, while in AI there is extensive use of discrete mathematics of one form or another, particularly logic. Over the years however, MaS and AI developed many frameworks and perspectives that are more similar than their respective practitioners may care to admit. We will argue in this paper that these parallel developments have led to some myopia that should be overcome because techniques and insights borrowed from the other discipline can be very beneficial.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Incorporating relevance in epistemic states in belief revision",
            "Publication year": 2018,
            "Publication url": "https://www.aaai.org/ocs/index.php/KR/KR18/paper/viewPaper/18033",
            "Abstract": "We present an account of relevance in belief revision where, intuitively, one wants to only consider the relevant part of an agent's epistemic state in a revision. We assume that relevance is a domain-specific notion, and that (ir) relevance assertions are given as part of the agent's epistemic state. Such assertions apply in a given context, and are of the form``in the case that formula\\sigma holds, the Y part of the agent's epistemic state is independent of the rest of the epistemic state'', where Y is part of the signature of the language. Two approaches are given, one in which (in semantic terms) conditions are placed on a faithful ranking on possible worlds to enforce the (ir) relevance assertions, and a second in which the possible worlds characterising the agent's beliefs may be modified in a revision. These approaches are shown to yield the same resulting belief set. Corresponding postulates and a representation result are given. The overall approach is compared to that of Parikh's for language splitting as well as with multivalued dependencies in relational databases.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Construction of system of spheres-based transitively relational partial meet multiple contractions: An impossibility result",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370216000023",
            "Abstract": "In this paper we show that, contrary to what is the case in what concerns contractions by a single sentence, there is not a system of spheres-based construction of multiple contractions which generates each and every transitively relational partial meet multiple contraction.Before proving the general result, we consider the class of system of spheres-based multiple contractions introduced in [17], [5] and show that this class neither subsumes nor is subsumed by the class of transitively relational partial meet multiple contractions.Furthermore, we propose two system of spheres-based constructions of multiple contractions which generate (only) transitively relational partial meet multiple contractions. Therefore we can conclude that, although it is impossible to obtain a system of spheres-based definition of all the transitively relational partial meet multiple contractions, there are classes of system of spheres-based multiple …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Belief revision in answer set programming",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3139367.3139387",
            "Abstract": "Answer Set Programming is a declarative problem solving approach, initially tailored to modeling problems in the area of Knowledge Representation and Reasoning. In this article, we provide a logic program, in the context of Answer Set Programming framework, that implements the AGM belief revision process, constructed by means of faithful preorders. The above-mentioned approach constitutes a representative implementation of the Answer Set Programming's modeling methodology, as well as a practical method/construction, bringing us a step closer to the successful development of an AGM belief revision system, for real-world applications.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Unifying Semantics for Causal Ramifications",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=8jdtCQAAQBAJ&oi=fnd&pg=PA38&dq=info:Bk86dN2z3e8J:scholar.google.com&ots=KbUTUsDBL_&sig=CVUAxtlMzmkpOFxFVJDmnnA-Tg0",
            "Abstract": "A unifying semantic framework for different reasoning approaches provides an ideal tool to compare these competing alternatives. However, it has been shown recently that a pure preferential semantics alone is not capable of providing such a unifying framework. On the other hand, variants of preferential semantics augmented by additional structures on the state space have been successfully used to characterise some influential approaches to reasoning about action and causality. The primary aim of this paper is to provide an augmented preferential semantics that is general enough to unify two prominent frameworks for reasoning about action and causality—Sandewall's causal propagation semantics [4] and Thielscher's causal relationships approach [5]. There are indications that these and other different augmented preferential semantical approaches can by unified into a general framework, and provide the unified semantics that is lacking so far.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer"
        },
        {
            "Title": "Full Characterization of Parikh's Relevance-Sensitive Axiom for Belief Revision",
            "Publication year": 2019,
            "Publication url": "https://www.jair.org/index.php/jair/article/view/11838",
            "Abstract": "In this article, the epistemic-entrenchment and partial-meet characterizations of Parikh's relevance-sensitive axiom for belief revision, known as axiom (P), are provided. In short, axiom (P) states that, if a belief set  can be divided into two disjoint compartments, and the new information  relates only to the first compartment, then the revision of  by  should not affect the second compartment. Accordingly, we identify the subclass of epistemic-entrenchment and that of selection-function preorders, inducing AGM revision functions that satisfy axiom (P). Hence, together with the faithful-preorders characterization of (P) that has already been provided, Parikh's axiom is fully characterized in terms of all popular constructive models of Belief Revision. Since the notions of relevance and local change are inherent in almost all intellectual activity, the completion of the constructive view of (P) has a significant impact on many theoretical, as well as applied, domains of Artificial Intelligence.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Formal Conciseness Assessment of AR0",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9923708750861521096&hl=en&oi=scholarr",
            "Abstract": "A solution to the frame problem requires the development of a logic that is both correct in terms of the conclusions that it produces, as well as concise in its representations. The correctness of a logic of action can be assessed with the aid of theoretical tools that have been developed for such purposes in recent years. Conciseness on the other hand is harder to evaluate. In a previous paper,[4], we developed a general framework within which logics of action can be assessed in terms of conciseness. Herein we apply the results obtained in [4] to formally evaluate the logic of action AR0 proposed by Kartha and Lifschitz in [1].",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AGM-style belief revision of logic programs under answer set semantics",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40564-8_27",
            "Abstract": "In the past few years, several approaches for revision (and update) of logic programs have been studied. None of these however matched the generality and elegance of the original AGM approach to revision in classical logic. One particular obstacle is the underlying nonmonotonicity of the semantics of logic programs. Recently however, specific revision operators based on the monotonic concept of SE-models (which underlies the answer-set semantics of logic programs) have been proposed. Basing revision of logic programs on sets of SE-models has the drawback that arbitrary sets of SE-models may not necessarily be expressed via a logic program. This situation is similar to the emerging topic of revision in fragments of classical logic. In this paper we show how nonetheless classical AGM-style revision can be extended to various classes of logic programs using the concept of SE-models. That is, we …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Relevance in belief revision",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370215001228",
            "Abstract": "Possible-world semantics are provided for Parikh's relevance-sensitive axiom for belief revision, known as axiom (P). Loosely speaking, axiom (P) states that if a belief set K can be divided into two disjoint compartments, and the new information ϕ relates only to the first compartment, then the second compartment should not be effected by the revision of K by ϕ. Using the well-known connection between AGM revision functions and preorders on possible worlds as our starting point, we formulate additional constraints on such preorders that characterise precisely Parikh's axiom (P). Interestingly, the additional constraints essentially generalise a criterion of plausibility between possible worlds that predates axiom (P). A by-product of our study is the identification of two possible readings of Parikh's axiom (P), which we call the strong and the weak versions of the axiom. Regarding specific operators, we show that Dalal …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Capturing context in causal propagation",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.703.2315&rep=rep1&type=pdf",
            "Abstract": "Conciseness and intuitive representation are two primary objectives motivating the work on semantics for various logics of action. In addition, a unifying semantic framework for different reasoning approaches provides an ideal tool to compare these competing alternatives. It has been shown recently that a pure preferential semantics alone is not capable of providing such a unifying framework for a class of action theories dealing with causality. On the other hand, variants of preferential semantics augmented by additional structures on the state space have been successfully used to characterise some influential approaches to causal reasoning about action. The primary aim of this paper is to provide a general unifying semantics for Sandewall’s causal propagation semantics [Sandewall, 1996] and McCain-Turner causal fixed-points approach [McCain and Turner, 1995].",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parametrised difference revision",
            "Publication year": 2018,
            "Publication url": "https://www.aaai.org/ocs/index.php/KR/KR18/paper/viewPaper/18073",
            "Abstract": "Despite the great theoretical advancements in the area of Belief Revision, there has been limited success in terms of implementations. One of the hurdles in implementing revision operators is that their specification (let alone their computation), requires substantial resources. On the other hand, implementing a specific revision operator, like Dalal's operator, would be of limited use. In a recent paper we generalised Dalal's construction defining a whole family of concrete revision operators, called Parametrised Difference revision operators or PD operators for short. This family is wide enough to cover a whole range of different applications, and at the same time it is easy to represent. In this paper we characterise axiomatically the family of PD operators, study its computational complexity, and discuss its benefits for belief revision implementations.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On a Simple 3-valued Modal Language and a 3-valued Logic of ‘not-fully-justified’Belief",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8131523/",
            "Abstract": "In this paper, we advocate the usage of the family of Heyting-valued modal logics, introduced by M. Fitting, by presenting a simple 3-valued modal language and axiomatizing an interesting 3-valued logic of belief. We give two simple bisimulation relations for the modal language, one that respects non-falsity and one that respects the truth value. The doxastic logic axiomatized, apart from being interesting in its own right for KR applications, (i) it comes with an underlying 3-valued propositional logic which is a syntactic variant of the ‘logic of here-and-there’, whose importance in KR and Logic Programming is well-known, (ii) it is endowed from its very inception with a Gentzen-style proof theory from [Fit92] and a completeness theorem from [KNP02], (iii) it can be equivalently seen as a logic describing the epistemic agreement of two interrelated agents: a K45 agent who ‘dominates’ an S5 agent, (iv) as we show here …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:ZeXyd9-uunAC",
            "Publisher": "OUP"
        },
        {
            "Title": "Conciseness Considerations on Logics of Action",
            "Publication year": 2004,
            "Publication url": "http://users.uop.gr/~ckoutras/JIS-2004.pdf",
            "Abstract": "In recent years a number of formal results have been established on the correctness of some well-known logics of actions. Correctness however is only one side of the coin; for a theory of action to qualify as a solution to the frame problem, the conciseness of its representations is also relevant. In a previous paper,[15], we developed a general framework within which logics of action can be assessed both in terms of correctness as well as conciseness. Herein we apply the results obtained in [15] to evaluate the logic of action proposed by Kartha and Lifschitz in [7].",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:qUcmZB5y_30C",
            "Publisher": "FREUND PUBLISHING HOUSE LTD."
        },
        {
            "Title": "Associations between constructive models for set contraction",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_15",
            "Abstract": " Belief Change is one of the central research topics in Knowledge Representation and theory revision and contraction are two of the most important operators in Belief Change. Recently the original axiomatization of revision and contraction was extended to include epistemic input represented by a (possibly infinite) set of sentences (as opposed to a single sentence) giving rise to the operators of set revision (also known as multiple revision) and set contraction. Both set revision and set contraction have been characterized in terms of constructive models called system of spheres and epistemic grasp respectively. Based on these links, in this paper we provide a characterization of set contraction in terms of system of spheres, and we identify the necessary and sufficient conditions under which the system-of-spheres model and the epistemic-grasp model give rise to the same set contraction.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Agent-Oriented Knowledge Management",
            "Publication year": 2002,
            "Publication url": "https://warwick.ac.uk/fac/soc/wbs/conf/olkc/archive/oklc3/papers/id152.pdf",
            "Abstract": "Recent approaches to management acknowledge the central role of organizational knowledge evolution in a firm’s ability to obtain sustained competitive advantage. A notion similar to knowledge evolution has been studied extensively in the area of Belief Revision. In this area, formal models have been developed for analyzing the process by which an agent changes her beliefs in the light of new information. In this article we examine the use of techniques and results from Belief Revision to formally describe and analyze organizational knowledge evolution. Moreover, we will argue that a main routine which leads to a firm’s long term performance, is the one that supports the extraction and transformation of the maximum articulable knowledge into articulated and codified knowledge, technical or organizational, through systematic and intensive efforts.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Revising horn theories",
            "Publication year": 2011,
            "Publication url": "https://www.aaai.org/ocs/index.php/IJCAI/IJCAI11/paper/viewPaper/3314",
            "Abstract": "This paper investigates belief revision where the underlying logic is that governing Horn clauses. It proves to be the case that classical (AGM) belief revision doesn’t immediately generalise to the Horn case. In particular, a standard construction based on a total preorder over possible worlds may violate the accepted (AGM) postulates. Conversely, Horn revision functions in the obvious extension to the AGM approach are not captured by total preorders over possible worlds. We address these difficulties by first restricting the semantic construction to\" well behaved\" orderings; and second, by augmenting the revision postulates by an additional postulate. This additional postulate is redundant in the AGM approach but not in the Horn case. In a representation result we show that these two approaches coincide. Arguably this work is interesting for several reasons. It extends AGM revision to inferentially-weaker Horn theories; hence it sheds light on the theoretical underpinnings of belief change, as well as generalising the AGM paradigm. Thus, this work is relevant to revision in areas that employ Horn clauses, such as deductive databases and logic programming, as well as areas in which inference is weaker than classical logic, such as in description logic.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adjectival conceptual space generation with semantic gradation",
            "Publication year": 2018,
            "Publication url": "https://portal.research.lu.se/portal/en/publications/adjectival-conceptual-space-generation-with-semantic-gradation(6150bdd3-cbb2-4b8c-9ae4-2aafc66652c2).html",
            "Abstract": "Adjectival conceptual space generation with semantic gradation - Lund University Accessibility \nstatement Login for staff Lund University IN ENGLISH PÅ SVENSKA Research Portal Find \nresearchers, research outputs (eg publications), projects, infrastructures and units at Lund \nUniversity People Research Outputs Projects Infrastructure Organisation HomeResearch Outputs \nAdjectival conceptual space generation with semantic gradati... Adjectival conceptual space \ngeneration with semantic gradation Research output: Chapter in Book/Report/Conference \nproceeding › Paper in conference proceeding Overview Cite Details Authors Richard Billingsley \nPeter Gärdenfors Pavlos Peppas Henri Prade David Skillicorn Mary-Anne Williams Organisations \nCognitive Science Cognitive modeling External organisations University of Technology \nSydney University of Patras Université Paul Sabatier Research areas and keywords () /…",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Realization for Causal Nondeterministic Input-Output Systems",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1010524802140",
            "Abstract": "There are two well-developed formalizations of discrete time dynamic systems that evidently share many concerns but suffer from a lack of mutual awareness. One formalization is classical systems and automata theory. The other is the logic of actions in which the situation and event calculi are the strongest representatives. Researchers in artificial intelligence are likely to be familiar with the latter but not the former. This is unfortunate, for systems and automata theory have much to offer by way of insight into problems raised in the logics of action. This paper is an outline of how the input-output view of systems and its associated solution of state realization may be applied to the formalization of dynamics that uses a situation calculus approach. In particular, because the latter usually admits incompletely specified dynamics, which induces a non-deterministic input-output system behavior, we first show that …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Constructive models for contraction with intransitive plausibility indifference",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11558-0_25",
            "Abstract": "Plausibility rankings play a central role in modeling Belief Change, and they take different forms depending on the type of belief change under consideration: preorders on possible worlds, epistemic entrenchments, etc. A common feature of all these structures is that plausibility indifference is assumed to be transitive. In a previous article, [7], we argued that this is not always the case, and we introduced new sets of postulates for revision and contraction (weaker variants of the classical AGM postulates), that are liberated from the indifference transitivity assumption. Herein we complete the task by making the necessary adjustments to the epistemic entrenchment and the partial meet models. In particular we lift the indifference transitivity assumption from both these two models, and we establish representation results connecting the weaker models with the weaker postulates for contraction introduced in [7].",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Early estimation of users’ perception of software quality",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11219-005-6215-9",
            "Abstract": "This paper presents a methodology for estimating users’ opinion of the quality of a software product. Users’ opinion changes with time as they progressively become more acquainted with the software product. In this paper, we study the dynamics of users’ opinion and offer a method for assessing users’ final perception, based on measurements in the early stages of product release. The paper also presents methods for collecting users’ opinion and from the derived data, shows how their initial belief state for the quality of the product is formed. It adapts aspects of Belief Revision theory in order to present a way of estimating users’ opinion, subsequently formed after their opinion revisions. This estimation is achieved by using the initial measurements and without having to conduct surveys frequently. It reports the correlation that users tend to infer among quality characteristics and represents this correlation …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A study of possible-worlds semantics of relevance-sensitive belief revision",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/logcom/article-abstract/30/5/1125/5843673",
            "Abstract": "Parikh’s relevance-sensitive axiom (P) for belief revision is open to two different interpretations, i.e. the weak and the strong version of (P), both of which are plausible depending on the context. Given that strong (P) has not received the attention it deserves, in this article, an extended examination of it is conducted. In particular, we point out interesting properties of the semantic characterization of the strong version of (P), as well as a vital feature of it that, potentially, results in a significant drop on the resources required for an implementation of a belief-revision system. Lastly, we shed light on the natural connection between global and local revision functions, via their corresponding semantic characterization, hence, a means for constructing global revision functions from local ones, and vice versa, is provided.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "If I know it then it can’t be false (and if it’s true then it is not impossible)",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780429076893-22/know-false-true-impossible-costas-koutras-christos-nomikos-pavlos-peppas",
            "Abstract": "In this paper we describe a three-valued logic of belief, a member of the family of many-valued modal logics introduced by M. Fitting. This logic possesses the axioms of positive and negative introspection along with an interesting version of axiom Τ which asserts that a known fact cannot be false, even if it has not been verified yet. The proposed logic is of computational interest for two reasons (i) it can also be seen as the logic describing the epistemic consensus of two interrelated agents: a K45 agent dominating an S5 agent, and (ii) its satisfiability problem is NP-complete. The latter should be contrasted to the well-known fact that the satisfiability problem for the above mentioned epistemic logics with two or more agents is PSPACE-complete.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:eJXPG6dFmWUC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "System properties of action theories",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30583-5_45",
            "Abstract": "Logic-based theories of action and automata-based systems theories share concerns about state dynamics that are however not reflected by shared insights. As an example of how to remedy this we examine a simple variety of situation calculus theories from the viewpoint of system-theoretic properties to reveal relationships between them. These provide insights into relationships between logic-based solution policies, and are suggestive of similar relationships for more complex versions.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Journal of logic and computation-Preface",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=212000009057013214&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:XiSMed-E-HIC",
            "Publisher": "OXFORD UNIV PRESS"
        },
        {
            "Title": "Observations on darwiche and Pearl's approach for iterated belief revision",
            "Publication year": 2019,
            "Publication url": "https://opus.lib.uts.edu.au/handle/10453/141461",
            "Abstract": "© 2019 International Joint Conferences on Artificial Intelligence. All rights reserved. Notwithstanding the extensive work on iterated belief revision, there is, still, no fully satisfactory solution within the classical AGM paradigm. The seminal work of Darwiche and Pearl (DP approach, for short) remains the most dominant, despite its well-documented shortcomings. In this article, we make further observations on the DP approach. Firstly, we prove that the DP postulates are, in a strong sense, inconsistent with Parikh's relevance-sensitive axiom (P), extending previous initial conflicts. Immediate consequences of this result are that an entire class of intuitive revision operators, which includes Dalal's operator, violates the DP postulates, as well as that the Independence postulate and Spohn's conditionalization are inconsistent with (P). Lastly, we show that the DP postulates allow for more revision polices than the ones that can be captured by identifying belief states with total preorders over possible worlds, a fact implying that a preference ordering (over possible worlds) is an insufficient representation for a belief state.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modelling belief-revision functions at extended languages",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=17279931894078513861&hl=en&oi=scholarr",
            "Abstract": "The policy of rational belief revision is encoded in the so-called AGM revision functions. Such functions are characterized (both axiomatically and constructively) within the well-known AGM paradigm, proposed by Alchourrón, Gärdenfors and Makinson. In this article, we show that - although not in a straightforward way - a sufficient extension of the underlying language allows for the modelling of any AGM revision function (defined at the initial language), by means of a Hamming-based rule for belief revision introduced by Dalal (defined at the extended language). The established results enrich the applicability of Dalal's proposal, leading to a conceptual and ontological reduction, as well as open new doors for the construction of any type of revision function in a practical context, given the intuitive appeal and simplicity of Dalal's construction.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Two axiomatic characterizations for the system of spheres-based (and the epistemic entrenchment-based) multiple contractions",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10472-015-9454-x",
            "Abstract": "In some recent works (Reis 2011, Fermé and Reis, J. Philos. Log. 41, 29–52, 2012, Fermé and Reis, Rev. Symb. Log. 6, 460–487, 2013) two new kinds of multiple contraction functions have been proposed, namely the system of spheres-based multiple contractions and the epistemic entrenchment-based multiple contractions, as generalizations (to the case of multiple contraction) of the well-known classes of systems of spheres-based and of epistemic entrenchment-based (singleton) contractions. Additionally, a representation theorem for the class of epistemic entrenchment-based multiple contraction has been proposed, and it has been shown that the two newly proposed constructions are equivalent, in the sense that a multiple contraction function is a system of spheres-based multiple contraction if and only if it is an epistemic entrenchment-based multiple contraction. In this paper we present two …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Handbook of Knowledge Representation, chapter 8-Belief Revision",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=16514646358559729912&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Dynamic belief revision operators",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370203000171",
            "Abstract": "The AGM approach to belief change is not geared to provide a decent account of iterated belief change. Darwiche and Pearl have sought to extend the AGM proposal in an interesting way to deal with this problem. We show that the original Darwiche–Pearl approach is, on the one hand excessively strong and, on the other rather limited in scope. The later Darwiche–Pearl approach, we argue, although it addresses the first problem, still remains rather permissive. We address both these issues by (1) assuming a dynamic revision operator that changes to a new revision operator after each instance of belief change, and (2) strengthening the Darwiche–Pearl proposal. Moreover, we provide constructions of this dynamic revision operator via entrenchment kinematics as well as a simple form of lexicographic revision, and prove representation results connecting these accounts.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Maps in multiple belief change",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2362355.2362358",
            "Abstract": "Multiple Belief Change extends the classical AGM framework for Belief Revision introduced by Alchourron, Gardenfors, and Makinson in the early ’80s. The extended framework includes epistemic input represented as a (possibly infinite) set of sentences, as opposed to a single sentence assumed in the original framework. The transition from single to multiple epistemic input worked out well for the operation of belief revision. The AGM postulates and the system-of-spheres model were adequately generalized and so was the representation result connecting the two. In the case of belief contraction however, the transition was not as smooth. The generalized postulates for contraction, which were shown to correspond precisely to the generalized partial meet model, failed to match up to the generalized epistemic entrenchment model. The mismatch was fixed with the addition of an extra postulate, called the limit …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "ACM"
        },
        {
            "Title": "Legal reasoning in answer set programming",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8576053/",
            "Abstract": "Answer Set Programming is a declarative problem solving approach, initially tailored to modelling problems in the area of Knowledge Representation and Reasoning. In this article, we provide a knowledge-based system, capable of representing and reasoning about legal knowledge in the context of Answer Set Programming - thus, modelling non-monotonicity that is inherent in legal arguments. The work, although limited to a specific indicative domain, namely, university regulations, has a variety of extensions. The overall approach constitutes a representative implementation of the Answer Set Programming's modelling methodology, as well as an enhancing of the bond between Artificial Intelligence and Legal Science, bringing us a step closer to a successful development of an automated legal reasoning system for real-world applications.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distance Semantics for Relevance-Sensitive Belief Revision.",
            "Publication year": 2004,
            "Publication url": "https://www.aaai.org/Papers/KR/2004/KR04-034.pdf",
            "Abstract": "Possible-world semantics are provided for Parikh’s relevance-sensitive model for belief revision. Having Grove’s system-of-spheres construction as a base, we consider additional constraints on measuring distance between possible worlds, and we prove that, in the presence of the AGM postulates, these constraints characterize precisely Parikh’s axiom (P). These additional constraints essentially generalize a criterion of similarity that predates axiom (P) and was originally introduced in the context of Reasoning about Action. A by-product of our study is the identification of two possible readings of Parikh’s axiom (P), which we call the strong and the weak versions of the axiom. An interesting feature of the strong version is that, unlike classical AGM belief revision, it makes associations between the revision policies of different theories.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The altruistic robot: Do what i want, not just what i say",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-67582-4_11",
            "Abstract": "As autonomous robots expand their application beyond research labs and production lines, they must work in more flexible and less well defined environments. To escape the requirement for exhaustive instruction and stipulated preference ordering, a robot’s operation must involve choices between alternative actions, guided by goals. We describe a robot that learns these goals from humans by considering the timeliness and context of instructions and rewards as evidence of the contours and gradients of an unknown human utility function. In turn, this underlies a choice-theory based rational preference relationship. We examine how the timing of requests, and contexts in which they arise, can lead to actions that pre-empt requests using methods we term contemporaneous entropy learning and context sensitive learning. We provide experiments on these two methods to demonstrate their usefulness in …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Knowledge and Belief after a round of information acquisition from Trusted sources",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=5903258512968426094&hl=en&oi=scholarr",
            "Abstract": "We propose a family of modal logics, intended to capture the dynamics of knowledge and belief in a simple, interesting scenario: that of a single intelligent agent, conducting a round of information acquisition from a finite number of trusted sources. The modal language we employ comprises two normal epistemic operators, denoting what is known by the agent before (Kb) and after (Ka) the round of consultation, along with a stock of classical modal operators Ti which capture the basics of information acquisition. The agent’s knowledge before and after the round of consultation, is governed by the principles of logic S4. 2, while belief is captured by a derived operator, in the style introduced by W. Lenzen in the’70s [Len79]. Knowledge and belief dynamics is captured by the interplay between Kb, Ka and the Ti’s, expressing the way (s) a rational agent’s knowledge and belief may be affected by the acquisition of new …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "INSTITUT FUR INFORMATIONSSYSTEME",
            "Publication year": 2016,
            "Publication url": "https://www.dbai.tuwien.ac.at/local/reports/dbai-tr-2016-100.pdf",
            "Abstract": "In Artificial Intelligence, a key question concerns how an agent may rationally revise its beliefs in light of new information. The standard (AGM) approach to belief revision assumes that the underlying logic contains classical propositional logic. This is a significant limitation, since many representation schemes in AI don’t subsume propositional logic. In this paper we consider the question of what the minimal requirements are on a logic, such that the AGM approach to revision may be formulated. We show that AGM-style revision can be obtained even when extremely little is assumed of the underlying language and its semantics; in fact, one requires little more than a language with sentences that are satisfied at models, or possible worlds. The classical AGM postulates are expressed in this framework and a representation result is established between the postulate set and certain preorders on possible worlds. To obtain the representation result, we add a new postulate to the AGM postulates, and we add a constraint to preorders on worlds. Crucially, both of these additions are redundant in the original AGM framework, and so we extend, rather than modify, the AGM approach. As well, iterated revision is addressed and shown to be compatible with our approach. Various examples are given to illustrate the approach, including Horn clause revision, revision in extended logic programs, and belief revision in a very basic logic called literal revision.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "General belief revision",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3203409",
            "Abstract": "In artificial intelligence, a key question concerns how an agent may rationally revise its beliefs in light of new information. The standard (AGM) approach to belief revision assumes that the underlying logic contains classical propositional logic. This is a significant limitation, since many representation schemes in AI don’t subsume propositional logic. In this article, we consider the question of what the minimal requirements are on a logic, such that the AGM approach to revision may be formulated. We show that AGM-style revision can be obtained even when extremely little is assumed of the underlying language and its semantics; in fact, one requires little more than a language with sentences that are satisfied at models, or possible worlds. The classical AGM postulates are expressed in this framework and a representation result is established between the postulate set and certain preorders on possible worlds. To …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:SP6oXDckpogC",
            "Publisher": "ACM"
        },
        {
            "Title": "Canonicity and completeness results for many-valued modal logics",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.3166/jancl.12.7-41",
            "Abstract": "We prove frame determination results for the family of many-valued modal logics introduced by M. Fitting in the early '90s. Each modal language of this family is based on a Heyting algebra, which serves as the space of truth values, and is interpreted on an interesting version of possible-worlds semantics: the modal frames are directed graphs whose edges are labelled with an element of the underlying Heyting algebra. We introduce interesting generalized forms of the classical axioms D, T, B, 4, and 5 and prove that they are canonical for certain algebraic frame properties, which generalize seriality, reflexivity, symmetry, transitivity and euclideanness. Our results are quite general as they hold for any modal language built on a complete Heyting algebra.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Belief Revision: Revising Horn clause theories",
            "Publication year": 2011,
            "Publication url": "https://www2.cs.sfu.ca/~jim/publications/IJCAI11a.pdf",
            "Abstract": "This paper investigates belief revision where the underlying logic is that governing Horn clauses. It proves to be the case that classical (AGM) belief revision doesn’t immediately generalise to the Horn case. In particular, a standard construction based on a total preorder over possible worlds may violate the accepted (AGM) postulates. Conversely, Horn revision functions in the obvious extension to the AGM approach are not captured by total preorders over possible worlds. We address these difficulties by first restricting the semantic construction to “well behaved” orderings; and second, by augmenting the revision postulates by an additional postulate. This additional postulate is redundant in the AGM approach but not in the Horn case. In a representation result we show that these two approaches coincide. Arguably this work is interesting for several reasons. It extends AGM revision to inferentially-weaker Horn theories; hence it sheds light on the theoretical underpinnings of belief change, as well as generalising the AGM paradigm. Thus, this work is relevant to revision in areas that employ Horn clauses, such as deductive databases and logic programming, as well as areas in which inference is weaker than classical logic, such as in description logic.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Belief revision",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574652607030088",
            "Abstract": "The study of the process of belief revision, which gave rise to an exciting research area with the same name, can be traced back to the early 1980s. The framework that has evolved from what is now known as the “AGM paradigm” (or simply AGM) after the initials of its three founders to this date is a dominant framework in belief revision. Much has happened since 1985. The formal apparatus developed has been enhanced and thoroughly studied, new research directions have emerged from it, connections with neighboring fields have been established, and a lot more is currently under way. This chapter discusses the main developments in belief revision, which are presented in a historical order, starting with the classic AGM paradigm following the trail till the present day. After identifying the class of rational revision and contraction functions axiomatically, constructive models for these functions …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Causality and minimal change demystified",
            "Publication year": 2001,
            "Publication url": "https://129.94.242.51/~morri/Papers/ijcai01.pdf",
            "Abstract": "The Principle of Minimal Change is prevalent in various guises throughout the development of areas such as reasoning about action, belief change and nonmonotonic reasoning. Recent literature has witnessed the proposal of several theories of action that adopt an explicit representation of causality. It is claimed that an explicit notion of causality is able to deal with the frame problem in a manner not possible with traditional approaches based on minimal change.However, such claims remain untested by all but representative examples. It is our purpose here to objectively test these claims in an abstract sense; to determine whether an explicit representation of causality is capable of providing something that the Principle of Minimal Change is unable to capture. Working towards this end, we provide a precise characterisation of the limit of applicability of minimal change.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Formal Assessment of Argumentation Support Systems.",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=5CDpAwAAQBAJ&oi=fnd&pg=PA182&dq=info:P6GkxLf3Z0gJ:scholar.google.com&ots=3WqsDGWZP7&sig=sGt7tBYywdiHeTB-3ouSgPatRDI",
            "Abstract": "The development of argumentation support systems for different types of groups and application areas has been receiving growing interest in the last twenty years. Such systems address the needs of a user to interpret and reason about knowledge during a discourse, and demonstrate diverse human and machine reasoning functionalities. However, methodologies to check whether the reasoning mechanisms of such systems adhere to broadly accepted argumentation theories are missing. Provision of such methodologies is of much value, especially in data intensive contexts. The approach described in this paper is a first step towards this direction. Specifically, we formally assess a specific argumentation support system, namely HERMES, against Dungs argumentation theory and prove its correctness as far as the acceptability of arguments is concerned.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Epistemic Entrenchment Characterization of Parikh's Axiom",
            "Publication year": 2017,
            "Publication url": "https://www.ijcai.org/Proceedings/2017/0107.pdf",
            "Abstract": "In this article, we provide the epistemicentrenchment characterization of the weak version of Parikh’s relevance-sensitive axiom for belief revision—known as axiom (P)—for the general case of incomplete theories. Loosely speaking, axiom (P) states that, if a belief set K can be divided into two disjoint compartments, and the new information φ relates only to the first compartment, then the second compartment should not be affected by the revision of K by φ. The above-mentioned characterization, essentially, constitutes additional constraints on epistemicentrenchment preorders, that induce AGM revision functions, satisfying the weak version of Parikh’s axiom (P).",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measuring similarity in belief revision",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8132608/",
            "Abstract": "The Possible Models Approach (PMA) introduced by Winslett, proposes, among other things, a domain-independent criterion for measuring similarity between different states of a dynamic system. The concept of similarity between states (possible worlds) appears also in the area of Belief Revision in the form of a system of spheres. Systems of spheres are in turn connected to epistemic entrenchments by means of the AGM revision functions that the two structures induce. In view of these connections, in this article we study the implications of adopting PMA's criterion of similarity in the context of Belief Revision. More precisely, we formulate conditions that capture PMA's criterion of similarity in terms of systems of spheres (PMA systems of spheres) and we provide an axiomatic characterization of the class of epistemic entrenchments corresponding to systems of spheres that comply with PMA's criterion of similarity (PMA …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:eQOLeE2rZwMC",
            "Publisher": "OUP"
        },
        {
            "Title": "Action Invariants and System Constraints in STRIPS",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Norman-Foo/publication/228619663_Action_Invariants_and_System_Constraints_in_STRIPS/links/0deec52d902242e6ea000000/Action-Invariants-and-System-Constraints-in-STRIPS.pdf",
            "Abstract": "In [Foo, et. al. 04] we re-visited the problem of converting action specifications into system constraints by re-examining it in the very simple setting of STRIPS, motivated by the simplicity of its simplicity as an action specification language. We showed how to extract action invariants, and then system laws, from STRIPS specifications. This was the consistency part of our method, and we deferred its adequacy to a later report. This paper provides the missing part, thus closing the circle. Here we show that the invariants extracted by our method can be tested by using them to complete partial specifications that may match those which were used as inputs to the extraction phase. Even when the match is incomplete there is interesting ontological information that can be inferred from it. Fixed point theory is used to account for some of the proposed algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Circumscriptive models and automata",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=1565056658487174871&hl=en&oi=scholarr",
            "Abstract": "In applying circumscription to minimise fluent change in the logic of actions, we could either let the Holds predicate vary, or let the Result function vary. We show that the solutions of the latter are included in that of the former when viewed from an input-output perspective. This is done by using concepts and constructions from classical automata and systems theory, in which state, inertia, causality and observability are natural constructs. A case is made for automata as circumscriptive models. The role of the Markov property is also examined.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CEUR WORKSHOP PROCEEDINGS",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=11982783872359813852&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The limit assumption and multiple revision",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8132961/",
            "Abstract": "In his seminal paper in 1988, Grove provided possible-world semantics for the axiomatic approach to belief revision proposed by Alchourron, Gardenfors, and Makinson. Grove's semantics are based on a system of spheres, which is essentially a total preorder on possible worlds, satisfying a particular smoothness condition called the limit assumption. In this article we build upon Grove's representation result working in two (related) directions. In particular, the first part of the article considers a number of smoothness conditions (variants of the limit assumption) as additional constraints to systems of spheres, and studies their implications for AGM belief revision. Such smoothness conditions are of particular importance in the context of multiple revision, that is, revision with respect to a (possibly infinite) set of sentences. In the second part of the article we examine closely this process and, in the spirit of Grove, we provide …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "OUP"
        },
        {
            "Title": "Iterated Belief Revision and Dalal's Operator",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201038",
            "Abstract": "One of the main shortcomings of the early AGM paradigm is its lack of any guidelines for iterated revision; it formalizes only one-step rational belief revision. Darwiche and Pearl, subsequently, addressed this problem by introducing four additional postulates (the DP postulates), supplementing the AGM ones. Despite the popularity of the DP approach, there are still controversies surrounding the DP postulates. In this article, we prove a conflict between each one of the latter, and one of the most popular and intuitive\" off the shelf\" revision functions, that is Dalal's revision operator.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A panorama of iterated revision",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-7759-0_5",
            "Abstract": "In 1985, David Makinson, together with Carlos Alchourron and Peter Gärdenfors published an article, the now renowned “AGM paper”, that gave rise to an entire new area of research: Belief Revision. The AGM paper set the stage for studying belief revision and provided the first fundamental results in the area. There was however one aspect of belief revision that was not addressed in the AGM paper: iterated belief revision. Since 1985, there have been numerous attempts to tackle this problem. In this chapter, we shall review some of the most influential approaches to the problem of iterated belief revision, and discuss their strengths and shortcomings.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Constraints from STRIPS—preliminary report",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30549-1_58",
            "Abstract": "We re-visit the problem of converting action specifications into system constraints by re-examining it in the very simple setting of STRIPS. This has the merit of making many thorny issues relatively transparent. The paper is in the form of an extended summary of ongoing work and many of the results are merely outlined. But sufficient details are included to indicate where we will be taking things further, and to encourage others to pursue the same objectives. These objectives are in some sense a kind of reverse-engineering, as the database community is evidently familiar with the idea of starting with constraints and then deriving action specifications from them. However in AI reactive systems, action specifications are often the primary entity, so techniques to unearth the implicit constraints can facilitate better designs.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Uts unleashed! robocup@ home sspl champions 2019",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-35699-6_49",
            "Abstract": " This paper summarizes the approaches employed by Team UTS Unleashed! to take First Place in the 2019 RoboCup@Home Social Standard Platform League. First, our system architecture is introduced. Next, our approach to basic skills needed for a strong performance in the competition. We describe several implementations for tests participation. Finally our software development methodology is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:vRqMK49ujn8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Self-referential basis of undecidable dynamics: From the Liar paradox and the halting problem to the edge of chaos",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1571064519300077",
            "Abstract": "In this paper we explore several fundamental relations between formal systems, algorithms, and dynamical systems, focussing on the roles of undecidability, universality, diagonalization, and self-reference in each of these computational frameworks. Some of these interconnections are well-known, while some are clarified in this study as a result of a fine-grained comparison between recursive formal systems, Turing machines, and Cellular Automata (CAs). In particular, we elaborate on the diagonalization argument applied to distributed computation carried out by CAs, illustrating the key elements of Gödel's proof for CAs. The comparative analysis emphasizes three factors which underlie the capacity to generate undecidable dynamics within the examined computational frameworks: (i) the program-data duality; (ii) the potential to access an infinite computational medium; and (iii) the ability to implement negation …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:P5F9QuxV20EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Construction of system of spheres-based transitively relational partial meet multiple contractions: an impossibility result",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/3171837.3172011",
            "Abstract": "In this paper we show that, contrary to what is the case in what concerns contractions by a single sentence, there is not a system of spheres-based construction of multiple contractions which generates each and every transitively relational partial meet multiple contraction.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Connecting Recovery and Iterated Belief Revision",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Pavlos-Peppas/publication/266483915_Connecting_Recovery_and_Iterated_Belief_Revision/links/5761af1b08aeeada5bc50018/Connecting-Recovery-and-Iterated-Belief-Revision.pdf",
            "Abstract": "In this paper we introduce a new postulate for belief contraction that has its origins in the well known recovery postulate. We show that our new postulate can be reformulated into a postulate for iterated revision, which we call Iterated Recovery (IR), and we prove that (IR) is strictly weaker than Darwiche and Pearl’s second postulate (DP2). We provide possible-world-semantics for (IR) in terms of systems of spheres and we study additional constraints related to (IR) and (DP2).",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conflicts between Relevance-Sensitive and Iterated Belief Revision.",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3Wsn3SwEBScC&oi=fnd&pg=PA85&dq=info:4BbhZ8hahtMJ:scholar.google.com&ots=a2qvjI6AmR&sig=3SM1UylmvoxJYJXZI9xD20kMXZM",
            "Abstract": "The original AGM paradigm focuses only on one-step belief revision and leaves open the problem of revising a belief state with whole sequences of evidence. Darwiche and Pearl later addressed this problem by introducing extra (intuitive) postulates as a supplement to the AGM ones. A second shortcoming of the AGM paradigm, seemingly unrelated to iterated revision, is that it is too liberal in its treatment of the notion of relevance. Once again this problem was addressed with the introduction of an extra (also very intuitive) postulate by Parikh. The main result of this paper is that Parikh postulate for relevance-sensitive belief revision is inconsistent with each of the Darwiche and Pearl postulates for iterated belief revision.",
            "Abstract entirety": 1,
            "Author pub id": "44G4locAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Belief revision in Horn theories",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370214001155",
            "Abstract": "This paper investigates belief revision where the underlying logic is that governing Horn clauses. We show that classical (AGM) belief revision doesn't immediately generalise to the Horn case. In particular, a standard construction based on a total preorder over possible worlds may violate the accepted (AGM) postulates. Conversely, in the obvious extension to the AGM approach, Horn revision functions are not captured by total preorders over possible worlds. We address these difficulties by introducing two modifications to the AGM approach. First, the semantic construction is restricted to “well behaved” orderings, what we call Horn compliant orderings. Second, the revision postulates are augmented by an additional postulate. Both restrictions are redundant in the AGM approach, but not in the Horn case. In a representation result we show that the class of revision functions captured by Horn compliant total …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A unifying semantics for causal ramifications",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44533-1_8",
            "Abstract": "A unifying semantic framework for different reasoning approaches provides an ideal tool to compare these competing alternatives. However, it has been shown recently that a pure preferential semantics alone is not capable of providing such a unifying framework. On the other hand, variants of preferential semantics augmented by additional structures on the state space have been successfully used to characterise some influential approaches to reasoning about action and causality. The primary aim of this paper is to provide an augmented preferential semantics that is general enough to unify two prominent frameworks for reasoning about action and causality—Sandewall’s causal propagation semantics [4] and Thielscher’s causal relationships approach [5]. There are indications that these and other different augmented preferential semantical approaches can by unified into a general framework, and …",
            "Abstract entirety": 0,
            "Author pub id": "44G4locAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]