[{
    "name": "Παναγιώτης Αλεβίζος",
    "romanize name": "Panagiotis Alevizos",
    "School-Department": "Μαθηματικών",
    "University": "upatras",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 23939,
    "Scholar name": "Panagiotis D. Alevizos",
    "Scholar id": "i6uX5zUAAAAJ",
    "Affiliation": "Jean-Daniel Boissonnat, M. Yvinec, Franco P. Preparata, Michael N. Vrahatis",
    "Citedby": 368,
    "Interests": [
        "Algorithms and Complexity",
        "Computational Geometry",
        "Data Structures"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=i6uX5zUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Improving the orthogonal range search k-windows algorithm",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1180810/",
            "Abstract": "Clustering, that is the partitioning of a set of patterns into disjoint and homogeneous meaningful groups (clusters), is a fundamental process in the practice of science. k-windows is an efficient clustering algorithm that reduces the number of patterns that need to be examined for similarity. using a windowing technique. It exploits well known spatial data structures, namely the range free, that allows fast range searches. From a theoretical standpoint, the k-windows algorithm is characterized by lower time complexity compared to other well-known clustering algorithms. Moreover it achieves high quality clustering results. However, it appears that it cannot be directly applicable in high-dimensional settings due to the superlinear space requirements for the range tree. In this paper an improvement of the k-windows algorithm, aiming at resolving this deficiency, is presented. The improvement is based on an alternative …",
            "Abstract entirety": 0,
            "Author pub id": "i6uX5zUAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The new k-windows algorithm for improving thek-means clustering algorithm",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0885064X01906338",
            "Abstract": "The process of partitioning a large set of patterns into disjoint and homogeneous clusters is fundamental in knowledge acquisition. It is called Clustering in the literature and it is applied in various fields including data mining, statistical data analysis, compression and vector quantization. The k-means is a very popular algorithm and one of the best for implementing the clustering process. The k-means has a time complexity that is dominated by the product of the number of patterns, the number of clusters, and the number of iterations. Also, it often converges to a local minimum. In this paper, we present an improvement of the k-means clustering algorithm, aiming at a better time complexity and partitioning accuracy. Our approach reduces the number of patterns that need to be examined for similarity, in each iteration, using a windowing technique. The latter is based on well known spatial data structures, namely the …",
            "Abstract entirety": 0,
            "Author pub id": "i6uX5zUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Parallelizing the unsupervised k-windows clustering algorithm",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24669-5_29",
            "Abstract": "Clustering can be defined as the process of partitioning a set of patterns into disjoint and homogeneous meaningful groups, called clusters. The growing need for parallel clustering algorithms is attributed to the huge size of databases that is common nowadays. This paper presents a parallel version of a recently proposed algorithm that has the ability to scale very well in parallel environments mainly regarding space requirements but also gaining a time speedup.",
            "Abstract entirety": 1,
            "Author pub id": "i6uX5zUAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Optimal Dynamic Box-Counting Algorithm",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218127410028197",
            "Abstract": "An optimal box-counting algorithm for estimating the fractal dimension of a nonempty set which changes over time is given. This nonstationary environment is characterized by the insertion of new points into the set and in many cases the deletion of some existing points from the set. In this setting, the issue at hand is to update the box-counting result at appropriate time intervals with low computational cost. The proposed algorithm tackles the dynamic box-counting problem by using computational geometry methods. In particular, we use a sequence of compressed Box Quadtrees to store the data points. This storage permits the fast and efficient application of our box-counting approach to compute what we call the \"dynamic fractal dimension\". For a nonempty set of points in the d-dimensional space ℝd (for constant d ≥ 1), the time complexity of the proposed algorithm is shown to be O(n log n) while the space …",
            "Abstract entirety": 0,
            "Author pub id": "i6uX5zUAAAAJ:eQOLeE2rZwMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Pictures as Boolean Formulas",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10851-012-0371-x",
            "Abstract": "Both labellability and realizability problems of planar projections of polyhedra (i.e., pictures) are known to be NP-complete problems. This is true, even in the case of trihedral polyhedra, where exactly three faces meet at every vertex. In this paper, we examine pictures that are taken to be projections of trihedral polyhedra without holes, and contain the projections of all edges (hidden and visible) of a polyhedron. In other words, we examine pictures which represent the entire shape of a trihedral polyhedron without holes. Such a picture is a connected graph P=(V,E) with |E| edges and |V| nodes, each of degree 3 (). We propose a mathematical scheme that constructs from the picture a Boolean formula Φ  P , which is a conjunction of clauses, each consisting of at most two literals. Based on the satisfiability of Φ  P , we show that both labellability …",
            "Abstract entirety": 0,
            "Author pub id": "i6uX5zUAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Parallel unsupervised k-windows: an efficient parallel clustering algorithm",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45145-7_32",
            "Abstract": "Clustering can be defined as the process of partitioning a set of patterns into disjoint and homogeneous meaningful groups (clusters). There is a growing need for parallel algorithms in this field since databases of huge size are common nowadays. This paper presents a parallel version of a recently proposed algorithm that has the ability to scale very well in parallel environments.",
            "Abstract entirety": 1,
            "Author pub id": "i6uX5zUAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "An optimal algorithm for computing the non-trivial circuits of a union of iso-oriented rectangles",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020019012002992",
            "Abstract": "Given n rectangles R 1,…, R n on the plane with sides parallel to the coordinate axes, Lipski and Preparata (1981)[1] have presented a Θ (n log n) time and O (n log n) space algorithm for computing the non-trivial circuits of the union U= R 1∪⋯∪ R n. In this paper, we are presenting a simple algorithm, which computes the non-trivial circuits of U in Θ (n log n) time and Θ (n) space.",
            "Abstract entirety": 1,
            "Author pub id": "i6uX5zUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Elsevier"
        }
    ]
}]