[{
    "name": "Παναγιώτης Κωνσταντόπουλος",
    "romanize name": "Panagiotis Konstantopoulos",
    "School-Department": "Πληροφορικης",
    "University": "aueb",
    "Rank": "Καθηγητής",
    "Apella_id": 18164,
    "Scholar name": "Panos Constantopoulos",
    "Scholar id": "EAagfCoAAAAJ",
    "Affiliation": "Professor of Informatics, Athens University of Economics and Business",
    "Citedby": 2038,
    "Interests": [
        "Information Systems",
        "Knowledge Representation",
        "Ontologies",
        "Digital Curation"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=EAagfCoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "WP2 User Requirements & Benchmarking of Key Competencies Deliverable 7: Report on user Requirements: Reference Curricula to be Developed and Benchmarking Key Criteria",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01477151/",
            "Abstract": "The design and implementation of a platform-based training course requires an understanding of basic concepts from psychology, education, and human-computer interaction which are all essential to the development of successful learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enterprise Information Systems",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-40654-6.pdf",
            "Abstract": "The present book includes extended and revised versions of a set of selected papers from the 14th International Conference on Enterprise Information Systems (ICEIS 2013), held in Wroclaw, Poland, during June 28–July 1, 2012 and co-organized by the Wroclaw University of Economics. The conference was sponsored by the Institute for Systems and Technologies of Information, Control and Communication (INSTICC), held in cooperation with the Association for Advancement of Artificial Intelligence (AAAI), the Institute of Electronics Information and Communication Engineers (IEICE), the IEICE Special Interest Group on Software Interprise Modelling (SWIM), the Association for Computation Machinery (ACM), the ACM Special Interest Group on Management Information Systems (SIGMIS), and the ACM Special Interest Group on Computer Human Interaction.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Reliability modelling for long term digital preservation",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.505.1448&rep=rep1&type=pdf",
            "Abstract": "Digital material is vulnerable to loss and corruption as it is stored in magnetic and optical media that can fail because of exposure to heat, humidity, airborne contaminants or because of faulty reading and writing devices. Organizations whose mission encompasses the preservation of information and cultural heritage have very high reliability requirements for their digital preservation systems. The problem essentially is to achieve given reliability goals with minimal cost. In an on-going project we study the effectiveness of various system configurations for digital preservation by applying analytical modelling techniques to evaluate the reliability of those configurations. The results are expected to be useful in supporting such decisions as how many copies to retain for each document, how frequently to check these copies for corruptions, what storage schemes are most effective for data preservation, what strategies are most effective for error recovery and repair, how many sites should be used in order to prevent loss from natural disasters such as flood, fire, earthquake. Our work includes sensitivity analysis of a set of reliability criteria with respect to model parameters in representative cases. This can prove especially helpful in identifying dominant factors with respect to the reliability and cost of each configuration. Preliminary results exhibit a certain degree of counter-intuitiveness, which adds value to the model. In this paper we present the main points of the model and outline some policies suggested by the analysis so far.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "4th International Digital Curation Conference",
            "Publication year": 2008,
            "Publication url": "https://www.dcc.ac.uk/sites/default/files/documents/events/dcc-2008/accepted_papers/DCC&U%20An%20Extended%20Digital%20Curation%20Lifecycle%20Model.pdf",
            "Abstract": "The proliferation of Web, database and social networking technologies has enabled us to produce, publish and exchange digital assets at an enormous rate. This vast amount of information that is either digitized or born-digital needs to be collected, organized and preserved in a way that ensures that our digital assets and the information they carry remain available for future use. Digital curation has emerged as a new inter-disciplinary practice that seeks to set guidelines for disciplined management of information. In this paper we review two recent models for digital curation introduced by the Digital Curation Centre (DCC) of UK and the Digital Curation Unit (DCU) of the Athena Research Centre. We then propose a fusion of the two models that highlights the need to extend the digital curation lifecycle by adding (a) provisions for the registration of usage experience,(b) a stage for knowledge enhancement and (c) controlled vocabularies used by convention to denote concepts, properties and relations. The objective of the proposed extensions is twofold:(i) to provide a more complete lifecycle model for the digital curation domain; and (ii) to provide a stimulus for a broader discussion on the research agenda.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing query patterns",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04346-8_13",
            "Abstract": "Query patterns enable effective information tools and provide guidance to users interested in posing complex questions about objects. Semantically, query patterns represent important questions, while syntactically they impose the correct formulation of queries. In this paper we address the development of query patterns at successive representation layers so as to expose dominant information requirements on one hand, and structures that can support effective user interaction and efficient implementation of query processing on the other. An empirical study for the domain of cultural heritage reveals an initial set of recurrent questions, which are then reduced to a modestly sized set of query patterns. A set of Datalog rules is developed in order to formally define these patterns which are also expressed as SPARQL queries.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extended faceted taxonomies for web catalogs",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1181656/",
            "Abstract": "Indexing and retrieval in Web catalogs can benefit from using faceted taxonomies. A faceted taxonomy consists of a set of facets, where each facet consists of a predefined set of terms structured by a subsumption relation. We propose two extensions of faceted taxonomies, which allow inferring conjunctions of terms that are valid in the underlying domain. We give a model-theoretic interpretation to these extended faceted taxonomies and we provide mechanisms for inferring the valid conjunctions of terms. This inference service can be exploited for preventing errors during the indexing process and for dynamically generating navigation trees that are suitable for browsing through the Web. The proposed scheme has several advantages by comparison to the hierarchical classification schemes that are currently employed by Web catalogs, namely: (a) conceptual clarity: it is easier to understand; (b) compactness: it …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mediators over ontology-based information sources",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996464/",
            "Abstract": "We propose a model for providing integrated and unified access to multiple information sources of the kind of Web catalogs. We assume that each source comprises two parts: (a) an ontology i.e. a set of terms structured by a subsumption relation, and (b) a database that stores objects of interest under the terms of the ontology. We assume that these objects belong to an underlying domain that is common to all sources (e.g. a set of Web pages of interest), and that different sources may use different ontologies with terms that correspond to different natural languages or to different levels of granularity. Information integration is obtained through a mediator comprising two parts: (a) an ontology, and (b) a set of articulations to the sources. Here, by articulation to a source we mean a set of relationships between terms of the mediator and terms of that source. Information requests (queries) are addressed to the mediator …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shortcut selection in RDF databases",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5767659/",
            "Abstract": "An increasing amount of data produced nowadays is in RDF format. While significant work has been performed on view selection and query optimization algorithms in relational database systems, little attention has been paid to the problem of optimizing the performance of query workloads in RDF databases. In this paper we propose the notion of shortcuts, as a method for reducing the query processing cost. We then devise a greedy algorithm that, given a space constraint and a query workload in an RDF database, seeks to select the optimal shortcuts to materialize. Our experiments validate our approach and demonstrate that our algorithm manages to significantly reduce the query processing cost while keeping space requirements low.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mediators over taxonomy-based information sources",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00778-003-0119-8",
            "Abstract": "We propose a mediator model for providing integrated and unified access to multiple taxonomy-based sources. Each source comprises a taxonomy and a database that indexes objects under the terms of the taxonomy. A mediator comprises a taxonomy and a set of relations between the mediator’s and the sources’ terms, called articulations. By combining different modes of query evaluation at the sources and the mediator and different types of query translation, a flexible, efficient scheme of mediator operation is obtained that can accommodate various application needs and levels of answer quality. We adopt a simple conceptual modeling approach (taxonomies and intertaxonomy mappings) and we illustrate its advantages in terms of ease of use, uniformity, scalability, and efficiency. These characteristics make this proposal appropriate for a large-scale network of sources and mediators.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Proceedings of the 5th European Conference on Research and Advanced Technology for Digital Libraries",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/646634",
            "Abstract": "Proceedings of the 5th European Conference on Research and Advanced Technology for \nDigital Libraries | Guide Proceedings ACM Digital Library home ACM home Google, Inc. (search) \nAdvanced Search Browse About Sign in Register Advanced Search Journals Magazines \nProceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch \nAdvanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsECDL \n'01 ABSTRACT No abstract available. Comments Login options Check if you have access \nthrough your login credentials or your institution to get full access on this article. Sign in Full \nAccess Get this Publication Information Contributors Published in Guide Proceedings cover \nimage ECDL '01: Proceedings of the 5th European Conference on Research and Advanced \nTechnology for Digital Libraries September 2001 457 pages ISBN:Editors: , © -…",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Information design for cultural documentation",
            "Publication year": 2007,
            "Publication url": "http://delos-wp5.ukoln.ac.uk/dissemination/pdfs/constantopoulos-2.pdf",
            "Abstract": "Digital cultural repositories contain digital surrogates of cultural objects, objects born digital, or documentation data. The latter comprise data (or ‘metadata’) about physical or informational objects, as well as about the various related processes, such as acquisition, recording, digitization, research, conservation, exhibition, publication, etc. Interoperability of the different, autonomous repositories is important for the joint utilization of their contents. This, in turn, implies compliance with certain syntactic and semantic representation conditions determined by relevant standards and recommendations. The elaboration of information structures and associated guidelines that can support the development of interoperable digital cultural repositories, in particular of the respective documentation parts, for application on a national scale is the object of a Greek Information Society project we have undertaken. Drawing on the recommendations of various established international and national bodies concerning archaeological, ethnological, museological, archival, geographical, terminological and digital preservation data, and adopting as general frameworks for syntactic and semantic interoperability the standards of W3C and CIDOC CRM (ISO/DIS 21127) respectively, we have defined a set of appropriate information patterns that can meet the requirements of a large variety of cultural material in an integrated manner while maintaining enough flexibility to accommodate further special needs. This paper presents the approach and the main design decisions taken in this large information design project.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extended faceted ontologies",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47961-9_66",
            "Abstract": "A faceted ontology consists of a set of facets, where each facet consists of a predefined set of terms structured by a subsumption relation. We propose two extensions of faceted ontologies, which allow inferring conjunctions of terms that are valid in the underlying domain. We give a model-theoretic interpretation to these extended faceted ontologies and we provide mechanisms for inferring the valid conjunctions of terms. This inference service can be exploited for preventing errors during the indexing process and for deriving navigation trees that are suitable for browsing. The proposed scheme has several advantages by comparison to the hierarchical classification schemes that are currently used, namely: conceptual clarity: it is easier to understand, compactness: it takes less space, and scalability: the update operations can be formulated easier and be performed more efficiently.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Deriving Valid Expressions from Ontology Definitions",
            "Publication year": 2002,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zYSjldbRVaYC&oi=fnd&pg=PA307&dq=info:CbFeNFGoidYJ:scholar.google.com&ots=q2IjW5WILs&sig=A_hC-QvFsHZUN4IEBD8wevIfF2U",
            "Abstract": "In this paper, we consider an ontology as a set of terms together with three binary relations on terms, called synonymy, subsumption and crossreference. We present a model-theoretic interpretation of ontologies and we show that this approach although appropriate for deciding the soundness of an ontology, is not sufficient for providing a sound and complete inference procedure for checking the validity of expressions in an ontology. Therefore a different\" proof-theoretic\" approach which allows checking the validity of expressions is also presented.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:aqlVkmm33-oC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "An Algebra for Specifying Compound Terms for Faceted Taxonomies",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.110.8470&rep=rep1&type=pdf",
            "Abstract": "A faceted taxonomy is a set of taxonomies, each describing a given domain from a different aspect, or facet. The indexing of domain objects is done through conjunctive combinations of terms from the facets, called compound terms. A faceted taxonomy has several advantages over a single hierarchy of terms, including conceptual clarity, compactness and scalability. A drawback, however, is the cost of avoiding invalid combinations, ie compound terms that do not apply to any object in the domain. This need arises in both indexing and retrieval, and typically involves human effort for specifying the valid compound terms one by one. We here propose a compound term composition algebra which can be used to generate valid compound terms in a given faceted taxonomy in an efficient and flexible manner. It works on the basis of the original simple terms of the facets and a small set of positive and/or negative statements. In each algebraic operation, we adopt a closed-world assumption with respect to the declared positive or negative statements. The taxonomy algebra can be exploited in dynamically generating navigation trees, a significant browsing aid.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A conceptual model for scholarly research activity",
            "Publication year": 2010,
            "Publication url": "http://www.ideals.illinois.edu/handle/2142/14945",
            "Abstract": "This paper presents a conceptual model for scholarly research activity, developed as part of the conceptual modelling work within the “Preparing DARIAH” European e-Infrastructures project. It is inspired by cultural-historical activity theory, and is expressed in terms of the CIDOC Conceptual Reference Model, extending its notion of activity so as to also account, apart from historical practice, for scholarly research planning. It is intended as a framework for structuring and analyzing the results of empirical research on scholarly practice and information requirements, encompassing the full research lifecycle of information work and involving both primary evidence and scholarly objects; also, as a framework for producing clear and pertinent information requirements, and specifications of digital infrastructures, tools and services for scholarly research. We plan to use the model to tag interview transcripts from an empirical study on scholarly information work, and thus validate its soundness and fitness for purpose.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "e-Infrastructures: The starting blocks for Open Science and Innovation. The OpenAIRE case",
            "Publication year": 2016,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=428131",
            "Abstract": "There is an emerging consensus among the members of the academic research community that eScience practices should be congruent with Open Science, which essentially facilitates multi-disciplinary collaboration and data sharing and re-use, entailing Open and Shared Access to research data, data services, tools, analyses, and methods. This short paper presents the key characteristics of a sustainable open science e-Infrastructure as gained from six years of operation of OpenAIRE, a key EU e-Infrastructure on scholarly communication. presented.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:t6usbXjVLHcC",
            "Publisher": "Институт по математика и информатика-Българска академия на науките"
        },
        {
            "Title": "An algebra for specifying valid compound terms in faceted taxonomies",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X06001339",
            "Abstract": "A faceted taxonomy is a set of taxonomies, each describing a given knowledge domain from a different aspect. The indexing of the domain objects is done using compound terms, i.e. conjunctive combinations of terms from the taxonomies. A faceted taxonomy has several advantages over a single taxonomy, including conceptual clarity, compactness, and scalability. A drawback, however, is the cost of identifying compound terms that are invalid, i.e. terms that do not apply to any object of the domain. This need arises both in indexing and retrieval, and involves considerable human effort for specifying the valid compound terms one by one. In this paper, we propose and present in detail an algebra which can be used to specify the set of valid compound terms in an efficient and flexible manner. It works on the basis of the original simple terms of the facets and a small set of positive and/or negative statements. In each …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:4TOpqqG69KYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A retrospective on Telos as a metamodeling language for requirements engineering",
            "Publication year": 2021,
            "Publication url": "https://www.diva-portal.org/smash/record.jsf?pid=diva2:1414547",
            "Abstract": "Telos is a conceptual modeling language intended to capture software knowledge, such as software system requirements, domain knowledge, architectures, design decisions and more. To accomplish this, Telos was designed to be extensible in the sense that the concepts used to capture software knowledge can be defined in the language itself, instead of being built-in. This extensibility is accomplished through powerful metamodeling features, which proved very useful for interrelating heterogeneous models from requirements, model-driven software engineering, data integration, cultural informatics and eLearning. We trace the evolution of ideas and research results in the Telos project from its origins in the late eighties. Our account looks at the semantics of Telos, its various implementations and its applications. We also recount related research by other groups and the cross-influences of ideas thereof. We conclude with lessons learnt.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:5awf1xo2G04C",
            "Publisher": "Springer"
        },
        {
            "Title": "Ontology driven extraction of research processes",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-00671-6_10",
            "Abstract": "We address the automatic extraction from publications of two key concepts for representing research processes: the concept of research activity and the sequence relation between successive activities. These representations are driven by the Scholarly Ontology, specifically conceived for documenting research processes. Unlike usual named entity recognition and relation extraction tasks, we are facing textual descriptions of activities of widely variable length, while pairs of successive activities often span multiple sentences. We developed and experimented with several sliding window classifiers using Logistic Regression, SVMs, and Random Forests, as well as a two-stage pipeline classifier. Our classifiers employ task-specific features, as well as word, part-of-speech and dependency embeddings, engineered to exploit distinctive traits of research publications written in English. The extracted activities …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:HE397vMXCloC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Digital methods in the humanities: understanding and describing their use across the disciplines",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781118680605.ch11",
            "Abstract": "This chapter considers the impact and reach of digital methods in the humanities. Digital methods are a core element of what has been called the “methodological commons”: the intellectual, disciplinary, and methodological framework that underlies the conceptualization and understanding of digital humanities. The term “method” is used to refer to the computer‐based (also called information and communications technology, or ICT) techniques for the creation, analysis, communication, and dissemination of digital research. This chapter revisits the theory of computer‐based methods as a core construct (or “scholarly primitive”) of the digital humanities. It reviews two significant collaborative research support initiatives to investigate the use of ICT methods in the humanities, and explores the interdependencies between digital methods and the content and computer‐based tools they are used with across these …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Aspects of a digital curation agenda for cultural heritage",
            "Publication year": 2008,
            "Publication url": "http://www.dcu.gr/wp-content/uploads/2016/10/Aspects-of-a-digital-curation-agenda-for-cultural-heritage.pdf",
            "Abstract": "Digital curation emerged recently as an important concept in the theory and management of cultural heritage information. This paper presents the approach and research agenda adopted by the newly-founded Digital Curation Unit of Athena Research Centre, Greece, and illustrates its relevance to the management and use of cultural heritage digital collections. It highlights the need to tackle the risks of epistemic failure tied with the prospect of long-term access to curated repositories, and presents the case for multidisciplinary research, informed by humanistic and social science as well as computer science perspectives. A multi-tiered research agenda, it argues, would need to resolve problems of representing domain knowledge; developing and maintaining knowledge resources; streamlining the enrichment of these resources from text; automatically generating text from databases; discovering and accessing domain associations; enabling the use of databases containing valuable data over time; conceptualizations of epistemic discourse, and communication genres in specific contexts; grounded research on the motives, activities and contexts of digital resources appraisal, knowledge enhancement and use; and, cost-benefit assessment of preservation policies. These complementary approaches are particularly relevant in the field of cultural heritage, where large-scale digitisation of heritage resources on one hand, and web-based social computing on the other, already create a deluge of un-curated and poorly represented cultural information.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "From Research Articles to Knowledge Graphs",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3308560.3320090",
            "Abstract": "Understanding and extracting knowledge contained in text and encoding it as linked data for the WEB is a highly complex task that poses several challenges, requiring expertise from different fields such as conceptual modeling, natural language processing and web technologies including web mining, linked data generation and publishing, etc. When it comes to the scholarly domain, the transformation of human readable research articles into machine comprehensible knowledge bases is considered of high importance and necessity today due to the explosion of scientific publications in every major discipline, that makes it increasingly difficult for experts to maintain an overview of their domain or relate ideas from different domains. This situation could be significantly alleviated by knowledge bases capable of supporting queries such as: find all papers that address a given problem; how was the problem solved …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimizing query shortcuts in RDF databases",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21064-8_6",
            "Abstract": "The emergence of the Semantic Web has led to the creation of large semantic knowledge bases, often in the form of RDF databases. Improving the performance of RDF databases necessitates the development of specialized data management techniques, such as the use of shortcuts in the place of path queries. In this paper we deal with the problem of selecting the most beneficial shortcuts that reduce the execution cost of path queries in RDF databases given a space constraint. We first demonstrate that this problem is an instance of the quadratic knapsack problem. Given the computational complexity of solving such problems, we then develop an alternative formulation based on a bi-criterion linear relaxation, which essentially seeks to minimize a weighted sum of the query cost and of the required space consumption. As we demonstrate in this paper, this relaxation leads to very efficient classes of linear …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "DCC&U: An extended digital curation lifecycle model",
            "Publication year": 2009,
            "Publication url": "http://www.ijdc.net/index.php/ijdc/article/view/100",
            "Abstract": "The proliferation of Web, database and social networking technologies has enabled us to produce, publish and exchange digital assets at an enormous rate. This vast amount of information that is either digitized or born-digital needs to be collected, organized and preserved in a way that ensures that our digital assets and the information they carry remain available for future use. Digital curation has emerged as a new inter-disciplinary practice that seeks to set guidelines for disciplined management of information. In this paper we review two recent models for digital curation introduced by the Digital Curation Centre (DCC) and the Digital Curation Unit (DCU) of the Athena Research Centre. We then propose a fusion of the two models that highlights the need to extend the digital curation lifecycle by adding (a) provisions for the registration of usage experience,(b) a stage for knowledge enhancement and (c) controlled vocabularies used by convention to denote concepts, properties and relations. The objective of the proposed extensions is twofold:(i) to provide a more complete lifecycle model for the digital curation domain; and (ii) to provide a stimulus for a broader discussion on the research agenda.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extended Faceted Ontologies for Web Catalogs",
            "Publication year": 2001,
            "Publication url": "ftp://139.91.151.43/tech-reports/2001/2001.TR293.Extended_Ontologies_Web_Portals.ps.gz",
            "Abstract": "Indexing and retrieval in Web portals can bene t from using faceted ontologies. A faceted ontology consists of a set of facets, where each facet consists of a prede ned set of terms which may be structured by a subsumption relation. We propose two extensions of faceted ontologies, which allow inferring the combinations (conjunctions) of terms that are valid in the underlying domain. We give a model-theoretic interpretation to these extended ontologies and we provide mechanisms for inferring the valid combinations of terms. This inference service can be exploited for preventing errors during the indexing process and for deriving navigation trees that are suitable for browsing through the Web.The proposed scheme has several advantages by comparison to the hierarchical classi cation schemes that are currently employed by Web portals, namely, conceptual clarity (it is easier to understand), compactness (it takes less space), scalability (the update operations can be formulated easier and be performed more e ciently).",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:35N4QoGY0k4C",
            "Publisher": "Technical Report TR-293, FORTH-ICS"
        },
        {
            "Title": "An approach to analyzing working practices of research communities in the humanities",
            "Publication year": 2013,
            "Publication url": "https://www.euppublishing.com/doi/abs/10.3366/ijhac.2013.0084",
            "Abstract": "The need for a firm understanding of the working practices of researchers in the humanities emerges as a prerequisite for the development of effective digital research infrastructures. This paper will focus on the rationale behind the design and implementation of two related studies conducted in the context of two European e-Infrastructures projects, DARIAH and EHRI. Within DARIAH the challenge involved conducting, analysing and understanding research practices of arts and humanities researchers, a largely ill-defined community encompassing a wide spectrum of disciplines. Each of them deals with a variety of objects employing an extensive number of methods. In the context of EHRI, the challenge is slightly different, due to the involvement of a better-defined research community. Holocaust researchers share well-identified objects, common ground on methods, and handle similar setbacks. In this paper we …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:738O_yMBCRsC",
            "Publisher": "Edinburgh University Press"
        },
        {
            "Title": "MORe: A Micro-service Oriented Aggregator",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-49157-8_2",
            "Abstract": "Metadata aggregation is a task increasingly encountered in many projects involving data repositories. The small number of specialized software for this task indicates that in most cases customized software is used to perform aggregation, which in turn relates to the highly complex tasks and architectures involved. In this paper, the metadata and object repository aggregator (MORe) is presented, which has been effectively used in numerous projects and provides an easy and flexible way of aggregating metadata from multiple sources and in multiple formats. Its flexible and scalable architecture exploits cloud technologies and allows storing content into different storage systems, defining workflows dynamically and extending the system with external services. One of the most important aspects of MORe is its curation/enrichment services which allow curation managers to automatically apply and execute …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A digital library service for the small",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/43059291/6800574_DigCCurr2009Proceedings_060909.pdf#page=182",
            "Abstract": "In this paper, we present MOPSEUS, a lightweight digital library service based on the Fedora system. This service was created to address the needs of small libraries without support from technical staff. Hence, MOPSEUS attempts to balance flexibility against ease of installation, configuration and use. The service is available as a standard Java Web servlet, uses no external databases or other systems and can easily be deployed on top of any Fedora installation. Preliminary tests concerning the ease of installation and use are encouraging. We contend that facilitating the introduction of digital library infrastructures in the small may contribute to spreading digital curation practices.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contextualization as an independent abstraction mechanism for conceptual modeling",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437905000499",
            "Abstract": "The notion of context appears in computer science, as well as in several other disciplines, in various forms. In this paper, we present a general framework for representing the notion of context in information modeling. First, we define a context as a set of objects, within which each object has a set of names and possibly a reference: the reference of the object is another context which “hides” detailed information about the object. Then, we introduce the possibility of structuring the contents of a context through the traditional abstraction mechanisms, i.e., classification, generalization, and attribution. We show that, depending on the application, our notion of context can be used as an independent abstraction mechanism, either in an alternative or a complementary capacity with respect to the traditional abstraction mechanisms. We also study the interactions between contextualization and the traditional abstraction …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:Se3iqnhoufwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An Algebraic Approach for Specifying Compound",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=15946639602206662919&hl=en&oi=scholarr",
            "Abstract": "A faceted taxonomy is a set of taxonomies, each describing a given domain from a different aspect, or facet. The indexing of domain objects is done through conjunctive combinations of terms from the facets, called compound terms. A faceted taxonomy has several advantages over a single hierarchy of terms, including conceptual clarity, compactness and scalability. A drawback, however, is the cost of avoiding invalid combinations, ie compound terms that do not app to any object in the domain. This need arises in both indexing and retrieval, and typically involves human effort for specifying the valid compound terms one by one. We here propose a compound term composition algebra which can be used to generate valid compound terms in a given faceted taxonomy in an efficient and flexible manner. It works on the basis of the original simple terms of the facets and a small set of positive and/or negative statements. In each algebraic operation, we adopt a closed-world assumption with respect to the declared positive or negative statements. The taxonomy algebra can be exploited in dynamically generating navigation trees, a significant browsing aid.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Understanding the information requirements of arts and humanities scholarship",
            "Publication year": 2010,
            "Publication url": "http://ijdc.net/index.php/ijdc/article/view/144",
            "Abstract": "This paper reports on research of scholarly research practices and requirements conducted in the context of the Preparing DARIAH European e-Infrastructures project, with a view to ensuring current and future fitness for purpose of the planned digital infrastructure, services and tools. It summarises the findings of earlier research, primarily from the field of human information behaviour as applied in scholarly work, it presents a conceptual perspective informed by cultural-historical activity theory, it introduces briefly a formal conceptual model for scholarly research activity compliant with CIDOC CRM, it describes the plan of work and methodology of an empirical research project based on open-questionnaire interviews with arts and humanities researchers, and presents illustrative examples of segmentation, tagging and initial conceptual analysis of the empirical evidence. Finally, it presents plans for future work, consisting, firstly, of a comprehensive re-analysis of interview segments within the framework of the scholarly research activity model, and, secondly, of the integration of this analysis with the extended digital curation process model we presented in earlier work.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic Web workshop: Models, architectures and management",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=12252512865938864355&hl=en&oi=scholarr",
            "Abstract": "Call for Nominations-2016 SIGMOD Systems Award The SIGMOD Systems Award is awarded to an individual or set of individuals to recognize the development of a piece of software that made a significant technical contribution to the database management field and which was made available for others to use. The nomination deadline is April 1, 2016.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Historical documents as monuments and as sources",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Martin-Doerr/publication/228708565_Historical_documents_as_monuments_and_as_sources/links/00b7d52029b9d116a5000000/Historical-documents-as-monuments-and-as-sources.pdf",
            "Abstract": "The main functions of a digital library of historical documents are the digital recording of documents, transcriptions and translations of documents, subject indexing, annotation and retrieval. Using such a system, scholars can efficiently study the documents without involvement of the originals, thus ensuring the preservation of documents and the protection of researchers from exposure to potential health hazards. An important part of the study of historical documents consists of classifying the material and annotating it in such a way that retrieval is facilitated in the future. We present the development of a historical document management system that supports both digital library functionality and archival management of the original documents. This system includes semantic indexing and multifaceted classification of historical documents with the use of a built-in thesaurus aimed at attaining satisfactory levels of efficiency of the classification process, completeness and precision of the retrieved information, and user-friendliness.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mopseus–A digital library management system focused on preservation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15464-5_53",
            "Abstract": "This paper presents Mopseus, a Fedora-commons based digital repository that focuses on preservation. An overview of the general architecture of the system is presented along with some more in-depth details of its semantic structures. Mopseus features dynamic RDF- based relations, a service for defining metadata schemas, a built-in RDBMS synchronization and indexing mechanism, a mechanism for migration from existing repositories and a built-in workflow engine.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Query translation for mediators over ontology-based information sources",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_38",
            "Abstract": "We propose a model for providing integrated and unified access to multiple information sources. Each source comprises: (a) an ontology i.e. a set of terms structured by a subsumption relation, and (b) a database that stores descriptions of objects using terms of the ontology. We assume that different sources may use different ontologies, i.e., different terminologies withterms that correspond to different natural languages or to different levels of granularity. Information integration is obtained through a mediator comprising two parts: (a) an ontology, and (b) a set of articulations to the sources, where an articulation to a source is a set of relationships between terms of the mediator and terms of that source. Information requests (queries) are addressed to the mediator whose task is to analyze each query into sub-queries, send them to the appropriate sources, then combine the results to answer the original query …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "OntoSPIT: SPIT management through ontologies",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366408005276",
            "Abstract": "VoIP enables new ways for communication. At the same time, it provides new means, in terms of transmitting bulk unsolicited messages and calls, namely SPam over Internet telephony (SPIT). In this paper, we propose a conceptual model, based on an underlying ontology, which describes the SPIT domain. The ontology provides capabilities, such as modeling the SPIT phenomenon in a SIP-based VoIP environment, a common understanding of SPIT domain, as well as reusable SPIT-related knowledge interoperability, aggregation and reasoning. We demonstrate that the proposed ontology, combined with a set of SPIT identification criteria, as its underlying axioms and rules, could enhance the correlation and management of SPIT incidents. It could also support SPIT detection, thus facilitating the better protection of VoIP environments in a holistic, cooperative, and effective way.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On information organization in annotation systems",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-32279-5_13",
            "Abstract": "A rich semantic model of annotation is presented that distinguishes several annotation types, uses controlled vocabulary where appropriate, and supports multi-facetted characterization of documents, annotation of parts of documents as well as of entire documents, and annotation of document associations besides annotation of single documents. This model has served as the basis for implementing a powerful annotation system included in an advanced digital library system.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Preparing DARIAH",
            "Publication year": 2008,
            "Publication url": "https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_1758919",
            "Abstract": "Panos Constantopoulos a, Costis Dallas a, Petern Doornd, Dimitris Gavrilis a, Andreas Gros c, Georgios Stylianoud a Digital Curation Unit, Athena Research Centre, Greece-(p. constantopoulos, c. dallas, d. gavrilis)@ dcu. gr b Computer Graphics and Visualization lab, European University, Cyprus–g. stylianou@ euc. ac. cy c Max Planck Digital Library (MPDL), Munich, Germany–gros@ mpdl. mpg. de d Data Archiving and Networked Services, The Hague, The Netherlands-Peter. Doorn@ dans. knaw. nl",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:IWHjjKOFINEC",
            "Publisher": "Archaeolingua"
        },
        {
            "Title": "Leveraging Digital Cultural Memories",
            "Publication year": 2016,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=428133",
            "Abstract": "The penetration of ICT in the management and study of material culture and the emergence of digital cultural repositories and linked cultural data in particular are expected to enable new paths in humanities research and new approaches to cultural heritage. Success is contingent upon securing information trustworthiness, long-term preservation, and the ability to re-use, re-combine and re-interpret digital content. In this perspective, we review the use in the cultural heritage domain of digital curation and curation-aware repository systems; achieving semantic interoperability through ontologies; explicitly addressing contextual issues of cultural heritage and humanities information; and the services of digital research infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Институт по математика и информатика-Българска академия на науките"
        },
        {
            "Title": "Information patterns for digital cultural repositories [electronic version]",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=11106431048233955570&hl=en&oi=scholarr",
            "Abstract": "Digital cultural repositories emerge from the ever-increasing digitization of documents and images, digital photography, analogue-to-digital conversion of audio or video recordings, and digital transcription of object information recorded in various ways. Adding original digital cultural products and digital recordings of cultural information to these digital surrogates leads to an impressive collection of digital cultural material.As digital collections are created independently by autonomous organizations, the emergence of a unified digital space is neither automatic nor easy. Aside from the legal and organizational issues, certain conditions are required for repositories to be interoperable. These are primarily concerned with documentation data and processes. Cultural documentation comprises a wide spectrum of information on the objects themselves, physical or informational, as well as related processes ranging from …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Research and Advanced Technology for Digital Libraries: 5th European Conference, ECDL 2001, Darmstadt, Germany, September 4-9, 2001. Proceedings",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=KsluCQAAQBAJ&oi=fnd&pg=PR3&dq=info:slyVqJP_0uMJ:scholar.google.com&ots=JE-MsGNFfD&sig=7Uoe0aoVG8mLB7kJ8ZIhz_2xNoA",
            "Abstract": "Digital libraries (DLs) are major advances in information technology that frequently fall short of expectations [7, 28]. Covi & Kling [7] argue that understanding the wider context of technology use is essential to understanding digital library use and its-plementation in different social worlds. Recent health informatics research also-gues that social and organisational factors can determine the success or failure of healthcare IT developments [8, 11, 12]. Heathfield [11] suggests that this is due to the complex, autonomous nature of the medical discipline and the specialized (clinician or software engineer) approach to system development. Negative reactions to these systems is often due to inappropriate system design and poor implementation. H-ever, there may be other less obvious social and political repercussions of information system design and deployment. Symon et al [26] have identified, within a hospital scenario, how social structures and work practices can be disrupted by technology implementation. Although these systems often deal with sensitive, personal infor-tion, other system design research has found that apparently innocuous data can be perceived as a threat to social and political stability [1, 2, 3]. To understand the impact of DLs within the medical profession, an in-depth evaluation is required of the int-duction and later development of these applications within their specific social and organisational settings. However, as Covi & Kling [7] have highlighted, there are few high-level theories that aid designers in understanding the implication of these issues for DL design and implementation.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer"
        },
        {
            "Title": "A decision theoretic model for information retrieval supporting time constraints",
            "Publication year": 2001,
            "Publication url": "https://139.91.152.92/isl/publications/paperlink/Tzitzikas_ECIR_2001.pdf",
            "Abstract": "This paper presents ideas and identi£ es research issues for a novel information retrieval model for general purpose information retrieval systems, in which each query except from specifying the topic of the information need, it also speci£ es the time period the user is willing to spend for getting and consuming the answer set, hence, for changing his mental state and ful£ lling his information need. The model requires knowing the” consumption time” of each document by the user. We describe methods for obtaining these times and show how these times can be exploited for providing different results orderings. We analyze the issue of ordering from a decision theoretic point of view and we further investigate an approach that uses Cost-Bene£ t Analysis for choosing the documents to be returned for each query. The model is further re£ ned in order to support long term information needs with deadlines and documents that are not instantly deliverable.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ontology-driven information extraction from research publications",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-00066-0_21",
            "Abstract": "Extraction of information from a research article, association with other sources and inference of new knowledge is a challenging task that has not yet been entirely addressed. We present Research Spotlight, a system that leverages existing information from DBpedia, retrieves articles from repositories, extracts and interrelates various kinds of named and non-named entities by exploiting article metadata, the structure of text as well as syntactic, lexical and semantic constraints, and populates a knowledge base in the form of RDF triples. An ontology designed to represent scholarly practices is driving the whole process. The system is evaluated through two experiments that measure the overall accuracy in terms of token- and entity- based precision, recall and F1 scores, as well as entity boundary detection, with promising results.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Query evaluation for mediators over Web catalogs",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.19.4882&rep=rep1&type=pdf",
            "Abstract": "The Web catalogs like Yahoo! and Open Directory are very useful for browsing and querying the Web. Although they index only a fraction of the pages that are indexed by search engines these catalogs are hand-crafted by domain experts and are therefore of high quality. We present a model for building mediators over Web catalogs, so as to provide users with customized views of such catalogs. We focus on query evaluation, speci cally on the complexity of query answering by the mediator.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measuring quality in metadata repositories",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24592-8_5",
            "Abstract": "The need for good quality metadata records becomes a necessity given the large quantities of digital content that is available through digital repositories and the increasing number of web services that use this content. The context in which metadata are generated and used affects the problem in question and therefore a flexible metadata quality evaluation model that can be easily and widely used has yet to be presented. This paper proposes a robust multidimensional metadata quality evaluation model that measures metadata quality based on five metrics and by taking into account contextual parameters concerning metadata generation and use. An implementation of this metadata quality evaluation model is presented and tested against a large number of real metadata records from the humanities domain and for different applications.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "From publications to knowledge graphs",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-44900-1_2",
            "Abstract": "We address the task of compiling structured documentation of research processes in the form of knowledge graphs by automatically extracting information from publications and associating it with information from other sources. This challenge has not been previously addressed at the level described here. We have developed a process and a system that leverages existing information from DBpedia, retrieves articles from repositories, extracts and interrelates various kinds of named and non-named entities by exploiting article metadata, the structure of text as well as syntactic, lexical and semantic constraints, and populates a knowledge base in the form of RDF triples. An ontology designed to represent scholarly practices is driving the whole process. Rule -based and machine learning- based methods that account for the nature of scientific texts and a wide variety of writing styles have been developed for …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:WqliGbK-hY8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Preservation aspects of a curation-oriented thematic aggregator",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/33148094/iPres2013-Proceedings.pdf#page=258",
            "Abstract": "The emergence of the European Digital Library (Europeana) foregrounds the need for aggregating content using smarter and more efficient ways taking into account its context and production circumstances. This paper presents the main functionalities of MoRe, a curation oriented aggregator that addresses digital preservation issues. MoRe combines aggregation, digital curation and preservation capabilities in a package that shields content providers from changes, and that ensures efficient, high volume metadata processing. It aggregates data from a wide community of archaeological content providers and integrates them to a common metadata schema. The system provides added-value digital curation services for metadata quality monitoring and enrichment so that to ensure metadata reliability. Furthermore it provides preservation workflows which guarantee effective record keeping of all transactions and the current status of the repository.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scholarly Ontology: modelling scholarly practices",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s00799-016-0169-3",
            "Abstract": "In this paper we present the Scholarly Ontology (SO), an ontology for modelling scholarly practices, inspired by business process modelling and Cultural-Historical Activity Theory. The SO is based on empirical research and earlier models and is designed so as to incorporate related works through a modular structure. The SO is an elaboration of the domain-independent core part of the NeDiMAH Methods Ontology addressing the scholarly ecosystem of Digital Humanities. It thus provides a basis for developing domain-specific scholarly work ontologies springing from a common root. We define the basic concepts of the model and their semantic relations through four complementary perspectives on scholarly work: activity, procedure, resource and agency. As a use case we present a modelling example and argue on the purpose of use of the model through the presentation of indicative SPRQL and SQWRL …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "An ontological model for digital preservation",
            "Publication year": 2007,
            "Publication url": "https://ils.unc.edu/digccurr2007/papers/constantopoulos_paper_6-4.pdf",
            "Abstract": "The long-term preservation of digital resources requires assigning appropriate metadata. Several recommendations exist for preservation metadata reflecting the purposes and major preoccupations of the organizations that proposed each one. Digital resources are either digital surrogates of non-digital objects, or original digital objects. In either case we may assume that, if a digital resource is selected for preservation, it can be considered as a cultural object that belongs to some collection, has a certain value and must be appropriately preserved, used and documented. In other words, although the digital nature of the resource induces specific requirements in terms of preservation policies and techniques, basic commonalities can be traced with other cultural objects at the functional level. Based on this premise, the work reported here aims at harmonizing the information structures supporting digital preservation with those for documenting nondigital cultural objects. The approach taken is to develop a conceptual model for preservation metadata that complies with a standard ontology for cultural documentation, namely CIDOC CRM. The perils faced by digital resources are related either to physical causes or to technological evolution. Correspondingly a number of preservation strategies have been developed and a preservation life cycle, independent of preservation strategy, has been identified. Furthermore, several proposals for preservation metadata have been made, five of which, appearing to be the most interesting and influential, namely the Dublin Core Metadata Element Set, the Open Archival Information System (OAIS), the Curl …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Z39. 50 wrapping and description logics",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s007990000036.pdf",
            "Abstract": "Z39.50 is a client/server protocol widely used in digital libraries and museums for searching and retrieving information spread over a number of heterogeneous sources. To overcome semantic and schematic discrepancies among the various data sources the protocol relies on a world view of information as a flat list of fields, called Access Points (AP). One of the major issues for building Z39.50 wrappers is to map this unstructured list of APs to the underlying source data structure and semantics. For highly structured sources (e.g., database management systems, knowledge base systems) this mapping is quite complex and considerably affects the quality of the retrieved data. Unfortunately, existing Z39.50 wrappers have been developed from scratch and they do not provide high-level mapping languages with verifiable properties. In this paper, we propose a description logic (DL) based toolkit for the …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A new architecture and approach to asset representation for Europeana aggregation: the CARARE way",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24731-6_41",
            "Abstract": "This paper presents a new metadata aggregation approach based on a mediating repository that intends to ensure the integrity, authenticity and semantic enrichment of metadata provided to Europeana by heterogeneous collections. Primary metadata are mapped to CARARE schema, a schema suitable for describing archaeological and architectural heritage assets, digital resources, collections, as well as events associated with them. The paper specifies the proposed schema and discusses the overall architecture of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "WP2 User Requirements & Benchmarking of Key Competencies Deliverable 8: Visualisation of Benchmarking Key Criteria",
            "Publication year": 2016,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01473551/",
            "Abstract": "A significant part of the work conducted for designing and implementing the platform of #dariahTeach concerns the creation of Benchmarks and Key Criteria by which individual modules/courses will be designed and evaluated. Since a goal of the project is creating a model for developing and delivering open source, flexible online educational materials from which other communities of practice can benefit, it is necessary to define the framework so that future DH instructors can create their own modules for the #dariahTeach platform.   To this end, work has previously been undertaken in WP2 for identifying User Requirements and Benchmarking Key Criteria, and in WP5, reporting on Quality Assurance and Evaluation. This report builds on User Requirements presented in Deliverable 7 and on Key Quality Criteria defined in Deliverable 17. This report thus constitutes a conjunction between the main aspects of those two deliverables with a new focus, i.e. creating a visualisation of the benchmarking of key criteria.",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A theory of contexts in information bases",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437901000369",
            "Abstract": "Although semantic data models provide expressive conceptual modeling mechanisms, they do not support context, i.e. providing controlled partial information on conceptual entities by viewing them from different viewpoints or in different situations. In this paper, we present a model for representing contexts in information bases along with a set of operations for manipulating contexts. These operations support context creation, update, copy, union, intersection, and difference. In particular, our operations of context union, intersection, and difference are different from those of set theory as they take into account the notion of context. However, they also satisfy the important properties of commutativity, associativity, and distributivity. Our model contributes to the efficient handling of information, especially in distributed, cooperative environments, as it enables (i) representing (possibly overlapping) partitions of an …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Query Patterns: Foundation and Analysis",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=3402908976184014091&hl=en&oi=scholarr",
            "Abstract": "A directed graph or digraph is a pair (V, E)(also denoted by G (V, E) or simply G) where V is a finite set called set of vertices and E is a subset of V× V called set of edges. Let G (V, E) be a directed graph, let Γ be a finite set of labels and let c be a 1-1 mapping from V∪ E to Γ: the pair (G, c) is called Γ-labeled digraph (also denoted by (V, E, c) or G (V, E, c)).",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Technical Report AUEB/ISDB/TR/2008/01"
        },
        {
            "Title": "A CIDOC CRM–compatible metadata model for digital preservation",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/33762155/constantopoulos.pdf",
            "Abstract": "A number of long-term digital preservation strategies exist, each one appropriate under different circumstances. No matter what strategy is followed, though, the preservation of digital resources requires applying the appropriate metadata elements. Several proposals exist for this purpose, each one indicating a set of the essential metadata. In our work we have studied five such widely known proposals. From this study, we identify a set of elements we consider most important, on the basis of which we propose a “common denominator” metadata model for digital preservation. Furthermore this is taken beyond the level of a mere list of metadata elements by establishing semantic relations between those. In the domain of cultural information, digital resources can be surrogates of non-digital cultural objects and they can also be considered as cultural objects themselves. In the context of a wider effort to ensure …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital curation and digital cultural memory",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_1",
            "Abstract": "The last two decades have witnessed an ever increasing penetration of digital media initially in the management and, subsequently, in the study of culture. From collections management, object documentation, domain knowledge representation and reasoning, to supporting the creative synthesis and re-interpretation of data in the framework of digital productions, significant progress has been achieved in the development of relevant knowledge and software tools. Developing a standard ontology for the cultural domain stands out as the most prominent such development.As a consequence of this progress, digital repositories are created that aim at serving as digital cultural memories, while a process of convergence has started among the different kinds of memory institutions, i.e., museums, archives, and libraries, in what concerns their information functions. The success of digital cultural memories …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A theory of contexts in information bases",
            "Publication year": 2002,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=317806",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "EAagfCoAAAAJ:bnK-pcrLprsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Deriving and retrieving contextual categorical information through instance inheritance",
            "Publication year": 2000,
            "Publication url": "https://content.iospress.com/articles/fundamenta-informaticae/fi44-4-01",
            "Abstract": "In semantic and object-oriented data models, each class has one or more typing properties that associate it to other classes, and carry type information about all instances of the class. We introduce a new kind of property that we call instance-typing property. An instance-typing property associates an instance of a class to another class, and carries type information about that particular instance (and not about all instances of the class). Instance-typing properties are important as they allow to represent summary information about an instance, in addition to specific information. In this paper, we study inheritance of properties from a class to an instance, using type information about the class, as well as type information about the instance. This kind of inheritance, that we call contextual instance-inheritance, provides us with the most specific type information about the instance, in a particular context. Intuitively, a context is …",
            "Abstract entirety": 0,
            "Author pub id": "EAagfCoAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IOS Press"
        }
    ]
}]