[{
    "name": "Παντελής Αγγελίδης",
    "romanize name": "Pantelis Angelidis",
    "School-Department": "Μηχανικών Πληροφορικής & Τηλεπικοινωνιών",
    "University": "uowm",
    "Rank": "Καθηγητής",
    "Apella_id": 19621,
    "Scholar name": "Pantelis Angelidis",
    "Scholar id": "a_6ka4oAAAAJ",
    "Affiliation": "UOWM-ICTE",
    "Citedby": 506,
    "Interests": [
        "PHS",
        "Health information capturing",
        "transmission and representation"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=a_6ka4oAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A statistical approach for identification of potential pollution incidents due to lignite mining activity in a surface water stream",
            "Publication year": 2016,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/19443994.2015.1100559",
            "Abstract": "The present study aims to the development of a methodology for the identification of potential pollution incidents in surface water bodies, by the utilization of statistical techniques, using monitoring data collected from a multi-parametric sensors system. Demonstration of the proposed methodology carried out in a surface water stream located within a lignite mine area in Northern Greece; an on-line water quality monitoring system using multi-parametric sensors was installed in three representative sites of the study area, and the corresponding measured parameters included pH, temperature, conductivity, nitrate ions (), sulfate ions (), and chloride ions (Cl−) for a period of about 10 months. This system comprised of a probe containing the measuring elements (electrodes and sensors) and additional hardware/software for data collection, processing and transfer through the internet (wireless telemetry). The data …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Country brief: Greece",
            "Publication year": 2010,
            "Publication url": "http://www.ehealth-strategies.eu/database/documents/Greece_CountryBrief_eHStrategies.pdf",
            "Abstract": "A national eHealth roadmap for Greece was launched by the Ministry of Health and Social Solidarity in 2006. It is based on a critical review of the national 2002-2006 ICT Action Plan “ICT in healthcare” 1 and incorporates new policies aligned with the European eHealth Action Plan (2004). The policy paper is valid for the years from 2006 until 2015 and encompasses infrastructural issues and specific health applications such as, electronic health records, health cards, ePrescription, EDI based Hospital Procurement etc.In May 2010 “The Economic Adjustment Programme for Greece” was published by the European Commission. It acknowledges the difficult economic situation in which Greece currently finds itself and the need for reform in particular expenditure cuts. Greece is a country in transition and any plans for healthcare developments, particularly in light of the social insurance reform, are in a state of transition too.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing the Self Management of Type II Diabetes in Elderly Greeks Using m-and e-Health Facilitated Integrated Care Services and Policy Implications for Greece.",
            "Publication year": 2016,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15684156&asa=Y&AN=120724987&h=XeUzMfnhzhXvgy5H%2Fr3riTZfn23jPQ2ehZYY9%2BFT878%2FQuIx1VkxU23DfBG4w%2FiI2tw0oToX%2FLMyfmdMJhK3Nw%3D%3D&crl=c",
            "Abstract": "Chronic diseases are the leading cause of death and disability in Greece, a country suffering from a rapid deterioration of public health indicators during the years of the crisis. In the case of Type II Diabetes, the prevalence of the disease is estimated at more than 10%% among Greek adults. The managements of Type II Diabetes has been so far mainly medical centred, specialists in special diabetic clinics providing secondary services to patients. However, Type II Diabetes can be effectively managed in community settings if the patient is empowered to self-manage the condition. The presence of a multidisciplinary team of care professionals, that offers a holistic service, putting the needs and wishes of the patient and the caregiver at the centre of the care process, is of paramount importance in improving health related outcomes and decreasing the costs for management of the disease. For the first time in Greece, a …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Denoising simulated EEG signals: A comparative study of EMD, wavelet transform and Kalman filter",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701613/",
            "Abstract": "Electrooculographic (EOG) artefact is one of the most common contaminations of Electroencephalographic (EEG) recordings. The corruption of EEG characteristics from Blinking Artefacts (BAs) affects the results of EEG signal processing methods and also impairs the visual analysis of EEGs. In this paper, our scope was a comparative analysis of the performance of three standard denoising methods like continuous Empirical Mode Decomposition (EMD), Discrete Wavelet Transform (DWT) and Kalman Filter (KF). In order to evaluate the performance of EMD, DWT and KF of noise reduction and to express the quality of the denoised EEG, we calculate several indexes such as the Signal-to-Noise Ratio (SNR). All the results obtained from noise simulated EEG data show that WT achieved the greatest SNR difference and also the mode mixing issue of EMD affected this method's performance.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cost-effective health services for interactive lifestyle management: the PANACEIA-iTV and the e-Vital concepts",
            "Publication year": 2005,
            "Publication url": "http://yadda.icm.edu.pl/yadda/element/bwmeta1.element.baztech-article-BAT3-0031-0006",
            "Abstract": "Information technology applications in medicine are rapidly expanding, and new methods and solutions are evolving since they are considered pivotal in the success of preventive medicine. In this paper two different concepts will be presented, the PANACEIA-iTV and the e-Vital concept. PANACEIA-iTV is a home care service provision system based on interactive TV technology and supported by the IST programme of the European Commission. The e-Vital service, supported by the eTEN programme of the European Commission, regards an integrated home care and telemonitoring service chain aimed at large sensitive parts of the European population, the “at-risk” citizens, who are usually patients with a stable medical condition that allow a near normal life but may suddenly deteriorate and put life at risk.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview on telecommunications regulation framework in south-eastern Europe",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-006-9139-1",
            "Abstract": "Over the last few years all South-Eastern European (SEE) countries have started an effort that involves complete transition of telecom regulations, in order to comply with European Union rules. Towards this direction, the majority of the SEE governments have proceeded in the establishment of independent Regulative Authorities. In addition, a set of Telecommunications Acts was entered into force in all SEE countries, while the mobile market is fully liberalised. This paper presents an overview of the regulation and institutional telecommunications framework in the SEE region.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Wireless sensor network cluster formation at the presence of a Wireless Mesh Network",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687680/",
            "Abstract": "Countries under development have recently benefited from the emergence of networked communities operating in an infrastructure poor environment. We describe a WSN protocol for monitoring quality of life in such networked communities. The protocol bridges a IEEE 802.15.4 to a IEEE 802.11 network using a presence advertising algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hospital information system evaluation",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Leonidas-Fragidis/publication/255968172_Hospital_Information_System_Evaluation/links/02e7e5211efa0260d5000000/Hospital-Information-System-Evaluation.pdf",
            "Abstract": "Information technology has rapidly penetrated into the healthcare sector and it has been proved that it can lead to better decision support, organizational support and even influence the quality of the services offered to patients. The evaluation of any HIS is, therefore, a very critical issue. After an extended and systematic review of the existing literature, user satisfaction was chosen as the measurement of IS success. The proposed research model of IS success is based on widely validated user satisfaction models. System quality, information quality, service quality and user bac ground were selected to measure user satisfaction. A structured questionnaire has been used to collect data from four Gree state hospitals, in order to empirically test the validity of the proposed model. Structural Equation Modeling is the main statistical technique used to test the fit of the structural model. The main conclusion is that user bac ground, information quality and service quality directly and positively affect user satisfaction confirming three out of four initial hypotheses (H1, H3, and H4). System quality has been found to influence user satisfaction only indirectly, through information quality, but not directly, as it was initially stated.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developments of the telecommunications regulation framework in the western balkans",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/48040934/mcom.2004.131652220160814-5422-19zw4rk.pdf",
            "Abstract": "In the field of telecommunications, stimulating policies are being implemented in order to foster this sector’s activities and create liberalized markets in the region, which will he aligned with the European ones. Nevertheless, this effort cannot he successful without the establishment of an adequate regulatory environment. Toward this direction and under the framework of the European Telecommunications Directive, the majority of the governments have proceeded to create independent regulatory authorities. The authorities’ role is to implement the best policy practices and support the development of a credible regulatory regime, which will boost investments in the sector and promote public confidence in the market through transparent regulatory and licensing processes. The purpose of this article is to present an overview of the regulation and institutional framework of the telecommunications sector in the Western Balkans.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of queue load effect on channel access prioritization in wireless sensor networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5593273/",
            "Abstract": "Resource allocation in Wireless Sensor Networks (WSNs) is certainly a challenging issue. WSNs are characterized by special features, like energy constraints and limited computing resources. Latest trends define that sensors should be able to provide Quality of Service (QoS) demanding data transmission. A modern approach in bandwidth sharing considers both the packet queue load as well as the traffic priority. A new QoS aware channel sharing approach is introduced, analyzing the effect of queue load in WSN Medium Access Control (MAC). The analysis reveals that the queue load factor has a great impact on QoS provision in bandwidth sharing, while packet priorities are also considered.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spyridon K. Chronopoulos‑schronopoulos@ uowm. gr; spychro@ gmail. com Annals of General Psychiatry 2018, 17 (Suppl 1): A14 Background: Throughout the history of e-learning, the people with disabilities had to face a lot of omissions relevant to every aspect of their learning procedure [1]. These problems ranged from improper web designed pages to the improper way of confronting these types of our fellow citizens. This research takes into consideration the need for radical changes into e-learning",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Spyridon-Chronopoulos/publication/327467102_Revolutionizing_e-learning_with_the_proposition_of_Matrix_Based-Artificial_Intelligent_Decisions_MB-AID_taking_into_account_the_best_practices_towards_each_person's_psychological_condition/links/5b90f1c292851c6b7ec88e20/Revolutionizing-e-learning-with-the-proposition-of-Matrix-Based-Artificial-Intelligent-Decisions-MB-AID-taking-into-account-the-best-practices-towards-each-persons-psychological-condition.pdf",
            "Abstract": "Background: Throughout the history of e-learning, the people with disabilities had to face a lot of omissions relevant to every aspect of their learning procedure [1]. These problems ranged from improper web designed pages to the improper way of confronting these types of our fellow citizens. This research takes into consideration the need for radical changes into e-learning process and especially the need for breakthrough changes towards e-class design while it introduces a new way for assessing people and especially patients suffering from severe psychological problems. The latter could be accomplished by properly calibrating the innovative e-class environment (by an Artificial Intelligent System) through audiovisual and self-perceived measurements [2]. These measurements could be split into various matrix-based robotic decisions for properly estimating the condition of a person interacting with the e-class environment. This in turn will not only benefit the final user from the aspect of best e-learning but also to properly warn him/her for potential psychological problems that could be addressed with the use of a clinician (Eg Ophthalmologist, Psychiatrist, Psychologist, Speech Language Therapist, etc.). Also, the proposed system could be part of an advanced scheme such as the Reduced Ecological Footprints of Modern Facilities REFF [3]. Materials and methods: The research is focused on a protocol which introduces the way of designing and constructing a viable smart e-learning environment. Moreover, this protocol is so flexible that it can be implemented in a large variety of applications and systems. It consists of two parts. The first part …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cost-utility analysis of long-term telemonitoring of DMT2 patients among different EU health systems: the Renewing Health multicenter trial.",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Afentoula-Mavrodi/publication/273630113_Cost-utility_analysis_of_long-term_telemonitoring_of_DMT2_patients_among_different_EU_health_systems_The_Renewing_Health_multicentre_trial/links/5506dbba0cf26ff55f7b0f45/Cost-utility-analysis-of-long-term-telemonitoring-of-DMT2-patients-among-different-EU-health-systems-The-Renewing-Health-multicentre-trial.pdf",
            "Abstract": "MethodsIn all three trial sites a randomized, unblinded, controlled, multicenter study was carried out. In total, 823 patients with DMT2, HbA1c> 53 mmol/mol (7.0% NGSP) and capable of using the telemonitoring device were studied after randomly assigned in the telemonitoring (I),(N= 555), and the control (C),(N= 268), group (Figure 1). In the (I) patients’ blood glucose levels were collected weekly via a telemonitoring device, for a period of one year. The exact integration platform differed in the three regions; keeping in common, though, the health professionals’ contact with the patients via phone for counseling on lifestyle and medication adjustments, whenever required (Figure 2). Patients in the (C) received usual care with face-to-face consultations. HRQoL was assessed using a generic (SF36v2) questionnaire and SF-6D was used to calculate quality adjusted life years (QALYs) in the cost-utility analysis. The average cost of telemedicine treatment per patient was measured throughout the trial.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extraction of Reflectance Maps for Smart Farming Applications Using Unmanned Aerial Vehicles",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9249628/",
            "Abstract": "In this application paper, a robust framework for smart remote sensing of cultivations using Unmanned Aerial Vehicles is presented, yielding to a useful tool with advanced capabilities in terms of time-efficiency, accuracy, user-friendly operability, adjustability and expandability. The proposed system incorporates multispectral imaging, automated navigation and real-time monitoring functionalities into a fixed-wing Unmanned Aerial Vehicle platform. Offline analysis of captured data is performed, at this stage of system development, via powerful commercial software so as to extract the reflection map of the crop area under study based on the Normalized Difference Vegetation Index. The proposed approach has been tested on selected cultivations in two regions (Greece), aiming at recording field variability and early detecting factors related to crop stress. Preliminary results indicate that the proposed framework can …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Uptake of Mobile ICT Health Services: Has the Time Come to become Commodity?",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_28",
            "Abstract": "Personalized healthcare (pHealth) is a collective term aiming to reflect all modes of patient-centric healthcare delivery via advanced technology means. Personalized health involves the utilization of micro and nanotechnology advances, molecular biology, implantable sensors, textile innovations and mobile information & communication technology (mICT) to create individualized monitoring and treatment plans. pHealth proactively endorses the sense of “one-to-one” communication to elevate healthcare delivery, optimize patient services and ensure seamless from the patient point of view information exchange. Patient awareness, policy planning and technology progress are favoring phealth market penetration, while financing issues, political commitment, and unavailability of technology infrastructures are fundamentally prohibiting its expansion. This paper explores the drivers and barriers to the adoption of …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Country Brief: Cyprus",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/9143729/cyprus_countrybrief_ehstrategies.pdf",
            "Abstract": "In Cyprus, the National Strategic Reference Framework for Cohesion Policy1 (NSRF) 2007-2013, covers aspects of eHealth and eGovernment services. It defines that the supply of eHealth should be extended and action to be taken in the field of eHealth in order to upgrade the quality of health services provided. Prior to this, groundwork had been laid by the e-Government Vision. This policy paper was published in 2002, and seeks the continuous enhancement and updating of the Information Society Service (ISS) 2, the developments in Information Technology and the EU Directions. Many of the objectives of the e-Europe Action Plans have been achieved. Also related is the Business",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bandwidth allocation in cooperative wireless networks: Buffer load analysis and fairness evaluation",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874490711000152",
            "Abstract": "In modern cooperative wireless networks, the resource allocation is an issue of major significance. The cooperation of source and relay nodes in wireless networks towards improved performance and robustness requires the application of an efficient bandwidth sharing policy. Moreover, user requirements for multimedia content over wireless links necessitate the support of advanced Quality of Service (QoS) features. In this paper, a novel bandwidth allocation technique for cooperative wireless networks is proposed, which is able to satisfy the increased QoS requirements of network users taking into account both traffic priority and packet buffer load. The performance of the proposed scheme is examined by analyzing the impact of buffer load on bandwidth allocation. Moreover, fairness performance in resource sharing is also studied. The results obtained for the cooperative network scenario employed, are validated …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Accelerated Seven Segment Optical Character Recognition Algorithm",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956283/",
            "Abstract": "We present an accelerated optical character recognition approach of seven-segment display digits. We focus on digital medical devices, which are used by aged people with possible disabilities, although numerous practical applications are available for this type of digit recognition. Using the proposed system, patients are expected to scan a medical instrument with a smartphone to automatically extract measurements related to their health. Such a system can make the procedure easier for the patient and does not require specific knowledge of what each number represents. Although, similar research is existent, we present a highly parallelizable algorithm, along with it's implementation on an FPGA host, to accelerate the recognition process. Experiment results on FPGA and ARM platforms illustrate that our enhanced multithreaded procedure of applying optical character recognition achieves 96.22% accuracy and …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless Network Traffic and Quality of Service Support: Trends and Standards: Trends and Standards",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=QylGxA5WZ2MC&oi=fnd&pg=PR1&dq=info:fHzw7ybAXxUJ:scholar.google.com&ots=G6ZMGqirBJ&sig=K9UvaKiEnsngVcy-jXjZ77KostQ",
            "Abstract": "Wireless networking is considered by many to be the future of communication technology, as the demand for high quality, mobile connection increases across the world. Wireless Network Traffic and Quality of Service Support: Trends and Standards examines cutting edge approaches for the provision of Quality of Service (QoS) in wireless local area networks, presenting the latest solutions towards the optimization of the channel management and routing in infrastructure and ad hoc wireless networks. This book also analyzes traffic categorization issues and methods that can predict the available QoS, as well as managing wireless mesh networks and wireless sensor networks. It also examines the entire user experience, by treating energy conservation techniques to maximize mobile devices' battery lifetime. It is a vital foundation for researchers dealing with the problems of today to create the new networks of the future.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:Se3iqnhoufwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Analysis of electroencephalographic signals complexity regarding Alzheimer's Disease",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790618330350",
            "Abstract": "Alzheimer's Disease (AD) is the most common type of dementia with world prevalence of more than 46 million people. The Mini-Mental State Examination (MMSE) score is used to categorize the severity and evaluate the disease progress. The electroencephalogram (EEG) is a cost-effective diagnostic tool and lately, new methods have developed for MMSE score correlation with EEG markers. In this paper, EEG recordings acquired from 14 patients with mild and moderate AD and 10 control subjects are analyzed in the five EEG rhythms (δ, θ, α, β, γ). Then, 38 linear and non-linear features are calculated. Multiregression linear analysis showed highly correlation of with MMSE score variation with Permutation Entropy of δ rhythm, Sample Entropy of θ rhythm and Relative θ power. Also, the best statistically significant regression models in terms of R2 are at O2 (0.542) and F4 (0.513) electrodes and at posterior (0.365 …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "MOBINET: e-Wellness services fostering citizen empowerment",
            "Publication year": 2006,
            "Publication url": "http://medlab.cs.uoi.gr/itab2006/proceedings/eHealth/48.pdf",
            "Abstract": "The Mobinet service concept emerged, as points of care move closer to the patient and the citizen undertakes a more active role in healthcare monitoring and prevention. Today’s advances in monitoring devices and telecommunication networks have made possible a viable solution regarding the provision of continuous health monitoring services seamlessly. Utilizing the information and communication technologies (ICT) and medical industry advances, Mobinet exploits a modular telemedicine platform, to provide a personalized and location independent service focusing on prevention (rather than disease management) to support increasing patients needs for self-empowerment and increasing the quality in the healthcare delivery away from the traditional nursing areas. The business plan explores the potential of telemonitoring services and draws the business, financial and marketing strategies for the successful penetration to the Greek market. The paper presents two models for the provision of health-telemonitoring services to all citizens and examines the added value and effectiveness of the proposed services. Data from real life case studies are extracted. The future of mobile healthcare is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cost-Effective Health Services for Interactive Continuous Monitoring of Vital Signs Parameters–The e-Vital concept",
            "Publication year": 2004,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-60750-946-2-355",
            "Abstract": "The objective of the e-Vital project is the validation of the market concerning the provision of a novel remote telemedicine service aimed at large sensitive parts of the European population, the “at-risk” citizens, who are usually patients with a stable medical condition that allow a near normal life but may suddenly deteriorate and put life at risk. This service will increase their quality of life and their feeling of safety concerning their health. The e-Vital project focuses on the implementation and exploitation of a modular and ambulatory secure telemedicine platform, which is using easily wearable vital signs monitoring devices, causing minimal discomfort to patients, and which transfer in real time and on-line critical vital parameters to doctors and/or medical experts/consultants, regardless of their location, while getting feedback to increase their feeling of comfort or in case of alarm. The interactive continuous monitoring …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Machine Learning Algorithms and Statistical Approaches for Alzheimer's Disease Analysis Based on Resting-State EEG Recordings: A Systematic Review.",
            "Publication year": 2021,
            "Publication url": "https://europepmc.org/article/med/33588710",
            "Abstract": "Alzheimer's Disease (AD) is a neurodegenerative disorder and the most common type of dementia with a great prevalence in western countries. The diagnosis of AD and its progression is performed through a variety of clinical procedures including neuropsychological and physical examination, Electroencephalographic (EEG) recording, brain imaging and blood analysis. During the last decades, analysis of the electrophysiological dynamics in AD patients has gained great research interest, as an alternative and cost-effective approach. This paper summarizes recent publications focusing on (a) AD detection and (b) the correlation of quantitative EEG features with AD progression, as it is estimated by Mini Mental State Examination (MMSE) score. A total of 49 experimental studies published from 2009 until 2020, which apply machine learning algorithms on resting state EEG recordings from AD patients, are reviewed. Results of each experimental study are presented and compared. The majority of the studies focus on AD detection incorporating Support Vector Machines, while deep learning techniques have not yet been applied on large EEG datasets. Promising conclusions for future studies are presented.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Technology for integrated eCare",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/chapter/technology-for-integrated-ecare/111377",
            "Abstract": "Today, healthcare and social care services are often delivered independently. This can lead to inefficiencies, duplication of resources, and potentially to reduced levels of care quality. Older people are particularly affected by this situation, since they often need both types of services, such as support with daily living activities and chronic disease management. At the same time, the potential of Information and Communication Technology (ICT) to support integrated service delivery remains largely unexploited. Against this background, many are the technologies that might offer a suitable canvas for integrated care, particularly to more vulnerable social groups. The main goal of this chapter is to provide insight into the most promising technologies for facilitation of integrated care, such as Ambient Intelligence, Internet of Things, Robotics, Service Platforms, etc., and to discuss the potential of combined technologies to …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Managing children’s asthma with a low cost web-enabled multifunctional device",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-04102-5_6",
            "Abstract": "The essence of this paper is to present an innovative, viable, low cost, cloud based asthma management system solution, regarding children’s asthma issues. The proposed device is a spirometric element that combines the functionality of several other devices that are so important for the daily life of asthma patients aged between 6 to 14. All the above are achieved using the latest technology in wireless and medical equipment that would make the device become irreplaceable to the end user.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards an effective energy efficient passive optical network",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983869/",
            "Abstract": "Communication networks' energy consumption poses a considerable threat to the environment stability. The expansion of access networks, which constitute the main playground of the Internet backhaul, is accompanied by numerous energy inefficient devices and equipments. Passive optical networks (PONs) is a potential dominant technology on the field of access networking, hence the reduction of the consumed energy of the optical devices forms a critical issue. In this paper, an efficient green PON is introduced, having two main targets: a) to reduce the energy consumption, by allowing optical devices to operate longer in sleep mode, and b) to maintain PON's good performance. Beyond the green provisioning, the proposed scheme is able to increase occasionally the network performance in terms of mean packet delay and packet drop ratio. This is accomplished by reducing the amount of control messages …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Utilization of a multi-parameter sensor network for online monitoring of the water quality in the lignite mining area of Kozani, Greece",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/19443994.2012.748446",
            "Abstract": "The present study is focused on the examination and evaluation of environmental pressures on the aquatic resources of western Macedonia region (Greece) and particularly in Kozani lignite mines area, and on the development of a water quality monitoring system in the region, in order to identify potential impacts to the adjacent water resources. A multi-parametric sensor system was installed in three representative sites of the target area and the corresponding measured parameters included pH, temperature, conductivity, nitrate ions (  ), sulfate ions (  ), and chloride ions (Cl−) for a period of about 10 months. Additionally, certain other complementary physicochemical parameters (turbidity, hardness, COD, BOD5. DO, TSS,   ,   , Fe, and Al) were measured in selected grab samples, collected from certain points in the same area, in order to have an integrated view of water quality. The pH values ranged between 7.6 …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Reduced ecological footprints of modern facilities introducing the implementation of advanced wireless technologies, and human resources’ benefits",
            "Publication year": 2017,
            "Publication url": "https://www.scirp.org/journal/paperinformation.aspx?paperid=81122",
            "Abstract": "The necessity of lowering the mean power consumption of various facilities, due to the lack of their enormous future energy needs, led to an ongoing advance of various technologies. These technologies have been oriented towards the concept of a Reduced Ecological Footprint. Massive structures (such as building complexes and hospitals) have been redesigned and upgraded; many interior designs have been dramatically altered while new electronic devices are constantly being produced in order to revolutionize a long term perspective towards a “Green Planet” while they exhibit astonishing signal processing. Consequently, an enormous technology already exists which needs to be properly combined to a proposed methodology and to new ideas relevant to systems’ administration through automatic wireless control. This paper intends to reduce the gap between design and realization of the aforementioned research. Consequently, the primary contribution of this research is the proposal of a complete design protocol with minimized defects relevant to Reduced Ecological Footprints of Facilities (REFF) along with its beneficial advantages relevant to providing a healthy and productive work environment. This protocol consists of four main parts which are 1) the main key points-guidelines, 2) its objectives, 3) the know-how methodology for implementation in existing installations and 4) the description of the imminent benefits in workforce/human resources.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Scientific Research Publishing"
        },
        {
            "Title": "EEG window length evaluation for the detection of Alzheimer’s disease over different brain regions",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/445258",
            "Abstract": "Alzheimer’s Disease (AD) is a neurogenerative disorder and the most common type of dementia with a rapidly increasing world prevalence. In this paper, the ability of several statistical and spectral features to detect AD from electroencephalographic (EEG) recordings is evaluated. For this purpose, clinical EEG recordings from 14 patients with AD (8 with mild AD and 6 with moderate AD) and 10 healthy, age-matched individuals are analyzed. The EEG signals are initially segmented in nonoverlapping epochs of different lengths ranging from 5 s to 12 s. Then, a group of statistical and spectral features calculated for each EEG rhythm (δ, θ, α, β, and γ) are extracted, forming the feature vector that trained and tested a Random Forests classifier. Six classification problems are addressed, including the discrimination from whole-brain dynamics and separately from specific brain regions in order to highlight any alterations of the cortical regions. The results indicated a high accuracy ranging from 88.79% to 96.78% for whole-brain classification. Also, the classification accuracy was higher at the posterior and central regions than at the frontal area and the right side of temporal lobe for all classification problems. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:u_35RYKgDlwC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Cost-effective health services for interactive continuous monitoring of vital signs parameters-the e-Vital concept",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1291176/",
            "Abstract": "An integrated home care and telemonitoring service chain, the e-Vital service, is presented aimed at large sensitive parts of the European population, the \"at-risk\" citizens, who are usually patients with a stable medical condition that allow a near normal life but may suddenly deteriorate and put life at risk. This service will increase their quality of life and their feeling of safety concerning their health. The e-Vital project focuses on the implementation and exploitation of a modular and ambulatory secure telemedicine platform, which is using easily wearable vital signs monitoring devices, causing minimal discomfort to patients, and which transfer in real time and on-line critical vital parameters to doctors and/or medical experts/consultants, regardless of their location, while getting feedback to increase their feeling of comfort or in case of alarm.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "INDEPENDENT: Technology Supported Autonomous Living",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20865-2_10",
            "Abstract": "ICT enabled Service Integration for Independent Living (INDEPENDENT) is an ICT – PSP project funded under objective 1.3 ICT for ageing well / independent living. Work has started as early as February 2010 and expected to finish after 3 years. INDIPENDENT will address current limitations of telehealth and telecare platforms to serve needs for support and delivery of support to the elderly which is not limited to a single sector (healthcare or social care) but spans the two sectors and empowers informal carers and the third sector to participate in delivery of support. This paper will discuss the Greek experience when drafting pilot scenarios that fit into the project’s goals.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The use of HL7 as an interoperability framework in a regional healthcare system in Greece",
            "Publication year": 2005,
            "Publication url": "http://yadda.icm.edu.pl/yadda/element/bwmeta1.element.baztech-article-BAT3-0031-0002",
            "Abstract": "The integration of information systems represents one of the most urgent priorities of a regional healthcare authority in order to meet its clinical, organizational and managerial needs. Current practice shows that the most promising approach to achieve a regional healthcare information system is to use a health level 7 (HL7) message-based communication system implemented by an asynchronous common communication infrastructure between healthcare sites. The system is a complete and integrated information system at a regional level that comprises all types of healthcare levels, that includes interoperability issues, that covers most of the needed components, and that is able to work efficiently in a secure wide area network to ensure data privacy and confidentiality. Another important feature of the proposed solution is that it creates an interoperability framework that can be replicated from one healthcare institution to another. In that sense, common interoperability messages can be used to interconnect heterogeneous information systems. In response to this strategy, more than 10 different consortiums have submitted proposals to the Greek government and the proposed interoperability framework seems to be widely accepted as a solution to enhance information and communication technologies developments in the healthcare sector in Greece.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The mobile telecommunications landscape in associate candidate and Western Balkan countries",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.586.4346&rep=rep1&type=pdf",
            "Abstract": "The last few years the telecommunication market in Associate Candidate Countries (ACC) and Western Balkan (WB) countries has experienced a rapid growth in terms of mobile operators and penetration rates of mobile telephony. An overview on the mobile telecommunications evolution in the emerging markets of the ACC and WB countries in terms of penetration indicators is analyzed in this article.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach towards semantic interoperability using domain models",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Georg-Heidenreich-2/publication/51016167_An_Approach_towards_Semantic_Interoperability_using_Domain_Models/links/553fb82e0cf2320416ec1d77/An-Approach-towards-Semantic-Interoperability-using-Domain-Models.pdf",
            "Abstract": "This paper introduces so-called Domain models to support semantic interoperability of connected IT-systems. The focus of the paper is to motivate the combination of technical and informal specifications and to present a procedure of modelling independent IT-systems at the semantic level for the purpose of semantic interoperability. The resulting domain models may then be the foundation for systematic mappings between those IT-systems which preserve semantics of both messages and persistent records.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview on telecommunications regulation frameworkin south-eastern Europe",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/34154013/Overview_on_telecom._regulation_framework2.pdf",
            "Abstract": "Over the last few years all South-Eastern European (SEE) countries have started an effort that involves complete transition of telecom regulations, in order to comply with European Union rules. Towards this direction, the majority of the SEE governments have proceeded in the establishment of independent Regulative Authorities. In addition, a sct of Telecommunications Acts was entered into force in all SEE countries, while the mobile market is fully liberalised. This paper presents an overview of the regulation and institutional telecommunications framework in the SEE region.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "IoT-based smart triage of Covid-19 suspicious cases in the Emergency Department",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9367584/",
            "Abstract": "According to scientific reports, the main and most common Covid-19 symptoms are fever and shortness of breath. Therefore, monitoring of vitals such as temperature, breathing and heart rate and blood oxygen saturation is of essence. Our team has designed and developed a wrist-worn wearable device that continuously monitors relevant vital signs with the aim to prioritize and triage Covid-19 patients in the Emergency Department.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CAROTID–A web-based platform for optimal personalized management of atherosclerotic patients",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016926071400056X",
            "Abstract": "Carotid atherosclerosis is the main cause of fatal cerebral ischemic events, thereby posing a major burden for public health and state economies. We propose a web-based platform named CAROTID to address the need for optimal management of patients with carotid atherosclerosis in a twofold sense: (a) objective selection of patients who need carotid-revascularization (i.e., high-risk patients), using a multifaceted description of the disease consisting of ultrasound imaging, biochemical and clinical markers, and (b) effective storage and retrieval of patient data to facilitate frequent follow-ups and direct comparisons with related cases. These two services are achieved by two interconnected modules, namely the computer-aided diagnosis (CAD) tool and the intelligent archival system, in a unified, remotely accessible system. We present the design of the platform and we describe three main usage scenarios to …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:isC4tDSrTZIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Personalised physical exercise regime for chronic patients through a wearable ICT platform",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJEH.2010.036207",
            "Abstract": "Today's state of the art in exercise physiology, professional athletics and sports practice in general clearly shows that the best results depend on the personalisation and continuous update of the recommendations provided to an athlete training, a sports lover or a person whose medical condition demands regular physical exercise. The vital signs information gathered in telemonitoring systems can be better evaluated and exploited if processed along with data from the subject's electronic health records, training history and performance statistics. In this context, the current paper intends to exploit modern smart miniaturised systems and advanced information systems towards the development of an infrastructure for continuous, non-invasive acquisition and advanced processing of vital signs information. In particular, it will look into wearable electronics embedded in textile capable of performing regular or exceptional …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:HDshCWvjkbEC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Development of a multi-parameter sensors network for monitoring the water quality of Kozani lignite mines region, Greece",
            "Publication year": 2011,
            "Publication url": "http://users.uowm.gr/paggelidis/publications/cpapers/Paper%20Arev262_HRAKLEITOS%20footnote.pdf",
            "Abstract": "The present study is focused in the development of a water quality monitoring system of effluents and drainage from lignite mining activities in the region of Western Macedonia (Kozani), and in the investigation of potential impacts to the adjacent water resources by the installation and operation of an appropriate network of sensors. Particularly, the aim of this paper is to present the process of the design, installation and operation of a network initially consisting of three multi-parameter sensor systems, located in the wider lignite mines region of Kozani, in order to monitor the surface and underground water quality of the aquatic resources of the area. The basic physicochemical parameters measured by the multi-parameter sensors system included pH, temperature, conductivity, nitrate ions (NO3-), sulfuric ions (SO4-2), chloride ions (Cl-) for a period of about ten months. Additionally, certain other complementary physicochemical parameters have been measured in selected samples collected from the same areas, in order to deduce an integrated view of water quality. The pH values ranged between 7.6 and 8.3 and remained quite stable in all three monitoring stations. Observed fluctuation in conductivity measured values from 188 to 1082 μS/cm was related to variations in water quality characteristics especially in the surface water monitoring sites. The wide NO3-content only in Ag. Dimitrios PPC Station was attributed to wastewater discharge. Detailed analysis of recorded measurements on a day-to-day level, especially for SO4-2 and Cl-values, revealed potential pollution incidents.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Take-A-Breath: Smart Platform for Self-management and Support of Patients with Chronic Respiratory Diseases",
            "Publication year": 2020,
            "Publication url": "https://electra.lis.upatras.gr/iisa/article/view/3328",
            "Abstract": "This paper presents the Take-A-Breath project, which focus on the development of an advanced system for supporting personalized approaches to self-management of chronic patients with respiratory diseases to significantly increase the effectiveness of the medical care. Take-A-Breath is a project co-financed by the European Regional Development Fund of the European Union and Greek national funds through the Operational Program Competitiveness, Entrepreneurship and Innovation, under the call RESEARCH–CREATE–INNOVATE. The project has started on July of 2018 (M1) and will have a duration of 36 months. The first section of this report provides an overview of Take-A-Breath, by presenting objectives and innovation aspects as well as by describing the work plan, the implementation phases, the expected results and the impact of the project. The current status of the project is described in section 2, while conclusions and future work are included in the last section.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the Potential of Over-the-Web Psychiatry",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-1274-9_2",
            "Abstract": "Over the past years, the scientific community has witnessed a tremendous growth of applications in healthcare telematics. The adoption rate of web-based practices was not the same for all medical specialties. Some such as cardiology were fast adopters mainly due to the ‘electric’ nature of the standard diagnostic tools (electro-cardiographer) but others such as psychiatry are still lagging from adopting new methodologies. Now that ubiquitous broadband Internet access is here to stay, the time has come to explore the potential of mental care services that could be offered over the web.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Monitoring quality-of-life parameters in wearable environments",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/271584",
            "Abstract": "The paper presents a new cross-layer bridge protocol between IEEE 802.15. 4, IEEE 11073 and IEEE 802.11 for wearable-enabled health-data aggregation formations. The protocol addresses the new reality as imposed by the recent evolution of sensors and networking in situations where backbone infrastructure is experiencing congestion. We discuss real-life application scenarios of nimble-network formations. The main novelty of the proposed algorithm is that it defines presence as a new way of routing. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Integration of eHealth Service in IPv6 Vehicular Networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-04102-5_7",
            "Abstract": "Several convenience and efficiency applications have been proposed as part of recent vehicular networks (a.k.a. VANET) activities. Among these proposals, eHealth has often been studied as a time-critical application to emulate an ambulance. The Vehicle-To-Infrastructure (V2I) setting is the typical communication scenario to carry out the data in this case. From a user perspective, combining vehicular networking and eHealth to record and transmit a patient’s vital signs is a special telemedicine application that helps hospital resident professionals to optimally prepare the patient’s admittance. The current proposal pro-vides an IPv6 vehicular platform which integrates eHealth devices and allows sending captured user health-related data to a Personal Health Record (PHR) application server on the IPv6 Internet. The collected data are viewed remotely by a doctor and supports diagnostic decision. The …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Energy-efficiency evaluation of a medium access control protocol for cooperative ARQ",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962602/",
            "Abstract": "We present in this paper the evaluation of the energy consumption of PRCSMA, an 802.11-based medium access control protocol designed to coordinate the retransmissions from the relays in a wireless network implementing a Cooperative Automatic Retransmission Request (C-ARQ) scheme. A comparison in terms of energy efficiency with non-cooperative ARQ schemes (retransmissions performed only from the source) and with ideal C-ARQ (with perfect scheduling among the relays) is included in this paper. The main results show the conditions under which a C-ARQ scheme with PRCSMA outperforms, in terms of energy efficiency, non-cooperative ARQ schemes and also show that the overhead of the MAC layer cannot be neglected in order to accurately evaluate the performance of a C-ARQ scheme.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel system for hemodialysis patients home monitoring",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20865-2_8",
            "Abstract": "Chronic renal patients and patients with end stage renal disease are a distinctive patient group with a serious, chronic and irreversible health condition, which is mainly treated at home. As such they are unique candidates for support via telehealth services. This paper introduces a novel monitoring system for hemodialysis patients. The leading aims of this system are the development of innovative biomedical signals management system and the implementation of integrated model medical signal projection and processing tools. The system is expected to contribute to the increase of the demand in the medical services field as well as to reduce the patient transfer abroad for recovery.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The hackathon model to spur innovation around global mHealth",
            "Publication year": 2016,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03091902.2016.1213903",
            "Abstract": "The challenge of providing quality healthcare to underserved populations in low- and middle-income countries (LMICs) has attracted increasing attention from information and communication technology (ICT) professionals interested in providing societal impact through their work. Sana is an organisation hosted at the Institute for Medical Engineering and Science at the Massachusetts Institute of Technology that was established out of this interest. Over the past several years, Sana has developed a model of organising mobile health bootcamp and hackathon events in LMICs with the goal of encouraging increased collaboration between ICT and medical professionals and leveraging the growing prevalence of cellphones to provide health solutions in resource limited settings. Most recently, these events have been based in Colombia, Uganda, Greece and Mexico. The lessons learned from these events can provide a …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:70eg2SAEIzsC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "E-health",
            "Publication year": 2005,
            "Publication url": "https://www.il-pib.pl/czasopisma/JTIT/2005/4/1.pdf",
            "Abstract": "E-health is a collective term aiming to reflect all modes of electronic healthcare delivery via the electronic communication means. E-health applications bring technology to patient care, ranging from prevention and diagnosis to follow-up, allowing the utilization of modern communication equipment and services capacity to link distant healthcare stations and individuals for the provision of healthcare services in real-time to remote groups of populations. More than that, e-health practices minimize the paperwork involved in the healthcare delivery, optimize the provided services, and ensure seamless communication and access to information independently of geographical limitations.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "eHealth service support in future IPv6 vehicular networks",
            "Publication year": 2013,
            "Publication url": "https://www.mdpi.com/53504",
            "Abstract": "Recent vehicular networking activities include novel automotive applications, such as public vehicle to vehicle/infrastructure (V2X), large scale deployments, machine-to-machine (M2M) integration scenarios, and more. The platform described in this paper focuses on the integration of eHealth in a V2I setting. This is to allow the use of Internet from a vehicular setting to disseminate health-related information. From an eHealth viewpoint, the use of remote healthcare solutions to record and transmit a patient’s vital signs is a special telemedicine application that helps hospital resident health professionals to optimally prepare the patient’s admittance. From the automotive perspective, this is a typical vehicle-to-infrastructure (V2I) communication scenario. This proposal provides an IPv6 vehicular platform, which integrates eHealth devices and allows sending captured health-related data to a personal health record (PHR) application server in the IPv6 Internet. The collected data is viewed remotely by a doctor and supports his diagnostic decision. In particular, our work introduces the integration of vehicular and eHealth testbeds, describes related work and presents a lightweight auto-configuration method based on a DHCPv6 extension to provide IPv6 connectivity with a few numbers of messages. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:TFP_iSt0sucC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Mobile telecommunications evolution in Southeastern Europe",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1391413/",
            "Abstract": "Over the last few years the mobile market in South East Europe (SEE) has experienced a rapid growth in terms of operators and penetration rates of mobile telephony. This is due to the fact that wireless telephony has a cost comparable to fixed and it is easier to be established in comparison with fixed. Moreover, the countries of SEE hope that through mobile telephony they will be able to decrease the digital gap between them and the European Union countries. An overview of the mobile telecommunications evolution in SEE countries is analyzed in this article.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handling multicast video over non multicast networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065039/",
            "Abstract": "In this paper we evaluate the basic methods of video transmission, focusing on multicast, the popularity of which has increased over the last years. Although the specific technique is able of reducing significantly the consumption of network resources, such as the bandwidth, the specifications of IEEE 802.11 family networks do not support the mechanisms for reliable multicast transmission. Therefore, multicast video transmission over those wireless networks is considered to be almost inapplicable. In this paper we propose the use of VPN technologies for deploying an efficient and low cost infrastructure of multicast video transmission over wireless networks.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integration of healthcare information systems: Steps towards common clinical documents",
            "Publication year": 2005,
            "Publication url": "http://users.uowm.gr/paggelidis/publications/publications/%CE%A332.pdf",
            "Abstract": "The process of transmitting patient medical information between the departments of a health care organization and between heaithcare practitioners involves dealing with interoperability issues within a hospital information system infrastructure (HIS) as well as harmonising documents to be exchanged. The 2\"\" Regional Healthcare Authority of Central Macedonia (RHA) is in the process of implementing a major information technology infrastructure under the 3'“Community Support Framework (CSF) funding. In that context, a pilot system was developed to achieve data integration and record synchronisation using Health Level 7 (HL7) as the basic protocol for data exchange. One of the next steps is to determine clinical documents data to be used in order to achieve a “basic medical communication level\" within the RHA. This paper presents the methodology used to sort and achieve a common understanding in …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "eMed: the paradigm of utilization of digital economy techniques for the reimbursement of medical services across Europe",
            "Publication year": 2002,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/146045820200800101",
            "Abstract": "eMed provides for the first time a complete framework for organizations involved in the healthcare sector to utilize eCommerce and m-Commerce technologies and to enable information sharing and partnerships. It devises a sustainable supply-chain model that can best satisfy an ever-changing marketplace. It aids organizations in migrating to an improved system while focusing on driving costs out of the supply chain. eMed is an advanced experiment in the field of healthcare administration that aims at the connection of regional medical communities to the global digital economy. It aims at the creation of local medical digital communities in selected European regions as well as their interconnection. The main objective is to systematically assess the risks and opportunities involved in the implementation of a service for reimbursement of medical services in Europe, based on advanced telematics technologies and …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:5nxA0vEk-isC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Quality assessment of a second opinion telemedicine service",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s12553-019-00343-2",
            "Abstract": "The use of technology advancements and telemedicine has definitely contributed to reducing the communication gap between patients and doctors. Lately, a telemedicine program is applied in Greece aiming at the improvement of primary health services offered to Greek citizens, especially of remote and rural areas. The program is supported by the Greek National Health Service, while it is fully funded and run by Vodafone Greece. Vodafone offers doctors of 100 remote areas of continental Greece and Greek islands, portable medical equipment, supplies, electronic equipment and internet access to enable them to monitor their patients. It also offers them potential advisory support from doctors of the Athens Medical Center. The differentiation of this program from the vast majority of others lies in the fact that the end-user of the program is not the patients themselves. In accordance with the will of Vodafone to …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Adaptive Control in Wireless Networks",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30806134/5935.pdf",
            "Abstract": "In wireless networks, where all mobile stations share the same unreliable medium (the air), channel access control is crucial. The role of the medium access control mechanism becomes even more important nowadays, since the mobile users’ network demands have greatly increased. Initially, the wireless networks were employed as simple extensions of the wired ones, thus, the requirements for this new kind of computer networks were not high. The first wireless computer communications were mainly involving traditional data transmissions of low demands. Modern wireless networks are expected to serve “heavy” multimedia transmissions as well. Now, the medium access control has to efficiently adapt to the different network conditions, the different demands and characteristics of the served transmissions.There is a great number of medium access control methods proposed in the literature. A categorization of these methods is provided in this chapter. Some of the proposed methods are quite generic and can be theoretically employed in a large number of networks, while others are more specialized and target, for example, exclusively on wireless local area networks. The type and the specific features of the used access control mechanism significantly defines the overall network behavior. Modern wireless network access control is expected to efficiently provide QoS.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:IWHjjKOFINEC",
            "Publisher": "INTECH Open Access Publisher"
        },
        {
            "Title": "Development of an mHealth open source platform for diabetic foot ulcers tele-consultations",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29734-2_22",
            "Abstract": "Diabetes is one of the foremost causes of death in many countries and a leading cause of blindness, renal failure, and non-traumatic amputation. Therefore, diabetic foot ulceration and amputation cause extensive burden on individuals and health care systems in developed and developing countries. Due to the multi-disciplinary requirements for the treatment of diabetic foot ulceration, telemedicine has been introduced to facilitate the access of the patients to specialized health professionals. In this paper the development of an open source mobile health platform is presented, able to support diagnostic algorithms, with the use of a smartphone.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Correspondence: Spyridon K. Chronopoulos‑schronopoulos@ uowm. gr; spychro@ gmail. com Annals of General Psychiatry 2018, 17 (Suppl 1): A16 Background: Robots as well-known are complex machines constituted of artificial parts and digital logic structures. Two key points need special attention in order an artificial humanoid to be finely developed. Firstly, the artificial structure must resemble to a human not only in the figure but moreover in expressed movements accomplishing a body language very close to that of their",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Spyridon-Chronopoulos/publication/327514129_How_robots_could_reach_humanity_with_the_implementation_of_Advanced_Emotional_Signalling_in_Algorithmically_Structured_Systems_AESASS/links/5b92e3a292851c78c4f7c9bb/How-robots-could-reach-humanity-with-the-implementation-of-Advanced-Emotional-Signalling-in-Algorithmically-Structured-Systems-AESASS.pdf",
            "Abstract": "Background: Robots as well-known are complex machines constituted of artificial parts and digital logic structures. Two key points need special attention in order an artificial humanoid to be finely developed. Firstly, the artificial structure must resemble to a human not only in the figure but moreover in expressed movements accomplishing a body language very close to that of their owner while this artificial body should include sensors network (BWSN) technology [1]. Secondly, the artificial brain must exhibit seamless decisions and if needed quick responses taking into consideration an empathetic employed nature of behavior. The latter could be accomplished with the use of 5-stage iterative logic which guarantees the best possible result and a unique behavior even when compared between the same robot models. In this point of development all precautions must take into account that the artificial developed characters should conform to a significant standard. Their auto-development should not constitute an abuse towards their owner’s safety and generally towards every other human’s clinical condition. Additionally, a self-robot check is proposed based on SCL90-R questionnaire as soon as the artificial character will be fully-deployable. Materials and methods: This work is centered on five primal principles-stages. Iterative logic is employed in order the system to self-adapt to the best solution. The latter is accomplished by using soft approximation through various stages and finally a feedback loop to constantly monitor new apprehended data versus past decisions. In this way, the behavior of the robot is constantly changing in order to adapt to …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A robust methodology for classification of epileptic seizures in EEG signals",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s12553-018-0265-z",
            "Abstract": "Drug inefficiency in patients with refractory seizures renders epilepsy a life-threatening and challenging brain disorder and stresses the need for accurate seizure detection and prediction methods and more personalized closed-loop treatment systems. In this paper, a multicenter methodology for automated seizure detection based on Discrete Wavelet Transform (DWT) is presented. A decomposition of 5 levels is applied in each EEG segment and five features are extracted from the wavelet coefficients. The extracted feature vector is used to train a Random Forest classifier and discriminate between ictal and interictal data. EEG recordings from the database of University of Bonn and the database of the University Hospital of Freiburg were employed, in an attempt to test the efficiency and robustness of the method. Classification results in both databases are significant, reaching accuracy above 95% and …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Mobile telemonitoring insights",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/mobile-telemonitoring-insights/26210",
            "Abstract": "Technology advances create new possibilities for healthcare monitoring, management, and support, focusing on prevention rather than disease management. The provision of personalized healthcare applications is also greatly supported. Developments in the wireless and mobile markets are capitalized by the medical device industry. Services are becoming personalized and location independent to fulfill the increasing patient needs for self-empowerment and quality in the healthcare delivery away from the traditional nursing areas. This overview discusses the new opportunities for the healthcare domain in the mobile times we live.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A citizen telemonitoring strategy as envisaged for Central Greece",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20865-2_2",
            "Abstract": "Renewing Health, a Pilot A, CIP/PSP project, funded from the European Commission, aims at implementing large-scale real-life test beds for the validation and subsequent evaluation of innovative telemedicine services using a patient-centric approach and a common rigorous assessment methodology. The services offered are designed to give patients a central role in the management of their own diseases, fine-tuning the choice and dosage of medications, promoting compliance to treatment, and helping healthcare professionals to detect early signs of worsening in the monitored pathologies. The current paper discusses the telemonitoring strategy as envisaged for Central Greece in the framework of the Renewing Health project.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Predicting multimedia traffic in wireless networks: a performance evaluation of cognitive techniques",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878802/",
            "Abstract": "Traffic engineering in networking is defined as the process that incorporates sophisticated methods in order to ensure optimization and high network performance. One of the most constructive tools employed by the traffic engineering concept is the traffic prediction. Having in mind the heterogeneous traffic patterns originated by various modern services and network platforms, the need of a robust, cognitive, and error-free prediction technique becomes even more pressing. This work focuses on the prediction concept as an autonomous, functional, and efficient process, where multiple cutting-edge methods are presented, modeled, and thoroughly assessed. To this purpose, real traffic traces have been captured, including multiple multimedia traffic flows, so as to comparatively assess widely used methods in terms of accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cost-effective Ambulatory Monitoring",
            "Publication year": 2005,
            "Publication url": "http://users.uowm.gr/paggelidis/publications/publications/%CE%A333.pdf",
            "Abstract": "The Mobinet service concept emerged, as points of care move closer to the patient and the citizen/patient undertakes a more active role in healthcare monitoring and prevention. T oday’s advances in monitoring devices and telecommunication networks have made possible a viable solution regarding the provision of continuous health monitoring services, seamlessly ﬁom the patients' point of view. The Mobinet concept has been tested under various clinical, technical and business pilots throughout Europe and is currently set ﬁar commercial launch in Greece.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:-f6ydRqryjwC",
            "Publisher": "Amsterdam; Washington, DC: IOS Press, 1991-"
        },
        {
            "Title": "Ambulatory monitoring for chronic cardiac and pulmonary patients",
            "Publication year": 2004,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/20850",
            "Abstract": "In the Greek pilot of the e-Vital project, remote telemedicine services are provided to chronic cardiac and pulmonary patients who are not confined to a hospital (ie receiving home/ambulatory health care) with the aim of exploring the dynamics of interactive continuous chronic patient monitoring, particularly focusing on the impact on patient's quality of life, the patient's active involvement in their own care and according impact on the overall quality of healthcare provision, as well as the benefits for healthcare providers (time management, patient management, savings, etc).",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:ufrVoPGSRksC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Secure precise clock synchronization for interconnected body area networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2011/797931.pdf",
            "Abstract": "Secure time synchronization is a paramount service for wireless sensor networks (WSNs) constituted by multiple interconnected body area networks (BANs). We propose a novel approach to securely and efficiently synchronize nodes at BAN level and/or WSN level. Each BAN develops its own notion of time. To this effect, the nodes of a BAN synchronize with their BAN controller node. Moreover, controller nodes of different BANs cooperate to agree on a WSN global and/or to transfer UTC time. To reduce the number of exchanged synchronization messages, we use an environmental-aware time prediction algorithm. The performance analysis in this paper shows that our approach exhibits very advanced security, accuracy, precision, and low-energy trade-off. For comparable precision, our proposal outstands related clock synchronization protocols in energy efficiency and risk of attacks. These results are …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Tele-psychiatry: socioeconomic results and the way forward",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20865-2_1",
            "Abstract": "Over the past years, the scientific community has witnessed a tremendous growth of applications in heath care telematics. The adoption rate of web based practices was not the same for all medical specialties. Others such as cardiology were fast adopters mainly due to the “electric” nature of the standard diagnostic tools (electro-cardiographer) but others such as psychiatry are still lagging from adopting new methodologies. Now that ubiquitous broadband Internet access is here to stay the time has come to explore the potential of mental care services that could be offered over the web.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "eHealth service support in IPv6 vehicular networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6379134/",
            "Abstract": "Recent vehicular networking activities include public vehicle to vehicle/infrastructure (V2X) large scale deployment, machine-to-machine (M2M) integration scenarios and more automotive applications. eHealth is about the use of the Internet to disseminate health related information, and is one of the promising Internet of Things (IoT) applications. Combining vehicular networking and eHealth to record and transmit a patient's vital signs is a special telemedicine application that helps hospital resident health professionals to optimally prepare the patient's admittance. From the automotive perspective, this is a typical Vehicle-to-Infrastructure (V2I) communication scenario. This proposal provides an IPv6 vehicular platform which integrates eHealth devices and allows sending captured health-related data to a Personal Health Record (PHR) application server in the IPv6 Internet. The collected data is viewed remotely by a …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobispiro: A novel spirometer",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_125",
            "Abstract": "Respiratory function monitoring and pulmonary diseases evaluation usually involve patient examination with spirometers, for the recording and monitoring of two principal parameters: the total air volume that the lungs can inhale and exhale, and the peek of the exhaled air flow. The purpose of implementing a portable spirometer device is to be used by patients who suffer from chronic pulmonary diseases, and need frequently to record and monitor their respiratory function. Mobispiro is a novel spirometer that enables recording and transmission of vital signs over GSM/GPRS networks and supports patient-centric models of healthcare provision. The core of the device includes all the essential hardware components, as well as software providing the necessary functionality and it is expected to fulfill all expert needs for monitoring patient’s disease. Mobispiro measurements are transferred to the doctor through …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A roadmap towards healthcare information systems interoperability in Greece",
            "Publication year": 2006,
            "Publication url": "http://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-article-BAT3-0038-0008",
            "Abstract": "EN The advantages of the introduction of information and communication technologies (ICT) in the complex healthcare sector are already well known and well stated in the past. It is common knowledge that in order to install any type of information system in healthcare, six main groups of issues have to be dealt with: organizational and cultural matters related to healthcare, technological gap between healthcare professionals and information science experts, legal requirements on the confidentiality of personal data, of patient related data and on data privacy, industrial and market position of healthcare informatics and interoperability complexity, lack of vision and leadership of the health care managers and health authorities and user acceptability and usability of the proposed information systems. In order to meet these issues stated above, a special focus group (Z3) performed an assessment of the situation of healthcare informatics in Greece and of the main key points that would lead to success. In that sense it is now common knowledge that Greece is lagging information and communication technology progress in healthcare because almost none of the above mentioned issues were dealt with. This assessment is the result of the interaction of more than 150 decision makers, medical informaticians, healthcare practitioners and other individual involved in healthcare. As a conclusion, this focus group resulted in 4 major propositions that will lead to healthcare informatics introduction with better success chances: focus on terminologies and standards, focus on interoperability and information systems sustainability, focus on clear goals and system …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CLAP: Cross-Layer Protocols for Phealth",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20865-2_26",
            "Abstract": "We present a low cost, low power, backbone free quality of life monitoring solution, suitable for rural areas of countries under development. CLAP is an MIT/VIDAVO initiative that we envision as a turnaround approach on the way health and quality of life in these areas of the world are being addressed.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Introducing telemedicine and telehealth in undergraduate medical education",
            "Publication year": 2006,
            "Publication url": "http://medlab.cc.uoi.gr/itab2006/proceedings/eHealth/161.pdf",
            "Abstract": "The introduction of telemedicine in medical curricula has mainly been facilitated over the last decade through either dedicated modules or through the inclusion of telemedicine aspects in Medical Informatics modules. This paper attempts to put across a taxonomy of telemedicine teaching approaches to be used by module designers in medical curricula. This is the first effort to classify the telemedicine contexts in the light of learning theories and given the availability of numerous teaching instruments available today.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An adaptive power management scheme for Ethernet Passive Optical Networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6912460/",
            "Abstract": "Undoubtedly, energy consumption in communication networks poses a significant threat to the environmental stability. Access networks contribute to this consumption by being composed of numerous energy inefficient devices and network equipment. Passive Optical Networks (PONs), one of the most promising candidates in the field of access networking, should avoid this bottleneck in the backhaul power consumption by lowering the energy use of the optical devices. In this paper, we move towards that direction by introducing an energy efficient power management scheme that encompasses two major goals: a) to reduce the energy consumption by allowing the optical devices to enter the sleep mode longer, and b) to concurrently maintain the network performance. To this end, we focus on the energy consumed by the optical network units (ONUs). The intelligence of the ONUs is stimulated by enhancing the …",
            "Abstract entirety": 0,
            "Author pub id": "a_6ka4oAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cost-effective health services for interactive lifestyle management: the PANACEIA-iTV and the e-Vital concepts",
            "Publication year": 2014,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/4668",
            "Abstract": "Information technology applications in medicine are rapidly expanding, and new methods and solutions are evolving since they are considered pivotal in the success of preventive medicine. In this paper two different concepts will be presented, the PANACEIA-iTV and the e-Vital concept. PANACEIA-iTV is a home care service provision system based on interactive TV technology and supported by the IST programme of the European Commission. The e-Vital service, supported by the eTEN programme of the European Commission, regards an integrated home care and telemonitoring service chain aimed at large sensitive parts of the European population, the \"at-risk\" citizens, who are usually patients with a stable medical condition that allow a near normal life but may suddenly deteriorate and put life at risk.",
            "Abstract entirety": 1,
            "Author pub id": "a_6ka4oAAAAJ:yD5IFk8b50cC",
            "Publisher": "National Institute of Telecommunications"
        }
    ]
}]