[{
    "name": "Παύλος Εφραιμίδης",
    "romanize name": "Pavlos Efraimidis",
    "School-Department": "Ηλεκτρολόγων Μηχ. & Μηχ. Υπολογιστών",
    "University": "duth",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 18194,
    "Scholar name": "Pavlos S. Efraimidis",
    "Scholar id": "Dxz0pLsAAAAJ",
    "Affiliation": "Assoc. Prof., ECE, Democritus University of Thrace and affiliated member of Athena RC",
    "Citedby": 1009,
    "Interests": [
        "Algorithms",
        "Algorithmic Game Theory",
        "Privacy",
        "Social Network Analysis"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Dxz0pLsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Towards Privacy by Design in Personal e-Health Systems",
            "Publication year": 2016,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11774",
            "Abstract": "Personal e-health systems are the next generation of e-health applications and their goal is to assist patientsin  managing their  disease  and to  help  both  patients  and  healthy  people  maintain behaviours  that  promote  health. To do this, e-health systems collect, process, store and communicate the individual’s personal data. This  paper  presents an  analysis  of  personal  e-health  systems  and  identifies  privacy  issues  as  a first  step  towards a ‘privacy by design’ methodology and practical guidelines.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:u_35RYKgDlwC",
            "Publisher": "SCITEPRESS-Science and Technology Publications, Lda"
        },
        {
            "Title": "Weighted random sampling over data streams",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24024-4_12",
            "Abstract": "In this work, we present a comprehensive treatment of weighted random sampling (WRS) over data streams. More precisely, we examine two natural interpretations of the item weights, describe an existing algorithm for each case [3, 8], discuss sampling with and without replacement and show adaptations of the algorithms for several WRS problems and evolving data streams.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "User-centric privacy-preserving statistical analysis of ubiquitous health monitoring data",
            "Publication year": 2014,
            "Publication url": "http://www.doiserbia.nb.rs/Article.aspx?ID=1820-02141400022D",
            "Abstract": "In this paper, we propose a user-centric software architecture for managing    Ubiquitous Health Monitoring Data (UHMD) generated from wearable sensors in a    Ubiquitous Health Monitoring System (UHMS), and examine how these data can be    used within privacy-preserving distributed statistical analysis. Two are the    main goals of our approach. First, to enhance the privacy of patients.    Second, to decongest the Health Monitoring Center (HMC) from the enormous    amount of biomedical data generated by the users’ wearable sensors. In our    solution personal software agents are used to receive and manage the personal    medical data of their owners. Moreover, the personal agents can support    privacy-preserving distributed statistical analysis of the health data. To    this end, we present a cryptographic protocol based on secure multi-party    computations that accept as input current or archived values of users’    wearable sensors. We describe a prototype implementation that performs a    statistical analysis on a community of independent personal agents. Finally,    experiments with up to several hundred agents confirm the viability and the    effectiveness of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "User-Centric Privacy-Preserving Statistical Analysis of Ubiquitous Health Monitoring Data",
            "Publication year": 2014,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11765",
            "Abstract": "In this paper, we propose a user-centric software architecture for managing Ubiquitous Health Monitoring Data (UHMD) generated from wearable sensors in a Ubiquitous Health Monitoring System (UHMS), and examine how these data can be used within privacy-preserving distributed statistical analysis. Two are the main goals of our approach. First, to enhance the privacy of patients. Second, to decongest the Health Monitoring Center (HMC) from the enormous amount of biomedical data generated by the users’ wearable sensors. In our solution personal software agents are used to receive and manage the personal medical data of their owners. Moreover, the personal agents can support privacy-preserving distributed statistical analysis of the health data. To this end, we present a cryptographic protocol based on secure multi-party computations that accept as input current or archived values of users’ wearable sensors. We describe a prototype implementation that performs a statistical analysis on a community of independent personal agents. Finally, experiments with up to several hundred agents confirm the viability and the effectiveness of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "ComSIS Consortium"
        },
        {
            "Title": "DUTH at TREC 2013 Contextual Suggestion Track",
            "Publication year": 2013,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11811",
            "Abstract": "In this report we give an overview of our participation in the TREC 2013 Contextual Suggestion Track. We present an approach for context processing that comprises a newly designed and fine-tuned POI (Point Of Interest) data collection technique, a crowdsourcing approach to speed up data collection and two radically different approaches for suggestion processing (a k-NN based and a Rocchio-like). In the context processing, we collect POIs from three popular place search engines, Google Places, Foursquare and Yelp. The collected POIs are enriched by adding snippets from the Google and Bing search engines using crowdsourcing techniques. In the suggestion processing, we propose two methods. The first submits each candidate place as a query to an index of a user’s rated examples and scores it based on the top-k results. The second method is based on Rocchio’s algorithm and uses the rated examples per user profile to generate a personal query which is then submitted to an index of all candidate places. The track evaluation shows that both approaches are working well; especially the Rocchio-like approach is the most promising since it scores almost firmly above the median system and achieves the best system result in almost half of the judged contextprofile pairs. In the final TREC system rankings, we are the 2nd best group in MRR and TBG, and 3rd best group in P@5, out of 15 groups in the category we participated.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy-preserving, user-centric VoIP CAPTCHA challenges: An integrated solution in the SIP environment",
            "Publication year": 2016,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/ICS-07-2014-0046/full/html",
            "Abstract": " – This work aims to argue that it is possible to address discrimination issues that naturally arise in contemporary audio CAPTCHA challenges and potentially enhance the effectiveness of audio CAPTCHA systems by adapting the challenges to the user characteristics.  – A prototype has been designed, called PrivCAPTCHA, to offer privacy-preserving, user-centric CAPTCHA challenges. Anonymous credential proofs are integrated into the Session Initiation Protocol (SIP) protocol and the approach is evaluated in a real-world Voice over Internet Protocol (VoIP) environment.  – The results of this work indicate that it is possible to create VoIP CAPTCHA services offering privacy-preserving, user-centric challenges while maintaining sufficient efficiency …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:r0BpntZqJG4C",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "A privacy-preserving protocol for finding the nearest doctor in an emergency",
            "Publication year": 2010,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11781",
            "Abstract": "In this work, we define the Nearest Doctor Problem (NDP) for finding the closest doctor in case of an emergency and present a secure multi-party computation for solving it. The solution is based on a privacy-preserving cryptographic protocol and makes use of the current location of each participating doctor. The protocol is efficient and protects the privacy of the location of all doctors. A prototype implementing the proposed solution for a community of doctors that use mobile devices to obtain their current location is presented.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy-enhanced management of ubiquitous health monitoring data",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2141622.2141667",
            "Abstract": "In this paper, we propose a new architecture for managing data in a Ubiquitous Health Monitoring System (UHMS). The purpose of this architecture is to enhance the privacy of patients and furthermore to decongest the Health Monitoring Center (HMC) from the enormous amount of biomedical data generated by the users' wearable sensors. This is achieved by using personal agents that receive and manage the personal medical data of their owners. A component implementing the appropriate level of intelligence can be plugged-in into the personal agent and continuously analyze the raw health data. In case of an aberration detection the component may alert the HMC to initiate a more thorough examination of the possible emergency. Finally, we discuss how the personal agents can support privacy-preserving distributed computations.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Communicating Personalized Risk Factors for Lifestyle Coaching",
            "Publication year": 2018,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11782",
            "Abstract": "Chronic non-communicable diseases such as diabetes, chronic cardiorenal and respiratory disease and cancer, are serious, burdensome and costly conditions that share a common characteristic: they heavily depend on common behavioural risk factors, such as physical activity, diet, stress, and substance abuse. Despite concerted efforts it has been remarkably difficult to change such lifestyle related disease determinants, as behavioural change is a complex process requiring significant personal responsibility. In this paper we propose a personal mobile eHealth application to communicate personalized lifestyle related health risks and understand their individual impact on personal health condition and disease progression.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interoperable Multimedia Annotation and Retrieval for the Tourism Sector",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24129-6_6",
            "Abstract": "The Atlas Metadata System (AMS) employs semantic web annotation techniques in order to create an interoperable information annotation and retrieval platform for the tourism sector. AMS adopts state-of-the-art metadata vocabularies, annotation techniques and semantic web technologies. Interoperability is achieved by reusing several vocabularies and ontologies, including Dublin Core, PROV-O, FOAF, Geonames, Creative commons, SKOS, and CiTO, each of which provides with orthogonal views for annotating different aspects of digital assets. Our system invests a great deal in managing geospatial and temporal metadata, as they are extremely relevant for tourism-related applications. AMS has been implemented as a graph database using Neo4j, and is demonstrated with a dataset of more than 160000 images downloaded from Flickr. The system provides with online recommendations, via queries …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Revealing the political affinity of online entities through their Twitter followers",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306457319305023",
            "Abstract": "In this work, we show that the structural features of the Twitter online social network can divulge valuable information about the political affinity of the participating nodes. More precisely, we show that Twitter followers can be used to predict the political affinity of prominent Nodes of Interest (NOIs) they opt to follow. We utilize a series of purely structure-based algorithmic approaches, such as modularity clustering, the minimum linear arrangement (MinLA) problem and the DeGroot opinion update model in order to reveal diverse aspects of the NOIs’ political profile. Our methods are applied to a dataset containing the Twitter accounts of the members of the Greek Parliament as well as an enriched dataset that additionally contains popular news sources. The results confirm the viability of our approach and provide evidence that the political affinity of NOIs can be determined with high accuracy via the Twitter follower …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:70eg2SAEIzsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A framework for anonymizing GSM calls over a smartphone VoIP network",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30436-1_46",
            "Abstract": "The proposed framework describes a service for users that gives them the ability to make gsm calls from their smartphones without revealing their identity. The principle to achieve that is simple: instead of using your cell phone to make a call, pick somebody else’s phone to do so. We proposed an infrastructure of smartphones, sip registrars and sip proxies to provide caller anonymity. We developed a testbed where a smartphone registers on a SIP registrar and can start GSM conversation through another smartphone acting as a GSM gateway, by using a SIP proxy. Empirical evaluation revealed no significant QoS degradation.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Secure Mobile Database Applications: A Case Study",
            "Publication year": 2006,
            "Publication url": "https://www.drosatos.eu/files/pdf/SecMobDB.pdf",
            "Abstract": "In this work, we present a case study of a secure mobile database application. In particular, we design, implement and evaluate a mobile database application for an electronic announcement board. We identify a set of security issues and apply appropriate techniques to satisfy the corresponding security requirements.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Weighted random sampling over data streams",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1012.0256",
            "Abstract": "In this work, we present a comprehensive treatment of weighted random sampling (WRS) over data streams. More precisely, we examine two natural interpretations of the item weights, describe an existing algorithm for each case ([2, 4]), discuss sampling with and without replacement and show adaptations of the algorithms for several WRS problems and evolving data streams.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "About Weighted Random Sampling in Preferential Attachment Models",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.08173",
            "Abstract": "The Barabasi-Albert model is a very popular model for creating random scale-free graphs. Despite its widespread use, there is a subtle ambiguity in the definition of the model and, consequently, the dependent models and applications. This ambiguity is a result of the model's tight relation with the field of unequal probability random sampling, which dictates the exact process of edge creation after a newborn node has been added. In this work, we identify the ambiguity, assess its impact and propose a more precise definition of the Barabasi-Albert model that is expressed as an application of unequal probability random sampling.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Point-of-interest lists and their potential in recommendation systems",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s40558-021-00195-5",
            "Abstract": "Location based social networks, such as Foursquare and Yelp, have inspired the development of novel recommendation systems due to the massive volume and multiple types of data that their users generate on a daily basis. More recently, research studies have been focusing on utilizing structural data from these networks that relate the various entities, typically users and locations. In this work, we investigate the information contained in unique structural data of social networks, namely the lists or collections of items, and assess their potential in recommendation systems. Our hypothesis is that the information encoded in the lists can be utilized to estimate the similarities amongst POIs and, hence, these similarities can drive a personalized recommendation system or enhance the performance of an existing one. This is based on the fact that POI lists are user generated content and can be considered as collections …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Privacy-Enhanced Television Audience Measurements",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3009969",
            "Abstract": "Internet-enabled television systems (SmartTVs) are a development that introduces these devices into the interconnected environment of the Internet of Things. We propose a privacy-preserving application for computing Television Audience Measurement (TAM) ratings. SmartTVs communicate over the Internet to calculate aggregate measurements. Contemporary cryptographic building blocks are utilized to ensure the privacy of the participating individuals and the validity of the computed TAM ratings. Additionally, user compensation capabilities are introduced to bring some of the company profits back to the data owners. A prototype implementation is developed on an Android-based SmartTV platform and experimental results illustrate the feasibility of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:blknAaTinKkC",
            "Publisher": "ACM"
        },
        {
            "Title": "The complexity of linear programming in Formula Not Shown-form",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=8734526168556455039&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An efficient privacy-preserving solution for finding the nearest doctor",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00779-012-0619-x.pdf",
            "Abstract": "In this work, we define the Nearest Doctor Problem for finding the nearest doctor in case of an emergency and present a privacy-preserving protocol for solving it. The solution is based on cryptographic primitives and makes use of the current location of each participating doctor. The protocol is efficient and protects the privacy of the doctors’ locations. A prototype implementing the proposed solution for a community of doctors that use mobile devices to obtain their current location is presented. The prototype is evaluated on experimental communities with up to several hundred doctor agents.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer London"
        },
        {
            "Title": "A versatile tool for privacy-enhanced web search",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-36973-5_31",
            "Abstract": "We consider the problem of privacy leaks suffered by Internet users when they perform web searches, and propose a framework to mitigate them. Our approach, which builds upon and improves recent work on search privacy, approximates the target search results by replacing the private user query with a set of blurred or scrambled queries. The results of the scrambled queries are then used to cover the original user interest. We model the problem theoretically, define a set of privacy objectives with respect to web search and investigate the effectiveness of the proposed solution with a set of real queries on a large web collection. Experiments show great improvements in retrieval effectiveness over a previously reported baseline in the literature. Furthermore, the methods are more versatile, predictably-behaved, applicable to a wider range of information needs, and the privacy they provide is more …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Privacy-preserving statistical analysis on ubiquitous health data",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22890-2_3",
            "Abstract": "In this work, we consider ubiquitous health data generated from wearable sensors in a Ubiquitous Health Monitoring System (UHMS) and examine how these data can be used within privacy- preserving distributed statistical analysis. To this end, we propose a secure multi-party computation based on a privacy-preserving cryptographic protocol that accepts as input current or archived values of users’ wearable sensors. We describe a prototype implementation of the proposed solution with a community of independent personal agents and present preliminary results that confirm the viability of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Reengineering the user: privacy concerns about personal data on smartphones",
            "Publication year": 2015,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/ICS-10-2014-0071/full/html",
            "Abstract": " – This paper aims to discuss the privacy and security concerns that have risen from the permissions model in the Android operating system, along with two shortcomings that have not been adequately addressed.  – The impact of the applications’ evolutionary increment of permission requests from both the user’s and the developer’s point of view is studied, and finally, a series of remedies against the erosion of users’ privacy is proposed.  – The results of this work indicate that, even though providing access to personal data of smartphone users is by definition neither problematic nor unlawful, today’s smartphone operating systems do not provide an adequate level of protection for the user’s personal data. However, there are several ideas that can significantly improve the situation and …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:HDshCWvjkbEC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Pythia: A privacy-enhanced personalized contextual suggestion system for tourism",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7273705/",
            "Abstract": "We present Pythia, a privacy-enhanced non-invasive contextual suggestion system for tourists, with important architectural innovations. The system offers high quality personalized recommendations, non-invasive operation and protection of user privacy. A key feature of Pythia is the exploitation of the vast amounts of personal data generated by smartphones to automatically build user profiles, and make contextual suggestions to tourists. More precisely, the system utilizes (sensitive) personal data, such as location traces, browsing history and web searches (query logs), to build a POI-based user profile. This profile is then used by a contextual suggestion engine for making POI recommendations to the user based on her current location. Strong privacy guarantees are achieved by placing both mechanisms at the user-side. As a proof of concept, we present a Pythia prototype which implements the aforementioned …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Privacy-preserving computation of participatory noise maps in the cloud",
            "Publication year": 2014,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11764",
            "Abstract": "This paper presents a privacy-preserving system for participatory sensing, which relies on cryptographic techniques and distributed computations in the cloud. Each individual user is represented by a personal software agent, deployed in the cloud, where it collaborates on distributed computations without loss of privacy, including with respect to the cloud service providers. We present a generic system architecture involving a cryptographic protocol based on a homomorphic encryption scheme for aggregating sensing data into maps, and demonstrate security in the Honest-But-Curious model both for the users and the cloud service providers. We validate our system in the context of NoiseTube, a participatory sensing framework for noise pollution, presenting experiments with real and artificially generated data sets, and a demo on a heterogeneous set of commercial cloud providers. To the best of our knowledge our system is the first operational privacy-preserving system for participatory sensing. While our validation pertains to the noise domain, the approach used is applicable in any crowd-sourcing application relying on location-based contributions of citizens where maps are produced by aggregating data – also beyond the domain of environmental monitoring.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Elsevier Ltd."
        },
        {
            "Title": "Deriving the political affinity of twitter users from their followers",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8672222/",
            "Abstract": "In this work, we show that Twitter users can reveal valuable political information about particular Nodes of Interest (NOIs) they opt to follow. More precisely, we utilize an interesting graph projection method and a series of algorithmic approaches, such as modularity clustering, a minimum linear arrangement (MinLA) approximation algorithm and the DeGroot opinion update model in order to reveal the political affinity of selected NOIs. Our methods, which are purely structure-based, are applied to a snapshot of the Twitter network based on the user accounts of NOIs, consisting of the members of the current Greek Parliament along with their respective followers. The findings confirm that the information obtained can portray with significant precision the political affinity of the NOIs. We, furthermore, argue that these methods are of general interest for imprinting the political leaning of other NOIs, for example news media …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Probing based load balancing for web server farms",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/43899492/Probing_based_load_balancing_for_web_ser20160319-21030-175os3h.pdf",
            "Abstract": "We present an adaptive load balancing algorithm, ALBL, for cluster-based web systems. The balancing policy is based on two criteria; HTTP process time and network delay.The former describes web server ability to process a forthcoming request, while the latter tries to estimate network conditions. Periodic calculations of the criteria are performed by agents at the web switch and the estimation process is transparent to web servers. We compare our implementation with known blind selection balancing algorithms used at web-farms, such as: Round",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solving influence problems on the DeGroot model with a probabilistic model checking tool",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003780",
            "Abstract": "DeGroot learning is a model of opinion diffusion and formation in a social network of individuals. We examine the behavior of the DeGroot learning model when external strategic players that aim to bias the final consensus of the social network, are introduced to the model. More precisely, we consider the case of a single decision maker and the case of two competing external players, and a fixed number of possible influence actions on each individual. When studying the influence problems, we focus on the stochastic processes underlying the solution of DeGroot problems. In case of one decision maker, the analysis of the DeGroot model leads to the formation of a Markov Decision Process (MDP) and in the case of two external competing players the model is reduced to a Stochastic Game (SG). Since such models are heavily used in probabilistic model checking we apply tools of the field to solve them. Preliminary …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Combinatorial randomized rounding: boosting randomized rounding with combinatorial arguments",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4757-6594-6_2",
            "Abstract": "Randomized Rounding (RR) is a simple and very efficient probabilistic method to convert a solution of a relaxed combinatorial optimization (CO) problem into an approximate solution to the original problem. Since its introduction by Raghavan and Thompson in [14], RR and variations of it have been successfully applied to many approximation algorithms for hard CO problems. Though RR can be applied to an even wider set of problems, often the performance guarantees of the RR based approximation algorithms are poor.We show that in specific settings, combinatorial arguments interact with the randomized rounding procedure in a simple but also surprising way, and boost the performance guarantee of the RR technique to any constant ratio. We call this variation of RR, Combinatorial Randomized Rounding (CRR) and illustrate it on a fully linear time approximation scheme for an interesting …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Privacy-Enhanced Management of Ubiquitous Health Monitoring Data",
            "Publication year": 2011,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11806",
            "Abstract": "In this paper, we propose a new architecture for managing data in a Ubiquitous Health Monitoring System (UHMS). The purpose of this architecture is to enhance the privacy of patients and furthermore to decongest the Health Monitoring Center (HMC) from the enormous amount of biomedical data generated by the users' wearable sensors. This is achieved by using personal agents that receive and manage the personal medical data of their owners. A component implementing the appropriate level of intelligence can be plugged-in into the personal agent and continuously analyze the raw health data. In case of an aberration detection the component may alert the HMC to initiate a more thorough examination of the possible emergency. Finally, we discuss how the personal agents can support privacy-preserving distributed computations.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "PETRA"
        },
        {
            "Title": "Towards privacy in personal data management",
            "Publication year": 2009,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/09685220910993971/full/html",
            "Abstract": "In order to enhance privacy protection during electronic transactions, the purpose of this paper is to propose, develop, and evaluate a personal data management framework called Polis that abides by the following principle: every individual has absolute control over his/her personal data that reside only at his/her own side.This paper identifies representative electronic transactions that involve personal data and proposes Polis‐based protocols for them. The approach is evaluated on a Polis prototype both as a stand‐alone application and as part of a commercial database management system.The results of this paper indicate that electronic transactions can remain both feasible and straightforward, while personal data remain only at the owner's side.This paper describes a Polis‐approach implementing prototype, which is …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "On money as a means of coordination between network packets",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1208.3747",
            "Abstract": "In this work, we apply a common economic tool, namely money, to coordinate network packets. In particular, we present a network economy, called PacketEconomy, where each flow is modeled as a population of rational network packets, and these packets can self-regulate their access to network resources by mutually trading their positions in router queues. Every packet of the economy has its price, and this price determines if and when the packet will agree to buy or sell a better position. We consider a corresponding Markov model of trade and show that there are Nash equilibria (NE) where queue positions and money are exchanged directly between the network packets. This simple approach, interestingly, delivers improvements even when fiat money is used. We present theoretical arguments and experimental results to support our claims.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A privacy-by-design contextual suggestion system for tourism",
            "Publication year": 2016,
            "Publication url": "https://www.mdpi.com/138940",
            "Abstract": "We focus on personal data generated by the sensors and through the everyday usage of smart devices and take advantage of these data to build a non-invasive contextual suggestion system for tourism. The system, which we call Pythia, exploits the computational capabilities of modern smart devices to offer high quality personalized POI (point of interest) recommendations. To protect user privacy, we apply a privacy by design approach within all of the steps of creating Pythia. The outcome is a system that comprises important architectural and operational innovations. The system is designed to process sensitive personal data, such as location traces, browsing history and web searches (query logs), to automatically infer user preferences and build corresponding POI-based user profiles. These profiles are then used by a contextual suggestion engine to anticipate user choices and make POI recommendations for tourists. Privacy leaks are minimized by implementing an important part of the system functionality at the user side, either as a mobile app or as a client-side web application, and by taking additional precautions, like data generalization, wherever necessary. As a proof of concept, we present a prototype that implements the aforementioned mechanisms on the Android platform accompanied with certain web applications. Even though the current prototype focuses only on location data, the results from the evaluation of the contextual suggestion algorithms and the user experience feedback from volunteers who used the prototype are very positive. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Efficient Approximation Algorithms for Scheduling Unrelated Parallel Machines",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.591.9590&rep=rep1&type=pdf",
            "Abstract": "Scheduling n independent jobs on m Unrelated Parallel Machines (SUM) is the problem of assigning n jobs j= 1,.., n to m machines i= 1,.., m so that each job is processed without interruption on one of the machines, and at any time, every machine processes at most one job. The objective is to minimize the makespan of the schedule. SUM is an NP-hard problem even when the number of machines is defined to be m= 2. In this work, efficient approximation algorithms for SUM, when the number of machines is an arbitrary constant, are presented. The results hold for SUM and several extensions of SUM, like the Generalized Assignment Problem (GAP). The approximation algorithms can achieve any given approximation ratio ϵ (approximation schemes) and admit efficient parallelization. The core of the algorithms is a new rounding procedure, the so-called Combinatorial Randomized Rounding (CRR) technique. Furthermore, an interesting property of combinatorial optimization problems and a new Chernoff-like bound, are introduced.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Twitter-based approach of news media impartiality in multipartite political scenes",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s13278-020-00642-x.pdf",
            "Abstract": "News dissemination in the modern world deploys online social networks (OSNs) to instantly and freely convey facts and opinions to Internet users worldwide. Recent research studies the structure of the graph formed by the relationships between news readers and media outlets in OSNs to investigate the profile of the media and derive their political leanings. In this work, we focus on the notion of political impartiality in multipartite political scenes. Our aim is to describe the graph-theoretic attributes of the ideal outlet that exhibits an impartial stance towards all political groups and propose a methodology based on Twitter, an OSN with profound informative and political profile, to algorithmically approximate this ideal medium and evaluate the deviation of popular outlets from it. The magnitude of deviation is used to rank the existing outlets based on their political impartiality and, hence, tackle the bewildering …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "A privacy-preserving cloud computing system for creating participatory noise maps",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6340214/",
            "Abstract": "Participatory sensing is a crowd-sourcing technique which relies both on active contribution of citizens and on their location and mobility patterns. As such, it is particularly vulnerable to privacy concerns, which may seriously hamper the large-scale adoption of participatory sensing applications. In this paper, we present a privacy-preserving system architecture for participatory sensing contexts which relies on cryptographic techniques and distributed computations in the cloud. Each individual is represented by a personal software agent, which is deployed on one of the popular commercial cloud computing services. The system enables individuals to aggregate and analyse sensor data by performing a collaborative distributed computation among multiple agents. No personal data is disclosed to anyone, including the cloud service providers. The distributed computation proceeds by having agents execute a …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Privacy-preserving computation of participatory noise maps in the cloud",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121214000430",
            "Abstract": "This paper presents a privacy-preserving system for participatory sensing, which relies on cryptographic techniques and distributed computations in the cloud. Each individual user is represented by a personal software agent, deployed in the cloud, where it collaborates on distributed computations without loss of privacy, including with respect to the cloud service providers. We present a generic system architecture involving a cryptographic protocol based on a homomorphic encryption scheme for aggregating sensing data into maps, and demonstrate security in the Honest-But-Curious model both for the users and the cloud service providers. We validate our system in the context of NoiseTube, a participatory sensing framework for noise pollution, presenting experiments with real and artificially generated data sets, and a demo on a heterogeneous set of commercial cloud providers. To the best of our knowledge our …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Blockchain-Based Notarization Service for Biomedical Knowledge Retrieval",
            "Publication year": 2018,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11745",
            "Abstract": "Biomedical research and clinical decision depend increasingly on scientific evidence realized by a number of au-thoritative databases, mostly public and continually enriched via peer scientific contributions. Given the dynamicnature of biomedical evidence data and their usage in the sensitive domain of biomedical science, it is importantto ensure retrieved data integrity and non-repudiation. In this work, we present a blockchain-based notarizationservice that uses smart digital contracts to seal a biomedical database query and the respective results. The goal isto ensure that retrieved data cannot be modified after retrieval and that the database cannot validly deny that theparticular data has been provided as a result of a specific query. Biomedical evidence data versioning is also sup-ported. The feasibility of the proposed notarization approach is demonstrated using a real blockchain infrastruc-ture and is tested on two different biomedical evidence databases: a publicly available medical risk factorreference repository and on the PubMed database of biomedical literature references and abstracts.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Elsevier Ltd."
        },
        {
            "Title": "Exploring Ethereum's Data Stores: A Cost and Performance Comparison",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.10520",
            "Abstract": "The cost of using a blockchain infrastructure as well as the time required to search and retrieve information from it must be considered when designing a decentralized application. In this work, we examine a comprehensive set of data management approaches for Ethereum applications and assess the associated cost in gas as well as the retrieval performance. More precisely, we analyze the storage and retrieval of various-sized data, utilizing smart contract storage. In addition, we study hybrid approaches by using IPFS and Swarm as storage platforms along with Ethereum as a timestamping proof mechanism. Such schemes are especially effective when large chunks of data have to be managed. Moreover, we present methods for low-cost data handling in Ethereum, namely the event-logs, the transaction payload, and the almost surprising exploitation of unused function arguments. Finally, we evaluate these methods on a comprehensive set of experiments.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Window-games between TCP flows",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397510001684",
            "Abstract": "We consider network congestion problems between TCP flows and define a new game, the Window-game, which models the problems of network congestion caused by the competing flows. Analytical and experimental results show the relevance of the Window-game to real TCP congestion games and provide interesting insight into the respective Nash equilibria. Furthermore, we propose a new algorithmic queue mechanism, called Prince, which at congestion makes a scapegoat of the most greedy flow. We provide evidence which shows that Prince achieves efficient Nash equilibria while requiring only limited computational resources.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Existence, uniqueness and asymptotic behavior of the solutions of a fuzzy differential equation with piecewise constant argument",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020025507001508",
            "Abstract": "In this paper we study the existence, the uniqueness and the asymptotic behavior of the solutions of the fuzzy differential equation of the form: x′(t)= px (t)+ qx ([t]), t∈[0,∞), where p, q are constant real numbers and the initial value x 0 is a fuzzy number.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:4DMP91E08xMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Whole Sampling Generation of Scale-Free Graphs",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.00287",
            "Abstract": "This paper presents the development of a new class of algorithms that accurately implement the preferential attachment mechanism of the Barab\\'asi-Albert (BA) model to generate scale-free graphs. Contrary to existing approximate preferential attachment schemes, our methods are exact in terms of the proportionality of the vertex selection probabilities to their degree and run in linear time with respect to the order of the generated graph. Our algorithms are based on a principle of random sampling which is called whole sampling and is a new perspective for the study of preferential attachment. We show that they obey the definition of the original BA model that generates scale-free graphs and discuss their higher-order properties. Finally, we extend our analytical presentation with computer experiments that focus on the degree distribution and several measures surrounding the local clustering coefficient.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Window-games between tcp flows",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-79309-0_10",
            "Abstract": "We consider network congestion problems between TCP flows and define a new game, the Window-game, which models the problem of network congestion caused by the competing flows. Analytical and experimental results show the relevance of the Window-game to the real TCP game and provide interesting insight on Nash equilibria of the respective network games. Furthermore, we propose a new algorithmic queue mechanism, called Prince, which at congestion makes a scapegoat of the most greedy flow. Preliminary evidence shows that Prince achieves efficient Nash equilibria while requiring only limited computational resources.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Implementing PacketEconomy: Distributed money‐based QoS in OMNET++",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.3252",
            "Abstract": "In this work we examine how quality of service (QoS) can be achieved in a real network by allowing packets to coordinate using fiat money in a market economy for router queue positions. In this context we implement and evaluate the PacketEconomy mechanism in the discrete‐event simulator OMNET++, using the standard INET library for simulating Internet Protocol version 6 networks and evaluate throughput, end‐to‐end delay, and packet drop rates. Additionally, we examine whether the flows have a game‐theoretic incentive to participate in the market economy, while covering both Transmission Control Protocol– and User Datagram Protocol–based flows in multiple different cases. The mechanism achieves QoS by allowing packets with different QoS requirements waiting to be served in router queues to mutually trade positions by exchanging money. Notably, each flow can independently and selfishly define …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:M3NEmzRMIkIC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Personalised Cloud-Based Recommendation Services for Creative Tourism",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/53031917/Heritage__Tourism_and_Hospitality__International_Conference_HTHIC_2014.pdf#page=270",
            "Abstract": "Mass tourism increasingly gives way to creative and niche tourism. The creative visitor is a more informed tourist, better integrating with the place of a visit, its local culture, history and people. The best ambassadors of a region are local stakeholders who are able to include their offerings within the wider cultural context of the region, as well asvisitors who enjoyed a personalised experience, tailored to their wishes, needs and interests. Recent advances in computer-assisted tourism services are well-suited to support the personalisation of the touristic product. Specifically, recommender systems make it possible to support a personalised experience by tailoring offered information and services to the specific context of an individual visit. MYVISITPLANNER is a cloud-based service employing a recommender engine to offer personalised suggestions of cultural activities and a planning tool to create valid tour plans for visitors and residents of an area. In doing so, it also addresses the need of local authorities and regional stakeholders to raise the visibility of their offerings, by providing an easy to use platform for their recording and inclusion in individual tour planning. This paper offers an overview of the underlying logic and implementation for a personalised activities recommender system, developed as part of the intelligent itineraries planning system MYVISITPLANNER. The recommender engine takes into account both a taxonomy of possible activities, as well as user preferences and past recommendations, making it capable of offering recommendations tailored to the overall visit profile.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Social network analysis of public lists of POIs",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2802031",
            "Abstract": "In this work, we show how social network analysis can be applied to lists of points of interest (POIs) in order to extract important information about the POIs and the relations between them. More precisely, we use public lists of POIs to build the PoiGraph, a social graph of POIs, and then apply the Hyperlink-Induced Topic Search (HITS) algorithm and the Normalized Pointwise Mutual Information (NPMI) measure to estimate the user rating of each POI and the pairwise similarity between POIs, respectively. We evaluate our approach on POIs from the cities of Athens, Thessaloniki, and Rhodes. As a data source we use the corresponding publicly accessible user-specified lists of POIs of Foursquare. Our results show that for each POI the authority score obtained with the HITS algorithm is firmly correlated with the actual rating of Foursquare. Moreover, preliminary evidence shows that the NPMI-based measure gives …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Versatile query scrambling for private web search",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10791-015-9256-0",
            "Abstract": "We  consider the problem of privacy leaks suffered by Internet users when they perform web searches, and propose a framework to mitigate them. In brief, given a ‘sensitive’ search query, the objective of our work is to retrieve the target documents from a search engine without disclosing the actual query. Our approach, which builds upon and improves recent work on search privacy, approximates the target search results by replacing the private user query with a set of blurred or scrambled queries. The results of the scrambled queries are then used to cover the private user interest. We model the problem theoretically, define a set of privacy objectives with respect to web search and investigate the effectiveness of the proposed solution with a set of queries with privacy issues on a large web collection. Experiments show great improvements in retrieval effectiveness over a previously reported baseline in the …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Enhancing deniability against query-logs",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20161-5_13",
            "Abstract": "We propose a method for search privacy on the Internet, focusing on enhancing plausible deniability against search engine query-logs. The method approximates the target search results, without submitting the intended query and avoiding other exposing queries, by employing sets of queries representing more general concepts. We model the problem theoretically, and investigate the practical feasibility and effectiveness of the proposed solution with a set of real queries with privacy issues on a large web collection. The findings may have implications for other IR research areas, such as query expansion and fusion in meta-search.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Formal analysis of DeGroot Influence Problems using probabilistic model checking",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1569190X18301369",
            "Abstract": "DeGroot learning is a model of opinion diffusion and formation in a social network. We examine the behaviour of the DeGroot learning model when external strategic players that aim to influence the opinion formation process are introduced. More specifically, we consider the case of a single decision maker and that of two competing players, with a fixed number of possible influence actions for each of them. In the former case, the DeGroot model takes the form of a Markov Decision Process (MDP), while in the latter case it takes the form of a Stochastic Game (SG). These models are solved using probabilistic model checking techniques, as well as other solution techniques beyond model checking. The viability of our analysis is attested on a well-known social network, the Zachary’s karate club. Finally, the evaluation of influence in a social network simultaneously with the decision maker’s cost is supported, which is …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Privacy-Preserving Statistical Analysis on Ubiquitous Health Data",
            "Publication year": 2011,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11807",
            "Abstract": "In this work, we consider ubiquitous health data generated from wearable sensors in a Ubiquitous Health Monitoring System (UHMS) and examine how these data can be used within privacy preserving distributed statistical analysis. To this end, we propose a secure multi-party computation based on a privacy-preserving cryptographic protocol that accepts as input current or archived values of users’ wearable sensors. We describe a prototype implementation of the proposed solution with a community of independent personal agents and present preliminary results that confirm the viability of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Electrical and Computer Engineering, Democritus University of Thrace"
        },
        {
            "Title": "The Lagrangian Search Method",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4613-0279-7_15",
            "Abstract": "In this work, the Lagrangian Search Method (LSM), an algorithmic framework based on lagrangian relaxation, relaxed decision procedures and binary search, is presented. LSM is used to efficiently extend the class of positive linear programs (PLP), a submodel of linear programming that admits very efficient approximations in sequential, parallel and distributed settings. Theoretical guarantees for the efficiency and the approximation ratio of LSM for extended PLP, are derived. The extended PLP model is used for fast parallel (and sequential) approximations to a class of hard combinatorial optimization problems.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "A heaviest hitters limiting mechanism with O (1) time complexity for sliding-window data streams",
            "Publication year": 2013,
            "Publication url": "https://ariskou.com/files/papers/JIT13%20-%20A%20Heaviest%20Hitters%20Limiting%20Mechanism%20with%20O(1)%20Time%20Complexity%20for%20Sliding-Window%20Data%20Streams.pdf",
            "Abstract": "In this work we address the problem of identifying and limiting the heaviest hitters in a sliding-window data stream. We propose the first, to our knowledge, exact (ie, not approximate) algorithm which achieves O (1) with high probability time complexity in both update and query operations. Additionally, it tracks the first and last item of any itemset in the window in O (1) time complexity as well as the lightest hitters with no additional computational costs. These properties allow us to efficiently implement a mechanism to limit the heaviest hitters by evicting them from or not allowing them in the window. We describe the algorithms and data structure which implement this functionality, we explain how they can be used to accomplish the goal of limiting the heaviest hitters and perform experiments to produce quantitative results to support our theoretical arguments.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "台灣軟體模擬學會 & Ainosco Press"
        },
        {
            "Title": "A query scrambler for search privacy on the internet",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10791-012-9212-1.pdf",
            "Abstract": "We propose a method for search privacy on the Internet, focusing on enhancing plausible deniability against search engine query-logs. The method approximates the target search results, without submitting the intended query and avoiding other exposing queries, by employing sets of queries representing more general concepts. We model the problem theoretically, and investigate the practical feasibility and effectiveness of the proposed solution with a set of real queries with privacy issues on a large web collection. The findings may have implications for other IR research areas, such as query expansion and fusion in meta-search. Finally, we discuss ideas for privacy, such as k-anonymity, and how these may be applied to search tasks.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Towards Privacy by Design in Personal e-Health Systems.",
            "Publication year": 2016,
            "Publication url": "https://www.scitepress.org/papers/2016/58214/58214.pdf",
            "Abstract": "Personal e-health systems are the next generation of e-health applications and their goal is to assist patients in managing their disease and to help both patients and healthy people maintain behaviours that promote health. To do this, e-health systems collect, process, store and communicate the individual’s personal data. This paper presents an analysis of personal e-health systems and identifies privacy issues as a first step towards a ‘privacy by design’methodology and practical guidelines.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy-Preserving Television Audience Measurement Using Smart TVs",
            "Publication year": 2012,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11808",
            "Abstract": "Internet-enabled television systems, often referred to as Smart TVs, are a new development in television and home entertainment technologies. In this work, we propose a new, privacy-preserving, approach for Television Audience Measurement (TAM), utilizing the capabilities of the Smart TV technologies. We propose a novel application to calculate aggregate audience measurements using Smart TV computation capabilities and permanent Internet access. Cryptographic techniques, including homomorphic encryption and zero-knowledge proofs, are used to ensure both that the privacy of the participating individuals is preserved and that the computed results are valid. Additionally, participants can be compensated for sharing their information. Preliminary experimental results on an Android-based Smart TV platform show the viability of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "How much does a zero-permission Android app know about us?",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3360664.3360671",
            "Abstract": "Android devices contain a vast amount of personal data of their owners. These data are stored on the device and are protected by the Android permission scheme. Android apps can obtain access to specific data items by requesting the appropriate permissions from the user. However, in Android, the access to certain assets is granted by default to the installed apps. For example, any Android app has the right to get the device's network operator, which may be used to infer information about user's country and nationality. Similarly, any app has access to the clipboard which may occasionally contain very sensitive information, like a password. Consequently, a honest but curious Android app may leverage the implicit access rights to accumulate such unguarded information pieces and gradually build a detailed profile of the user. The device owner has no immediate way to control this flow of information and, even …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and Implementation of a Secure Mobile IP Architecture",
            "Publication year": 2002,
            "Publication url": "http://delab.csd.auth.gr/bci1/Panhellenic/269siozos.pdf",
            "Abstract": "The increasing number of portable computers, combined with the requirement for non-stop connections to networks, makes the provision of Internet mobility important. Mobile IP defines protocols and procedures by which a mobile node can exchange packets, regardless of its current point-of-attachment to the Internet, and without changing its IP address. In this work we describe the design and the implementation of SMA (Secure Mobile IP Architecture), a new approach for Mobile IP services. SMA is a complete operational system that supports the functionality of main Mobile IP requirements and, at the same time, achieves significant results for several interesting aspects of transparent mobile connectivity. SMA is based on standard software components and can therefore be considered as platform-independent, since it can support the common operation systems. The architecture has been tested on heterogeneous networks built with nodes running Linux, Solaris and MS-Windows, using both wireless and non-wireless networking technology.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Privacy-by-Design Contextual Suggestion System for Tourism",
            "Publication year": 2016,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11767",
            "Abstract": "We focus on personal data generated by the sensors and through the everyday usage of smart devices and take advantage of these data to build a non-invasive contextual suggestion system for tourism. The system, which we call Pythia, exploits the computational capabilities of modern smart devices to offer high quality personalized POI (point of interest) recommendations. To protect user privacy, we apply a privacy by design approach within all of the steps of creating Pythia. The outcome is a system that comprises important architectural and operational innovations. The system is designed to process sensitive personal data, such as location traces, browsing history and web searches (query logs), to automatically infer user preferences and build corresponding POI-based user profiles. These profiles are then used by a contextual suggestion engine to anticipate user choices and make POI recommendations for tourists. Privacy leaks are minimized by implementing an important part of the system functionality at the user side, either as a mobile app or as a client-side web application, and by taking additional precautions, like data generalization, wherever necessary. As a proof of concept, we present a prototype that implements the aforementioned mechanisms on the Android platform accompanied with certain web applications. Even though the current prototype focuses only on location data, the results from the evaluation of the contextual suggestion algorithms and the user experience feedback from volunteers who used the prototype are very positive",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:3s1wT3WcHBgC",
            "Publisher": "MDPI"
        },
        {
            "Title": "Quantum: Ένα Δίκτυο Ομότιμων Κόμβων για Κατανεμημένους Υπολογισμούς με Ενισχυμένη Ιδιωτικότητα",
            "Publication year": 2009,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11812",
            "Abstract": "In this paper, a new platform, called Quantum, for distributed computations among independent agents, is presented. Quantum is capable to operate on infrastructures that are formed by massive numbers of agents communicating over the Internet, and is tolerant of adding/removing peers. Furthermore, the new platform is intended to support the privacy of the peers which participate in each distributed computation. In the proposed solution we have chosen a decentralized network architecture and exploited technologies of peer-to-peer networks.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:a0OBvERweLwC",
            "Publisher": "3ο Πανελλήνιο Επιστημονικό Φοιτητικό Συνέδριο Πληροφορικής\" ΦΟΙΤΗΤΙΚΟ ΕΥΡΗΚΑ\""
        },
        {
            "Title": "myVisitPlanner GR: Personalized Itinerary Planning System for Tourism",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_53",
            "Abstract": "This application paper presents myVisitPlanner GR, an intelligent web-based system aiming at making recommendations that help visitors and residents of the region of Northern Greece to plan their leisure, cultural and other activities during their stay in this area. The system encompasses a rich ontology of activities, categorized across dimensions such as activity type, historical era, user profile and age group. Each activity is characterized by attributes describing its location, cost, availability and duration range. The system makes activity recommendations based on user-selected criteria, such as visit duration and timing, geographical areas of interest and visit profiling. The user edits the proposed list and the system creates a plan, taking into account temporal and geographical constraints imposed by the selected activities, as well as by other events in the user’s calendar. The user may edit the …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Economics of personal data management: Fair personal information trades",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11631-5_14",
            "Abstract": "Individuals today have no control over the way their personal information is being used even though they are the ones to suffer the consequences of any unwanted uses of their information. We propose addressing this externality through the creation of a market for personal information, where licenses to access individuals’ personal information will be voluntarily traded. Through this market, satisfactory compensation to the information owner is provided, whilst personal information remains under the owner’s control. Using cryptographic tools and micropayments we propose and develop a prototype for personal information trades where the above principles are implemented and tested.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Federated Neural Collaborative Filtering",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.04405",
            "Abstract": "In this work, we present a federated version of the state-of-the-art Neural Collaborative Filtering (NCF) approach for item recommendations. The system, named FedNCF, allows learning without requiring users to expose or transmit their raw data. Experimental validation shows that FedNCF achieves comparable recommendation quality to the original NCF system. Although federated learning (FL) enables learning without raw data transmission, recent attacks showed that FL alone does not eliminate privacy concerns. To overcome this challenge, we integrate a privacy-preserving enhancement with a secure aggregation scheme that satisfies the security requirements against an honest-but-curious (HBC) entity, without affecting the quality of the original model. Finally, we discuss the peculiarities observed in the application of FL in a collaborative filtering (CF) task as well as we evaluate the privacy-preserving mechanism in terms of computational cost.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A privacy-preserving protocol for finding the nearest doctor in an emergency",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1839294.1839316",
            "Abstract": "In this work, we define the Nearest Doctor Problem (NDP) for finding the closest doctor in case of an emergency and present a secure multi-party computation for solving it. The solution is based on a privacy-preserving cryptographic protocol and makes use of the current location of each participating doctor. The protocol is efficient and protects the privacy of the location of all doctors. A prototype implementing the proposed solution for a community of doctors that use mobile devices to obtain their current location is presented.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "User-centric, Privacy-Preserving Adaptation for VoIP CAPTCHA Challenges.",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=YxfHAwAAQBAJ&oi=fnd&pg=PA139&dq=info:_v2yerTpsVYJ:scholar.google.com&ots=jlQJdtaPL5&sig=J8t_LDxlGDIq340vUEpXWO8svAY",
            "Abstract": "The effectiveness of CAPTCHA challenges largely depends on being simultaneously easier to solve for humans and harder to solve for bots. In this work we argue that it is possible to enhance the effectiveness of audio CAPTCHA challenges by adapting the challenge to the users’ characteristics. We propose a method for achieving this adaptation while protecting users’ privacy. Moreover, our approach allows us to address discrimination issues that naturally arise in contemporary audio CAPTCHA challenges. Utilizing modern cryptographic techniques we design a privacy-preserving system, called PrivCAPTCHA, which offers customized CAPTCHA challenges.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The complexity of linear programming in (γ, κ)-form",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020019007002591",
            "Abstract": "Linear programming in (γ, κ)-form is a restricted class of linear programming (LP) introduced in [L. Trevisan, Parallel approximation algorithms by positive linear programming. Algorithmica 21 (1998) 72–88]. Since [L. Trevisan, Erratum: A correction to parallel approximation algorithms by positive linear programming. Algorithmica 27 (2000) 115–119] the complexity of (γ, κ)-form LP is an open problem. In this work, we show that LP in (γ, κ)-form is P-Complete to be approximated within any constant factor. An immediate consequence is that the extension of Positive Linear Programming (PLP) where the coefficients (matrix A) can have negative values is also P-Complete to be approximated within any constant factor.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:0EnyYjriUFMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Privacy-Enhanced Television Audience Measurements",
            "Publication year": 2017,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11769",
            "Abstract": "Internet-enabled television systems (SmartTVs) are a development that introduces these devices into the interconnected environment of the Internet of Things. We propose a privacy-preserving application for computing Television Audience Measurement (TAM) ratings. SmartTVs communicate over the Internet to calculate aggregate measurements. Contemporary cryptographic building blocks are utilized to ensure the privacy of the participating individuals and the validity of the computed TAM ratings. Additionally, user compensation capabilities are introduced to bring some of the company profits back to the data owners. A prototype implementation is developed on an Android-based SmartTV platform and experimental results illustrate the feasibility of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Communicating Personalized Risk Factors for Lifestyle Coaching.",
            "Publication year": 2018,
            "Publication url": "https://pdfs.semanticscholar.org/5218/2d4682729b8fbf61fee0a2d2b12a62df9728.pdf",
            "Abstract": "Chronic non-communicable diseases such as diabetes, chronic cardiorenal and respiratory disease and cancer, are serious, burdensome and costly conditions that share a common characteristic: they heavily depend on common behavioural risk factors, such as physical activity, diet, stress, and substance abuse. Despite concerted efforts it has been remarkably difficult to change such lifestyle related disease determinants, as behavioural change is a complex process requiring significant personal responsibility. In this paper we propose a personal mobile eHealth application to communicate personalized lifestyle related health risks and understand their individual impact on personal health condition and disease progression.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lexicographic Enumeration of Set Partitions",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.07472",
            "Abstract": "In this report, we summarize the set partition enumeration problems and thoroughly explain the algorithms used to solve them. These algorithms iterate through the partitions in lexicographic order and are easy to understand and implement in modern high-level programming languages, without recursive structures and jump logic. We show that they require linear space in respect to the set cardinality and advance the enumeration in constant amortized time. The methods discussed in this document are not novel. Our goal is to demonstrate the process of enumerating set partitions and highlight the ideas behind it. This work is an aid for learners approaching this enumeration problem and programmers undertaking the task of implementing it.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using personal portfolios to manage customer data",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28879-1_10",
            "Abstract": "Transactions today are conducted in a way that leaves no real option to the customers to protect their privacy. Sensitive private information is left uncontrolled at the companies’ disposal and is often (un)intentionally leaked to unauthorized parties. There is a growing demand for privacy-preserving management of private information that will make individuals feel safer during their transactions and assist companies with customer data management. In this work we propose that individuals store and manage their transaction data locally, in a personal portfolio, allowing them to retain control of their private information. Using contemporary cryptographic techniques, companies are given access to the accountable, certified data of portfolios in a privacy-preserving way.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Weighted random sampling with a reservoir",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002001900500298X",
            "Abstract": "In this work, a new algorithm for drawing a weighted random sample of size m from a population of n weighted items, where m⩽ n, is presented. The algorithm can generate a weighted random sample in one-pass over unknown populations.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A novel mechanism for anonymizing Global System for Mobile Communications calls using a resource‐based Session Initiation Protocol community network",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.995",
            "Abstract": "Considering the widespread adoption of smartphones in mobile communications and the well‐established resource sharing use in the networking community, we present a novel mechanism to achieve anonymity in the Global System for Mobile Communications (GSM). We propose a Voice over Internet Protocol infrastructure using the Session Initiation Protocol (SIP) where a smartphone registers on a SIP registrar and can start GSM conversation through another smartphone acting as a GSM gateway, by using a SIP intermediate without an extra cost. The testbed that we developed for empirical evaluation revealed no significant quality of service degradation. Copyright © 2014 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Randomized approximation schemes for scheduling unrelated parallel machines",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.41.5753&rep=rep1&type=pdf",
            "Abstract": "The problem of Scheduling n Independent Jobs on m Unrelated Parallel Machines, when the number of machines m is xed, is considered. The standard problem of minimizing the makespan of the schedule (SUM) and the bicriteria problem of scheduling with bounded makespan and cost (SUMC) are addressed, and randomized fully linear time approximation schemes are shown for both of them. While matching the approximation guarantee and the complexity of the best known sequential results of Jansen and Porkolab (12]), the proposed algorithms exhibit a signi cantly simpler and more general rounding scheme, especially for the bicriteria SUMC problem, and admit simple optimal work parallelizations1 of O (log n){time complexity. The core of the algorithms, which also draw techniques from other related works (12], 11], 1]), is an interesting new randomized rounding procedure, the Filtered Randomized Rounding (FRR). In the settings of the problems considered, FRR boosts the deviation bounds of the rounded linear packing constraints to any given constant ratio. Finally, the notion of poly {bottleneck combinatorial optimization problems is de ned and used to build O (nlognlog logn) time approximation schemes for two natural optimization versions of SUMC, that is minimizing the makespan when the cost of the schedule is bounded (SUMCoptT) and minimizing the cost when the makespan is bounded (SUMCoptC). These algorithms too, admit simple optimal work parallelizations.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy leakages about political beliefs through analysis of Twitter followers",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3291533.3291557",
            "Abstract": "In this paper, we focus on privacy leakages about Twitter users and show that simply establishing follower and friend connections in the Twitter network might be enough to reveal sensitive information about the political beliefs of a user. More precisely, we create a Twitter dataset containing the twitter nodes of Greek news media and politicians, as well as their followers and present two approaches to predict the political beliefs of a Twitter user and the politicians the user will potentially follow. The intuition behind both approaches is the saying\" Show me who your friends are, and I will tell you who you are\". In the first approach, the politicians followed by the followers of the user are shown to be correlated to the politicians that the user follows. In the second one, the media that the user follows are used to predict the politicians that the user follows. The experimental results of both approaches confirm our claims and …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A blockchain-based notarization service for biomedical knowledge retrieval",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2001037018300400",
            "Abstract": "Biomedical research and clinical decision depend increasingly on scientific evidence realized by a number of authoritative databases, mostly public and continually enriched via peer scientific contributions. Given the dynamic nature of biomedical evidence data and their usage in the sensitive domain of biomedical science, it is important to ensure retrieved data integrity and non-repudiation. In this work, we present a blockchain-based notarization service that uses smart digital contracts to seal a biomedical database query and the respective results. The goal is to ensure that retrieved data cannot be modified after retrieval and that the database cannot validly deny that the particular data has been provided as a result of a specific query. Biomedical evidence data versioning is also supported. The feasibility of the proposed notarization approach is demonstrated using a real blockchain infrastructure and is tested on …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "DUTH at TREC 2013 Contextual Suggestion Track.",
            "Publication year": 2013,
            "Publication url": "https://trec.nist.gov/pubs/trec22/papers/DUTH-context.pdf",
            "Abstract": "In this report we give an overview of our participation in the TREC 2013 Contextual Suggestion Track. We present an approach for context processing that comprises a newly designed and fine-tuned POI (Point Of Interest) data collection technique, a crowdsourcing approach to speed up data collection and two radically different approaches for suggestion processing (a k-NN based and a Rocchio-like). In the context processing, we collect POIs from three popular place search engines, Google Places, Foursquare and Yelp. The collected POIs are enriched by adding snippets from the Google and Bing search engines using crowdsourcing techniques. In the suggestion processing, we propose two methods. The first submits each candidate place as a query to an index of a user’s rated examples and scores it based on the top-k results. The second method is based on Rocchio’s algorithm and uses the rated examples per user profile to generate a personal query which is then submitted to an index of all candidate places. The track evaluation shows that both approaches are working well; especially the Rocchio-like approach is the most promising since it scores almost firmly above the median system and achieves the best system result in almost half of the judged contextprofile pairs. In the final TREC system rankings, we are the 2nd best group in MRR and TBG, and 3rd best group in P@ 5, out of 15 groups in the category we participated.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Money-based coordination of network packets",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38233-8_17",
            "Abstract": "In this work, we apply a common economic tool, namely money, to coordinate network packets. In particular, we present a network economy, called PacketEconomy, where each flow is modeled as a population of rational network packets, and these packets can self-regulate their access to network resources by mutually trading their positions in router queues. We consider a corresponding Markov model of trade and show that there are Nash equilibria (NE) where queue positions and money are exchanged directly between the network packets. This simple approach, interestingly, delivers significant improvements for packets and routers.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Malevolent app pairs: an android permission overpassing scheme",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2903150.2911706",
            "Abstract": "Portable smart devices potentially store a wealth of information of personal data, making them attractive targets for data exfiltration attacks. Permission based schemes are core security controls for reducing privacy and security risks. In this paper we demonstrate that current permission schemes cannot effectively mitigate risks posed by covert channels. We show that a pair of apps with different permission settings may collude in order to effectively create a state where a union of their permissions is obtained, giving opportunities for leaking sensitive data, whilst keeping the leak potentially unnoticed. We then propose a solution for such attacks.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy-preserving television audience measurement using smart tvs",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30436-1_19",
            "Abstract": "Internet-enabled television systems, often referred to as Smart TVs, are a new development in television and home entertainment technologies. In this work, we propose a new, privacy-preserving, approach for Television Audience Measurement (TAM), utilizing the capabilities of the Smart TV technologies. We propose a novel application to calculate aggregate audience measurements using Smart TV computation capabilities and permanent Internet access. Cryptographic techniques, including homomorphic encryption and zero-knowledge proofs, are used to ensure both that the privacy of the participating individuals is preserved and that the computed results are valid. Additionally, participants can be compensated for sharing their information. Preliminary experimental results on an Android-based Smart TV platform show the viability of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards privacy in personal data management",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.591.3817&rep=rep1&type=pdf",
            "Abstract": "We present a personal data management framework called Polis, which abides by the following principle: Every individual has absolute control over her personal data, which reside only at her own side. Preliminary results indicate that beyond the apparent advantages of such an environment for users’ privacy, everyday transactions remain both feasible and straightforward.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An exact and O (1) time heaviest and lightest hitters algorithm for sliding-window data streams",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5992177/",
            "Abstract": "In this work we focus on the problem of finding the heaviest-k and lightest-k hitters in a sliding window data stream. The most recent research endeavours have yielded an e-approximate algorithm with update operations in constant time with high probability and O(1/e) query time for the heaviest hitters case. We propose a novel algorithm which for the first time, to our knowledge, provides exact, not approximate, results while at the same time achieves O(1) time with high probability complexity on both update and query operations. Furthermore, our algorithm is able to provide both the heaviest-k and the lightest-k hitters at the same time without any overhead. In this work, we describe the algorithm and the accompanying data structure that supports it and perform quantitative experiments with synthetic data to verify our theoretical predictions.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A game-theoretic analysis of preventing spam over Internet Telephony via audio CAPTCHA-based authentication",
            "Publication year": 2014,
            "Publication url": "https://content.iospress.com/articles/journal-of-computer-security/jcs496",
            "Abstract": "Spam over Internet Telephony (SPIT) is a potential source of disruption in Voice over IP (VoIP) systems. The use of anti-SPIT mechanisms, such as filters and audio CAPTCHA (Completely Automated Public Turing Test to Tell Computer and Humans Apart) can prevent unsolicited calls and lead to less unwanted traffic. In this paper, we present a game-theoretic model, in which the game is played between SPIT senders and internet telephony users. The game includes call filters and audio CAPTCHA, so as to classify incoming calls as legitimate or malicious. We show how the resulting model can be used to decide upon the trade-offs present in this problem and help us predict the SPIT sender’s behavior. We also highlight the advantages in terms of SPIT call reduction of merely introducing CAPTCHA, and provide experimental verification of our results.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "(\\alpha,\\beta) Fibonacci Search",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1012.0259",
            "Abstract": "Knuth [12, Page 417] states that \"the (program of the) Fibonaccian search technique looks very mysterious at first glance\" and that \"it seems to work by magic\". In this work, we show that there is even more magic in Fibonaccian (or else Fibonacci) search. We present a generalized Fibonacci procedure that follows perfectly the implicit optimal decision tree for search problems where the cost of each comparison depends on its outcome.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Notarization of knowledge retrieval from biomedical repositories using blockchain technology",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-10-7419-6_12",
            "Abstract": "Biomedical research and clinical decision depend increasingly on a number of authoritative databases, mostly public and continually enriched via peer scientific contributions. Given the dynamic nature of data and their usage in the sensitive domain of biomedical science, it is important to ensure retrieved data integrity and non-repudiation, that is, ensure that retrieved data cannot be modified after retrieval and that the database cannot validly deny that the particular data has been provided as a result of a specific query. In this paper, we propose the use of blockchain technology in combination with digital signatures to create smart digital contracts to seal the query and the respective results each time a third-party requests evidence from a reference biomedical database. The feasibility of the proposed approach is demonstrated using a real blockchain infrastructure and a publicly available medical risk factor …",
            "Abstract entirety": 0,
            "Author pub id": "Dxz0pLsAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "Towards Privacy in Personal Data Management",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=4202316497107943171&hl=en&oi=scholarr",
            "Abstract": "We present a personal data management framework called Polis, which abides by the following principle: Every individual has absolute control over her personal data, which reside only at her own side. Preliminary results indicate that beyond the apparent advantages of such an environment for users’ privacy, everyday transactions remain both feasible and straightforward.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Panhellenic Conference on Informatics"
        },
        {
            "Title": "Approximation schemes for scheduling and covering on unrelated machines",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397506003409",
            "Abstract": "We examine the problem of assigning n independent jobs to m unrelated parallel machines, so that each job is processed without interruption on one of the machines, and at any time, every machine processes at most one job. We focus on the case where m is a fixed constant, and present a new rounding approach that yields approximation schemes for multi-objective minimum makespan scheduling with a fixed number of linear cost constraints. The same approach gives approximation schemes for covering problems like maximizing the minimum load on any machine, and for assigning specific or equal loads to the machines.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Positive linear programming extensions: Parallel complexity and applications",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/3-540-44520-X_60.pdf",
            "Abstract": "In this paper, we propose a general class of linear programs that admit efficient parallel approximations and use it for efficient parallel approximations to hard combinatorial optimization problems.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Weighted Random Sampling.",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11157053825109096311&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prince: an effective router mechanism for networks with selfish flows",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Remous-Aris-Koutsiamanis/publication/310645897_Prince_an_Effective_Router_Mechanism_for_Active_Queue_Management/links/5834a8e508aef19cb81f8e6d/Prince-an-Effective-Router-Mechanism-for-Active-Queue-Management.pdf",
            "Abstract": "Starting from the premise that modern routers are not protected from aggressive and unresponsive flows, we define a new, almost stateless, active queue management scheme, called Prince. The basic idea is to protect the fair share of well-behaved flows. We adopt a game theoretic view, where incentive is given to the majority flow by dropping its packets at congestion. In order to find the majority flow, we focus on the queue of the router and detect the flow with the most packets in it. From a game-theoretic point of view, Prince manages to track and bound aggressive flows and favor socially responsible ones. Our results show that in this context Prince resembles MaxMin Fairness allocation. Finally, we also examine a streaming version of the algorithm that can be fine-tuned to any desired performance/accuracy trade-off point.",
            "Abstract entirety": 1,
            "Author pub id": "Dxz0pLsAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        }
    ]
}]