[{
    "name": "Παντελής Μπάγκος",
    "romanize name": "Pantelis Bagkos",
    "School-Department": "Πληροφορικής με Εφαρμογές στη Βιοϊατρική ",
    "University": "uth",
    "Rank": "Καθηγητής",
    "Apella_id": 18109,
    "Scholar name": "Pantelis Bagos",
    "Scholar id": "k3osijsAAAAJ",
    "Affiliation": "Professor, University of Thessaly",
    "Citedby": 6001,
    "Interests": [
        "Bioinformatics",
        "Membrane Proteins",
        "Biostatistics",
        "Genetic Epidemiology",
        "Meta-analysis"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=k3osijsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Key challenges for the creation and maintenance of specialist protein resources",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/prot.24803",
            "Abstract": "As the volume of data relating to proteins increases, researchers rely more and more on the analysis of published data, thus increasing the importance of good access to these data that vary from the supplemental material of individual articles, all the way to major reference databases with professional staff and long‐term funding. Specialist protein resources fill an important middle ground, providing interactive web interfaces to their databases for a focused topic or family of proteins, using specialized approaches that are not feasible in the major reference databases. Many are labors of love, run by a single lab with little or no dedicated funding and there are many challenges to building and maintaining them. This perspective arose from a meeting of several specialist protein resources and major reference databases held at the Wellcome Trust Genome Campus (Cambridge, UK) on August 11 and 12, 2014. During …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Meta-analysis of haplotype-association studies: comparison of methods and empirical evaluation of the literature",
            "Publication year": 2011,
            "Publication url": "https://bmcgenomdata.biomedcentral.com/articles/10.1186/1471-2156-12-8",
            "Abstract": "Meta-analysis is a popular methodology in several fields of medical research, including genetic association studies. However, the methods used for meta-analysis of association studies that report haplotypes have not been studied in detail. In this work, methods for performing meta-analysis of haplotype association studies are summarized, compared and presented in a unified framework along with an empirical evaluation of the literature. We present multivariate methods that use summary-based data as well as methods that use binary and count data in a generalized linear mixed model framework (logistic regression, multinomial regression and Poisson regression). The methods presented here avoid the inflation of the type I error rate that could be the result of the traditional approach of comparing a haplotype against the remaining ones, whereas, they can be fitted using standard software. Moreover, formal global tests are presented for assessing the statistical significance of the overall association. Although the methods presented here assume that the haplotypes are directly observed, they can be easily extended to allow for such an uncertainty by weighting the haplotypes by their probability. An empirical evaluation of the published literature and a comparison against the meta-analyses that use single nucleotide polymorphisms, suggests that the studies reporting meta-analysis of haplotypes contain approximately half of the included studies and produce significant results twice more often. We show that this excess of statistically significant results, stems from the sub-optimal method of analysis used and, in approximately half of the cases, the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:mB3voiENLucC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Comparative Clinical Evaluation Of Two Second And One Third Generation Parathyroid Hormone Assay In Both Healthy And Hemodialysis Patients",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=12464864838640660263&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Clinical Chemistry and Laboratory Medicine"
        },
        {
            "Title": "OMPdb: A global hub of beta-barrel outer membrane proteins",
            "Publication year": 2021,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fbinf.2021.646581/full?utm_source=S-TWT&utm_medium=SNET&utm_campaign=ECO_FBINF_XXXXXXXX_auto-dlvrit",
            "Abstract": "OMPdb (www.ompdb.org) was introduced as a database for β-barrel outer membrane proteins from Gram-negative bacteria in 2011and then included 69,354 entries classified into 85 families. The database has been updated continuously using a collection of characteristic profile Hidden Markov Models able to discriminate between the different families of prokaryotic transmembrane β-barrels. The number of families has increased ultimately to a total of 129 families in the current, second major version of OMPdb. New additions have been made in parallel with efforts to update existing families and add novel families. Here, we present the upgrade of OMPdb, which from now on aims to become a global repository for all transmembrane β-barrel proteins, both eukaryotic and bacterial.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:gsN89kCJA0AC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "PredSL: a tool for the N-terminal sequence-based prediction of protein subcellular localization",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1672022906600168",
            "Abstract": "The ability to predict the subcellular localization of a protein from its sequence is of great importance, as it provides information about the protein’s function. We present a computational tool, PredSL, which utilizes neural networks, Markov chains, profile hidden Markov models, and scoring matrices for the prediction of the subcellular localization of proteins in eukaryotic cells from the N-terminal amino acid sequence. It aims to classify proteins into five groups: chloroplast, thylakoid, mitochondrion, secretory pathway, and “other”. When tested in a five-fold cross-validation procedure, PredSL demonstrates 86.7% and 87.1% overall accuracy for the plant and non-plant datasets, respectively. Compared with TargetP, which is the most widely used method to date, and LumenP, the results of PredSL are comparable in most cases. When tested on the experimentally verified proteins of the Saccharomyces cerevisiae genome …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:roLk4NBRz8UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Molecular determinants of radiosensitivity in normal and tumor tissue: a bioinformatic approach",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304383517303695",
            "Abstract": "Although radiation therapy is a treatment of choice for cancer, a high percentage of patients develop adverse effects in normal tissue following radiotherapy, mainly, due to genetic factors. Notably, although it is established that a lower dose of ionizing radiation can minimize the tumor cell population in radiosensitive cancer patients, the sensitivity of tumor cells to radiation has not gained enough attention. In this mini-review, the molecular pathways/mechanisms and the related molecules involved in clinically relevant radiotoxicity, as well as normal and tumor cell radiosensitivity, were investigated for various types of cancers employing bioinformatics approaches. A total of 255 genes/gene products were retrieved and investigated in this study, which are implicated in pathways related mainly to DNA damage repair, oxidative stress, apoptosis and fibrosis. Furthermore, a novel molecular gene signature of normal tissue …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:5awf1xo2G04C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A comprehensive analysis of experimentally verified archaeal signal peptides reveals unexpected findings: PP3-32",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11738303434448080560&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "OMPdb: a database of β-barrel outer membrane proteins from Gram-negative bacteria",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/nar/article-abstract/39/suppl_1/D324/2508146",
            "Abstract": " We describe here OMPdb, which is currently the most complete and comprehensive collection of integral β-barrel outer membrane proteins from Gram-negative bacteria. The database currently contains 69 354 proteins, which are classified into 85 families, based mainly on structural and functional criteria. Although OMPdb follows the annotation scheme of Pfam, many of the families included in the database were not previously described or annotated in other publicly available databases. There are also cross-references to other databases, references to the literature and annotation for sequence features, like transmembrane segments and signal peptides. Furthermore, via the web interface, the user can not only browse the available data, but submit advanced text searches and run BLAST queries against the database protein sequences or domain searches against the collection of profile Hidden Markov Models …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:aqlVkmm33-oC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Plasminogen activator inhibitor-1 4G/5G and 5, 10-methylene-tetrahydrofolate reductase C677T polymorphisms in polycystic ovary syndrome",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/molehr/article-abstract/15/1/19/1122547",
            "Abstract": "Polycystic ovary syndrome (PCOS) is a heterogeneous condition with unknown etiology and is considered to be the most common endocrine disorder in women of reproductive age. Two meta-analyses are presented here concerning the association of Plasminogen Activator Inhibitor 1 (PAI-1) 4G/5G polymorphism and the methylene-tetrahydrofolate reductase (MTHFR) C677T polymorphism with the risk of developing PCOS. Seven studies were included concerning PAI-1 (1538 cases, 710 controls) and six studies concerning MTHFR C677T (223 cases, 392 controls). Overall, a significant association was found for PAI-1, with the odds ratio (OR) for 4G carriers versus 5G homozygotes being equal to 1.600 (95% CI 1.052, 2.434) with strong evidence for dominant inheritance. There was however a large between-studies variability (I2 = 67.3%). No evidence was found for association of MTHFR C677T …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Meta-analysis of BCOR rearranged sarcomas: challenging the therapeutic approach",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0284186X.2021.1890818",
            "Abstract": "BCOR rearranged sarcomas comprise a group of malignant mesenchymal tumors that until recently were classified as Ewing sarcomas or as undifferentiated round cell sarcomas. The identification of alterations involving BCOR gene such as BCOR-CCNB3, BCOR-MAML3, ZC3H7B-BCOR fusion genes and BCOR internal tandem duplication (ITD) is characteristic for the differential diagnosis of BCOR rearranged sarcomas. Due to the rarity of these tumors there is no consensus or guidelines regarding the optimal therapeutic algorithm, that clinicians should follow.Herein we have conducted a meta-analysis of the current reports dealing with the therapeutic approach of BCOR rearranged sarcomas.Meta-analysis of the 57 eligible cases from 10 studies resulted to similar Incidence Rate Ratio (IRR) and overall survival (OS) for patients who received Ewing protocols and non …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:g3aElNc5_aQC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Methods for multiple outcome meta-analysis of gene-expression data",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2215016120300546",
            "Abstract": "Meta-analysis is a valuable tool for the synthesis of evidence across a wide range study types including high-throughput experiments such as genome-wide association studies (GWAS) and gene expression studies. There are situations though, in which we have multiple outcomes or multiple treatments, in which the multivariate meta-analysis framework which performs a joint modeling of the different quantities of interest may offer important advantages, such as increasing statistical power and allowing performing global tests. In this work we adapted the multivariate meta-analysis method and applied it in gene expression data. With this method we can test for pleiotropic effects, that is, for genes that influence both outcomes or discover genes that have a change in expression not detectable in the univariate method. We tested this method on data regarding inflammatory bowel disease (IBD), with its two main forms …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multilocus sequence typing (and phylogenetic analysis) of Campylobacter jejuni and Campylobacter coli strains isolated from clinical cases in Greece",
            "Publication year": 2013,
            "Publication url": "https://bmcresnotes.biomedcentral.com/articles/10.1186/1756-0500-6-359",
            "Abstract": "The molecular epidemiology of C. jejuni and C. coli clinical strains isolated from children with gastroenteritis, was investigated using the multilocus sequence typing method (MLST). This analysis establishes for the first time in Greece and constitutes an important tool for the epidemiological surveillance and control of Campylobacter infection in our country. The MLST genotypes were compared with those gained by other typing methods (HS-typing, PFGE and FlaA typing) and were also phylogenetically analyzed, in order to uncover genetic relationships. Among 68 C. jejuni strains, 41 different MLST-Sequence Types (MLST-STs) were found. Fifty six strains or 34 MLST-STs could be sorted into 15 different MLST-Sequence Type Complexes (MLST-STCs), while twelve strains or seven MLST-STs did not match any of the MLST-STCs of the database. Twenty C. coli strains belonged to 14 different MLST-STs. Eleven MLST-STs were classified in the same MLST-STC (828), and three were unclassifiable. There was no significant association between the MLST-STs and the results of the other typing methods. Phylogenetic analysis revealed that some strains, classified to the species of C. jejuni, formed a separate, phylogenetically distinct group. In eight strains some alleles belonging to the taxonomic cluster of C. jejuni, were also detected in C. coli and vice versa, a phenomenon caused by the genetic mosaic encountered inside the genus Campylobacter. The MLST-ST determination proved to be a very useful tool for the typing as well as the identification of Campylobacter on the species level.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:NhqRSupF_l8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Meta‐analysis in Stata using gllamm",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jrsm.1157",
            "Abstract": "There are several user‐written programs for performing meta‐analysis in Stata (Stata Statistical Software: College Station, TX: Stata Corp LP). These include metan, metareg, mvmeta, and glst. However, there are several cases for which these programs do not suffice. For instance, there is no software for performing univariate meta‐analysis with correlated estimates, for multilevel or hierarchical meta‐analysis, or for meta‐analysis of longitudinal data. In this work, we show with practical applications that many disparate models, including but not limited to the ones mentioned earlier, can be fitted using gllamm. The software is very versatile and can handle a wide variety of models with applications in a wide range of disciplines. The method presented here takes advantage of these modeling capabilities and makes use of appropriate transformations, based on the Cholesky decomposition of the inverse of the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Chlamydia pneumoniae infection and the risk of multiple sclerosis: a meta-analysis",
            "Publication year": 2006,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1191/1352458506ms1291oa",
            "Abstract": "We conducted a meta-analysis of studies comparing the presence of Chlamydia                 pneumoniae (Cpn) between multiple sclerosis (MS) patients and other neurological                 diseases patients or healthy controls. We identified 26 studies with 1332 MS                 patients and 1464 controls. Using random-effects methods, MS patients were found                 more likely to have detectable levels of Cpn DNA (OR = 3.216; 95% CI: 1.204, 8.585)                 in their cerebrospinal fluid, and intrathecally synthesized immunoglobulins (OR =                 3.842; 95% CI: 1.317, 11.212), compared to other patients with neurological                 diseases. There is no evidence for increased levels of serum immunoglobulins (OR =                 1.068; 95% CI: 0.745, 1.530), even though this result is confounded by the presence                 of studies using normal subjects as controls. Similarly, there is no evidence for                 association of …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ufrVoPGSRksC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Cytokine gene polymorphisms in periodontal disease: a meta‐analysis of 53 studies including 4178 cases and 4590 controls",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1600-051X.2008.01298.x",
            "Abstract": "Aim:  We conducted a systematic review and a meta‐analysis, in order to investigate the potential association of cytokine gene polymorphisms with either aggressive or chronic periodontal disease.Material and Methods:  A comprehensive literature search was performed. We retrieved a total of 53 studies summarizing information about 4178 cases and 4590 controls. Six polymorphisms were included in our meta‐analysis which are the following: IL‐1A G[4845]T, IL‐1A C[−889]T, IL‐1B C[3953/4]T, IL‐1B T[−511]C, IL‐6 G[−174]C and TNFA G[−308]A. Random effect methods were used for the analysis. We calculated the specific odds ratios along with their 95% confidence intervals to compare the distribution of alleles and genotypes between cases and controls.Results and Conclusions:  Using random effect methods we found statistically significant association of IL‐1A C[−889]T and IL‐1B C[3953/4]T …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "TMRPres2D: high quality visual representation of transmembrane protein models",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/20/17/3258/186342",
            "Abstract": " Summary: The ‘TransMembrane protein Re-Presentation in 2-Dimensions’ (TMRPres2D) tool, automates the creation of uniform, two-dimensional, high analysis graphical images/models of alpha-helical or beta-barrel transmembrane proteins. Protein sequence data and structural information may be acquired from public protein knowledge bases, emanate from prediction algorithms, or even be defined by the user. Several important biological and physical sequence attributes can be embedded in the graphical representation. Availability:           http://bioinformatics.biol.uoa.gr/TMRPres2D         ",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Vitamin C for the prevention of postoperative atrial fibrillation after cardiac surgery: a meta-analysis",
            "Publication year": 2016,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4961983/",
            "Abstract": "Purpose: Several studies have investigated the administration of vitamin C (vitC) for the prevention of postoperative atrial fibrillation (AF) after cardiac surgery. However, their findings were inconsistent. The purpose of this meta-analysis was to evaluate the efficacy of vitC as prophylaxis for the prevention of postoperative AF in cardiac surgery.Methods: A systematic search of PubMed, EMBASE, Google Scholar, the Cochrane Library, and clinical trial registries, was performed. 9 studies, published from August 2001 to May 2015, were included, with a total of 1,037 patients. Patients were randomized to receive vitC, or placebo.Results: Cardiac surgery patients who received vitC as prophylaxis, had a significantly lower incidence of postoperative AF (random effects OR= 0.478, 95% CI 0.340–0.673, P< 10-4). No significant heterogeneity was detected across the analyzed studies (I 2= 21.7%), and no publication bias or …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:LPZeul_q3PIC",
            "Publisher": "Tabriz University of Medical Sciences"
        },
        {
            "Title": "Multivariate methods for meta-analysis of genetic association studies",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-4939-7868-7_11",
            "Abstract": "Multivariate meta-analysis of genetic association studies and genome-wide association studies has received a remarkable attention as it improves the precision of the analysis. Here, we review, summarize and present in a unified framework methods for multivariate meta-analysis of genetic association studies and genome-wide association studies. Starting with the statistical methods used for robust analysis and genetic model selection, we present in brief univariate methods for meta-analysis and we then scrutinize multivariate methodologies. Multivariate models of meta-analysis for a single gene-disease association studies, including models for haplotype association studies, multiple linked polymorphisms and multiple outcomes are discussed. The popular Mendelian randomization approach and special cases of meta-analysis addressing issues such as the assumption of the mode of inheritance …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:uLbwQdceFCQC",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "A multipoint method for meta‐analysis of genetic association studies",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/gepi.20531",
            "Abstract": "Meta‐analyses of genetic association studies are usually performed using a single polymorphism at a time, even though in many cases the individual studies report results from partially overlapping sets of polymorphisms. We present here a multipoint (or multilocus) method for multivariate meta‐analysis of published population‐based case‐control association studies. The method is derived by extending the general method for multivariate meta‐analysis and allows for multivariate modelling of log(odds ratios (OR)) derived from several polymorphisms that are in linkage disequilibrium (LD). The method is presented in a genetic model‐free approach, although it can also be used by assuming a genetic model of inheritance beforehand. Furthermore, the method is presented in a unified framework and is easily applied to both discrete outcomes (using the OR), as well as to meta‐analyses of a continuous outcome …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:hC7cP41nSMkC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "The GNB3 C825T polymorphism and essential hypertension: a meta-analysis of 34 studies including 14 094 cases and 17 760 controls",
            "Publication year": 2007,
            "Publication url": "https://journals.lww.com/jhypertension/Fulltext/2007/03000/The_GNB3_C825T_polymorphism_and_essential.1.aspx",
            "Abstract": "ObjectivesThe C825T single nucleotide polymorphism of the G-protein β3 (GNB3) has been implicated in susceptibility to essential hypertension, through the expression of an alternatively spliced truncated variant. In an effort to clarify earlier inconclusive results, we performed a meta-analysis of population-based case–control genetic association studies.MethodsRandom-effects methods were applied on summary data in order to combine the results of the individual studies.ResultsWe identified in total 34 studies, including 14 094 hypertensive cases and 17 760 controls. The TT versus CC+ CT contrast yielded an overall odds ratio (OR) of 1.08 [95% confidence interval (CI): 1.01, 1.15], the contrast of TT+ CT versus CC, an OR of 1.17 (95% CI: 1.06, 1.29), whereas that of the T allele versus C allele yielded a non-significant OR of 1.05 (95% CI: 0.98, 1.13). There was moderate evidence for a publication bias in the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:qjMakFHDy7sC",
            "Publisher": "LWW"
        },
        {
            "Title": "Ten simple rules for carrying out and writing meta-analyses",
            "Publication year": 2019,
            "Publication url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1006922",
            "Abstract": "In the context of evidence-based medicine, meta-analyses provide novel and useful information [1], as they are at the top of the pyramid of evidence and consolidate previous evidence published in multiple previous reports [2]. Meta-analysis is a powerful tool to cumulate and summarize the knowledge in a research field [3]. Because of the significant increase in the published scientific literature in recent years, there has also been an important growth in the number of meta-analyses for a large number of topics [4]. It has been found that meta-analyses are among the types of publications that usually receive a larger number of citations in the biomedical sciences [5, 6]. The methods and standards for carrying out meta-analyses have evolved in recent years [7–9]. Although there are several published articles describing comprehensive guidelines for specific types of meta-analyses, there is still the need for an abridged article with general and updated recommendations for researchers interested in the development of meta-analyses. We present here ten simple rules for carrying out and writing meta-analyses.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:VLnqNzywnoUC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Algorithms for incorporating prior topological information in HMMs: application to transmembrane proteins",
            "Publication year": 2006,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/1471-2105-7-189",
            "Abstract": "Hidden Markov Models (HMMs) have been extensively used in computational molecular biology, for modelling protein and nucleic acid sequences. In many applications, such as transmembrane protein topology prediction, the incorporation of limited amount of information regarding the topology, arising from biochemical experiments, has been proved a very useful strategy that increased remarkably the performance of even the top-scoring methods. However, no clear and formal explanation of the algorithms that retains the probabilistic interpretation of the models has been presented so far in the literature. We present here, a simple method that allows incorporation of prior topological information concerning the sequences at hand, while at the same time the HMMs retain their full probabilistic interpretation in terms of conditional probabilities. We present modifications to the standard Forward and Backward algorithms of HMMs and we also show explicitly, how reliable predictions may arise by these modifications, using all the algorithms currently available for decoding HMMs. A similar procedure may be used in the training procedure, aiming at optimizing the labels of the HMM's classes, especially in cases such as transmembrane proteins where the labels of the membrane-spanning segments are inherently misplaced. We present an application of this approach developing a method to predict the transmembrane regions of alpha-helical membrane proteins, trained on crystallographically solved data. We show that this method compares well against already established algorithms presented in the literature, and it is extremely useful in practical …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Bioinformatics Education in Greece: A Survey",
            "Publication year": 2017,
            "Publication url": "https://journal.unnes.ac.id/nju/index.php/biosaintifika/article/view/7257",
            "Abstract": "Bioinformatics is an interdisciplinary field, placed at the interface of Biology, Mathematics and Computer Science. In this work, we tried for the first time to investigate the current situation of Bioinformatics education in Greece. We searched the online resources of all relevant University Departments for Bioinformatics or relevant courses. We found that all the Departments of Biological Sciences include in their curricula courses dedicated to Bioinformatics, but this is not the case for Departments of Computer Science, Computer Engineering, or Medical Schools. Despite the fact that large Universities played a crucial role in establishing Bioinformatics research and education in Greece, we observe that Universities of the periphery invest in the field, by including more relevant courses in the curricula and appointing faculty members trained in the field. In order for us to triangulate we didnt confine ourselves to online resources and descriptive statistics but we also included interviews so as to have a more spherical view of the subject under discussion. The interviews provided useful insights regarding the teaching methods used by bioinformatics tutors, their attitudes and the difficulties they encounter. The tutors mentioned also the material that they choose, the audiences attraction techniques and the feedback they receive.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interpreting the omics ‘era’data",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00375-7_6",
            "Abstract": "The analysis and the interpretation of the complex and dynamic biological systems has become a major bottleneck nowadays. The latest high-throughput “omics” approaches, such as genomics, proteomics and transcriptomics and the available data repositories hosting information concerning bioentities and their properties grow exponentially in size over time. Therefore, to better understand biological systems as a whole and at a higher level, visualization is a necessity as clear and meaningful views and intuitive layouts can give a better insight into coping with data complexity. The implementation of tools to maximize user friendliness, portability and provide intuitive views is a difficult task and still remains a hurdle to overcome. In this chapter, we present a variety of significant visualization tools as they specialize in different topics covering different areas of the broad biological spectrum varying from …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Heidelberg"
        },
        {
            "Title": "Antibody tests in detecting SARS-CoV-2 infection: a meta-analysis",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/720304",
            "Abstract": "The emergence of Coronavirus disease 2019 (COVID-19) caused by SARS-CoV-2 made imperative the need for diagnostic tests that can identify the infection. Although Nucleic Acid Test (NAT) is considered to be the gold standard, serological tests based on antibodies could be very helpful. However, individual studies are usually inconclusive, thus, a comparison of different tests is needed. We performed a systematic review and meta-analysis in PubMed, medRxiv and bioRxiv. We used the bivariate method for meta-analysis of diagnostic tests pooling sensitivities and specificities. We evaluated IgM and IgG tests based on Enzyme-linked immunosorbent assay (ELISA), Chemiluminescence Enzyme Immunoassays (CLIA), Fluorescence Immunoassays (FIA), and the Lateral Flow Immunoassays (LFIA). We identified 38 studies containing data from 7848 individuals. Tests using the S antigen are more sensitive than N antigen-based tests. IgG tests perform better compared to IgM ones and show better sensitivity when the samples were taken longer after the onset of symptoms. Moreover, a combined IgG/IgM test seems to be a better choice in terms of sensitivity than measuring either antibody alone. All methods yield high specificity with some of them (ELISA and LFIA) reaching levels around 99%. ELISA-and CLIA-based methods perform better in terms of sensitivity (90%–94%) followed by LFIA and FIA with sensitivities ranging from 80% to 89%. ELISA tests could be a safer choice at this stage of the pandemic. LFIA tests are more attractive for large seroprevalence studies but show lower sensitivity, and this should be taken into account when …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:epqYDVWIO7EC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "The association between plasminogen activator inhibitor type 1 (PAI-1) levels, PAI-1 4G/5G polymorphism, and myocardial infarction: a Mendelian randomization meta-analysis",
            "Publication year": 2014,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/cclm-2013-1124/html",
            "Abstract": "Background: The circulating levels of plasminogen activator inhibitor type 1 (PAI-1) are increased in individuals carrying the 4G allele at position –675 of the PAI-1 gene. In turn, overexpression of PAI-1 has been found to affect both atheroma and thrombosis. However, the association between PAI-1 levels and the incidence of myocardial infarction (MI) is complicated by the potentially confounding effects of well-known cardiovascular risk factors. The current study tried to investigate in parallel the association of PAI-1 activity with the PAI-1 4G/5G polymorphism, with MI, and some components of metabolic syndrome (MetS).Methods: Using meta-analytical Mendelian randomization approaches, genotype-disease and genotype-phenotype associations were modeled simultaneously.Results: According to an additive model of inheritance and the Mendelian randomization approach, the MI-related odd ratio for individuals …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:KxtntwgDAa4C",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "Faster gradient descent training of hidden Markov models, using individual learning rate adaptation",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30195-0_5",
            "Abstract": "Hidden Markov Models (HMMs) are probabilistic models, suitable for a wide range of pattern recognition tasks. In this work, we propose a new gradient descent method for Conditional Maximum Likelihood (CML) training of HMMs, which significantly outperforms traditional gradient descent. Instead of using fixed learning rate for every adjustable parameter of the HMM, we propose the use of independent learning rate/step-size adaptation, which has been proved valuable as a strategy in Artificial Neural Networks training. We show here that our approach compared to standard gradient descent performs significantly better. The convergence speed is increased up to five times, while at the same time the training procedure becomes more robust, as tested on ap-plications from molecular biology. This is accomplished without additional computational complexity or the need for parameter tuning.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Plasminogen activator inhibitor-1 4G/5G polymorphism and risk of ischemic stroke: a meta-analysis",
            "Publication year": 2007,
            "Publication url": "https://journals.lww.com/bloodcoagulation/fulltext/2007/07000/Plasminogen_activator_inhibitor_1_4G_5G.16.aspx",
            "Abstract": "This study investigated the hypothesis that the insertion/deletion (4G/5G) polymorphism of the plasminogen activator inhibitor type-1 gene affects the risk for ischemic stroke, since results concerning this association have been controversial. We therefore performed a meta-analysis of published data regarding this issue. A comprehensive electronic search was carried out until January 2006. The analysis was performed using random-effects models and meta-regression. Eighteen eligible studies were retrieved (15 case–control studies and three cohort studies). The case–control studies included 3104 cases and 4870 control individuals concerning the contrast of 4G/4G versus remaining genotypes. The 4G pooled allele frequencies in cases and controls were 54.21 and 54.75%, respectively. Overall, the per-allele odds ratio of the 4G allele was 0.98 (95% confidence interval, 0.858–1.121). Regarding genotypes, we …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:UebtZRa9Y70C",
            "Publisher": "LWW"
        },
        {
            "Title": "Semi-supervised learning of Hidden Markov Models for biological sequence analysis",
            "Publication year": 2019,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/35/13/2208/5184961",
            "Abstract": "Hidden Markov Models (HMMs) are probabilistic models widely used in applications in computational sequence analysis. HMMs are basically unsupervised models. However, in the most important applications, they are trained in a supervised manner. Training examples accompanied by labels corresponding to different classes are given as input and the set of parameters that maximize the joint probability of sequences and labels is estimated. A main problem with this approach is that, in the majority of the cases, labels are hard to find and thus the amount of training data is limited. On the other hand, there are plenty of unclassified (unlabeled) sequences deposited in the public databases that could potentially contribute to the training procedure. This approach is called semi-supervised learning and could be very helpful in many applications.We propose …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "On the covariance of two correlated log‐odds ratios",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sim.4474",
            "Abstract": "In many applications two correlated estimates of an effect size need to be considered simultaneously to be combined or compared. Apparently, there is a need for calculating their covariance, which however requires access to the individual data that may not be available to a researcher performing the analysis. We present a simple and efficient method for calculating the covariance of two correlated log‐odds ratios. The method is very simple, is based on the well‐known large sample approximations, can be applied using only data that are available in the published reports and more importantly, is very general, because it is shown to encompass several previously derived estimates (multiple outcomes, multiple treatments, dose–response models, mutually exclusive outcomes, genetic association studies) as special cases. By encompassing the previous approaches in a unified framework, the method allows easily …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "A method for the prediction of GPCRs coupling specificity to G-proteins using refined profile Hidden Markov Models",
            "Publication year": 2005,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/1471-2105-6-104",
            "Abstract": "G- Protein coupled receptors (GPCRs) comprise the largest group of eukaryotic cell surface receptors with great pharmacological interest. A broad range of native ligands interact and activate GPCRs, leading to signal transduction within cells. Most of these responses are mediated through the interaction of GPCRs with heterotrimeric GTP-binding proteins (G-proteins). Due to the information explosion in biological sequence databases, the development of software algorithms that could predict properties of GPCRs is important. Experimental data reported in the literature suggest that heterotrimeric G-proteins interact with parts of the activated receptor at the transmembrane helix-intracellular loop interface. Utilizing this information and membrane topology information, we have developed an intensive exploratory approach to generate a refined library of statistical models (Hidden Markov Models) that predict the coupling preference of GPCRs to heterotrimeric G-proteins. The method predicts the coupling preferences of GPCRs to Gs, Gi/o and Gq/11, but not G12/13 subfamilies. Using a dataset of 282 GPCR sequences of known coupling preference to G-proteins and adopting a five-fold cross-validation procedure, the method yielded an 89.7% correct classification rate. In a validation set comprised of all receptor sequences that are species homologues to GPCRs with known coupling preferences, excluding the sequences used to train the models, our method yields a correct classification rate of 91.0%. Furthermore, promiscuous coupling properties were correctly predicted for 6 of the 24 GPCRs that are known to interact with more than one subfamily …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "MULTIVARIANT META-ANALYSIS OF KRAS MUTATIONS'S PREDICTIVE VALUE FOR RESPONSE TO CETUXIMAB IN COLORECTAL CANCER",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=6137689844588717249&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "OXFORD UNIV PRESS"
        },
        {
            "Title": "On the covariance of regression coefficients",
            "Publication year": 2015,
            "Publication url": "https://www.scirp.org/html/5-1240581_61997.htm?pagespeed=noscript",
            "Abstract": "In many applications, such as in multivariate meta-analysis or in the construction of multivariate models from summary statistics, the covariance of regression coefficients needs to be calculated without having access to individual patients’ data. In this work, we derive an alternative analytic expression for the covariance matrix of the regression coefficients in a multiple linear regression model. In contrast to the well-known expressions which make use of the cross-product matrix and hence require access to individual data, we express the covariance matrix of the regression coefficients directly in terms of covariance matrix of the explanatory variables. In particular, we show that the covariance matrix of the regression coefficients can be calculated using the matrix of the partial correlation coefficients of the explanatory variables, which in turn can be calculated easily from the correlation matrix of the explanatory variables. This is very important since the covariance matrix of the explanatory variables can be easily obtained or imputed using data from the literature, without requiring access to individual data. Two important applications of the method are discussed, namely the multivariate meta-analysis of regression coefficients and the so-called synthesis analysis, and the aim of which is to combine in a single predictive model, information from different variables. The estimator proposed in this work can increase the usefulness of these methods providing better results, as seen by application in a publicly available dataset. Source code is provided in the Appendix and in http://www.compgen.org/tools/regression.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:tOudhMTPpwUC",
            "Publisher": "Scientific Research Publishing"
        },
        {
            "Title": "The variability and accurate assessment of microinflammation in haemodialysis patients",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/ndt/article-abstract/19/1/150/1813366",
            "Abstract": " Background. Systemic microinflammation is correlated with atherosclerosis. It needs a reliable assessment. This study explores the temporal variations of three inflammatory indexes [C-reactive protein (CRP), serum amyloid A (SAA) and interleukin-6 (IL-6)] in a period free of clinical events and tests the reliability of their multiple measurements for the assessment of microinflammation in haemodialysis (HD) patients, a population at high risk of atherosclerotic cardiovascular disease. Methods. For 4 months, serum CRP, SAA and IL-6 were measured in 29 HD patients during the weeks they were free of inflammatory clinical events (≥12 measurements for each index in every patient). The components of the variance as well as the reliability of two to five measurements for each index, aimed at assessing microinflammation precisely, were computed. Results. The median (interquartile …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "β-Barrel transmembrane proteins: Geometric modelling, detection of transmembrane region, and structural properties",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1476927106000843",
            "Abstract": "The location of the membrane lipid bilayer relative to a transmembrane protein structure is important in protein engineering. Since it is not present on the determined structures, it is essential to automatically define the membrane embedded protein region in order to test mutation effects or to design potential drugs. β-Barrel transmembrane proteins, present in nature as outer membrane proteins (OMPs), comprise one of the two transmembrane protein fold classes. Lately, the number of their determined structures has increased and this enables the implementation and evaluation of structure-based annotation methods and their more comprehensive study. In this paper, we propose two new algorithms for (i) the geometric modelling of β-barrels and (ii) the detection of the transmembrane region of a β-barrel transmembrane protein. The geometric modelling algorithm combines a non-linear least square minimization …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "GPCRpipe: a pipeline for the detection of G-protein coupled receptors in proteomes",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Tsaousis/publication/266157747_GPCRpipe_a_pipeline_for_the_detection_of_G-protein_coupled_receptors_in_proteomes/links/5596886808ae99aa62c7ebfe/GPCRpipe-a-pipeline-for-the-detection-of-G-protein-coupled-receptors-in-proteomes.pdf",
            "Abstract": "G-protein coupled receptors represent the largest and most diverse superfamily of transmembrane receptors in eukaryotic cells, with more than 800 genes encoding such receptors in the human genome. At the interface between the extracellular and intracellular milieu, they are involved in the regulation of nearly every physiological process by converting extracellular stimuli into intracellular responses. Most GPCRs functions are performed by a special group of proteins called G-proteins. G-proteins act as switches for the transduction of messages from the extracellular space inside the cell, through their interaction with GPCRs. G-proteins interact with various effector molecules to immediately change the concentration of cellular molecules, leading eventually to a wide range of cellular and physiological responses.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effect of the plasminogen activator inhibitor-1 4G/5G polymorphism on the thrombotic risk",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0049384807003623",
            "Abstract": "Plasminogen activator inhibitor (PAI-1), is the central component of the fibrinolytic system. A deletion/insertion (4G/5G) polymorphism in the promoter region of the PAI-1 gene has been correlated with levels of plasma PAI-1. The 4G allele is associated with higher levels of PAI-1, and might increase the risk for intravascular thrombosis. However, the contribution of this genetic variant to the risk for thrombosis, both arterial and venous, has not been clearly established. A broad spectrum of findings regarding the effect of the 4G allele on thrombotic risk in different target organs has been reported. Our aim is to summarize the variable influence of this polymorphism on thrombotic events in different tissues or organs and explain the underlying mechanisms accounting for these differences.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A multivariate method for meta‐analysis and comparison of diagnostic tests",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sim.6919",
            "Abstract": "We present here an extension of the classic bivariate random effects meta‐analysis for the log‐transformed sensitivity and specificity that can be applied for two or more diagnostic tests. The advantage of this method is that a closed‐form expression is derived for the calculation of the within‐studies covariances. The method allows the direct calculation of sensitivity and specificity, as well as, the diagnostic odds ratio, the area under curve and the parameters of the summary receiver operator's characteristic curve, along with the means for a formal comparison of these quantities for different tests. There is no need for individual patient data or the simultaneous evaluation of both diagnostic tests in all studies. The method is simple and fast; it can be extended for several diagnostic tests and can be fitted in nearly all statistical packages. The method was evaluated in simulations and applied in a meta‐analysis for the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CW-PRED: a HMM-based method for the classification of cell wall-anchored proteins of Gram-positive bacteria",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30448-4_36",
            "Abstract": "Gram-positive bacteria have surface proteins that are often implicated in virulence. A group of extracellular proteins attached to the cell wall contains an LPXTG-like motif that is target for cleavage and covalent coupling to peptidoglycan by sortase enzymes. A Hidden Markov Model (HMM) was developed for predicting the LPXTG and LPXTG-like cell-wall proteins of Gram-positive bacteria. The model is the first capable of predicting alternative (i.e. other than LPXTG-containing) substrates. Our analysis of 177 completely sequenced genomes identified 1456 cell-wall proteins, a number larger compared to the previously available methods. Among these, apart from the previously identified 1283 proteins carrying the LPXTG motif, we identified 39 newly identified proteins carrying NPXTG, 53 carrying LPXTA and 81 carrying the LAXTG motif. The tool is freely available for academic use at …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "THE VALUE OF KRAS MUTATIONAL STATUS AS A PREDICTIVE BIOMARKER IN METASTATIC COLORECTAL CANCER",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=10375948686957819768&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "OXFORD UNIV PRESS"
        },
        {
            "Title": "Diagnsotic accuracy of YLK-40 for diabetic nephropathy in type 2 diabetic patients. A systematic review and meta-analysis",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=17746070539527890014&hl=en&oi=scholarr",
            "Abstract": "MethodsA comprehensive search was performed on PubMed by two reviewers until December 2018. Studies in which a) the degree of DN was determined according to the urinary albumin/creatinine ratio and b) serum/plasma YKL-40 was measured in healthy individuals and in type 2 diabetic patients with DN, were included in the meta-analysis. For each study, a 2x2 contingency table was formulated using as data the mean and sd, of the outcomes of interest, assuming they normally distributed. Sensitivity, specificity and other estimates of accuracy were calculated using bivariate random effects model. The hierarchical summary ROC (hsROC) method was used to pool data and to evaluate the area under curve (AUC). The sources of heterogeneity were explored by subgroup analysis. Publication bias as assessed using Deeks test.ResultsThe meta-analysis enrolled 6 studies involving 400 healthy individuals and …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Predicting Alpha Helical Transmembrane Proteins Using HMMs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4939-6753-7_5.pdf",
            "Abstract": "Alpha helical transmembrane (TM) proteins constitute an important structural class of membrane proteins involved in a wide variety of cellular functions. The prediction of their transmembrane topology, as well as their discrimination in newly sequenced genomes, is of great importance for the elucidation of their structure and function. Several methods have been applied for the prediction of the transmembrane segments and the topology of alpha helical transmembrane proteins utilizing different algorithmic techniques. Hidden Markov Models (HMMs) have been efficiently used in the development of several computational methods used for this task. In this chapter we give a brief review of different available prediction methods for alpha helical transmembrane proteins pointing out sequence and structural features that should be incorporated in a prediction method. We then describe the procedure of the design …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "Association between the plasminogen activator inhibitor-1 4G/5G gene polymorphism and ischemic stroke; A meta-analysis.",
            "Publication year": 2006,
            "Publication url": "https://ashpublications.org/blood/article-abstract/108/11/4010/120324",
            "Abstract": "The relationship between the insertion/deletion (4G/5G) polymorphism of the plasminogen activator inhibitor type-1 (PAI-1) gene and ischemic stroke (IS), remains unclear. This association has received less attention compared with the relation with coronary heart disease. Since stroke is the third commonest cause of death in the developed world, we performed a meta-analysis of published data regarding this issue. A comprehensive electronic search was carried out up until January 2006 and the analysis was performed using random effects models and meta-regression.A total of 15 eligible case-control studies were considered. The analysis included 3104 cases and 4870 controls regarding the contrast of 4G/4G vs. the rest genotypes. The 4G pooled allele frequency in cases and controls was 54.21% and 54.75% respectively. Overall, the per-allele Odds Ratio (OR) of the 4G allele was 0.98 with a 95 …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:D03iK_w7-QYC",
            "Publisher": "American Society of Hematology"
        },
        {
            "Title": "Genetic model selection in genome-wide association studies: robust methods and the use of meta-analysis",
            "Publication year": 2013,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/sagmb-2012-0016/html",
            "Abstract": "In genetic association studies (GAS) as well as in genome-wide association studies (GWAS), the mode of inheritance (dominant, additive and recessive) is usually not known a priori. Assuming an incorrect mode of inheritance may lead to substantial loss of power, whereas on the other hand, testing all possible models may result in an increased type I error rate. The situation is even more complicated in the meta-analysis of GAS or GWAS, in which individual studies are synthesized to derive an overall estimate. Meta-analysis increases the power to detect weak genotype effects, but heterogeneity and incompatibility between the included studies complicate things further. In this review, we present a comprehensive summary of the statistical methods used for robust analysis and genetic model selection in GAS and GWAS. We then discuss the application of such methods in the context of meta-analysis. We describe …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prediction of lipoprotein signal peptides in Gram-positive bacteria with a Hidden Markov Model",
            "Publication year": 2008,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/pr800162c",
            "Abstract": "We present a Hidden Markov Model method for the prediction of lipoprotein signal peptides of Gram-positive bacteria, trained on a set of 67 experimentally verified lipoproteins. The method outperforms LipoP and the methods based on regular expression patterns, in various data sets containing experimentally characterized lipoproteins, secretory proteins, proteins with an N-terminal TM segment and cytoplasmic proteins. The method is also very sensitive and specific in the detection of secretory signal peptides and in terms of overall accuracy outperforms even SignalP, which is the top-scoring method for the prediction of signal peptides. PRED-LIPO is freely available at http://bioinformatics.biol.uoa.gr/PRED-LIPO/, and we anticipate that it will be a valuable tool for the experimentalists studying secreted proteins and lipoproteins from Gram-positive bacteria.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:3fE2CSJIrl8C",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "GPCRs, G-proteins, Effectors and their interactions: Human-gpDB, a database employing advanced visualization tools and data integration techniques",
            "Publication year": 2010,
            "Publication url": "https://orbilu.uni.lu/handle/10993/16773",
            "Abstract": "[en] G-protein coupled receptors (GPCRs) are a major family of membrane receptors in eukaryotic cells. They play a crucial role in the communication of a cell with the environment. Ligands bind to GPCRs on the outside of the cell, activating them by causing a conformational change, and allowing them to bind to G-proteins. Through their interaction with G-proteins, several effector molecules are activated leading to many kinds of cellular and physiological responses. The great importance of GPCRs and their corresponding signal transduction pathways is indicated by the fact that they take part in many diverse disease processes and that a large part of efforts towards drug development today is focused on them. We present Human-gpDB, a database which currently holds information about 713 human GPCRs, 36 human G-proteins and 99 human effectors. The collection of information about the interactions between these molecules was done manually and the current version of Human-gpDB holds information for about 1663 connections between GPCRs and G-proteins and 1618 connections between G-proteins and effectors. Major advantages of Human-gpDB are the integration of several external data sources and the support of advanced visualization techniques. Human-gpDB is a simple, yet a powerful tool for researchers in the life sciences field as it integrates an up-to-date, carefully curated collection of human GPCRs, G-proteins, effectors and their interactions. The database may be a reference guide for medical and pharmaceutical research, especially in the areas of understanding human diseases and chemical and drug discovery.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Impact of HIV type 1 DNA levels on spontaneous disease progression: a meta-analysis",
            "Publication year": 2012,
            "Publication url": "https://www.liebertpub.com/doi/abs/10.1089/aid.2011.0032",
            "Abstract": "Several studies have reported the prognostic strength of HIV-1 DNA with variable results however. The aims of the current study were to estimate more accurately the ability of HIV-1 DNA to predict progression of HIV-1 disease toward acquired immunodeficiency syndrome (AIDS) or death, and to compare the prognostic information obtained by HIV-1 DNA with that derived from plasma HIV-1 RNA. Eligible articles were identified through a comprehensive search of Medline, ISI Web of Science, Scopus, and Google Scholar. The analysis included univariate and bivariate random-effects models. The univariate meta-analysis of six studies involving 1074 participants showed that HIV-1 DNA was a strong predictive marker of AIDS [relative risk (RR): 3.01, 95% confidence interval (CI): 1.88–4.82] and of all-cause mortality (RR: 3.49, 95% CI: 2.06–5.89). The bivariate model using the crude estimates of primary studies …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "Developing the evidence base for cancer chemoprevention: use of meta-analysis",
            "Publication year": 2011,
            "Publication url": "https://www.ingentaconnect.com/content/ben/cdt/2011/00000012/00000013/art00011",
            "Abstract": "Meta-analysis is a quantitative approach for systematically combining the results of previous studies in order to arrive at conclusions about the body of research. It answers a specific research question, includes an explicit methodology section, employs strategies to minimize bias, yields objective findings and enables evidence-based decisions. In this review, we examine meta-analysis taking examples from the field of cancer chemoprevention, an innovative area of cancer research that focuses on the prevention of cancer through pharmacological, biologic, and nutritional interventions. In particular, we consider the practical steps involved in the conduct of a meta-analysis, illustrate the statistical techniques for the calculation of summary estimates, present the available methodology for detecting and minimizing bias and, finally, we discuss unresolved issues and future applications.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "The effect of plasma homocysteine levels on clinical outcomes of patients with acute lung injury/acute respiratory distress syndrome",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0002962915317456",
            "Abstract": "Several reports have shown that homocysteine promotes thrombosis by disturbing the procoagulant-anticoagulant balance, whereas alterations in coagulation and fibrinolysis have been suggested as important pathogenetic and prognostic determinants of mortality in acute lung injury (ALI)/acute respiratory distress syndrome (ARDS). The objective of the study was to evaluate the effect of plasma homocysteine levels on the outcomes of patients with ALI/ARDS.Sixty-nine consecutive ventilated patients with ALI/ARDS were studied. Blood samples were drawn within 3 days of clinical recognition of ARDS. Measurement of plasma homocysteine, vitamin B12, folate, creatinine, protein C and plasminogen-activator inhibitor-1 antigen levels, and genotyping of the methylenetetrahydrofolate reductase gene C677T and A1298C polymorphisms were carried out. The primary outcomes were 28- and 90 …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:-f6ydRqryjwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Susceptibility to leishmaniasis is affected by host SLC11A1 gene polymorphisms: a systematic review and meta-analysis",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s00436-019-06374-y",
            "Abstract": "Leishmaniases are cutaneous, mucocutaneous, and visceral diseases affecting humans and domesticated animals mostly in the tropical and subtropical areas of the planet. Host genetics have been widely investigated for their role in developing various infectious diseases. The SLC11A1 gene has been reported to play a role in neutrophil function and is associated with susceptibility to infectious and inflammatory diseases such as tuberculosis or rheumatoid arthritis. In the present meta-analysis, we investigate the genetic association of SLC11A1 polymorphisms with susceptibility to leishmaniasis. Genotypes and other risk-related data were collected from 13 case-control and family-based studies (after literature search). Conventional random-effects meta-analysis was performed using STATA 13. To pool case-control and family-based data, the weighted Stouffer’s method was also applied. Eight …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "The human GPCR signal transduction network",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s13721-020-00278-z",
            "Abstract": "The eukaryotic cell surface G protein-coupled receptors (GPCRs) interact with a wide spectrum of ligands. The intracellular transmission of the extracellular signal is mediated by the selective coupling of GPCRs to G proteins, which, in turn, activate downstream effectors. GPCRs are of paramount pharmacological importance, with approximately 40% of all commercial drugs targeting these proteins. Herein, we have made an effort to unravel the molecular mechanisms underlying the GPCR-mediated signaling pathway and the way this pathway is associated with diseases. Network-based approaches were utilized to delineate the GPCR pathway, incorporating data from gene expression profiles across eleven healthy tissues and disease–gene associations from three diverse resources. The associations between the tissue-specific expression profiles of the disease-related genes along with the relative risk of disease …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:p__nRnzSRKYC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "Season of birth and multiple sclerosis: a systematic review and multivariate meta-analysis",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00415-019-09346-5",
            "Abstract": "Season of birth is considered to be associated with multiple sclerosis (MS) although some findings opposing to this assumption raise doubts about the seasonality pattern in MS births. The present work synthesizes the evidence of previous published studies aiming at examining whether the month of birth is associated with a higher number of MS births. Pubmed and Scopus were systematically searched and a multivariate meta-analysis of case–control studies was conducted. Data of healthy controls births were retrieved from census reports when not included in the studies. For comparisons, October was set as a reference month and autumn (September–October–November) as a reference season. The meta-analysis included studies that provided the number of MS births for each month or season. Twenty-two eligible studies were included in the meta-analysis involving twenty-four different populations and overall …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "GPDB: a database of GPCRs and G-proteins, now integrating information concerning interaction with effectors PP3-7",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=6157499420702261890&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prediction of the coupling specificity of GPCRs to four families of G-proteins using hidden Markov models and artificial neural networks",
            "Publication year": 2005,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/21/22/4101/194844",
            "Abstract": " Motivation: G-protein coupled receptors are a major class of eukaryotic cell-surface receptors. A very important aspect of their function is the specific interaction (coupling) with members of four G-protein families. A single GPCR may interact with members of more than one G-protein families (promiscuous coupling). To date all published methods that predict the coupling specificity of GPCRs are restricted to three main coupling groups Gi/o, Gq/11 and Gs, not including G12/13-coupled or other promiscuous receptors. Results: We present a method that combines hidden Markov models and a feed-forward artificial neural network to overcome these limitations, while producing the most accurate predictions currently available. Using an up-to-date curated dataset, our method yields a 94% correct classification rate in a 5-fold cross-validation test. The method predicts also promiscuous coupling …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Computational Studies on Mitochondrial Transmembrane beta-barrel Proteins.",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=13917161819085906701&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:z_wVstp3MssC",
            "Publisher": "SPRINGER"
        },
        {
            "Title": "Can statin therapy reduce the risk of melanoma? A meta-analysis of randomized controlled trials",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10654-009-9396-x.pdf",
            "Abstract": "A growing body of literature suggests that statins may have a chemopreventive potential against melanoma through pleiotropic anti-inflammatory, immunomodulatory, and antiangiogenesis mechanisms. Our aim was to examine this association through a detailed meta-analysis of randomized controlled trials (RCTs). A comprehensive search for trials published up to June 2009 was performed, reviews of each study were conducted and data were abstracted. Prior to meta-analysis, the studies were evaluated for publication bias and heterogeneity. Pooled relative risk estimates (RR) and 95% confidence intervals (CIs) were calculated using the fixed- and the random-effects models. Subgroup and sensitivity analyses were also conducted. Sixteen RCTs of statins for cardiovascular outcomes, involving 62,568 individuals with a mean age of 60 years and an average follow-up of nearly 4.7 years, contributed to …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Prediction of signal peptides in archaea",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/peds/article-abstract/22/1/27/1477345",
            "Abstract": "Computational prediction of signal peptides (SPs) and their cleavage sites is of great importance in computational biology; however, currently there is no available method capable of predicting reliably the SPs of archaea, due to the limited amount of experimentally verified proteins with SPs. We performed an extensive literature search in order to identify archaeal proteins having experimentally verified SP and managed to find 69 such proteins, the largest number ever reported. A detailed analysis of these sequences revealed some unique features of the SPs of archaea, such as the unique amino acid composition of the hydrophobic region with a higher than expected occurrence of isoleucine, and a cleavage site resembling more the sequences of gram-positives with almost equal amounts of alanine and valine at the position-3 before the cleavage site and a dominant alanine at position-1, followed in …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:Se3iqnhoufwC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Diagnostic accuracy of neutrophil gelatinase-associated lipocalin for predicting early diabetic nephropathy in patients with type 1 and type 2 diabetes mellitus: a systematic review and meta-analysis",
            "Publication year": 2019,
            "Publication url": "https://academic.oup.com/jalm/article-abstract/4/1/78/5603087",
            "Abstract": "Currently, there is a lack of prediction markers for diabetic nephropathy (DN) in patients with type 1 and type 2 diabetes mellitus (T1DM/T2DM). The aim of this systematic review and meta-analysis was to evaluate the value of a promising biomarker, neutrophil gelatinase-associated lipocalin (NGAL), in both serum and urine for the diagnosis of early DN in T1DM and T2DM patients with different stages of albuminuria.A comprehensive search was performed on PubMed by 2 reviewers until September 2018. Studies in which (a) the degree of DN was determined according to the urinary albumin/creatinine ratio and (b) NGAL was measured in healthy individuals and in diabetes patients with DN were included in the meta-analysis. For each study, a 2 × 2 contingency table was formulated. Sensitivity, specificity, and other estimates of accuracy were calculated …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:fEOibwPWpKIC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "An approach for modelling multiple correlated outcomes in a network of interventions using odds ratios",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sim.6117",
            "Abstract": "A multivariate meta‐analysis of two or more correlated outcomes is expected to improve precision compared with a series of independent, univariate meta‐analyses especially when there are studies reporting some but not all outcomes. Multivariate meta‐analysis requires estimates of the within‐study correlations, which are seldom available. Existing methods for analysing multiple outcomes simultaneously are limited to pairwise treatment comparisons. We propose a model for a joint, simultaneous synthesis of multiple dichotomous outcomes in a network of interventions and introduce a simple way to elicit expert opinion for the within‐study correlations by utilizing a set of conditional probability parameters. We implement our multiple‐outcomes network meta‐analysis model within a Bayesian framework, which allows incorporation of expert information. As an example, we analyse two correlated dichotomous …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PRED-GPCR: GPCR recognition and family classification server",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/nar/article-abstract/32/suppl_2/W380/1040647",
            "Abstract": "The vast cell-surface receptor family of G-protein coupled receptors (GPCRs) is the focus of both academic and pharmaceutical research due to their key role in cell physiology along with their amenability to drug intervention. As the data flow rate from the various genome and proteome projects continues to grow, so does the need for fast, automated and reliable screening for new members of the various GPCR families. PRED-GPCR is a free Internet service for GPCR recognition and classification at the family level. A submitted sequence or set of sequences, is queried against the PRED-GPCR library, housing 265 signature profile HMMs corresponding to 67 well-characterized GPCR families. Users query the server through a web interface and results are presented in HTML output format. The server returns all single-motif matches along with the combined results for the corresponding families. The service is …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "PRED-TMBB2: improved topology prediction and detection of beta-barrel outer membrane proteins",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/32/17/i665/2450774",
            "Abstract": "The PRED-TMBB method is based on Hidden Markov Models and is capable of predicting the topology of beta-barrel outer membrane proteins and discriminate them from water-soluble ones. Here, we present an updated version of the method, PRED-TMBB2, with several newly developed features that improve its performance. The inclusion of a properly defined end state allows for better modeling of the beta-barrel domain, while different emission probabilities for the adjacent residues in strands are used to incorporate knowledge concerning the asymmetric amino acid distribution occurring there. Furthermore, the training was performed using newly developed algorithms in order to optimize the labels of the training sequences. Moreover, the method is retrained on a larger, non-redundant dataset which includes recently solved structures, and a newly developed decoding method was …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:eflP2zaiRacC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Fcγ receptor polymorphisms and their association with periodontal disease: a meta‐analysis",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1600-051X.2009.01530.x",
            "Abstract": "Dimou NL, Nikolopoulos GK, Hamodrakas SJ, Bagos PG. Fcγ receptor polymorphisms and their association with periodontal disease: a meta‐analysis. J Clin Periodontol 2010. 37: 255–265 doi: 10.1111/j.1600‐051X.2009.01530.x.Aim:  A systematic review and a meta‐analysis were conducted in order to investigate the potential association of Fcγ receptor (FcγR) polymorphisms with susceptibility to aggressive and chronic periodontal disease.Materials and Methods:  A database search yielded a total of 17 studies involving 1685 cases and 1570 controls. Three polymorphisms were included in the meta‐analysis: FcγRIIA H131R (rs1801274), FcγRIIIA F158V (rs396991) and FcγRIIIB NA1/NA2. Random‐effect models were used in the analysis. Odds ratios (ORs) along with their 95% confidence intervals (CIs) were computed to compare the distribution of alleles and genotypes between cases and controls …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:4TOpqqG69KYC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Efficient Training of Hidden Markov Models for Protein Sequence Analysis",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:kuK5TVdYjLIC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "A database of experimentally derived topological models of transmembrane proteins: PP3-8",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=3081564677792593095&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hidden Neural Networks for transmembrane protein topology prediction",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2001037021004712",
            "Abstract": "Hidden Markov Models (HMMs) are amongst the most successful methods for predicting protein features in biological sequence analysis. However, there are biological problems where the Markovian assumption is not sufficient since the sequence context can provide useful information for prediction purposes. Several extensions of HMMs have appeared in the literature in order to overcome their limitations. We apply here a hybrid method that combines HMMs and Neural Networks (NNs), termed Hidden Neural Networks (HNNs), for biological sequence analysis in a straightforward manner. In this framework, the traditional HMM probability parameters are replaced by NN outputs. As a case study, we focus on the topology prediction of for alpha-helical and beta-barrel membrane proteins. The HNNs show performance gains compared to standard HMMs and the respective predictors outperform the top-scoring …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:M7yex6snE4oC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "JUCHMME: a Java Utility for Class Hidden Markov Models and Extensions for biological sequence analysis",
            "Publication year": 2019,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/35/24/5309/5524600",
            "Abstract": "JUCHMME is an open-source software package designed to fit arbitrary custom Hidden Markov Models (HMMs) with a discrete alphabet of symbols. We incorporate a large collection of standard algorithms for HMMs as well as a number of extensions and evaluate the software on various biological problems. Importantly, the JUCHMME toolkit includes several additional features that allow for easy building and evaluation of custom HMMs, which could be a useful resource for the research community.             http://www.compgen.org/tools/juchmme, https://github.com/pbagos/juchmme.             Supplementary data are available at Bioinformatics online.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Evaluation of methods for predicting the topology of β-barrel outer membrane proteins and a consensus prediction method",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-6-7",
            "Abstract": "Prediction of the transmembrane strands and topology of β-barrel outer membrane proteins is of interest in current bioinformatics research. Several methods have been applied so far for this task, utilizing different algorithmic techniques and a number of freely available predictors exist. The methods can be grossly divided to those based on Hidden Markov Models (HMMs), on Neural Networks (NNs) and on Support Vector Machines (SVMs). In this work, we compare the different available methods for topology prediction of β-barrel outer membrane proteins. We evaluate their performance on a non-redundant dataset of 20 β-barrel outer membrane proteins of gram-negative bacteria, with structures known at atomic resolution. Also, we describe, for the first time, an effective way to combine the individual predictors, at will, to a single consensus prediction method. We assess the statistical significance of the performance …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Multiple outcome meta-analysis of gene-expression data in inflammatory bowel disease",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0888754319306007",
            "Abstract": "We performed a multivariate meta-analysis of microarray data in Crohn's disease (CD) and Ulcerative colitis (UC), which are the main forms of inflammatory bowel disease (IBD). They share similar symptoms but differ in the location and extent of inflammation and in complications. We identified 249 differentially expressed genes (DEGs) in CD and 38 in UC at a false discovery rate of 1%. 20 of the DEGs were common to both diseases. A multivariate test identified 260 DEGs associated with IBD, 53 of which were not found in any of the disorders. We identified important molecular pathways implicated in the pathogenesis of IBD, such as the JAK/STAT and interferon-gamma signaling pathways, genes involved in cell adhesion, apoptosis and carcinogenesis. Among others, BCAT1 and GZMB are interesting novel DEGs that deserve further investigation in experimental models. The method could also be useful to other …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:yB1At4FlUx8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Serum albumin: a late-reacting negative acute-phase protein in clinically evident inflammation in dialysis patients",
            "Publication year": 2005,
            "Publication url": "https://academic.oup.com/ndt/article-abstract/20/3/658/1870689",
            "Abstract": "1. Nascimento MM, Pecoits-Filho R, Qureshi AR et al. The prognostic impact of fluctuating levels of C-reactive protein in Brazilian haemodialysis patients: a prospective study. Nephrol Dial Transplant 2004; 19: 2803–2809 2. Tsirpanlis G, Bagos P, Ioannou D et al. Exploring inflammation in hemodialysis patients: persistent and superimposed inflammation. Kidney Blood Press Res 2004; 27: 63–70 3. Kaysen GA, Dubin JA, Muller HG et al. Levels of alpha acid glycation, and ceruloplasmin predict future albumin levels in hemodialysis patients. Kidney Int 2001; 60: 2360–2366 4. Kaysen GA, Dubin JA, Muller HG et al. Relationships among inflammation nutrition and physiologic mechanisms establishing albumin levels in hemodialysis patients. Kidney Int 2002; 61: 2240–2249",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A unification of multivariate methods for meta-analysis of genetic association studies",
            "Publication year": 2008,
            "Publication url": "https://www.degruyter.com/document/doi/10.2202/1544-6115.1408/html",
            "Abstract": "Methods for multivariate meta-analysis of genetic association studies are reviewed, summarized and presented in a unified framework. Modifications of standard models are described in detail in order to be applied in genetic association studies. The model based on summary data is uniformly defined for both discrete and continuous outcomes and analytical expressions for the covariance of the two jointly modeled outcomes are derived for both cases. The models based on the binary nature of the data are fitted using both prospective and retrospective likelihood. Furthermore, formal tests for assessing the genetic model of inheritance are developed based on standard normal theory.  The general model is compared to the recently proposed genetic model-free bivariate approach (either using summary or binary data), and it is clearly shown that the estimates provided by this approach are nearly identical to the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:0EnyYjriUFMC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "How many 3D structures do we need to train a predictor?",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1672022908600418",
            "Abstract": "It has been shown that the progress in the determination of membrane protein structure grows exponentially, with approximately the same growth rate as that of the water-soluble proteins. In order to investigate the effect of this, on the performance of prediction algorithms for both α-helical and β-barrel membrane proteins, we conducted a prospective study based on historical records. We trained separate hidden Markov models with different sized training sets and evaluated their performance on topology prediction for the two classes of transmembrane proteins. We show that the existing top-scoring algorithms for predicting the transmembrane segments of α-helical membrane proteins perform slightly better than that of β-barrel outer membrane proteins in all measures of accuracy. With the same rationale, a meta-analysis of the performance of the secondary structure prediction algorithms indicates that existing …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:maZDTaKrznsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A method for meta-analysis of case-control genetic association studies using logistic regression",
            "Publication year": 2007,
            "Publication url": "https://www.degruyter.com/document/doi/10.2202/1544-6115.1281/html",
            "Abstract": "We propose here a simple and robust approach for meta-analysis of molecular association studies.  Making use of the binary structure of the data, and by treating the genotypes as independent variables in a logistic regression, we apply a simple and commonly used methodology that performs satisfactorily, being at the same time very flexible.  We present simple tests for detecting heterogeneity and we describe a random effects extension of the method in order to allow for between studies heterogeneity.  We derive also simple tests for assessing the most plausible genetic model of inheritance, and its between-studies heterogeneity as well as adjusting for covariates. The methodology introduced here is easily extended in cases with polytomous or continuous outcomes as well as in cases with more than two alleles.  We apply the methodology in several published meta-analyses of genetic association studies with …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "A novel method for GPCR recognition and family classification from sequence alone using signatures derived from profile hidden Markov models",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10629360310001623999",
            "Abstract": "G-protein coupled receptors (GPCRs) constitute a broad class of cell-surface receptors, including several functionally distinct families, that play a key role in cellular signalling and regulation of basic physiological processes. GPCRs are the focus of a significant amount of current pharmaceutical research since they interact with more than 50% of prescription drugs, whereas they still comprise the best potential targets for drug design. Taking into account the excess of data derived by genome sequencing projects, the use of computational tools for automated characterization of novel GPCRs is imperative. Typical computational strategies for identifying and classifying GPCRs involve sequence similarity searches (e.g. BLAST) coupled with pattern database analysis (e.g. PROSITE, BLOCKS). The diagnostic method presented here is based on a probabilistic approach that exploits highly discriminative profile Hidden …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Taylor & Francis GroupAbingdon, UK"
        },
        {
            "Title": "Topology prediction of β-barrel outer membrane proteins",
            "Publication year": 2005,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cytokine gene polymorphisms in multiple sclerosis: a meta‐analysis of 45 studies including 7379 cases and 8131 controls",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1468-1331.2011.03355.x",
            "Abstract": "Many environmental and genetic factors have been implicated in the development of multiple sclerosis. However, the aetiology has not been clarified yet. Therefore, using a meta‐analytic approach, we tried to probe the potential association between various cytokine gene polymorphisms and the occurrence of multiple sclerosis. A comprehensive literature search yielded 45 eligible studies, which involved 7379 cases and 8131 controls. Totally, the effect of eight polymorphisms, i.e. IL‐1A C[‐889]T, IL‐1B C[‐511]T, IL‐1B C[3953]T, IL‐4 C[33]T, IL‐10 C[‐819]T, IL‐10 G[‐1082]A, tumour necrosis factor‐a (TNFA) G[‐308]A and TNFA G[‐238]A, was evaluated in a random‐effects meta‐analysis. There was no evidence of statistically significant association between the aforementioned polymorphisms and multiple sclerosis. Publication bias and heterogeneity were absent in most analyses. Within its limitations, the current …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:k_IJM867U9cC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "GPCRs, G-proteins, effectors and their interactions: human-gpDB, a database employing visualization tools and data integration techniques",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/database/article-abstract/doi/10.1093/database/baq019/406892",
            "Abstract": "G-protein coupled receptors (GPCRs) are a major family of membrane receptors in eukaryotic cells. They play a crucial role in the communication of a cell with the environment. Ligands bind to GPCRs on the outside of the cell, activating them by causing a conformational change, and allowing them to bind to G-proteins. Through their interaction with G-proteins, several effector molecules are activated leading to many kinds of cellular and physiological responses. The great importance of GPCRs and their corresponding signal transduction pathways is indicated by the fact that they take part in many diverse disease processes and that a large part of efforts towards drug development today is focused on them. We present Human-gpDB, a database which currently holds information about 713 human GPCRs, 36 human G-proteins and 99 human effectors. The collection of information about the interactions between …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:4DMP91E08xMC",
            "Publisher": "Oxford Academic"
        },
        {
            "Title": "Unraveling the mechanisms of extreme radioresistance in prokaryotes: lessons from nature",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1383574215000642",
            "Abstract": "The last 50 years, a variety of archaea and bacteria able to withstand extremely high doses of ionizing radiation, have been discovered. Several lines of evidence suggest a variety of mechanisms explaining the extreme radioresistance of microorganisms found usually in isolated environments on Earth. These findings are discussed thoroughly in this study. Although none of the strategies discussed here, appear to be universal against ionizing radiation, a general trend was found. There are two cellular mechanisms by which radioresistance is achieved: (a) protection of the proteome and DNA from damage induced by ionizing radiation and (b) recruitment of advanced and highly sophisticated DNA repair mechanisms, in order to reconstruct a fully functional genome. In this review, we critically discuss various protecting (antioxidant enzymes, presence or absence of certain elements, high metal ion or salt …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Bacterial β-Barrel Outer Membrane Proteins: A Common Structural Theme Implicated in a Wide Variety of Functional Roles",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/bacterial-barrel-outer-membrane-proteins/21532",
            "Abstract": "ß-barrel outer membrane proteins constitute the second and less well-studied class of transmembrane proteins. They are present exclusively in the outer membrane of Gram-negative bacteria and presumably in the outer membrane of mitochondria and chloroplasts. During the last few years, remarkable advances have been made towards an understanding of their functional and structural features. It is now wellknown that ß-barrels are performing a large variety of biologically important functions for the bacterial cell. Such functions include acting as specific or non-specific channels, receptors for various compounds, enzymes, translocation channels, structural proteins, and adhesion proteins. All these functional roles are of great importance for the survival of the bacterial cell under various environmental conditions or for the pathogenic properties expressed by these organisms. This chapter reviews the currently …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Medical Information Science Reference"
        },
        {
            "Title": "TFBSPred: A functional transcription factor binding site prediction webtool for humans and mice",
            "Publication year": 2021,
            "Publication url": "https://www.spandidos-publications.com/10.3892/ije.2021.9",
            "Abstract": "Transcription factors (TFs) play a major role in the regulation of gene expression. Discovering the TFs which bind to the regulatory regions of each gene has been long‑term focus of research. Since the experimental verification of TF binding sites (TFBSs) is a complex process, webtools that perform predictions have been developed. However, the majority of the tools do not provide a user‑friendly environment for data input and a number of these tools produce a large number of false‑positive results. The present study introduces TFBSPred, a TFBS prediction webtool that utilises hidden Markov model‑based TF flexible models (TFFM) for predicting binding sites while providing an automated and minimal input user interface. TFBSPred uses DNAse I hypersensitivity data from ENCODE to identify open chromatin regions and takes advantage of the conservation between Homo sapiens and Mus musculus, by using …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Spandidos Publications"
        },
        {
            "Title": "Efficacy of emergency department–initiated tobacco control—systematic review and meta-analysis of randomized controlled trials",
            "Publication year": 2013,
            "Publication url": "https://academic.oup.com/ntr/article-abstract/15/3/643/1092340",
            "Abstract": "Systematic review and meta-analysis of randomized controlled trials evaluating the efficacy of emergency department–initiated tobacco control (ETC).Literature search in 7 databases and gray literature sources. Point prevalence tobacco abstinence at 1-, 3-, 6-, and/or 12-month follow-up was abstracted from each study. The proportionate effect (relative risk) of ETC on tobacco abstinence was calculated separately for each study and follow-up time and pooled, at different follow-up times, by Mantel-Haenszel relative risks. The effects of ETC on combined point prevalence tobacco abstinence across all follow-up times were calculated using generalized linear mixed models.Seven studies with overall 1,986 participants were included. The strongest effect of ETC on point prevalence tobacco abstinence was found at 1 month: Relative …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A meta-analysis of FZD3 gene polymorphisms and their association with schizophrenia",
            "Publication year": 2016,
            "Publication url": "https://www.ingentaconnect.com/content/wk/psyge/2016/00000026/00000006/art00004",
            "Abstract": "Objective The aim of this study was to investigate the potential association of FZD3 polymorphisms with schizophrenia. Methods A systematic review and a meta-analysis were carried out comprising of nine genetic association studies, with both a population-based and a family-based design, and three genome-wide association studies. A total of 1601 family trios, 39 922 schizophrenic patients, and 61 287 healthy individuals were involved in the analysis and six polymorphisms were examined: rs2241802, rs2323019, rs352203, rs3757888, rs880481, and rs960914. A summary-based method for pooling genetic association studies under both family-based and population-based designs was used. Odds ratios along with their 95% confidence intervals were computed to compare the contrast of alleles in patients and controls. Results The results indicate a potentially weaker effect of FZD3 polymorphisms on …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Wolters Kluwer"
        },
        {
            "Title": "Meta-analysis of gene expression profiles in preeclampsia",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2210778919304799",
            "Abstract": "Preeclampsia (PE) is a serious complication of pregnancy. It is considered a complex condition influenced by maternal genes, environmental factors and a deregulated immune response of the mother, but the etiology is largely unknown. The aim of this study is to identify differentially expressed genes (DEGs) in PE, to help elucidate the identification of the disease etiological mechanisms.The databases Pubmed and GEO were searched according to PRISMA guidelines for the existence of gene expression data on placental samples from case-control studies. After meta-analysis the identified DEGs were further analyzed with STRING and PANTHER to retrieve interaction networks and overrepresented biochemical pathways.Only 10 gene expression datasets and articles fulfilled inclusion criteria, containing data on 195 patients and 231 controls, and were analyzed. Meta-analysis …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ipzZ9siozwsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "with a Hidden Markov Model",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.330.5150",
            "Abstract": "Supporting Information Access to high resolution figures Links to articles and content related to this article Copyright permission to reproduce figures and/or text from this article Journal of Proteome Research is published by the American Chemical Society.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ExTopoDB: a database of experimentally derived topological models of transmembrane proteins",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/26/19/2490/228646",
            "Abstract": " Summary: ExTopoDB is a publicly accessible database of experimentally derived topological models of transmembrane proteins. It contains information collected from studies in the literature that report the use of biochemical methods for the determination of the topology of α-helical transmembrane proteins. Transmembrane protein topology is highly important in order to understand their function and ExTopoDB provides an up to date, complete and comprehensive dataset of experimentally determined topologies of α-helical transmembrane proteins. Topological information is combined with transmembrane topology prediction resulting in more reliable topological models. Availability:           http://bioinformatics.biol.uoa.gr/ExTopoDB          Contact:           shamodr@biol.uoa.gr          Supplementary information:           Supplementary data are available at Bioinformatics online.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:IWHjjKOFINEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Meta-Analysis Methods of Diagnostic Test Accuracy Studies",
            "Publication year": 2022,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-0716-1566-9_11",
            "Abstract": "Meta-analytic techniques are used to combine the results of different studies that have evaluated the accuracy of diagnostic tests. In this article, we present univariate and multivariate meta-analysis methods for a single test and we provide an extensive description of methods for meta-analysis and comparison of multiple diagnostic tests. We close with a practical example of a meta-analysis that aimed to determine whether Rheumatoid Factor identifies patients with Rheumatoid Arthritis.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:MLfJN-KU85MC",
            "Publisher": "Humana, New York, NY"
        },
        {
            "Title": "Bipartite graphs in systems biology and medicine: a survey of methods and applications",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/gigascience/article-abstract/7/4/giy014/4875933",
            "Abstract": "The latest advances in high-throughput techniques during the past decade allowed the systems biology field to expand significantly. Today, the focus of biologists has shifted from the study of individual biological components to the study of complex biological systems and their dynamics at a larger scale. Through the discovery of novel bioentity relationships, researchers reveal new information about biological functions and processes. Graphs are widely used to represent bioentities such as proteins, genes, small molecules, ligands, and others such as nodes and their connections as edges within a network. In this review, special focus is given to the usability of bipartite graphs and their impact on the field of network biology and medicine. Furthermore, their topological properties and how these can be applied to certain biological case studies are discussed. Finally, available methodologies and software are …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:UHK10RUVsp4C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Computational methods for the prediction of GPCRs coupling selectivity",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-systems-biology-applications/21531",
            "Abstract": "GPCRs comprise a wide and diverse class of eukaryotic transmembrane proteins with well-established pharmacological significance. As a consequence of recent genome projects, there is a wealth of information at the sequence level that lacks any functional annotation. These receptors, often quoted as orphan GPCRs, could potentially lead to novel drug targets. However, typical experiments that aim at elucidating their function are hampered by the lack of knowledge on their selective coupling partners at the interior of the cell, the G-proteins. Up-to-date, computational efforts to predict properties of GPCRs have been focused mainly on the ligand-binding specificity, while the aspect of coupling has been less studied. Here, we present the main motivations, drawbacks, and results from the application of bioinformatics techniques to predict the coupling specificity of GPCRs to G-proteins, and discuss the application of …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A database for G proteins and their interaction with GPCRs",
            "Publication year": 2004,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/1471-2105-5-208",
            "Abstract": "G protein-coupled receptors (GPCRs) transduce signals from extracellular space into the cell, through their interaction with G proteins, which act as switches forming hetero-trimers composed of different subunits (α,β,γ). The α subunit of the G protein is responsible for the recognition of a given GPCR. Whereas specialised resources for GPCRs, and other groups of receptors, are already available, currently, there is no publicly available database focusing on G Proteins and containing information about their coupling specificity with their respective receptors. gpDB is a publicly accessible G proteins/GPCRs relational database. Including species homologs, the database contains detailed information for 418 G protein monomers (272 Gα, 87 Gβ and 59 Gγ) and 2782 GPCRs sequences belonging to families with known coupling to G proteins. The GPCRs and the G proteins are classified according to a hierarchy of different classes, families and sub-families, based on extensive literature searchs. The main innovation besides the classification of both G proteins and GPCRs is the relational model of the database, describing the known coupling specificity of the GPCRs to their respective α subunit of G proteins, a unique feature not available in any other database. There is full sequence information with cross-references to publicly available databases, references to the literature concerning the coupling specificity and the dimerization of GPCRs and the user may submit advanced queries for text search. Furthermore, we provide a pattern search tool, an interface for running BLAST against the database and interconnectivity with PRED-TMR, PRED-GPCR …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Creating a specialist protein resource network: a meeting report for the protein bioinformatics and community resources retreat",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/database/article-abstract/doi/10.1093/database/bav063/2433196",
            "Abstract": "During 11–12 August 2014, a Protein Bioinformatics and Community Resources Retreat was held at the Wellcome Trust Genome Campus in Hinxton, UK. This meeting brought together the principal investigators of several specialized protein resources (such as CAZy, TCDB and MEROPS) as well as those from protein databases from the large Bioinformatics centres (including UniProt and RefSeq). The retreat was divided into five sessions: (1) key challenges, (2) the databases represented, (3) best practices for maintenance and curation, (4) information flow to and from large data centers and (5) communication and funding. An important outcome of this meeting was the creation of a Specialist Protein Resource Network that we believe will improve coordination of the activities of its member resources. We invite further protein database resources to join the network and continue the dialogue.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:WbkHhVStYXYC",
            "Publisher": "Oxford Academic"
        },
        {
            "Title": "Are sample sizes clear and justified in RCTs published in dental journals?",
            "Publication year": 2014,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0085949",
            "Abstract": "Sample size calculations are advocated by the CONSORT group to justify sample sizes in randomized controlled trials (RCTs). The aim of this study was primarily to evaluate the reporting of sample size calculations, to establish the accuracy of these calculations in dental RCTs and to explore potential predictors associated with adequate reporting. Electronic searching was undertaken in eight leading specific and general dental journals. Replication of sample size calculations was undertaken where possible. Assumed variances or odds for control and intervention groups were also compared against those observed. The relationship between parameters including journal type, number of authors, trial design, involvement of methodologist, single-/multi-center study and region and year of publication, and the accuracy of sample size reporting was assessed using univariable and multivariable logistic regression. Of 413 RCTs identified, sufficient information to allow replication of sample size calculations was provided in only 121 studies (29.3%). Recalculations demonstrated an overall median overestimation of sample size of 15.2% after provisions for losses to follow-up. There was evidence that journal, methodologist involvement (OR = 1.97, CI: 1.10, 3.53), multi-center settings (OR = 1.86, CI: 1.01, 3.43) and time since publication (OR = 1.24, CI: 1.12, 1.38) were significant predictors of adequate description of sample size assumptions. Among journals JCP had the highest odds of adequately reporting sufficient data to permit sample size recalculation, followed by AJODO and JDR, with 61% (OR = 0.39, CI: 0.19, 0.80) and 66% (OR = 0.34, CI: 0.15 …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "The effect of viable Chlamydia pneumoniae on serum cytokines and adhesion molecules in hemodialysis patients",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S008525381549221X",
            "Abstract": "The effect of viable Chlamydia pneumoniae on serum cytokines and adhesion molecules in hemodialysis patients.Chlamydia pneumoniae (Cp) induces the production of cytokines and adhesion molecules in infected host eukaryotic cells. The causes for pro-inflammatory cytokine and adhesion molecule increase in hemodialysis (HD) patients have not been fully elucidated. The possibility that, in this particularly atherosclerotic population, Cp, a microorganism implicated in the infectious-based inflammatory hypothesis of atherosclerosis' is also responsible for these molecules' increase is assessed in this study.In 130 stable HD patients, serum interleukin-1β (IL-1), interleukin-6, tumor necrosis factor α, interleukin-10, L-selectin, E-selectin, intercellular adhesion molecule-1, and vascular cell adhesion molecule-1 (VCAM-1) levels were determined. Cp presence was identified by inoculation of the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:5nxA0vEk-isC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Meta-analysis of family-based and case-control genetic association studies that use the same cases",
            "Publication year": 2011,
            "Publication url": "https://www.degruyter.com/document/doi/10.2202/1544-6115.1640/html",
            "Abstract": "In many cases in genetic epidemiology, the investigators in an effort to control for different sources of confounding and simultaneously to increase the power perform a family-based and a population-based case-control study within the same population, using the same or largely overlapping, set of cases. Various methods have been proposed for performing a combined analysis, but they all require access to individual data that are difficult to gather in a meta-analysis. Here, we propose a simple and efficient summary-based method for performing the meta-analysis. The key point, contrary to the methods presented earlier that need individual data, is the calculation of the covariance between the study estimates (log-Odds Ratios), using only data derived from the literature in the form of a 2x2 contingency table. Afterwards, the studies can easily be combined either in a two-step procedure using traditional methods for …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:r0BpntZqJG4C",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "Effect of hepatitis C virus on immunological and virological responses in HIV‐infected patients initiating highly active antiretroviral therapy: a meta‐analysis",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jvh.12101",
            "Abstract": "Co‐infection of human immunodeficiency virus (HIV) with hepatitis C virus (HCV) is rather common. In the era of highly active antiretroviral therapy (HAART), viral hepatitis could result in adverse outcomes in HIV+ patients. The current meta‐analysis aims to evaluate the impact of HCV on immunological and virological responses after HAART initiation in HIV/HCV co‐infected individuals by synthesizing the existing scientific evidence. A comprehensive search of electronic databases was performed. Eligible studies were analysed using univariate and multivariate meta‐analytic methods. Totally, 21 studies involving 22533 individuals were eligible. The estimated summary difference in CD4 cell counts increase between HIV and HIV/HCV co‐infected subjects after 3–12 months on HAART was 34.86 cells/mm3 [95% confidence interval (CI): 16.82–52.89]. The difference was more prominent in patients with baseline …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "gpDB: a database of GPCRs, G-proteins, effectors and their interactions",
            "Publication year": 2008,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/24/12/1471/196086",
            "Abstract": " Summary: gpDB is a publicly accessible, relational database, containing information about G-proteins, G-protein coupled receptors (GPCRs) and effectors, as well as information concerning known interactions between these molecules. The sequences are classified according to a hierarchy of different classes, families and subfamilies based on literature search. The main innovation besides the classification of G-proteins, GPCRs and effectors is the relational model of the database, describing the known coupling specificity of GPCRs to their respective alpha subunits of G-proteins, and also the specific interaction between G-proteins and their effectors, a unique feature not available in any other database. Availability:           http://bioinformatics.biol.uoa.gr/gpDB          Contact:           shamodr@biol.uoa.gr          Supplementary information:           Supplementary data are available …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "NAP: the network analysis profiler, a web tool for easier topological analysis and comparison of medium-scale biological networks",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1186/s13104-017-2607-8",
            "Abstract": "Nowadays, due to the technological advances of high-throughput techniques, Systems Biology has seen a tremendous growth of data generation. With network analysis, looking at biological systems at a higher level in order to better understand a system, its topology and the relationships between its components is of a great importance. Gene expression, signal transduction, protein/chemical interactions, biomedical literature co-occurrences, are few of the examples captured in biological network representations where nodes represent certain bioentities and edges represent the connections between them. Today, many tools for network visualization and analysis are available. Nevertheless, most of them are standalone applications that often (i) burden users with computing and calculation time depending on the network’s size and (ii) focus on handling, editing and exploring a network interactively. While such …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:N5tVd3kTz84C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "The effect of homocysteine on the clinical outcomes of ventilated patients with severe sepsis",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Petros_Kopterides/publication/47384772_The_effect_of_homocysteine_on_the_clinical_outcomes_of_ventilated_patients_with_severe_sepsis/links/574cebc008aec988526a26bf.pdf",
            "Abstract": "Background. There is considerable evidence that elevated plasma homocysteine levels are associated with a prothrombotic milieu, whereas activation of the coagulation cascade is an important component of the pathogenesis of sepsis. The protein C pathway has been reported to play a central role both in the propagation of sepsis and a hyperhomocysteinemia-induced hypercoagulable state. Our primary aim was to measure plasma homocysteine levels in mechanically ventilated patients with severe sepsis/septic shock and to assess the association of these levels with relevant clinical outcomes.Methods. The study cohort included 102 mechanically ventilated patients with severe sepsis or septic shock. Demographics, comorbidities, clinical data and severity scores were recorded. Plasma homocysteine, vitamin B12, folate, creatinine, and protein C levels were measured in all study subjects upon enrollment, and …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "METAGEN: Stata module to perform meta-analysis of genetic-association studies",
            "Publication year": 2008,
            "Publication url": "https://econpapers.repec.org/software/bocbocode/s456947.htm",
            "Abstract": "metagen performs fixed-, and random-effects meta-analysis of genetic association case-control studies using Individual Patient Data (IPD). metagen performs meta-analysis using fixed- and random-effects logistic regression models, treating the multiple genotypes as independent variables. By default, metagen performs tests for the overall heterogeneity of the genotypes effects, for the heterogeneity of the assumed genetic model of inheritance as well as for the between-studies heterogeneity of the genetic model. The random-effects models (random-coefficient) are estimated by gllamm (Rabe-Hesketh et al, 2001, 2002).",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:isC4tDSrTZIC",
            "Publisher": "Boston College Department of Economics"
        },
        {
            "Title": "Mixed-effects Poisson regression models for meta-analysis of follow-up studies with constant or varying durations",
            "Publication year": 2009,
            "Publication url": "https://www.degruyter.com/document/doi/10.2202/1557-4679.1168/html",
            "Abstract": "We present a framework for meta-analysis of follow-up studies with constant or varying duration using the binary nature of the data directly. We use a generalized linear mixed model framework with the Poisson likelihood and the log link function. We fit models with fixed and random study effects using Stata for performing meta-analysis of follow-up studies with constant or varying duration. The methods that we present are capable of estimating all the effect measures that are widely used in such studies such as the Risk Ratio, the Risk Difference (in case of studies with constant duration), as well as the Incidence Rate Ratio and the Incidence Rate Difference (for studies of varying duration). The methodology presented here naturally extends previously published methods for meta-analysis of binary data in a generalized linear mixed model framework using the Poisson likelihood. Simulation results suggest that the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "Network analysis of genes and their association with diseases",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378111916304395",
            "Abstract": "A plethora of network-based approaches within the Systems Biology universe have been applied, to date, to investigate the underlying molecular mechanisms of various human diseases. In the present study, we perform a bipartite, topological and clustering graph analysis in order to gain a better understanding of the relationships between human genetic diseases and the relationships between the genes that are implicated in them. For this purpose, disease-disease and gene-gene networks were constructed from combined gene-disease association networks. The latter, were created by collecting and integrating data from three diverse resources, each one with different content covering from rare monogenic disorders to common complex diseases. This data pluralism enabled us to uncover important associations between diseases with unrelated phenotypic manifestations but with common genetic origin. For our …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:geHnlv5EZngC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "ECCB 2018: The 17th European Conference on Computational Biology",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/34/17/i595/5093250",
            "Abstract": "The Conference is being held jointly with ISMB in the oddnumbered years and independently in the even-numbered years. This year, the 17th ECCB (ECCB 2018) will take place in Athens, at the Stavros Niarchos Foundation Cultural Center (SNFCC), from September 8 to 12, 2018. SNFCC, which was opened in June 2017, is a multifunctional arts, education and entertainment complex located on the edge of Faliro Bay, 4.5 km south of the center of Athens. Information on the ECCB 2018 can be found at eccb18. org and will be later archived at www. ebi. ac. uk/eccb/2018/. With more than 1,000 participants from academia and industry, ECCB is the leading European Conference on computational biology and bioinformatics and the second largest internationally, next to ISMB (Intelligent Systems in Molecular Biology). The work presented in ECCB is related to all domains of the field of computational biology and …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Improved strategies to counter the COVID-19 pandemic: Lockdowns vs. primary and community healthcare",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2214750020304431",
            "Abstract": "COVID-19 pandemic mitigation strategies are mainly based on social distancing measures and healthcare system reinforcement. However, many countries in Europe and elsewhere implemented strict, horizontal lockdowns because of extensive viral spread in the community which challenges the capacity of the healthcare systems. However, strict lockdowns have various untintended adverse social, economic and health effects, which have yet to be fully elucidated, and have not been considered in models examining the effects of various mitigation measures. Unlike commonly suggested, the dilemma is not about health vs wealth because the economic devastation of long-lasting lockdowns will definitely have adverse health effects in the population. Furthermore, they cannot provide a lasting solution in pandemic containment, potentially resulting in a vicious cycle of consecutive lockdowns with in-between breaks …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:4MWp96NkSFoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The role of genetic polymorphisms of the Renin–Angiotensin System in renal diseases: A meta-analysis",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2001037014000075",
            "Abstract": "Renal failure has a complex phenotype resulting from an underlying kidney disease as well as environmental and genetic factors. In the present study we performed a systematic review and meta-analyses to evaluate the association of the A1166C polymorphism of Angiotensin II type 1 Receptor gene (AGTR1) with Chronic Kidney Disease (CKD), End Stage Renal Disease (ESRD), IgA Nephropathy (IgAN) and Vesicoureteral Reflux (VUR) as well as the association of A1332G polymorphism of Angiotensin II type 2 Receptor (AGTR2) gene with Vesicoureteral Reflux (VUR). We found that neither AGTR1 Α1166C, nor AGTR2 A1332G polymorphisms were significantly associated with any of the aforementioned renal diseases, suggesting that they cannot be used as predictive markers in either general or subgroup ethnic populations.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Finding beta-barrel outer membrane proteins with a Markov chain model",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/3246244/488-184.pdf",
            "Abstract": "The task of finding β-barrel outer membrane proteins of the gram-negative bacteria is of great importance in current Bioinformatics research. We developed a computational method, which discriminates βbarrel outer membrane proteins from globular ones and, also, from α-helical membrane proteins. The method is based on a 1st order Markov Chain model, which captures the alternating pattern of hydrophilic-hydrophobic residues occurring in the membrane-spanning beta-strands of beta-barrel outer membrane proteins. The model achieves high accuracy in discriminating outer membrane proteins, and could be used alone, or in conjunction with other more sophisticated methods, already available.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "N-terminal sequence-based prediction of subcellular location",
            "Publication year": 2005,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/1471-2105-6-S3-S11",
            "Abstract": "Different compartments in a cell perform diverse tasks, thus knowledge of the localization of a protein would be highly indicative of its function. Many proteins have an N-terminal sequence of approximately 20–50 residues, which is responsible for their targeting to the appropriate location and is cleaved off, after the protein has been inserted into the organelle. Such information can be used in computational methods predicting protein localization. There are several methods for prediction of protein subcellular location available on the web, with TargetP (Emanuelsson et al 2000) being the most widely used. PredSL is a software tool, which aims to classify proteins to five subcellular locations: chloroplast, thylakoid, mitochondrion, secretory pathway and other. It combines neural networks, Markov chains, HMMs and scoring matrices in order to identify a targeting sequence at the N-terminal of a protein sequence, and determine its type (chloroplast-cTP, mitochondrial-mTP, secreted-SP, thylakoidallTP) and the precise location of the cleavage site. PredSL was tested on a set of 732 plant protein sequences and 637 non-plant sequences and the overall accuracy was 90.4% for the plant set and 93.3% for the non-plant set. Compared to the results obtained by TargetP when tested on the same datasets, PredSL's performance was better by 1.6% for the plant sequences and slightly worse (0.2%) for the non-plant sequences. For the prediction of thylakoid proteins PredSL was tested by cross-validation and achieved 87.3% accuracy compared to 87% by LumenP. PredSL is the only method for protein subcellular localization prediction that is available by the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:HDshCWvjkbEC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Meeting report: the seventh conference of the hellenic society for computational biology and bioinformatics",
            "Publication year": 2013,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc3962142/",
            "Abstract": "The Hellenic Society For Computational Biology and Bioinformatics (HSCBB) was conceived as a trans-national society, representing two countries that share the same language and history, Cyprus and Greece. The first, unofficial meeting was held in Heraklion in 2006, followed by Athens in 2007 and Thessalonica in 2008. After the formation of the Society and its ‘inaugural’, fourth scientific conference in Athens during 2009, the HSCBB organized two meetings in Alexandroupolis and Patras, with the aspiration to provide the necessary exposure of graduate students to new developments, expand its horizons towards the international community, promote the development of the field and formulate a solid agenda for the future, all consistent with its primary goals (http://www. hscbb. gr). The HSCBB12 meeting, which took place in Heraklion confirmed that, even in a period of austerity and societal crisis, the local …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:f2IySw72cVMC",
            "Publisher": "Research Network of Computational and Structural Biotechnology"
        },
        {
            "Title": "990P Endocrine immune-related adverse events (irAEs) of combined immunotherapy in solid tumors: Systematic review and meta-analysis",
            "Publication year": 2021,
            "Publication url": "https://www.annalsofoncology.org/article/S0923-7534(21)03603-6/abstract",
            "Abstract": "BackgroundImmunotherapy is already a revolution in oncology. Moreover, combined immunotherapy has shown very good results in some cancers. New kind of immune-related adverse events (irAEs) have been related with immunotherapy due to the stimulation of immune system and some of them concerning endocrine system (endocrine irAEs) can be severe with significant clinical consequences.MethodsA systematic review with detailed search in PubMed, Medline and Clinical trials. gov (from 1/2015 to 12/2020) followed by a meta-nalysis were performed for this study. Adult patients with solid tumors who received combined immunotherapy approved by EMA or FDA were included in this study. Endocrine irAEs of all grades were collected from the relevant clinical studies.ResultsTwenty-six clinical trials in total were included. Particularly, in 21 studies with 3269 patients who received Ipilimumab+ Nivolumab, the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:tuHXwOkdijsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The impact of pneumatic tube system on routine laboratory parameters: a systematic review and meta-analysis",
            "Publication year": 2017,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/cclm-2017-0008/html",
            "Abstract": "Pneumatic tube system (PTS) is a widely used method of transporting blood samples in hospitals. The aim of this study was to evaluate the effects of the PTS transport in certain routine laboratory parameters as it has been implicated with hemolysis.A systematic review and a meta-analysis were conducted. PubMed and Scopus databases were searched (up until November 2016) to identify prospective studies evaluating the impact of PTS transport in hematological, biochemical and coagulation measurements. The random-effects model was used in the meta-analysis utilizing the mean difference (MD). Heterogeneity was quantitatively assessed using the Cohran’s Q and the I2 index. Subgroup analysis, meta-regression analysis, sensitivity analysis, cumulative meta-analysis and assessment of publication bias were performed for all outcomes.From a total of 282 studies identified by the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Polymorphisms of the CD24 gene are associated with risk of multiple sclerosis: a meta-analysis",
            "Publication year": 2015,
            "Publication url": "https://www.mdpi.com/1422-0067/16/6/12368",
            "Abstract": "CD24 is a cell-surface protein mainly expressed in cells of the immune and central nervous system (CNS), cells that play a critical role in the development of multiple sclerosis (MS). In the current study, we investigated four polymorphisms of the CD24 gene regarding their associations with MS. To this end, univariate and multivariate meta-analysis were applied along with modifications to include data from family-trios so as to increase the robustness of the meta-analysis. We found that the polymorphism 226 C> T (Ala57Val) of the CD24 gene is associated with MS according to the recessive mode of inheritance (odds ratio= 1.75; 95% CI: 1.09, 2.81). Moreover, the 1527–1528 TG> del polymorphism is inversely associated with MS according to the dominant mode of inheritance (odds ratio= 0.57; 95% CI 0.39, 0.83). Conversely, the 1056 A> G and 1626 A> G polymorphisms were not found to be associated with MS. We conclude that the CD24 226 C> T polymorphism increases the risk of MS, while the 1527–1528 TG> del polymorphism seems to have a protective role against MS, suggesting that these two polymorphisms can be used as predictive biomarkers for MS development. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Integrin, alpha 2 gene C807T polymorphism and risk of ischemic stroke: a meta-analysis",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0049384806001447",
            "Abstract": "Platelet adhesion to fibrillar collagen via the membrane glycoprotein (GP) Ia/IIa (α2β1), is a crucial event in the pathogenesis of arterial occlusive disorders. The C807T single nucleotide polymorphism of the integrin, alpha 2 (ITGA2) gene has been shown to correlate with the platelet GPIa/IIa density. Consequently, subjects with the 807T allele, who express the highest receptor density, might have an increased potential of platelet adhesion and, hence an increased risk of cerebrovascular disease. However, the research findings remain controversial.A comprehensive electronic search was carried out up until November 2005 and 7 independent studies with a maximum of 774 cases and 1074 controls were analyzed using random effects models.The pooled frequency of the T allele was 36.33% in cases and 37.01% in controls. The T versus the C allele contrast gave an OR …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Using graph theory to analyze biological networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/1756-0381-4-10",
            "Abstract": "Understanding complex systems often requires a bottom-up analysis towards a systems biology approach. The need to investigate a system, not only as individual components but as a whole, emerges. This can be done by examining the elementary constituents individually and then how these are connected. The myriad components of a system and their interactions are best characterized as networks and they are mainly represented as graphs where thousands of nodes are connected with thousands of vertices. In this article we demonstrate approaches, models and methods from the graph theory universe and we discuss ways in which they can be used to reveal hidden properties and features of a network. This network profiling combined with knowledge extraction will help us to better understand the biological significance of the system.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Effects of yeast and bacterial commensals and pathogens of the female genital tract on the transepithelial electrical resistance of hela cells",
            "Publication year": 2016,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4899535/",
            "Abstract": "Commensals of the human body can shift to a pathogenic phase when the host immune system is impaired. This study aims to investigate the effect of seven yeast and two bacterial commensals and opportunistic pathogens isolated from blood and the female genital tract on the transepithelial electrical resistance (TER) of human cervical epithelial cell cultures (HeLa). The pathogens Candida tropicalis, C. parapsilosis, C. glabrata, C. krusei, C. albicans and Saccharomyces cerevisiae, caused a significant decrease in TER as compared to the controls; Lactobacillus spp caused a significant increase in TER versus the controls and Escherichia coli had no effect on the TER of the cell monolayers. The above data show that Candida spp., S. cerevisiae and Lactobacillus spp. have a non-selective effect on the TER of HeLa cell monolayers. These results are consistent with the in vivo non-selective action of these …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "Computational studies on eukaryotic transmembrane β-barrel proteins",
            "Publication year": 2018,
            "Publication url": "https://peerj.com/preprints/27318/",
            "Abstract": "Transmembrane β-barrel proteins perform multiple cellular functions such as passive transport of ions and allowing the flux of molecules. Also, they act as enzymes, transporters, receptors and virulence factors. Even though, in the last few years, several families of eukaryotic β-barrel outer membrane proteins (OMPs) have been discovered, the computational characterization of these families is far from complete. The PFAM database includes only very few characteristic profiles for these families and, in most cases, the profile Hidden Markov Models where trained using both prokaryotic and eukaryotic proteins. Here, we present, for the first time, a comprehensive computational analysis of eukaryotic transmembrane β-barrels. Ten characteristic pHMMs were build that can discriminate eukaryotic β-barrels from other classes of β-barrel proteins (globular and bacterial) and are, also, capable of discriminating between …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "PeerJ Preprints"
        },
        {
            "Title": "METATREND: Stata module to implement regression methods for detecting trends in cumulative meta-analysis",
            "Publication year": 2009,
            "Publication url": "https://econpapers.repec.org/software/bocbocode/s457058.htm",
            "Abstract": "metatrend performs a cumulative meta-analysis (Lau et al, 1995) using the DerSimonian and Laird random-effects method and afterwards, performs two tests for assesing the \"Proteus\" phenomenon (i.e. the appearence of an early extreme estimate that is refuted by subsequent research). The first method is the so-called \"first vs. subsequent\" approach (Ioannidis and Trikalinos, 2005). The second method, consists of performing a GLS regression of the cumulative logOR on the rank of the studies using an AR(1) process to handle the serial correlation.",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:TQgYirikUcIC",
            "Publisher": "Boston College Department of Economics"
        },
        {
            "Title": "Combined prediction of Tat and Sec signal peptides with hidden Markov models",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/26/22/2811/227437",
            "Abstract": " Motivation: Computational prediction of signal peptides is of great importance in computational biology. In addition to the general secretory pathway (Sec), Bacteria, Archaea and chloroplasts possess another major pathway that utilizes the Twin-Arginine translocase (Tat), which recognizes longer and less hydrophobic signal peptides carrying a distinctive pattern of two consecutive Arginines (RR) in the n-region. A major functional differentiation between the Sec and Tat export pathways lies in the fact that the former translocates secreted proteins unfolded through a protein-conducting channel, whereas the latter translocates completely folded proteins using an unknown mechanism. The purpose of this work is to develop a novel method for predicting and discriminating Sec from Tat signal peptides at better accuracy. Results: We report the development of a novel method, PRED-TAT, which is …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "PRED-TMBB: a web server for predicting the topology of β-barrel outer membrane proteins",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/nar/article-abstract/32/suppl_2/W400/1040611",
            "Abstract": "The β-barrel outer membrane proteins constitute one of the two known structural classes of membrane proteins. Whereas there are several different web-based predictors for α-helical membrane proteins, currently there is no freely available prediction method for β-barrel membrane proteins, at least with an acceptable level of accuracy. We present here a web server (PRED-TMBB, http://bioinformatics.biol.uoa.gr/PRED-TMBB) which is capable of predicting the transmembrane strands and the topology of β-barrel outer membrane proteins of Gram-negative bacteria. The method is based on a Hidden Markov Model, trained according to the Conditional Maximum Likelihood criterion. The model was retrained and the training set now includes 16 non-homologous outer membrane proteins with structures known at atomic resolution. The user may submit one sequence at a time and has the option of choosing between …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "HMMpTM: improving transmembrane protein topology prediction using phosphorylation and glycosylation site prediction",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570963913003762",
            "Abstract": "During the last two decades a large number of computational methods have been developed for predicting transmembrane protein topology. Current predictors rely on topogenic signals in the protein sequence, such as the distribution of positively charged residues in extra-membrane loops and the existence of N-terminal signals. However, phosphorylation and glycosylation are post-translational modifications (PTMs) that occur in a compartment-specific manner and therefore the presence of a phosphorylation or glycosylation site in a transmembrane protein provides topological information. We examine the combination of phosphorylation and glycosylation site prediction with transmembrane protein topology prediction. We report the development of a Hidden Markov Model based method, capable of predicting the topology of transmembrane proteins and the existence of kinase specific phosphorylation and N/O …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Lack of association between the platelet glycoprotein Ia C807T gene polymorphism and coronary artery disease: a meta-analysis",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167527306007868",
            "Abstract": "The platelet–collagen receptor, glycoprotein (GP) la/lla plays a crucial role in the adhesion of platelets to fibrillar collagen, an event contributing to the pathogenesis of thrombosis. The C807T polymorphism of the GPla gene is considered a genetic marker of the platelet GPla/lla density. The importance of the GPla gene C807T polymorphism as a genetic risk factor for coronary artery disease (CAD) remains controversial. To assess this association, we performed a meta-analysis of published data.A comprehensive meta-analysis of 19 studies, with a total sample of 13 835 subjects using random effects models.The C versus T allele contrast gave an OR of 0.998 with 95% Cl 0.937–1.064. Similarly, comparing the C homozygotes with the T homozygotes, the CC genotype versus the others and the TT genotype versus the rest, no evidence of any gene-disease association was obtained …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Diagnostic Performance of Biomarkers Urinary KIM-1 and YKL-40 for Early Diabetic Nephropathy, in Patients with Type 2 Diabetes: A Systematic Review and Meta-Analysis",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/882604",
            "Abstract": "There is a lack of prediction markers for early diabetic nephropathy (DN) in patients with type 2 diabetes mellitus (T2DM). The aim of this systematic review and meta-analysis was to evaluate the performance of two promising biomarkers, urinary kidney injury molecule 1 (uKIM-1) and Chitinase-3-like protein 1 (YKL-40) in the diagnosis of early diabetic nephropathy in type 2 diabetic patients. A comprehensive search was performed on PubMed by two reviewers until May 2020. For each study, a 2× 2 contingency table was formulated. Sensitivity, specificity, and other estimates of accuracy were calculated using the bivariate random effects model. The hierarchical summary receiver operating characteristic curve hsROC) was used to pool data and evaluate the area under curve (AUC). The sources of heterogeneity were explored by sensitivity analysis. Publication bias was assessed using Deek’s test. The meta-analysis enrolled 14 studies involving 598 healthy individuals, 765 T2DM patients with normoalbuminuria, 549 T2DM patients with microalbuminuria, and 551 T2DM patients with macroalbuminuria, in total for both biomarkers. The AUC of uKIM-1 and YKL-40 for T2DM patients with normoalbuminuria, was 0.85 (95% CI; 0.82–0.88) and 0.91 (95% CI; 0.88–0.93), respectively. The results of this meta-analysis suggest that both uKIM-1 and YKL-40 can be considered as valuable biomarkers for the early detection of DN in T2DM patients with the latter showing slightly better performance than the former. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Effect of early application of social distancing interventions on COVID-19 mortality over the first pandemic wave: An analysis of longitudinal data from 37 countries",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0163445320307519",
            "Abstract": "To estimate the effect of early application of social distancing interventions on Covid-19 cumulative mortality during the first pandemic wave.Ecological longitudinal study using multivariable negative binomial regression for panel data. Daily numbers of Covid-19 cases and deaths, and data on social distancing interventions, for the 37 member countries of the Organization for Economic Cooperation and Development (OECD) were analysed.Covid-19 cumulative mortality over the first pandemic wave varied widely across countries (range, 4.16 to 855 deaths per million population). On average, one-day delay in application of mass gatherings ban was associated with an adjusted increase in Covid-19 cumulative mortality by 6.97% (95% CI, 3.45 to 10.5), whilst a one-day delay in school closures was associated with an increase of 4.37% (95% CI, 1.58 to 7.17) over the study period. We …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "WB Saunders"
        },
        {
            "Title": "Data and programs in support of network analysis of genes and their association with diseases",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2352340916304577",
            "Abstract": "The network-based approaches that were employed in order to depict the relationships between human genetic diseases and their associated genes are described. Towards this direction, monopartite disease-disease and gene-gene networks were constructed from bipartite gene-disease association networks. The latter were created by collecting and integrating data from three diverse resources, each one with different content, covering from rare monogenic disorders to common complex diseases. Moreover, topological and clustering graph analyses were performed. The methodology and the programs presented in this article are related to the research article entitled “Network analysis of genes and their association with diseases” [1].",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Phoenix 100 versus Vitek 2 in the identification of gram-positive and gram-negative bacteria: a comprehensive meta-analysis",
            "Publication year": 2011,
            "Publication url": "https://journals.asm.org/doi/abs/10.1128/jcm.00182-11",
            "Abstract": "Phoenix 100 and Vitek 2 (operating with the current colorimetric cards) are commonly used in hospital laboratories for rapid identification of microorganisms. The present meta-analysis aims to evaluate and compare their performance on Gram-positive and Gram-negative bacteria. The MEDLINE database was searched up to October 2010 for the retrieval of relevant articles. Pooled correct identification rates were derived from random-effects models, using the arcsine transformation. Separate analyses were conducted at the genus and species levels; subanalyses and meta-regression were undertaken to reveal meaningful system- and study-related modifiers. A total of 29 (6,635 isolates) and 19 (4,363 isolates) articles were eligible for Phoenix and colorimetric Vitek 2, respectively. No significant differences were observed between Phoenix and Vitek 2 either at the genus (97.70% versus 97.59%, P = 0.919) or the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "American Society for Microbiology"
        },
        {
            "Title": "GWAR: robust analysis and meta-analysis of genome-wide association studies",
            "Publication year": 2017,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/33/10/1521/2902714",
            "Abstract": "In the context of genome-wide association studies (GWAS), there is a variety of statistical techniques in order to conduct the analysis, but, in most cases, the underlying genetic model is usually unknown. Under these circumstances, the classical Cochran-Armitage trend test (CATT) is suboptimal. Robust procedures that maximize the power and preserve the nominal type I error rate are preferable. Moreover, performing a meta-analysis using robust procedures is of great interest and has never been addressed in the past. The primary goal of this work is to implement several robust methods for analysis and meta-analysis in the statistical package Stata and subsequently to make the software available to the scientific community.The CATT under a recessive, additive and dominant model of inheritance as well as robust methods based on the Maximum Efficiency …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Multivariate meta-analysis of the association of G-protein beta 3 gene (GNB3) haplotypes with cardiovascular phenotypes",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11033-014-3171-0.pdf",
            "Abstract": "The objective of the present study was to review previous investigations on the association of haplotypes in the G-protein β3 subunit (GNB3) gene with representative cardiovascular risk factors/phenotypes: hypertension, overweight, and variation in the systolic and diastolic blood pressures (SBP and DBP, respectively) and as well as body mass index (BMI). A comprehensive literature search was undertaken in Pubmed, Web of Science, EMBASE, Biological Abstracts, LILACS and Google Scholar to identify potentially relevant articles published up to April 2011. Six genetic association studies encompassing 16,068 participants were identified. Individual participant data were obtained for all studies. The three most investigated GNB3 polymorphisms (G-350A, C825T and C1429T) were considered. Expectation–maximization and generalized linear models were employed to estimate haplotypic effects from …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Βιοπληροφορική (Bioinformatics)",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:q3oQSFYPqjQC",
            "Publisher": "https://repository.kallipos.gr/handle/11419/5016"
        },
        {
            "Title": "Discriminating membrane proteins using the joint distribution of length sums of success and failure runs",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10260-016-0370-y",
            "Abstract": "Discriminating integral membrane proteins from water-soluble ones, has been over the past decades an important goal for computational molecular biology. A major drawback of methods appeared in the literature, is that most of the authors tried to solve the problem using machine learning techniques. Specifically, most of the proposed methods require an appropriate dataset for training, and consequently the results depend heavily on the suitability of the dataset, itself. Motivated by these facts, in this paper we develop a formal discrimination procedure that is based on appropriate theoretical observations on the sequence of hydrophobic and polar residues along the protein sequence and on the exact distribution of a two dimensional runs-related statistic defined on the same sequence. Specifically, for setting up our discrimination procedure, we study thoroughly the exact distribution of a bivariate random …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Prediction of cell wall sorting signals in gram-positive bacteria with a hidden markov model: application to complete genomes",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219720008003382",
            "Abstract": "Surface proteins in Gram-positive bacteria are frequently implicated in virulence. We have focused on a group of extracellular cell wall-attached proteins (CWPs), containing an LPXTG motif for cleavage and covalent coupling to peptidoglycan by sortase enzymes. A hidden Markov model (HMM) approach for predicting the LPXTG-anchored cell wall proteins of Gram-positive bacteria was developed and compared against existing methods. The HMM model is parsimonious in terms of the number of freely estimated parameters, and it has proved to be very sensitive and specific in a training set of 55 experimentally verified LPXTG-anchored cell wall proteins as well as in reliable data sets of globular and transmembrane proteins. In order to identify such proteins in Gram-positive bacteria, a comprehensive analysis of 94 completely sequenced genomes has been performed. We identified, in total, 860 LPXTG-anchored …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Imperial College Press"
        },
        {
            "Title": "Apolipoprotein E Polymorphism and Left Ventricular Failure in Beta‐Thalassemia: A Multivariate Meta‐Analysis",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/ahg.12203",
            "Abstract": "Apolipoprotein E (ApoE) is potentially a genetic risk factor for the development of left ventricular failure (LVF), the main cause of death in beta‐thalassemia homozygotes. In the present study, we synthesize the results of independent studies examining the effect of ApoE on LVF development in thalassemic patients through a meta‐analytic approach. However, all studies report more than one outcome, as patients are classified into three groups according to the severity of the symptoms and the genetic polymorphism. Thus, a multivariate meta‐analytic method that addresses simultaneously multiple exposures and multiple comparison groups was developed. Four individual studies were included in the meta‐analysis involving 613 beta‐thalassemic patients and 664 controls. The proposed method that takes into account the correlation of log odds ratios (log(ORs)), revealed a statistically significant overall association …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Apolipoprotein E polymorphisms and type 2 diabetes: a meta-analysis of 30 studies including 5423 cases and 8197 controls",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1096719210000995",
            "Abstract": "Type 2 diabetes mellitus (T2DM) is a highly complicated metabolic disorder for which there is worldwide effort for the identification of susceptibility genes. Polymorphisms of the Apolipoprotein E (ApoE) gene are associated with plasma lipid and lipoprotein levels and influence cardiovascular risk. Since insulin resistance is known to be strongly associated with metabolic dyslipidemia, ApoE polymorphisms have been implicated in predisposition to diabetes but the results of the individual studies were inconclusive. We present here a meta-analysis of population-based case–control genetic-association studies relating ApoE polymorphisms and T2DM. We included in the analysis 30 studies, which reported data of ApoE genotypes in 5423 T2DM patients and 8197 healthy unrelated controls. Multivariate and univariate methods suggest a significant role played by the E2 allele, since carriers of the E2 allele were at …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Generalized least squares for assessing trends in cumulative meta-analysis with applications in genetic epidemiology",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895435609000171",
            "Abstract": "Cumulative meta-analysis allows the evaluation of a study's contribution to the combined effect of the preceding research. It accrues evidence, gradually adding studies one at a time and provides updated estimates along with confidence intervals whenever new evidence emerges. In many research areas, a temporal evolution of the effect size (ES) is present, leading to diminishing effects and would be advantageous to have methods capable of detecting it.We propose a simple regression-based approach for detecting trends in cumulative meta-analysis. We use the combined ES of studies published up to a particular time, as dependent variable and the rank of the published studies as independent variable, in a weighted linear regression to detect a possible trend over time. The correlation between successive ESs used in the regression, is dealt by introducing a first-order …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Percutaneous coronary intervention versus optimal medical therapy for prevention of spontaneous myocardial infarction in subjects with stable ischemic heart disease",
            "Publication year": 2013,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circulationaha.112.131961",
            "Abstract": "Contemporary studies have shown that spontaneous but not procedural myocardial infarction (MI) is related to subsequent mortality. Whether percutaneous coronary intervention (PCI) reduces spontaneous (nonprocedural) MI is unknown.PubMed, EMBASE, and Cochrane Central Register of Controlled Trials (CENTRAL) were searched for randomized clinical trials until October 2012 comparing PCI with optimal medical therapy (OMT) for stable ischemic heart disease and reporting MI outcomes: spontaneous nonprocedural MI, procedural MI, and all MI, including procedure-related MI. Given the varying length of follow-up between trials, a mixed-effect Poisson regression meta-analysis was used. From 12 randomized clinical trials with 37 548 patient-years of follow-up, PCI compared with OMT alone was associated with a significantly lower incident rate ratio (IRR) for …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "THE ASSOCIATION BETWEEN CIRCULATING PLASNUNOGEN ACTIVATOR INHIBITOR TYPE 1 (PAI-1 LEVELS, THE PAI-1 4G/5G POLYMORPHISM AND INCIDENT MYOCARDIAL INFRACTION",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=166440361235418435&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "SPRINGER"
        },
        {
            "Title": "Landscape of eukaryotic transmembrane beta barrel proteins",
            "Publication year": 2020,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/acs.jproteome.9b00740",
            "Abstract": "Even though in the last few years several families of eukaryotic β-barrel outer membrane proteins have been discovered, their computational characterization and their annotation in public databases are far from complete. The PFAM database includes only very few characteristic profiles for these families, and in most cases, the profile hidden Markov models (pHMMs) have been trained using prokaryotic and eukaryotic proteins together. Here, we present for the first time a comprehensive computational analysis of eukaryotic transmembrane β-barrels. Twelve characteristic pHMMs were built, based on an extensive literature search, which can discriminate eukaryotic β-barrels from other classes of proteins (globular and bacterial β-barrel ones), as well as between mitochondrial and chloroplastic ones. We built eight novel profiles for the chloroplastic β-barrel families that are not present in the PFAM database and also …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:EkHepimYqZsC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Emerging molecular networks common in ionizing radiation, immune and inflammatory responses by employing bioinformatics approaches",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030438351500213X",
            "Abstract": "Efficient radiation therapy is characterized by enhanced tumor cell killing involving the activation of the immune system (tumor immunogenicity) but at the same time minimizing chronic inflammation and radiation adverse effects in healthy tissue. The aim of this study was to identify gene products involved in immune and inflammatory responses upon exposure to ionizing radiation by using various bioinformatic tools. Ionizing radiation is known to elicit different effects at the level of cells and organism i.e. DNA Damage Response (DDR), DNA repair, apoptosis and, most importantly, systemic effects through the instigation of inflammatory ‘danger’ signals and innate immune response activation. Genes implicated both in radiation and immune/inflammatory responses were collected manually from the scientific literature with a combination of relevant keywords. The experimentally validated and literature-based results …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:u9iWguZQMMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Prediction of sortase substrates in Gram-positive bacteria with a hidden Markov model: PP3-52",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=3792622136768782343&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "No evidence for association of CTLA-4 gene polymorphisms with the risk of developing multiple sclerosis: a meta-analysis",
            "Publication year": 2007,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1352458507078059",
            "Abstract": "We conducted a meta-analysis concerning the association of cytotoxic T lymphocyte-associated antigen 4 (CTLA-4) gene polymorphisms with the risk of developing multiple sclerosis (MS). We identified 18 eligible studies summarizing information about 3375 MS cases and 2930 healthy controls. Two polymorphisms were of interest: the exon 1+49 A/G polymorphism (in 18 studies) and the promoter —318 C/T polymorphism (in 10 studies). Using random-effects methods we found no evidence for association of the various contrasts of genotypes (or allele frequencies) with the disease. There was significant between-studies heterogeneity that could not be explained by the ethnicity of the populations studied or by other summary measures (gender, disease course, latitude). The major finding of the meta-analysis, apart from the lack of an overall association, consists of detecting a significant time trend of the OR for the …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Polymorphisms of the insulin receptor and the insulin receptor substrates genes in polycystic ovary syndrome: a Mendelian randomization meta-analysis",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1096719209002972",
            "Abstract": "Polycystic ovary syndrome (PCOS) is a heterogeneous condition with unknown aetiology which is considered to be the most common endocrine disorder in women of reproductive age. In this work we investigated the association of insulin receptor (ΙNSR) and insulin receptor substrates (IRSs) polymorphisms with the risk of developing PCOS. The meta-analysis of eleven studies (889 cases, 1303 controls) yielded a significant association for IRS-1 Gly972Arg (G972R) polymorphism concerning the GR vs. GG genotype (OR: 1.77, 95% CI: 1.28, 2.45), with no between-studies heterogeneity. Concerning ΙNSR His1058 C/T, the meta-analysis of eight studies (795 cases, 576 controls) found no significant evidence for association with PCOS (OR for the TT + CT vs. CC comparison equal to 1.28 with 95% CI: 0.88, 1.85) and a moderate between studies variability (I2 = 44.6%). No evidence for publication bias was found in …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Smoking prevalence among hospitalized COVID-19 patients and its association with disease severity and mortality: an expanded re-analysis of a recent publication",
            "Publication year": 2021,
            "Publication url": "https://harmreductionjournal.biomedcentral.com/articles/10.1186/s12954-020-00437-5",
            "Abstract": "There is a lot of debate about the effects of smoking on COVID-19. A recent fixed-effects meta-analysis found smoking to be associated with disease severity among hospitalized patients, but other studies report an unusually low prevalence of smoking among hospitalized patients. The purpose of this study was to expand the analysis by calculating the prevalence odds ratio (POR) of smoking among hospitalized COVID-19 patients, while the association between smoking and disease severity and mortality was examined by random-effects meta-analyses considering the highly heterogeneous study populations. The same studies as examined in the previous meta-analysis were analyzed (N = 22, 20 studies from China and 2 from USA). The POR relative to the expected smoking prevalence was calculated using gender and age-adjusted population smoking rates. Random-effects meta-analyses were used for all other associations. A total of 7162 patients were included, with 482 being smokers. The POR was 0.24 (95%CI 0.19–0.30). Unlike the original study, the association between smoking and disease severity was not statistically significant using random-effects meta-analysis (OR 1.40, 95%CI 0.98–1.98). In agreement with the original study, no statistically significant association was found between smoking and mortality (OR 1.86, 95%CI 0.88–3.94). An unusually low prevalence of smoking, approximately 1/4th the expected prevalence, was observed among hospitalized COVID-19 patients. Any association between smoking and COVID-19 severity cannot be generalized but should refer to the seemingly low proportion of smokers who …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:vbGhcppDl1QC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Association between the plasminogen activator inhibitor-1 4G/5G polymorphism and venous thrombosis. A meta-analysis",
            "Publication year": 2007,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/abstract/10.1160/TH06-12-0745",
            "Abstract": "The effect of the 675 insertion/deletion (4G/5G) polymorphism of plasminogen activator inhibitor-1 (PAI-1) gene on the risk of venous thromboembolism (VTE) remains controversial. In this study, we performed a meta-analysis of published data regarding this issue. A comprehensive electronic search was carried out up until September 2006. A total of 22 articles were included in the analysis that was performed using random effects models. Eighteen papers, concerning patients without another known risk factor, comprised 2,644 cases and 3,739 controls. The alleles contrast (4G vs. 5G allele) yielded a statistically significant odds ratio (OR) of 1.153 (95% confidence interval [CI]: 1.068–1.246). In a sub-analysis of five studies that included 256 cases with another genetic risk factor and 147 controls, the combined per-allele OR was still significant (OR:1.833,95% CI:1.325–2.536). On the contrary, the analysis of five …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "SCHATTAUER VERLAGSGESELLSCHAFT"
        },
        {
            "Title": "A Hidden Markov Model method, capable of predicting and discriminating β-barrel outer membrane proteins",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-5-29",
            "Abstract": "Integral membrane proteins constitute about 20–30% of all proteins in the fully sequenced genomes. They come in two structural classes, the α-helical and the β-barrel membrane proteins, demonstrating different physicochemical characteristics, structure and localization. While transmembrane segment prediction for the α-helical integral membrane proteins appears to be an easy task nowadays, the same is much more difficult for the β-barrel membrane proteins. We developed a method, based on a Hidden Markov Model, capable of predicting the transmembrane β-strands of the outer membrane proteins of gram-negative bacteria, and discriminating those from water-soluble proteins in large datasets. The model is trained in a discriminative manner, aiming at maximizing the probability of correct predictions rather than the likelihood of the sequences. The training has been performed on a non-redundant database …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "VICTOR: A visual analytics web application for comparing cluster sets",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482521003516",
            "Abstract": "Clustering is the process of grouping different data objects based on similar properties. Clustering has applications in various case studies from several fields such as graph theory, image analysis, pattern recognition, statistics and others. Nowadays, there are numerous algorithms and tools able to generate clustering results. However, different algorithms or parameterizations may produce quite dissimilar cluster sets. In this way, the user is often forced to manually filter and compare these results in order to decide which of them generate the ideal clusters. To automate this process, in this study, we present VICTOR, the first fully interactive and dependency-free visual analytics web application which allows the visual comparison of the results of various clustering algorithms. VICTOR can handle multiple cluster set results simultaneously and compare them using ten different metrics. Clustering results can be filtered …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Methylene tetrahydrofolate reductase gene polymorphisms and their association with methotrexate toxicity: a meta-analysis",
            "Publication year": 2012,
            "Publication url": "https://journals.lww.com/jpharmacogenetics/Fulltext/2012/02000/Methylene_tetrahydrofolate_reductase_gene.4.aspx",
            "Abstract": "ObjectiveA systematic review and a meta-analysis were conducted, to investigate the possible association of methylene tetrahydrofolate reductase (MTHFR) gene polymorphisms with adverse effects related to methotrexate (MTX).MethodsA systematic literature search in PubMed retrieved a total of 44 studies (42 unique articles). Two polymorphisms were included in the meta-analysis: C677T and A1298C. Random effect models were used in the analysis. Odds ratios along with their 95% confidence intervals were computed to compare the distribution of alleles and genotypes between cases and controls.ResultsThe analysis highlighted a significant association of C677T polymorphism with overall MTX toxicity, hepatotoxicity, hematological toxicity, and neurotoxicity. It also revealed an association with MTX toxicity in patients with rheumatoid arthritis. In contrast, a protective effect of C677T MTHFR polymorphism on …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:JV2RwH3_ST0C",
            "Publisher": "LWW"
        },
        {
            "Title": "Vitamin B12 and hepatic enzyme serum levels correlate with interleukin-6 in alcohol-dependent individuals without liver disease",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0009912007001269",
            "Abstract": "Alcohol abuse is a major cause of liver cirrhosis as well as chronic liver disease. The aim of the present study was to investigate the possible correlation, between liver dysfunction biological markers and vitamin B12, with interleukin-6, in the serum of alcohol-dependent individuals without liver disease (AWLD).In a sample of 43 alcohol abusing/dependent subjects (33 males and 10 females) treated on an inpatient basis according to a standard detoxification protocol, the serum activities of the hepatic enzymes (ASAT, ALAT, γ-GT), as well as the concentration of B12 and IL-6, were determined on admission.A strong positive correlation has been observed between IL-6 and B12, ASAT, ALAT, and γ-GT at the beginning of the detoxification period. The results confirmed that in alcohol-dependent individuals, the median serum concentration of IL-6, before the beginning of the treatment, had a significant positive …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Interleukin gene polymorphisms and susceptibility to HIV-1 infection: a meta-analysis",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s12041-018-0907-y",
            "Abstract": "Some subjects are repeatedly exposed to human immunodeficiency virus (HIV), yet they remain uninfected. This suggests the existence of host-resistance mechanisms. The current study synthesizes the evidence regarding the association between interleukin (IL) gene polymorphisms and HIV susceptibility. Medline, Scopus and the Web of Science databases were systematically searched, and a meta-analysis of case–control studies was conducted. Univariate and bivariate methods were used. The literature search identified 42 eligible studies involving 15,727 subjects. Evidence was obtained on eight single-nucleotide polymorphisms (SNPs): IL1A −889 C>T (rs1800587), IL1B +3953/4 C>T (rs1143634), IL4 −589/90 C>T (rs2243250), IL6 −174 G>C (rs1800795), IL10 −592 C>A (rs1800872), IL10−1082 A>G (rs1800896), IL12B −1188 A>C (rs3212227) and IL28B C>T (rs12979860). The IL1B +3953/4 C>T …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An ecological study of the determinants of differences in 2009 pandemic influenza mortality rates between countries in Europe",
            "Publication year": 2011,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0019432",
            "Abstract": "Background Pandemic A (H1N1) 2009 mortality rates varied widely from one country to another. Our aim was to identify potential socioeconomic determinants of pandemic mortality and explain between-country variation.   Methodology Based on data from a total of 30 European countries, we applied random-effects Poisson regression models to study the relationship between pandemic mortality rates (May 2009 to May 2010) and a set of representative environmental, health care-associated, economic and demographic country-level parameters. The study was completed by June 2010.   Principal Findings Most regression approaches indicated a consistent, statistically significant inverse association between pandemic influenza-related mortality and per capita government expenditure on health. The findings were similar in univariable [coefficient: –0.00028, 95% Confidence Interval (CI): –0.00046, –0.00010, p = 0.002] and multivariable analyses (including all covariates, coefficient: –0.00107, 95% CI: –0.00196, –0.00018, p = 0.018). The estimate was barely insignificant when the multivariable model included only significant covariates from the univariate step (coefficient: –0.00046, 95% CI: –0.00095, 0.00003, p = 0.063).   Conclusions Our findings imply a significant inverse association between public spending on health and pandemic influenza mortality. In an attempt to interpret the estimated coefficient (–0.00028) for the per capita government expenditure on health, we observed that a rise of 100 international dollars was associated with a reduction in the pandemic influenza mortality rate by approximately 2.8%. However, further work needs to …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:qUcmZB5y_30C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Urine-Based Molecular Diagnostic Tests for Leishmaniasis Infection in Human and Canine Populations: A Meta-Analysis",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1013944",
            "Abstract": "Leishmaniasis is a neglected tropical disease affecting humans and domesticated animals with high mortality in endemic countries. The pleiotropy of symptoms and the complicated gold-standard methods make the need for non-invasive, highly sensitive diagnostic tests imperative. Individual studies on molecular-based Leishmania diagnosis in urine show high discrepancy; thus, a data-evidenced comparison of various techniques is necessary. We performed a systematic review and meta-analysis using the bivariate method of diagnostic methods to pool sensitivities and specificities. We investigated the impact of DNA-extraction method, PCR type, amplified locus, host species, leishmaniasis form, and geographical region. The pooled sensitivity was 69.2%. Tests performed with the kit-based DNA extraction method and qPCR outweighed in sensitivity the phenol-chloroform-based and PCR methods, while their combination showed a sensitivity of 79.3%. Amplified locus, human or canine as host and cutaneous or visceral leishmaniasis revealed similar sensitivities. Tests in European and Middle Eastern countries performed better than tests in other regions (sensitivity 81.7% vs. 43.7%). A combination of kit-based DNA extraction and qPCR could be a safer choice for molecular diagnosis for Leishmania infection in urine samples in European–Middle Eastern countries. For the rest of the world, more studies are needed to better characterize the endemic parasite species. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:hMsQuOkrut0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Use of fibrates and cancer risk: a systematic review and meta-analysis of 17 long-term randomized placebo-controlled trials",
            "Publication year": 2012,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0045259",
            "Abstract": "Background Fibrates comprise a class of well-established antilipidemic agents that significantly reduce cardiovascular events. Given the concerns of cancer with fibrate therapy, we undertook a systematic review and meta-analysis to investigate the effects of fibrates on cancer outcomes.   Methods We systematically searched Medline, Scopus, SCI Expanded, and the Cochrane Library for studies published up to 2012. We included randomized controlled trials (RCTs) that evaluated a fibrate therapy compared with placebo, had a minimum duration of two years, and reported data on the incidence of and/or deaths from cancer during the trial. Reviews of each study were performed and the relative data were abstracted. Pooled relative risk estimates (RR) and 95% confidence intervals (CIs) were calculated using the inverse variance weighted approach. Subgroup, sensitivity and meta-regression analyses were also conducted.   Results Seventeen RCTs, involving 44,929 participants with an average follow-up of 5.2 years, contributed to the analysis. The degree of variability between trials was consistent with what would be expected to occur by chance alone. The quantitative synthesis of data retrieved from the RCTs was not indicative of a fibrate effect on cancer incidence (780 [fibrate] vs 814 [control]; RR = 1.02, 95% CI 0.92–1.12) or cancer death (385 [fibrate] vs 377 [control]; RR = 1.06, 95% CI: 0.92–1.22). When the analysis was restricted to major RCTs, the results did not substantially change. Similarly, we found no evidence of differential effects by length of follow-up or type of fibrate. Insignificant results were also obtained for the role of fibrates in …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Predicting beta barrel transmembrane proteins using HMMs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4939-6753-7_4.pdf",
            "Abstract": "Transmembrane beta-barrels (TMBBs) constitute an important structural class of membrane proteins located in the outer membrane of gram-negative bacteria, and in the outer membrane of chloroplasts and mitochondria. They are involved in a wide variety of cellular functions and the prediction of their transmembrane topology, as well as their discrimination in newly sequenced genomes is of great importance as they are promising targets for antimicrobial drugs and vaccines. Several methods have been applied for the prediction of the transmembrane segments and the topology of beta barrel transmembrane proteins utilizing different algorithmic techniques. Hidden Markov Models (HMMs) have been efficiently used in the development of several computational methods used for this task. In this chapter we give a brief review of different available prediction methods for beta barrel transmembrane proteins …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "The association between apolipoprotein E gene polymorphisms and essential hypertension: a meta-analysis of 45 studies including 13 940 cases and 16 364 controls",
            "Publication year": 2013,
            "Publication url": "https://www.nature.com/articles/jhh201237",
            "Abstract": "The apolipoprotein E single-nucleotide polymorphisms are among the potential candidate genes that may serve as modulators in susceptibility to essential hypertension. In an effort to clarify earlier inconclusive results, we performed a meta-analysis of population-based case–control genetic association studies. Random-effects methods were applied on summary data in order to combine the results of the individual studies. We identified in total 45 studies, including 13 940 hypertensive cases and 16 364 controls. The contrast of E4 carriers versus non-carriers yielded an overall odds ratio (OR) of 1.16 (95% confidence interval (CI): 1.02, 1.31), whereas the contrast of E4 allele versus the others in a subtotal of 6617 cases and 7330 controls, yielded an OR of 1.39 (95% CI: 1.12, 1.72). There was moderate evidence of publication bias in both contrasts, which was eliminated after excluding studies not in Hardy …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Identification of gene expression profiles in myocardial infarction: a systematic review and meta-analysis",
            "Publication year": 2018,
            "Publication url": "https://bmcmedgenomics.biomedcentral.com/articles/10.1186/s12920-018-0427-x",
            "Abstract": "Myocardial infarction (MI) is a multifactorial disease with complex pathogenesis, mainly the result of the interplay of genetic and environmental risk factors. The regulation of thrombosis, inflammation and cholesterol and lipid metabolism are the main factors that have been proposed thus far to be involved in the pathogenesis of MI. Traditional risk-estimation tools depend largely on conventional risk factors but there is a need for identification of novel biochemical and genetic markers. The aim of the study is to identify differentially expressed genes that are consistently associated with the incidence myocardial infarction (MI), which could be potentially incorporated into the traditional cardiovascular diseases risk factors models. The biomedical literature and gene expression databases, PubMed and GEO, respectively, were searched following the PRISMA guidelines. The key inclusion criteria were gene expression data derived from case-control studies on MI patients from blood samples. Gene expression datasets regarding the effect of medicinal drugs on MI were excluded. The t-test was applied to gene expression data from case-control studies in MI patients. A total of 162 articles and 174 gene expression datasets were retrieved. Of those a total of 4 gene expression datasets met the inclusion criteria, which contained data on 31,180 loci in 93 MI patients and 89 healthy individuals. Collectively, 626 differentially expressed genes were detected in MI patients as compared to non-affected individuals at an FDR q-value = 0.01. Of those, 88 genes/gene products were interconnected in an interaction network. Totally, 15 genes were identified as hubs …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:tzM49s52ZIMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "ECCB 2018 ORGANIZATION",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/34/17/i599/5093243",
            "Abstract": "ECCB 2018 ORGANIZATION Page 1 ECCB 2018 ORGANIZATION CONFERENCE CHAIR \nArtemis G. Hatzigeorgiou – University of Thessaly & Hellenic Pasteur Institute, Greece \nCONFERENCE CO-CHAIR Pantelis Bagos – University of Thessaly, Greece LOCAL \nORGANIZING COMMITTEE Pantelis Bagos– University of Thessaly, Greece Takis Benos – \nUniversity of Pittsburgh, USA Artemis G. Hatzigeorgiou – University of Thessaly & Hellenic Pasteur \nInstitute, Greece Vassiliki Iconomidou – National and Kapodistrian University of Athens, Greece \nIoannis Kavakiotis – University of Thessaly & Hellenic Pasteur Institute, Greece Elias Manolakos \n– National and Kapodistrian University of Athens, Greece Ioannis Michalopoulos – Biomedical \nResearch Foundation Academy of Athens, Greece Ioannis Tsamardinos – University of Crete, \nGreece Ioannis Vlahavas – Aristotle University of Thessaloniki, Greece STEERING Ron – , , …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Effect Of Angiotensin Converting Enzyme Gene I/D Polymorphism And Its Expression On Clinical Outcome In Acute Respiratory Distress Syndrome",
            "Publication year": 2013,
            "Publication url": "https://europepmc.org/article/med/23635999",
            "Abstract": "BACKGROUND: The role of the D allele of the angiotensin-converting enzyme (ACE) gene I/D polymorphism in the clinical outcomes of patients with acute lung injury and acute respiratory distress syndrome (ALI/ARDS) remains controversial. Our aim was to assess simultaneously the effect of the ACE I/D polymorphisms as well as the serum and BALF ACE levels on prognosis of patients with ARDS. METHODS: Sixty-nine mechanically ventilated patients with ALI/ARDS were recruited. ACE activity levels both in serum and BALF were assessed by chemical methods. Patients were genotyped for ACE I/D polymorphisms. Time-to-event analysis evaluated the variables associated with the 28-day and 90-day mortality. Finally, we performed a meta-analysis of studies examining the association between ACE I/D polymorphisms and mortality of ALI/ARDS patients. RESULTS: In the multivariable model, age, lung compliance, serum lactate and serum ACE levels were significantly associated with both 28-and 90-day mortality. No significant correlation was found between serum and BALF ACE levels (Spearman's rho= 0.054; P= 0.66). Serum ACE concentrations were significantly higher (P= 0.046) in patients with D/D genotype versus the two other groups combined (I/D and I/I genotypes). The meta-analysis of 6 studies (including ours) provided evidence that D allele is significantly associated with increased mortality in ALI/ARDS patients, yielding a per-allele odds ratio of 1.76 (95% CI: 1.19, 2.59). CONCLUSION: Serum ACE levels appear to be affected by the I/D polymorphism and are correlated with prognosis in patients with ALI/ARDS indicating that …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Viterbi training of Hidden Markov Models for labeled sequences",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=9009265725184482496&hl=en&oi=scholarr",
            "Abstract": "Theodoropoulou MC, Mintsopoulos I and Bagos PG. Viterbi training of Hidden Markov Models for labeled sequences [version 1; not peer reviewed]. F1000Research 2017, 6 (ISCB Comm J): 1578 (poster)(https://doi. org/10.7490/f1000research. 1114805.1)",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interleukin gene polymorphisms and susceptibility to HIV-1 infection: a meta-analysis",
            "Publication year": 2018,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64077",
            "Abstract": "Some subjects are repeatedly exposed to human immunodeficiency virus (HIV), yet they remain uninfected. This suggests the existence of host-resistance mechanisms. The current study synthesizes the evidence regarding the association between interleukin (IL) gene polymorphisms and HIV susceptibility. Medline, Scopus and the Web of Science databases were systematically searched, and a meta-analysis of case-control studies was conducted. Univariate and bivariate methods were used. The literature search identified 42 eligible studies involving 15,727 subjects. Evidence was obtained on eight single-nucleotide polymorphisms (SNPs): IL1A -889 C>T (rs1800587), IL1B +3953/4 C>T (rs1143634), IL4 -589/90 C>T (rs2243250), IL6 -174 G>C (rs1800795), IL10 -592 C>A (rs1800872), IL10-1082 A>G (rs1800896), IL12B -1188 A>C (rs3212227) and IL28B C>T (rs12979860). The IL1B +3953/4 C>T variant appears to increase the risk of HIV acquisition, under the assumption of a recessive genetic model (odds ratio (OR): 4.47, 95% CI: 2.35-8.52). The AA homozygotes of the IL10 -592 C>A SNP had an increased, marginally nonsignificant, risk (OR: 1.39, 95% CI: 0.97-2.01). It reached, however, significance in sub analyses (OR: 1.49, 95% CI: 1.04-2.12). Finally, the well-studied hepatitis C virus (HCV) infection IL28B (rs12979860) CT/TT genotypes were associated with a 27% decrease in HIV infection risk, especially in populations infected with HCV (OR: 0.73, 95% CI: 0.57-0.95). Interleukin signalling is perhaps important in HIV infection and some interleukin genetic variants may affect the risk of HIV acquisition. Approaches targeting specific …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Methods of analysis and meta-analysis for identifying differentially expressed genes",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-4939-7868-7_12",
            "Abstract": "Microarray approaches are widely used high-throughput techniques to assess simultaneously the expression of thousands of genes under certain conditions and study the effects of certain treatments, diseases, and developmental stages. The traditional way to perform such experiments is to design oligonucleotide hybridization probes that correspond to specific genes and then measure the expression of the genes in order to determine which of them are up- or down-regulated compared to a condition that is used as a control. Hitherto, individual experiments cannot capture the bigger picture of how a biological system works and, therefore, data integration from multiple experimental studies and external data repositories is necessary to understand the function of genes and their expression patterns under certain conditions. Therefore, the development of methods for handling, integrating, comparing …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:JQOojiI6XY0C",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "Bisphosphonate use and risk of colorectal cancer: a systematic review and meta‐analysis",
            "Publication year": 2013,
            "Publication url": "https://bpspubs.onlinelibrary.wiley.com/doi/abs/10.1111/bcp.12135",
            "Abstract": "A growing body of evidence suggests that bisphosphonates may have chemopreventive potential against colorectal cancer. Our aim was to examine this association through a meta‐analysis of observational studies.A comprehensive search for relevant articles published up to October 2012 was performed, reviews of each study were conducted and data were abstracted. Prior to meta‐analysis, the studies were evaluated for publication bias and heterogeneity. Pooled relative risk (RR) estimates and 95% confidence intervals (CIs) were calculated using the random effects and the fixed effects models. Subgroup and sensitivity analyses were also performed.Eight large population‐based epidemiological studies (one case‐control, two nested case‐control analyses within a cohort and five cohort studies), involving more than 630 000 participants, contributed to the analysis. We found no …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bivariate genome-wide association meta-analysis of pediatric musculoskeletal traits reveals pleiotropic effects at the SREBF1/TOM1L2 locus",
            "Publication year": 2017,
            "Publication url": "https://www.nature.com/articles/s41467-017-00108-3",
            "Abstract": "Bone mineral density is known to be a heritable, polygenic trait whereas genetic variants contributing to lean mass variation remain largely unknown. We estimated the shared SNP heritability and performed a bivariate GWAS meta-analysis of total-body lean mass (TB-LM) and total-body less head bone mineral density (TBLH-BMD) regions in 10,414 children. The estimated SNP heritability is 43%(95% CI: 34–52%) for TBLH-BMD, and 39%(95% CI: 30–48%) for TB-LM, with a shared genetic component of 43%(95% CI: 29–56%). We identify variants with pleiotropic effects in eight loci, including seven established bone mineral density loci: WNT4, GALNT3, MEPE, CPED1/WNT16, TNFSF11, RIN3, and PPP6R3/LRP5. Variants in the TOM1L2/SREBF1 locus exert opposing effects TB-LM and TBLH-BMD, and have a stronger association with the former trait. We show that SREBF1 is expressed in murine and human …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "INFLAMMATION AND MICROINFLAMMATION IN HEMODIALYSIS PATIENTS-A LONGITUDINAL STUDY",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=15197436697643160097&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending hidden Markov models to allow conditioning on previous observations",
            "Publication year": 2018,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219720018500191",
            "Abstract": "Hidden Markov Models (HMMs) are probabilistic models widely used in computational molecular biology. However, the Markovian assumption regarding transition probabilities which dictates that the observed symbol depends only on the current state may not be sufficient for some biological problems. In order to overcome the limitations of the first order HMM, a number of extensions have been proposed in the literature to incorporate past information in HMMs conditioning either on the hidden states, or on the observations, or both. Here, we implement a simple extension of the standard HMM in which the current observed symbol (amino acid residue) depends both on the current state and on a series of observed previous symbols. The major advantage of the method is the simplicity in the implementation, which is achieved by properly transforming the observation sequence, using an extended alphabet. Thus, it …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:Fu2w8maKXqMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "MAXIMUM LIKELIHOOD AND CONDITIONAL MAXIMUM LIKELIHOOD LEARNING ALGORITHMS FOR HIDDEN MARKOV MODELS WITH LABELED DATA—APPLICATION TO TRANSMEMBRANE PROTEIN TOPOLOGY PREDICTION",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812704658_0012",
            "Abstract": "Hidden Markov Models (HMMs) have been widely used in applications in computational biology, during the last few years. In this paper we are reviewing the main algorithms proposed in the literature for training and decoding a HMM with labeled sequences, in the context of the topology prediction of bacterial integral membrane proteins. We evaluate the Maximum Likelihood algorithms traditionally used for the training of a Hidden Markov Model, against the less commonly used Conditional Maximum Likelihood-based algorithms and, after combining results previously obtained in the literature, we propose a new variant for Maximum Likelihood training. We compare the convergence rates of each algorithm showing the advantages and disadvantages of each method in the context of the problem at hand. Finally, we evaluate the predictive performance of each approach, using state of the art algorithms proposed for …",
            "Abstract entirety": 0,
            "Author pub id": "k3osijsAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "VARIABILITY CHARACTERISTICS AND ACCURATE ESTIMATION OF THE MICROINFLAMMATION IN HEMODIALYSIS PATIENTS",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=790728338077467131&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "k3osijsAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        }
    ]
}]