[{
    "name": "Παναγιώτης Ροντογιάννης",
    "romanize name": "Panagiotis Rontogiannis",
    "School-Department": "Πληροφορικής και Τηλεπικοινωνιών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 6836,
    "Scholar name": "Panos Rondogiannis",
    "Scholar id": "a6x5amYAAAAJ",
    "Affiliation": "Professor, Department of Informatics and Telecommunications, National and Kapodistrian University",
    "Citedby": 682,
    "Interests": [
        "Logic Programming",
        "Functional Programming",
        "Semantics of Programming Languages"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=a6x5amYAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Multidimensional xml",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45111-0_12",
            "Abstract": "The Extensible Markup Language (XML) tends to become a widely accepted formalism for the representation and exchange of data over the Web. A problem that often arises in practice is the representation in XML of data that are context-dependent (for example, information that exists in many different languages, in many degrees of detail, and so on). In this paper we propose an extension of XML, namely MXML or Multidimensional XML, which can be used in order to alleviate the problem of representing such context-dependent (or multidimensional) data. Apart from its usefulness in the semistructured data domain, MXML also reveals some new and promising research directions in the area of multidimensional languages.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Theorems on pre-fixed points of non-monotonic functions with applications in logic programming and formal grammars",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44145-9_12",
            "Abstract": "We derive two novel theorems regarding pre-fixed points of non-monotonic functions and demonstrate that they have immediate applications in logic programming and formal grammars. In particular, the results of the paper lead to a natural generalization of the model intersection theorem for definite logic programs, to the more general class of normal logic programs. Moreover, the obtained results also offer the first (to our knowledge) model intersection result for Boolean grammars.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The intricacies of three-valued extensional semantics for higher-order logic programs",
            "Publication year": 2017,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/intricacies-of-threevalued-extensional-semantics-for-higherorder-logic-programs/6E6A21E6C5D5E7F9E593943E861CD8F0",
            "Abstract": "M. Bezem defined an extensional semantics for positive higher-order logic programs. Recently, it was demonstrated by Rondogiannis and Symeonidou that Bezem's technique can be extended to higher-order logic programs with negation, retaining its extensional properties, provided that it is interpreted under a logic with an infinite number of truth values. Rondogiannis and Symeonidou also demonstrated that Bezem's technique, when extended under the stable model semantics, does not in general lead to extensional stable models. In this paper, we consider the problem of extending Bezem's technique under the well-founded semantics. We demonstrate that the well-founded extension fails to retain extensionality in the general case. On the positive side, we demonstrate that for stratified higher-order logic programs, extensionality is indeed achieved. We analyze the reasons of the failure of extensionality in the …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "FICS 2010",
            "Publication year": 2010,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00512377/document",
            "Abstract": "Informal proceedings of the 7th workshop on Fixed Points in Computer Science (FICS 2010), held in Brno, 21-22 August 2010",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Semantic Approaches to Boolean Grammars",
            "Publication year": 2008,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2008/1652/",
            "Abstract": "Boolean grammars extend context-free grammars by allowing conjunction and negation in rule bodies. This new formalism appears to be quite expressive and still efficient from a parsing point of view. Therefore, it seems reasonable to hope that boolean grammars can lead to more expressive tools that can facilitate the compilation process of modern programming languages. One important aspect concerning the theory of boolean grammars is their semantics. More specifically, the existence of negation makes it difficult to define a simple derivation-style semantics (such as for example in the case of context-free grammars). There have already been proposed a number of different semantic approaches in the literature. The purpose of this paper is to present the basic ideas behind each method and identify certain interesting problems that can be the object of further study in this area.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Extensional semantics for higher-order logic programs with negation",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48758-8_29",
            "Abstract": "We develop an extensional semantics for higher-order logic programs with negation, generalizing the technique that was introduced in [2, 3] for positive higher-order programs. In this way we provide an alternative extensional semantics for higher-order logic programs with negation to the one proposed in [6]. As an immediate useful consequence of our developments, we define for the language we consider the notions of stratification and local stratification, which generalize the familiar such notions from classical logic programming. We demonstrate that for stratified and locally stratified higher-order logic programs, the proposed semantics never assigns the unknown truth value.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Stratified negation in temporal logic programming and the cycle-sum test",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397500003741",
            "Abstract": "We consider stratified negation in temporal logic programming. We demonstrate that the cycle-sum test (which was initially proposed for detecting deadlocks in the context of temporal functional programming) can also be used as a syntactic stratification test for temporal logic programming. Therefore, on the one hand we exhibit a class of temporal logic programs with negation which have a well-defined semantics, and on the other hand we provide further evidence that the cycle-sum test is a fundamental one in the area of temporal programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:roLk4NBRz8UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Intensional Programming Ii",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=9MFUDwAAQBAJ&oi=fnd&pg=PR1&dq=info:QbdBFobHwlcJ:scholar.google.com&ots=mXqpBK-Wv4&sig=a280qhqTIbsjvnuVpV3lyW8KB9o",
            "Abstract": "There is a growing interest in programming languages and systems based on nonclassical logics such as temporal logics, interval logics, modal and intuitionistic logics. In fact, a whole new programming paradigm called'intensional programming'has been created, with applications in a wide range of areas, including parallel programming, dataflow computation, temporal reasoning, scientific computation, real-time programming, temporal and multidimensional databases, spreadsheets, attribute grammars, and Internet programming. This volume presents ongoing research as well as future directions of this new and fascinating area of research.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:HoB7MX3m0LUC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "An infinite-game semantics for well-founded negation in logic programming",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016800720700084X",
            "Abstract": "We present an infinite-game characterization of the well-founded semantics for function-free logic programs with negation. Our game is a simple generalization of the standard game for negation-less logic programs introduced by van Emden [M.H. van Emden, Quantitative deduction and its fixpoint theory, Journal of Logic Programming 3 (1) (1986) 37–53] in which two players, the Believer and the Doubter, compete by trying to prove (respectively disprove) a query. The standard game is equivalent to the minimum Herbrand model semantics of logic programming in the sense that a query succeeds in the minimum model semantics iff the Believer has a winning strategy for the game which begins with the Doubter doubting this query. The game for programs with negation that we propose follows the same rules as the standard one, except that the players swap roles every time the play “passes through” negation. We …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:ufrVoPGSRksC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Expressing preferences in logic programming using an infinite-valued logic",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2790449.2790511",
            "Abstract": "We propose the new logic programming language PrefLog, which is based on an infinite-valued logic in order to support operators for expressing preferences. We demonstrate that if the operators used are continuous over the infinite-valued underlying domain, then the resulting logic programming language retains the well-known properties of classical logic programming (and most notably the existence of a least Herbrand model). We argue that one can define simple and natural new continuous operators by using a small set of operators that are easily shown to be continuous. Finally, we demonstrate that despite the fact that the underlying truth domain and the set of possible interpretations of a PrefLog program are infinite, we can define a terminating bottom-up proof procedure for implementing a significant and useful fragment of the language.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game-theoretic characterization of Boolean grammars",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02737-6_27",
            "Abstract": "We obtain a simple, purely game-theoretic characterization of Boolean grammars [A. Okhotin, Information and Computation, 194 (2004) 19-48]. In particular, we propose a two-player infinite game of perfect information for Boolean grammars, which is equivalent to their well-founded semantics. The game is directly applicable to the simpler classes of conjunctive and context-free grammars, and it offers a promising new connection between game theory and formal languages.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Lexicographic Logic: a Many-valued Logic for Preference Representation",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2012.10940",
            "Abstract": "Logical formalisms provide a natural and concise means for specifying and reasoning about preferences. In this paper, we propose lexicographic logic, an extension of classical propositional logic that can express a variety of preferences, most notably lexicographic ones. The proposed logic supports a simple new connective whose semantics can be defined in terms of finite lists of truth values. We demonstrate that, despite the well-known theoretical limitations that pose barriers to the quantitative representation of lexicographic preferences, there exists a subset of the rational numbers over which the proposed new connective can be naturally defined. Lexicographic logic can be used to define in a simple way some well-known preferential operators, like \" and if possible \", and \" or failing that \". Moreover, many other hierarchical preferential operators can be defined using a systematic approach. We argue that the new logic is an effective formalism for ranking query results according to the satisfaction level of user preferences.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extensional higher-order logic programming",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2499937.2499942",
            "Abstract": "We propose a purely extensional semantics for higher-order logic programming. In this semantics program predicates denote sets of ordered tuples, and two predicates are equal iff they are equal as sets. Moreover, every program has a unique minimum Herbrand model which is the greatest lower bound of all Herbrand models of the program and the least fixed-point of an immediate consequence operator. We also propose an SLD-resolution proof system which is proven sound and complete with respect to the minimum Herbrand model semantics. In other words, we provide a purely extensional theoretical framework for higher-order logic programming which generalizes the familiar theory of classical (first-order) logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "ACM"
        },
        {
            "Title": "Temporal stratification tests for linear and branching-time deductive databases",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397505003257",
            "Abstract": "We consider the problem of extending temporal deductive databases with stratified negation. We argue that the classical stratification test for deductive databases is too restrictive when one shifts attention to the temporal case. Moreover, as we demonstrate, the (more general) local stratification approach is impractical: detecting whether a temporal deductive database is locally stratified is shown to be co-NP hard (even if one restricts attention to programs that only use one predicate symbol and two constants). For these reasons we define temporal stratification, an intermediate notion between stratification and local stratification. We demonstrate that for the temporal deductive databases we consider, temporal stratification coincides with local stratification in certain important cases in which the latter is polynomial-time decidable. We then develop two algorithms for detecting temporal stratification. The first algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Temporal disjunctive logic programming",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1007/BF03037535",
            "Abstract": "In this paper we introduce the logic programming languageDisjunctive Chronolog which combines the programming paradigms of temporal and disjunctive logic programming. Disjunctive Chronolog is capable of expressing dynamic behaviour as well as uncertainty, two notions that are very common in a variety of real systems. We present the minimal temporal model semantics and the fixpoint semantics for the new programming language and demonstrate their equivalence. We also show how proof procedures developed for disjunctive logic programs can be easily extended to apply to Disjunctive Chronolog programs.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "An infinite-valued semantics for logic programs with negation",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45757-7_38",
            "Abstract": "We give a purely model-theoretic (denotational) characterization of the semantics of logic programs with negation allowed in clause bodies. In our semantics (the first of its kind) the meaning of a program is, as in the classical case, the unique minimum model in a programindependent ordering. We use an expanded truth domain that has an uncountable linearly ordered set of truth values between False (the minimum element) and True (the maximum), with a Zero element in the middle. The truth values below Zero are ordered like the countable ordinals. The values above Zero have exactly the reverse order. Negation is interpreted as refiection about Zero followed by a step towards Zero; the only truth value that remains unaffected by negation is Zero. We show that every program has a unique minimum model M P, and that this model can be constructed with a T P iteration which …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Expressive Power of Higher-Order Datalog",
            "Publication year": 2019,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/expressive-power-of-higherorder-datalog/B800F077DBC66023631AF4139B9F0B47",
            "Abstract": "A classical result in descriptive complexity theory states that Datalog expresses exactly the class of polynomially computable queries on ordered databases (Papadimitriou 1985; Grädel 1992; Vardi 1982; Immerman 1986; Leivant 1989). In this paper we extend this result to the case of higher-order Datalog. In particular, we demonstrate that on ordered databases, for all k ≥ 2, k-order Datalog captures (k − 1)-EXPTIME. This result suggests that higher-order extensions of Datalog possess superior expressive power and they are worthwhile of further investigation both in theory and in practice.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:u_35RYKgDlwC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Models and Games by Jouko Väänänen, Cambridge University Press, Cambridge Studies in Advanced Mathematics Series 132, 2011. Hardcover, ISBN 978-0-521-51812-3, 367 pp.",
            "Publication year": 2012,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/models-and-games-by-vaananen-jouko-cambridge-university-press-cambridge-studies-in-advanced-mathematics-series-132-2011-hardcover-isbn-9780521518123-367-pp/6F47C99F64E054C253F5B2C4C13C0F23",
            "Abstract": "//static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS1471068412000038/resource/name/firstPage-S1471068412000038a.jpg",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Extensional Semantics for Higher-Order Logic Programs with Negation",
            "Publication year": 2018,
            "Publication url": "https://lmcs.episciences.org/4067",
            "Abstract": "We develop an extensional semantics for higher-order logic programs with negation, generalizing the technique that was introduced in [Bezem99,Bezem01] for positive higher-order programs. In this way we provide an alternative extensional semantics for higher-order logic programs with negation to the one proposed in [CharalambidisER14]. As an immediate useful consequence of our developments, we define for the language we consider the notions of stratification and local stratification, which generalize the familiar such notions from classical logic programming. We demonstrate that for stratified and locally stratified higher-order logic programs, the proposed semantics never assigns the unknown truth value. We conclude the paper by providing a negative result: we demonstrate that the well-known stable model semantics of classical logic programming, if extended according to the technique of [Bezem99,Bezem01] to higher-order logic programs, does not in general lead to extensional stable models.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Episciences. org"
        },
        {
            "Title": "A Many-valued Logic for Lexicographic Preference Representation",
            "Publication year": 2021,
            "Publication url": "https://proceedings.kr.org/2021/62/",
            "Abstract": "We introduce lexicographic logic, an extension of propositional logic that can represent a variety of preferences, most notably lexicographic ones. The proposed logic supports a simple new connective whose semantics can be defined in terms of finite lists of truth values. We demonstrate that, despite the well-known theoretical limitations that pose barriers to the quantitative representation of lexicographic preferences, there exists a subset of the rational numbers over which the proposed new connective can be naturally defined. Lexicographic logic can be used to define in a simple way some well-known preferential operators, like\" A and if possible B\", and\" A or failing that B\". We argue that the new logic is an effective formalism for ranking query results according to the satisfaction level of user preferences.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Locally stratified Boolean grammars",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S089054010800062X",
            "Abstract": "We introduce locally stratified Boolean grammars, a natural subclass of Boolean grammars with many desirable properties. Informally, if a grammar is locally stratified then the set of all pairs of the form (nonterminal, string) of the grammar can be mapped to a (possibly infinite) set of strata so as that the following holds: if the membership of a string w in the language defined by nonterminal A depends on the membership of string w′ in the language defined by nonterminal B, then (B, w′) cannot belong to a stratum higher than the stratum of (A, w); furthermore, if the above dependency is obtained through negation,(B, w′) must belong to a stratum lower than the stratum of (A, w). We prove that local stratifiability can be tested in linear time with respect to the size of the given grammar. We then develop the semantics of locally stratified grammars and prove that it is independent of the choice of the stratification mapping …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:0EnyYjriUFMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "The infinite-valued semantics: overview, recent results and future directions",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/11663081.2013.798959",
            "Abstract": "The infinite-valued semantics was introduced in Rondogiannis and Wadge (2005) as a purely logical way for capturing the meaning of well-founded negation in logic programming. The purpose of this paper is threefold: first, to give a non-technical introduction to the infinite-valued semantics; second, to discuss the applicability of the infinite-valued approach to syntactically richer extensions of logic programming; and third, to present the main open problems whose resolution would further enhance the applicability of the technique.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:r0BpntZqJG4C",
            "Publisher": "Routledge"
        },
        {
            "Title": "The intensional transformation for functional languages with user-defined data types",
            "Publication year": 2011,
            "Publication url": "http://www.softlab.ntua.gr/~gfour/files/pls11.pdf",
            "Abstract": "We extend the intensional transformation [6, 4] so as to apply to first-order lazy functional languages with user-defined data types. Since higher-order functional programs can be translated to first-order ones with the use of data types [3], the proposed approach can also be used to transform fully higher-order lazy functional programs.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An infinite-game semantics for negation in logic programming.",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=6656435350882765513&hl=en&oi=scholarr",
            "Abstract": "We present an infinite-game characterization of the wellfounded semantics of logic programming with negation. Our game is a simple generalization of the standard game for ordinary logic programming [vE86], in which a Doubter chooses variables which he hopes fail as queries. His opponent in the standard game, the Believer, on each move answers the Doubter by choosing a rule with the doubted variable as the head. The Doubter, on his move, chooses one of the variables in the body of the rule and doubts it in turn. The Believer wins by eventually forcing the Doubter to doubt a fact. It can be shown that aquery succeeds iff the Believer has a winning strategy for the game which begins with the Doubter doubting thequery. The game for logic programming with negation follows the same rules, except that the players swap roles every time the play\" passes through\" negation: when the Doubter chooses a negated …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Well-founded semantics for Boolean grammars",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11779148_19",
            "Abstract": "Boolean grammars [A. Okhotin, Information and Computation 194 (2004) 19-48] are a promising extension of context-free grammars that supports conjunction and negation. In this paper we give a novel semantics for boolean grammars which applies to all such grammars, independently of their syntax. The key idea of our proposal comes from the area of negation in logic programming, and in particular from the so-called well-founded semantics which is widely accepted in this area to be the “correct” approach to negation. We show that for every boolean grammar there exists a distinguished (three-valued) language which is a model of the grammar and at the same time the least fixed point of an operator associated with the grammar. Every boolean grammar can be transformed into an equivalent (under the new semantics) grammar in normal form. Based on this normal form, we propose an  algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Tagged Dataflow: a Formal Model for Iterative Map-Reduce.",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Panos-Rondogiannis/publication/260986851_Tagged_Dataflow_a_Formal_Model_for_Iterative_Map-Reduce/links/0f317532ea806ab4df000000/Tagged-Dataflow-a-Formal-Model-for-Iterative-Map-Reduce.pdf",
            "Abstract": "In this paper, we consider the recent iterative extensions of the Map-Reduce framework and we argue that they would greatly benefit from the research work that was conducted in the area of dataflow computing more than thirty years ago. In particular, we suggest that the tagged-dataflow model of computation can be used as the formal framework behind existing and future iterative generalizations of Map-Reduce. Moreover, we present various applications in which the tagged model gives elegant solutions with increased parallelism. The tagged-dataflow approach for iterative Map-Reduce creates a number of interesting research challenges which deserve further investigation, such as the requirement for a more sophisticated fault tolerance model.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intensional Programming II",
            "Publication year": 2000,
            "Publication url": "http://users.ionio.gr/~manolis/papers/IP2-2000.pdf",
            "Abstract": "Cactus has been proposed as a. temporal logic programming language based on the branching notion of time. Cactus supports two main operators: the temporal operator first which refers to the first moment in time and the temporal operator next; which refers to the i-th child of the current moment. Actually by next,-we denote a. family {next,-I 1'E N} of next operators, each one referring to a different next moment that immediately follows the present one. In this paper we propose the extension of Cactus with new temporal operators. More speciﬁcally, we investigate the use of two variants of the operator next namely the operators 0p and O5 referring to “some next moment\" and “all next moments\" respectively. We also investigate the use of branching variants of the well known temporal operators El (always) and O (sometime).",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Game semantics for non-monotonic intensional logic programming",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168007216301282",
            "Abstract": "Intensional logic programming is an extension of logic programming based on intensional logic, which includes as special cases both temporal and modal logic programming. In [13], M. Orgun and W.W. Wadge provided a general framework for capturing the semantics of intensional logic programming languages. They demonstrated that if the intensional operators of a language obey some simple semantic properties, then the programs of the language are guaranteed to have a minimum model semantics. One key property involved in the construction of [13] is the monotonicity of intensional operators. In this paper we consider intensional logic programming from a game-theoretic perspective. In particular we define a two-person game and demonstrate that it can be used in order to define a model for any given intensional program of the class introduced in [13]. Moreover, this model is shown to be identical to the …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:J_g5lzvAfSwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Fixed-Point Semantics for Non-Monotonic Formalisms.",
            "Publication year": 2010,
            "Publication url": "http://pageperso.lif.univ-mrs.fr/~luigi.santocanale/fics2010/presentations/panos.pdf",
            "Abstract": "Example In a data base for a university department there exists a relation enrolled (Student, Course). If we do not use negation-as-failure, we must also have a relation not-enrolled (Student, Course). Relations of this kind may be huge (without conveying essential information).",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Associative Query for Multi-version Web Documents",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/pdf/10.1142/9789814527019#page=64",
            "Abstract": "With the growing importance of the World Wide Web [1] as a truly global distributed system for information sharing, there has been a significant increase in the creation and modification of web documents. In order to produce and modify web sites efficiently, approaches to the creation of multiversion web sites have been developed. A multi-version Web site contains different versions of web documents and allow all the different versions to share one generic source page. Current practice of searching the Web using existing search tools is not adaptable for multi-version web sites. This paper proposes a database-like querying approach for more precise. and complex querying of multi-version web sites. Associative query is achieved by generating virtual version tables (VVT) upon different versions of web documents and joining them together to retrieve the exact information needed. We provide a Java applet interface …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A purely model-theoretic semantics for disjunctive logic programs with negation",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72200-7_6",
            "Abstract": "We present a purely model-theoretic semantics for disjunctive logic programs with negation, building on the infinite-valued approach recently introduced for normal logic programs [9]. In particular, we show that every disjunctive logic program with negation has a non-empty set of minimal infinite-valued models. Moreover, we show that the infinite-valued semantics can be equivalently defined using Kripke models, allowing us to prove some properties of the new semantics more concisely. In particular, for programs without negation, the new approach collapses to the usual minimal model semantics, and when restricted to normal logic programs, it collapses to the well-founded semantics. Lastly, we show that every (propositional) program has a finite set of minimal infinite-valued models which can be identified by restricting attention to a finite subset of the truth values of the underlying logic.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Minimum model semantics for extensional higher-order logic programming with negation",
            "Publication year": 2014,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/minimum-model-semantics-for-extensional-higherorder-logic-programming-with-negation/8097D0DC4016416D06A91A1134FE7224",
            "Abstract": "Extensional higher-order logic programming has been introduced as a generalization of classical logic programming. An important characteristic of this paradigm is that it preserves all the well-known properties of traditional logic programming. In this paper we consider the semantics of negation in the context of the new paradigm. Using some recent results from non-monotonic fixed-point theory, we demonstrate that every higher-order logic program with negation has a unique minimum infinite-valued model. In this way we obtain the first purely model-theoretic semantics for negation in extensional higher-order logic programming. Using our approach, we resolve an old paradox that was introduced by W. W. Wadge in order to demonstrate the semantic difficulties of higher-order logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Extensional higher-order datalog",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.60.7006&rep=rep1&type=pdf",
            "Abstract": "We define a higher-order extension of Datalog based on the Horn fragment of higher-order logic introduced in [Wad91]. Programs of Higher-Order Datalog can be understood declaratively as formulas in extensional higher-order logic, in which (for example) a unary predicate of unary predicates is a set of sets of data objects. The language retains all the basic principles of first-order logic programming. In particular, programs in this extended Datalog always have a minimum Herbrand model which can be computed in a bottom-up way. We present the syntax and semantics of our extended Datalog, state the main result cited above, and describe an implementation of this new language.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Strong equivalence of logic programs under the infinite-valued semantics",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020019009000477",
            "Abstract": "We consider the notion of strong equivalence [V. Lifschitz, D. Pearce, A. Valverde, Strongly equivalent logic programs, ACM Transactions on Computational Logic 2 (4) (2001) 526–541] of normal propositional logic programs under the infinite-valued semantics [P. Rondogiannis, W.W. Wadge, Minimum model semantics for logic programs with negation-as-failure, ACM Transactions on Computational Logic 6 (2) (2005) 441–467] (which is a purely model-theoretic semantics that is compatible with the well-founded one). We demonstrate that two such programs are strongly equivalent under the infinite-valued semantics if and only if they are logically equivalent in the corresponding infinite-valued logic. In particular, we show that strong equivalence of normal propositional logic programs is decidable, and more specifically coNP-complete. Our results have a direct implication for the well-founded semantics since, as we …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:HDshCWvjkbEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Transformation Technique for Datalog Programs Based on Non-deterministic",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=11118951292789109074&hl=en&oi=scholarr",
            "Abstract": "Recently, a novel transformation technique for Datalog programs, called the branching-time transformation, was introduced by the authors. In this paper we propose a significant extension of the branching-time transformation which we believe opens up a promising new direction of research in the area of value-propagating Datalog optimizations. One of the novel characteristics of the proposed approach is that the target language is Datalogns extended with choice predicates, a form of non-deterministic construct that was originally introduced in the area of intensional logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer"
        },
        {
            "Title": "The branching-time transformation technique for chain datalog programs",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1012502800961",
            "Abstract": "The branching-time transformation technique has proven to be an efficient approach for implementing functional programming languages. In this paper we demonstrate that such a technique can also be defined for logic programming languages. More specifically, we first introduce Branching Datalog, a language that can be considered as the basis for branching-temporal deductive databases. We then present a transformation algorithm from Chain Datalog programs to the class of unary Branching Datalog programs with at most one IDB atom in the body of each clause. In this way, we obtain a novel implementation approach for Chain Datalog, shedding at the same time new light on the power of branching-time logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "On the expressive power of univariate equations over sets of natural numbers",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09680-3_15",
            "Abstract": "Equations of the form X=φ(X) are considered, where the unknown X is a set of natural numbers. The expression φ(X) may contain the operations of set addition, defined as S+T= {m+n ∣ m ∈ S, n ∈ T}, union and intersection, as well as ultimately periodic constants. An equation with a non-periodic solution of exponential growth is constructed. At the same time it is demonstrated that no sets with super-exponential growth can be represented. It is also shown that a restricted class of these equations cannot represent sets with super-linearly growing complements. The results have direct implications on the power of conjunctive grammars with one nonterminal symbol.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Equivalence of two fixed-point semantics for definitional higher-order logic programs",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397517300373",
            "Abstract": "Two distinct research approaches have been proposed for assigning extensional semantics to higher-order logic programming. The former approach [11] uses classical domain-theoretic tools while the latter [1] builds on a fixed-point construction defined on a syntactic instantiation of the source program. The relationships between these two approaches had not been investigated until now. In this paper we demonstrate that for a very broad class of programs, namely the class of definitional programs introduced by W.W. Wadge, the two approaches coincide with respect to ground atoms that involve symbols of the program. On the other hand, we argue that if existential higher-order variables are allowed to appear in the bodies of program rules, the two approaches are in general different. The results of the paper contribute to a better understanding of the semantics of higher-order logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:GnPB-g6toBAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The generalized intensional transformation for implementing lazy functional languages",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-45284-0_11",
            "Abstract": "The intensional transformation is a promising technique for implementing lazy functional languages based on a demand-driven execution model. Despite its theoretical elegance and its simple and efficient execution model, the intensional transformation suffered, until now, from two main drawbacks: it could only be applied to programs that manipulate primitive data-types and it could only compile a simple (and rather restricted) class of higher-order functions. In this paper we remedy the above two deficiencies, obtaining a transformation algorithm that is applicable to mainstream lazy functional languages. The proposed transformation initially uses defunctionalization in order to eliminate higher-order functions from the source program. The original intensional transformation is then extended in order to apply to the target first-order language with user-defined data types that resulted from the defunctionalization …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A fixed point theorem for non-monotonic functions",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397515000687",
            "Abstract": "We present a fixed point theorem for a class of (potentially) non-monotonic functions over specially structured complete lattices. The theorem has as a special case the Knaster–Tarski fixed point theorem when restricted to the case of monotonic functions and Kleene's theorem when the functions are additionally continuous. From the practical side, the theorem has direct applications in the semantics of negation in logic programming. In particular, it leads to a more direct and elegant proof of the least fixed point result of [12]. Moreover, the theorem appears to have potential for possible applications outside the logic programming domain.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:TFP_iSt0sucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Approximation fixpoint theory and the well-founded semantics of higher-order logic programs",
            "Publication year": 2018,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/approximation-fixpoint-theory-and-the-wellfounded-semantics-of-higherorder-logic-programs/5F6FF1A7BB73DAE5FB12F148868BE9C7",
            "Abstract": "We define a novel, extensional, three-valued semantics for higher-order logic programs with negation. The new semantics is based on interpreting the types of the source language as three-valued Fitting-monotonic functions at all levels of the type hierarchy. We prove that there exists a bijection between such Fitting-monotonic functions and pairs of two-valued-result functions where the first member of the pair is monotone-antimonotone and the second member is antimonotone-monotone. By deriving an extension of consistent approximation fixpoint theory (Denecker et al. 2004) and utilizing the above bijection, we define an iterative procedure that produces for any given higher-order logic program a distinguished extensional model. We demonstrate that this model is actually a minimal one. Moreover, we prove that our construction generalizes the familiar well-founded semantics for classical logic programs …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "A Fixed Point Theorem on Lexicographic Lattice Structures",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3373718.3394797",
            "Abstract": "We introduce the notion of a lexicographic lattice structure, namely a lattice whose elements can be viewed as stratified entities and whose ordering relation compares elements in a lexicographic manner with respect to their strata. These lattices arise naturally in many non-monotonic formalisms, such as normal logic programs, higher-order logic programs with negation, and boolean grammars. We consider functions over such lattices that may overall be non-monotonic, but retain a restricted form of monotonicity inside each stratum. We demonstrate that such functions always have a least fixed point which is also their least pre-fixed point. Moreover, we prove that the sets of pre-fixed and post-fixed points of such functions, are complete lattices. For the special case of a trivial lexicographic lattice structure whose elements essentially consist of a unique stratum, our theorem gives as a special case the well-known …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game-theoretic characterization of Boolean grammars",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397510007590",
            "Abstract": "We obtain a simple, purely game-theoretic characterization of Boolean grammars [A. Okhotin, Boolean grammars, Information and Computation, 194(1) (2004) 19–48]. In particular, we propose a two-player infinite game of perfect information for Boolean grammars, which is equivalent to their well-founded semantics. The game is directly applicable to the simpler classes of conjunctive and context-free grammars, and offers a promising new connection between game theory and formal languages.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A transformation technique for datalog programs based on non-deterministic constructs",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45607-4_2",
            "Abstract": "Recently, a novel transformation technique for Datalog programs, called the branching-time transformation, was introduced by the authors. In this paper we propose a significant extension of the branching-time transformation which we believe opens up a promising new direction of research in the area of value-propagating Datalog optimizations. One of the novel characteristics of the proposed approach is that the target language is DatalognS extended with choice predicates, a form of non-deterministic construct that was originally introduced in the area of intensional logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A value-propagating transformation technique for Datalog programs based on non-deterministic constructs",
            "Publication year": 2006,
            "Publication url": "https://content.iospress.com/articles/fundamenta-informaticae/fi72-4-04",
            "Abstract": "The branching-time transformation is a recent technique for optimizing Chain Datalog programs. In this paper we propose a significant extension of the branching-time transformation which we believe opens up a promising new direction of research in the area of value-propagating Datalog optimizations. More specifically, the proposed transformation can handle more general programs that allow multiple consumptive occurrences of variables in the bodies of clauses. This extension is achieved by using as target language the temporal logic programming formalism Datalog [TeX:] _ {nS} enriched with choice predicates (a non-deterministic construct that was originally introduced in the area of intensional logic programming). We demonstrate the correctness of the transformation and propose several optimizations that can be applied to the target code. Moreover, we define a bottom-up proof procedure that applies to …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:aqlVkmm33-oC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A sufficient condition for strong equivalence under the well-founded semantics",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11562931_35",
            "Abstract": "We consider the problem of strong equivalence [1] under the infinite-valued semantics [2] (which is a purely model-theoretic version of the well-founded semantics). We demonstrate that two programs are now strongly equivalent if and only if they are logically equivalent under the infinite-valued logic of [2]. In particular, we show that for propositional programs strong equivalence is decidable but coNP-complete. Our results have a direct practical implication for the well-founded semantics since, as we demonstrate, if two programs are strongly equivalent under the infinite-valued semantics, then they are also strongly equivalent under the well-founded semantics.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extensional higher-order logic programming",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15675-5_10",
            "Abstract": "We propose a purely extensional semantics for higher-order logic programming. Under this semantics, every program has a unique minimum Herbrand model which is the greatest lower bound of all Herbrand models of the program and the least fixed-point of the immediate consequence operator of the program. We also propose an SLD-resolution proof procedure which is sound and complete with respect to the minimum model semantics. In other words, we provide a purely extensional theoretical framework for higher-order logic programming which generalizes the familiar theory of classical (first-order) logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Logical Characterization of the Preferred Models of Logic Programs with Ordered Disjunction",
            "Publication year": 2021,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/logical-characterization-of-the-preferred-models-of-logic-programs-with-ordered-disjunction/30FE6A8BBDA95785CE6892FAE77D69FF",
            "Abstract": "Logic programs with ordered disjunction (LPODs) extend classical logic programs with the capability of expressing alternatives with decreasing degrees of preference in the heads of program rules. Despite the fact that the operational meaning of ordered disjunction is clear, there exists an important open issue regarding its semantics. In particular, there does not exist a purely model-theoretic approach for determining the most preferred models of an LPOD. At present, the selection of the most preferred models is performed using a technique that is not based exclusively on the models of the program and in certain cases produces counterintuitive results. We provide a novel, model-theoretic semantics for LPODs, which uses an additional truth value in order to identify the most preferred models of a program. We demonstrate that the proposed approach overcomes the shortcomings of the traditional semantics of …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "General Logic Programs as Infinite Games",
            "Publication year": 2008,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2008/1651/",
            "Abstract": "In [vE86] MH van Emden introduced a simple game semantics for definite logic programs. Recently [RW05, GRW05], the authors extended this game to apply to logic programs with negation. Moreover, under the assumption that the programs have a finite number of rules, it was demonstrated in [RW05, GRW05] that the game is equivalent to the well-founded semantics of negation. In this paper we present work-in-progress towards demonstrating that the game of [RW05, GRW05] is equivalent to the well-founded semantics even in the case of programs that have a countably infinite number of rules. We argue however that in this case the proof of correctness has to be more involved. More specifically, in order to demonstrate that the game is correct one has to define a refined game in which each of the two players in his first move makes a bet in the form of a countable ordinal. Each ordinal can be considered as a kind of clock that imposes a\" time limit\" to the moves of the corresponding player. We argue that this refined game can be used to give the proof of correctness for the countably infinite case.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:dhFuZR0502QC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Constructive negation in extensional higher-order logic programming",
            "Publication year": 2014,
            "Publication url": "https://www.aaai.org/ocs/index.php/KR/KR14/paper/viewPaper/7995",
            "Abstract": "Extensional higher-order logic programming has been recently proposed as an interesting extension of classical logic programming. An important characteristic of the new paradigm is that it preserves all the well-known properties oftraditional logic programming. In this paper we enhance extensional higher-order logic programming with constructive negation. We argue that the main ideas underlying constructive negation are quite close to the existing proof procedurefor extensional higher-order logic programming and for this reason the two notions amalgamate quite conveniently. We demonstrate the soundness of the resulting proof procedure and describe an actual implementation of a language that embodies the above ideas. In this way we obtain the first (to our knowledge) higher-order logic programming language supporting constructive negation and offering a new style of programming that genuinely extends that of traditional logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview of an abstract fixed point theory for non-monotonic functions and its applications to logic programming",
            "Publication year": 2017,
            "Publication url": "http://cyber.bibl.u-szeged.hu/index.php/actcybern/article/view/3927",
            "Abstract": "The purpose of the present paper is to give an overview of our joint work with Zoltán Ésik, namely the development of an abstract fixed point theory for a class of non-monotonic functions [4] and its use in providing a novel denotational semantics for a very broad extension of classical logic programming [1]. Our purpose is to give a high-level presentation of the main developments of these two works, that avoids as much as possible the underlying technical details, and which can be used as a mild introduction to the area.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Game Semantics for Non-monotonic Intensional Logic Programming",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40564-8_33",
            "Abstract": " Intensional logic programming is an extension of logic programming based on intensional logic, which includes as special cases both temporal and modal logic programming. In [OW92], M. Orgun and W. W. Wadge provided a general framework for capturing the semantics of intensional logic programming languages. One key property involved in the construction of [OW92], is the monotonicity of intensional operators. In this paper we consider intensional logic programming from a game-theoretic perspective. In particular we define a two-person game and we demonstrate that it is equivalent to the semantics of [OW92]. More importantly, we demonstrate that the game is even applicable to intensional languages with non-monotonic operators. In this way we provide the first (to our knowledge) general semantic framework for capturing the semantics of non-monotonic intensional logic programming.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "ADDING MULTIDIMENSIONALITY TO PROCEDURAL",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=9MFUDwAAQBAJ&oi=fnd&pg=PA274&dq=info:Uz5ci3IiDDMJ:scholar.google.com&ots=mXqpBK-Wv7&sig=XgSeil8rjWcTKAkU2HmZhicX7Fs",
            "Abstract": "Multidimensional programming” is a recent programming paradigm which is especially appropriate for expressing problems which involve entities that vary along different dimensions. Many such problems exist in various areas such as scientific computing, signal and image processing, data processing, and so on***. One of the most serious obstacles in the wider use of multidimensional languages is the fact that they interface poorly with existing procedural programming languages and systems. As a result, multidimensional languages can not take advantage of advanced features that have been developed for traditional languages. On the other hand, conventional languages lack the problem expressing capabilities of multidimensional languages. This paper proposes the embedding of multidimensional programs into conventional programming languages by viewing such programs as defining lazy multidimensional arrays. A lazy array is one whose entries are filled on demand (and not eagerly as in conventional languages). The proposed ap-",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:g5m5HwL7SMYC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Efficient intensional implementation for lazy functional languages",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11786-008-0047-5.pdf",
            "Abstract": "The intensional transformation is a technique that can be used in order to eliminate higher-order functions from a functional program by introducing appropriate context-manipulation operators. The transformation can be applied to a significant class of higher-order programs and results in equivalent zero-order intensional programs that can be executed in a simple demand-driven way. Despite its simplicity, the transformation has never been seriously evaluated with respect to its efficiency and potential. Certain simple implementations of the technique have been performed, but questions regarding the merits of the method have remained inconclusive. In this paper we demonstrate that the transformation can be efficiently implemented by using what we call lazy activation records, namely activation records in which some entries are filled on-demand. An evaluation of our implementation demonstrates that the …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:8k81kl-MbHgC",
            "Publisher": "SP Birkhäuser Verlag Basel"
        },
        {
            "Title": "Well-founded semantics for Boolean grammars",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0890540109001473",
            "Abstract": "Boolean grammars [A. Okhotin, Boolean grammars, Information and Computation 194 (1)(2004) 19–48] are a promising extension of context-free grammars that supports conjunction and negation in rule bodies. In this paper, we give a novel semantics for Boolean grammars which applies to all such grammars, independently of their syntax. The key idea of our proposal comes from the area of negation in logic programming, and in particular from the so-called well-founded semantics which is widely accepted in this area to be the “correct” approach to negation. We show that for every Boolean grammar there exists a distinguished (three-valued) interpretation of the non-terminal symbols, which satisfies all the rules of the grammar and at the same time is the least fixed-point of an operator associated with the grammar. Then, we demonstrate that every Boolean grammar can be transformed into an equivalent …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:qjMakFHDy7sC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A stratification test for temporal logic programs",
            "Publication year": 2001,
            "Publication url": "http://users.ionio.gr/~manolis/papers/pls01.pdf",
            "Abstract": "In this paper, we propose a new stratification test for linear-time temporal logic programs. More specifically, we extend the cycle-sum test Ron01] to take into account negatively signed edges in the cycle-sum graph. In this way we broaden the class of temporal logic programs which are acceptable by the test. Moreover, we demonstrate that the cycle-sum test can be used to decide local statification for a broad class of temporal logic programs.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Minimum model semantics for logic programs with negation-as-failure",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1055686.1055694",
            "Abstract": "We give a purely model-theoretic characterization of the semantics of logic programs with negation-as-failure allowed in clause bodies. In our semantics, the meaning of a program is, as in the classical case, the unique minimum model in a program-independent ordering. We use an expanded truth domain that has an uncountable linearly ordered set of truth values between False (the minimum element) and True (the maximum), with a Zero element in the middle. The truth values below Zero are ordered like the countable ordinals. The values above Zero have exactly the reverse order. Negation is interpreted as reflection about Zero followed by a step towards Zero; the only truth value that remains unaffected by negation is Zero. We show that every program has a unique minimum model MP, and that this model can be constructed with a TP iteration which proceeds through the countable ordinals. Furthermore, we …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:d1gkVwhDpl0C",
            "Publisher": "ACM"
        },
        {
            "Title": "Higher-order logic programming: An expressive language for representing qualitative preferences",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167642317301909",
            "Abstract": "We consider the problem of concisely representing and handling preferences in logic programming and relational databases. Our starting point is the well-known proposal developed in [2] which advocates the embedding of first-order preference formulas into relational algebra through a winnow operator that is parameterized by a database relation and a preference formula. We argue that despite its elegance, the above proposal has certain shortcomings: only intrinsic preference formulas are supported, the preference relations and the preference queries are expressed in two different languages, and there is no direct way to define alternative operators beyond winnow. We propose the use of higher-order logic programming as a logical framework that remedies the above deficiencies. In particular, the proposed framework supports both intrinsic and extrinsic preference formulas, it can represent both preference …",
            "Abstract entirety": 0,
            "Author pub id": "a6x5amYAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A limit characterization for the number of spanning trees of graphs",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020019004000778",
            "Abstract": "In this paper we propose a limit characterization of the behaviour of classes of graphs with respect to their number of spanning trees. Let {Gn} be a sequence of graphs G0,G1,G2,… that belong to a particular class. We consider graphs of the form Kn−Gn that result from the complete graph Kn after removing a set of edges that span Gn. We study the spanning tree behaviour of the sequence {Kn−Gn} when n→∞ and the number of edges of Gn scales according to n. More specifically, we define the spanning tree indicator α({Gn}), a quantity that characterizes the spanning tree behaviour of {Kn−Gn}. We derive closed formulas for the spanning tree indicators for certain well-known classes of graphs. Finally, we demonstrate that the indicator can be used to compare the spanning tree behaviour of different classes of graphs (even when their members never happen to have the same number of edges).",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the expressive power of univariate equations over sets of natural numbers",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0890540112000107",
            "Abstract": "Equations of the form X= φ (X) are considered, where the unknown X is a set of natural numbers. The expression φ (X) may contain the operations of set addition, defined as S+ T={m+ n| m∈ S, n∈ T}, union, intersection, as well as ultimately periodic constants. An equation with a non-periodic solution of exponential growth rate is constructed. At the same time it is demonstrated that no sets with super-exponential growth rate can be represented. It is also shown that restricted classes of these equations cannot represent sets with super-linearly growing complements nor sets that are additive bases of order 2. The results have direct implications on the power of unary conjunctive grammars with one nonterminal symbol.",
            "Abstract entirety": 1,
            "Author pub id": "a6x5amYAAAAJ:UebtZRa9Y70C",
            "Publisher": "Academic Press"
        }
    ]
}]