[{
    "name": "Παναγιώτης Μπένος",
    "romanize name": "Panagiotis Benos",
    "School-Department": "Computational and Systems Biology",
    "University": "University of Pittsburgh",
    "Rank": "Καθηγητής",
    "Apella_id": 1128,
    "Scholar name": "Panayiotis (Takis) Benos",
    "Scholar id": "B5NDW0EAAAAJ",
    "Affiliation": "Professor of Computational and Systems Biology",
    "Citedby": 14418,
    "Interests": [
        "causal modeling",
        "gene networks",
        "systems medicine",
        "microbiome",
        "chronic lung diseases"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=B5NDW0EAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Comparison of strategies for scalable causal discovery of latent variable models from mixed data",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s41060-018-0104-3",
            "Abstract": "Modern technologies allow large, complex biomedical datasets to be collected from patient cohorts. These datasets are comprised of both continuous and categorical data (“Mixed Data”), and essential variables may be unobserved in this data due to the complex nature of biomedical phenomena. Causal inference algorithms can identify important relationships from biomedical data; however, handling the challenges of causal inference over mixed data with unmeasured confounders in a scalable way is still an open problem. Despite recent advances into causal discovery strategies that could potentially handle these challenges; individually, no study currently exists that comprehensively compares these approaches in this setting. In this paper, we present a comparative study that addresses this problem by comparing the accuracy and efficiency of different strategies in large, mixed datasets with latent …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Abstract A1-14: Discovery of a functional SNP in an estrogen receptor binding site in the IGF1R gene",
            "Publication year": 2015,
            "Publication url": "https://cancerres.aacrjournals.org/content/75/22_Supplement_1/A1-14.short",
            "Abstract": "Estrogen receptor (ER) positive luminal breast cancer represents approx 70% of all newly diagnosed breast cancers. ER is known to drive breast cancer development and progression, and targeting ER has been one of the most successful targeted therapies in oncology. Given the paucity of functional DNA sequence variants (DSVs) within the ER in primary breast tumors, we asked whether DSVs in ER binding sites could contribute to altered hormone response through changes in ER recruitment to DNA.We developed a pipeline to extract DSVs in ER binding sites, and to assess their impact on ER binding in a genome-wide manner, using ChIP-seq data from hormone responsive breast cancer cells. We utilized MACS for peak calling and GATK for calling DSVs including SNVs and short indels. Using 22,143 ER binding sites which overlapped in at least six data sets, we detected 1,409,406 DSVs from 441,855,039 …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:dshw04ExmUIC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Integration of Genome-Wide MicroRNA and mRNA Expression Profiles in Pulmonary Arterial Hypertension and Pulmonary Hypertension Associated with Idiopathic Pulmonary Fibrosis",
            "Publication year": 2011,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.124.suppl_21.a15511",
            "Abstract": "Objective: To determine the role of microRNAs in the pathogenesis of pulmonary arterial hypertension (PAH).Background: PAH is a life-threatening condition characterized by pulmonary arteriolar remodeling, progressive elevation of pulmonary artery pressure, and right heart failure. The genomic mechanisms of PAH remain ill defined. We have recently reported genome-wide lung tissue mRNA expression changes associated with PAH and pulmonary hypertension (PH) associated with idiopathic pulmonary fibrosis (IPF). We now report expression changes of microRNAs, which are small RNAs that play a key role in the post transcriptional regulation of mRNAs.Methods: Using microarrays, we generated microRNA expression profiles in lung tissue from subjects with PAH (n = 18), PH associated with IPF (n = 5), and normal controls (n = 10); and integrated these microRNA expression data with our previously …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Extracting biologically significant patterns from short time series gene expression data",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-10-255",
            "Abstract": "Time series gene expression data analysis is used widely to study the dynamics of various cell processes. Most of the time series data available today consist of few time points only, thus making the application of standard clustering techniques difficult. We developed two new algorithms that are capable of extracting biological patterns from short time point series gene expression data. The two algorithms, ASTRO and MiMeSR, are inspired by the rank order preserving framework and the minimum mean squared residue approach, respectively. However, ASTRO and MiMeSR differ from previous approaches in that they take advantage of the relatively few number of time points in order to reduce the problem from NP-hard to linear. Tested on well-defined short time expression data, we found that our approaches are robust to noise, as well as to random patterns, and that they can correctly detect the temporal …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:YOwf2qJgpHMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Identification of Cell Populations with Increase Expression of Markers of Cell Senescence in Explanted IPF Lungs",
            "Publication year": 2018,
            "Publication url": "https://erj.ersjournals.com/content/52/suppl_62/PA3714.abstract",
            "Abstract": "Cellular senescence is characterized by cell cycle arrest associated with apoptosis resistance and secretion of senescence-associated secretory phenotype (SASP), which includes many cytokines, growth factors and proteases. Telomere attrition, DNA damage and mitochondrial dysfunction are believed to drive to the accumulation of senescent cells with aging by induction of cell cycle-related inhibitory proteins such as p53, p21 and p16INK4a. Our previous published work shows that fibroblasts from IPF lungs have a senescence phenotype characterized by positive staining for SA-βGal, higher expression of inhibitors of cell cycle and expression of SASP factors. To examine potential differential gene expression patterns in specific lung cell compartments in IPF lungs we have performed preliminary studies of single cell RNA-seq in lung cell suspensions of 3 IPF patients using 10x v2 chemistry. Analysis focused in …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:b1wdh0AR-JQC",
            "Publisher": "European Respiratory Society"
        },
        {
            "Title": "Towards Understanding Spatial Lung Tissue Heterogeneity In Idiopathic Pulmonary Fibrosis (ipf)",
            "Publication year": 2017,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A2384",
            "Abstract": "Methods.H&E slides and the rest to perform RNA-seq (Fig. 1A). H&E slides were scanned using Aperio. cDNA libraries were prepared from 20ng total RNA and sequenced by Ion Torrent Proton Sequencer (~ 20 million single-end~ 100bp reads/sample). Reads were mapped to UCSC hg19 human genome. Cufflinks was used to calculate Fragments per Kilobase per Million (FPKM). We developed new histological image processing methods to (i) characterize fibrosis and other salient spatial phenotypic features in IPF tissues,(ii) quantify disease heterogeneity and (iii) classify IPF samples from controls. We also used a Mixed Graphical Model (MGM-Learn) algorithm to make causal inferences between histopathological image features, RNA-seq and clinical data (FEV%, DLCO%).",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:tKAzc9rXhukC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "microRNA (miRNA) expression profiling predicts clinical outcome of carboplatin/paclitaxel-based therapy (CP) in metastatic melanoma (MM) treated on the intergroup trial E2603.",
            "Publication year": 2014,
            "Publication url": "https://ascopubs.org/doi/abs/10.1200/jco.2014.32.15_suppl.9048",
            "Abstract": "9048 Background:  Chemotherapy continues to be a commonly used modality in MM despite the recent successes of immunotherapy and targeted therapy. CP with or without sorafenib (S) results in objective response rates of 16-18% in unselected chemotherapy-naïve patients (intergroup trial E2603). Our primary objective was to identify molecular predictors of survival and response to CP-based chemotherapy in MM.  Methods:  E2603 randomized 823 MM pts to CP+S vs CP alone. This analysis was performed on pre-treatment formalin fixed paraffin-embedded (FFPE) tumor tissues from 115 pts balanced across treatment arms, BRAF status, and clinical outcome. We used technology optimized for FFPE samples: Nanostring miRNA expression array and DASL/Illumina microarrays (HT12 v4) for mRNA expression. Integrative analysis was performed using a novel Tree-guided Recursive Cluster Selection (T-ReCS …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:CHSYGLWDkRkC",
            "Publisher": "American Society of Clinical Oncology"
        },
        {
            "Title": "Biclustering of DNA microarray data: theory, evaluation, and applications",
            "Publication year": 2013,
            "Publication url": "https://www.igi-global.com/chapter/content/76082",
            "Abstract": "In this chapter, different methods and applications of biclustering algorithms to DNA microarray data analysis that have been developed in recent years are discussed and compared. Identification of biological significant clusters of genes from microarray experimental data is a very daunting task that emerged, especially with the development of high throughput technologies. Various computational and evaluation methods based on diverse principles were introduced to identify new similarities among genes. Mathematical aspects of the models are highlighted, and applications to solve biological problems are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Footer: a quantitative comparative genomics method for efficient recognition of cis-regulatory elements",
            "Publication year": 2005,
            "Publication url": "https://genome.cshlp.org/content/15/6/840.short",
            "Abstract": "The search for mammalian DNA regulatory regions poses a challenging problem in computational biology. The short length of the DNA patterns compared with the size of the promoter regions and the degeneracy of the patterns makes their identification difficult. One way to overcome this problem is to use evolutionary information to reduce the number of false-positive predictions. We developed a novel method for pattern identification that compares a pair of putative binding sites in two species (e.g., human and mouse) and assigns two probability scores based on the relative position of the sites in the promoter and their agreement with a known model of binding preferences. We tested the algorithm's ability to predict known binding sites on various promoters. Overall, it exhibited 83% sensitivity and the specificity was 72%, which is a clear improvement over existing methods. Our algorithm also successfully predicted …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Cold Spring Harbor Lab"
        },
        {
            "Title": "Regulation of alveolar septation by microRNA-489",
            "Publication year": 2016,
            "Publication url": "https://journals.physiology.org/doi/abs/10.1152/ajplung.00145.2015%40apsselect.2016.3.issue-2",
            "Abstract": "MicroRNAs (miRs) are small conserved RNA that regulate gene expression. Bioinformatic analysis of miRNA profiles during mouse lung development indicated a role for multiple miRNA, including miRNA-489. miR-489 increased on completion of alveolar septation [postnatal day 42 (P42)], associated with decreases in its conserved target genes insulin-like growth factor-1 (Igf1) and tenascin C (Tnc). We hypothesized that dysregulation of miR-489 and its target genes Igf1 and Tnc contribute to hyperoxia-induced abnormal lung development. C57BL/6 mice were exposed to normoxia (21%) or hyperoxia (85% O2) from P4 to P14, in combination with intranasal locked nucleic acid against miR-489 to inhibit miR-489, cytomegalovirus promoter (pCMV)-miR-489 to overexpress miR-489, or empty vector. Hyperoxia reduced miR-489 and increased Igf1 and Tnc. Locked nucleic acid against miR-489 improved lung …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:UxriW0iASnsC",
            "Publisher": "American Physiological Society"
        },
        {
            "Title": "Aldosterone regulates microRNAs in the cortical collecting duct to alter sodium transport (vol 26, pg 1476, 2015)",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=2674338330261800642&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "AMER SOC NEPHROLOGY"
        },
        {
            "Title": "Mir 30b As A Potential Modifier Of Fibroblasts Phenotypes In Lung Fibrosis",
            "Publication year": 2011,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2011.183.1_MeetingAbstracts.A3528",
            "Abstract": "Introduction: pulmonary fibrosis (IPF), a chronic progressive and lethal lung disease. We have previously shown that transfection of human fetal lung fibroblasts with epithelial miRNA (let-7d) affected gene expression and reduced their mesenchymal properties. The aim of this study was to determine whether over expression of mir30b in fibroblasts have anti-fibrotic properties. Two types of fibroblasts, primary human fetal lung fibroblasts or the ATCC cell line HFF-1 (human foreskin) were transfectedMethods: with pre-miR30b. We used Agilent Human Expression Arrays and quantitative RT-PCR (qRT-PCR) to analyze gene expression. Functional parameters such as: cell morphology, proliferation, senescence and mobility were also examined using [3H]-thymidine incorporation assay, Senescence Detection Kit (abcam) and Boyden chamber assay (Matrigel inserts with 8-µm pores). Transfected cells with mir-30b …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:zA6iFVUQeVQC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "The role and regulation of miR-154 microRNA family in lung fibrosis",
            "Publication year": 2010,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2010.181.1_MeetingAbstracts.A2019",
            "Abstract": "Rationale activation of developmental pathways. We have previously demonstrated significant and biologically relevant down-regulation of microRNAs in IPF. In this study we focus on up-regulated microRNAs in IPF.: We analyzed the expression of microRNAs in IPF lungs and identified 26 significantly (p< 0.05) up-regulated",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:rO6llkc54NcC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Topographic heterogeneity of lung microbiota in end-stage idiopathic pulmonary fibrosis: the Microbiome in Lung Explants-2 (MiLEs-2) study",
            "Publication year": 2021,
            "Publication url": "https://thorax.bmj.com/content/76/3/239.abstract",
            "Abstract": "Lung microbiota profiles in patients with early idiopathic pulmonary fibrosis (IPF) have been associated with disease progression; however, the topographic heterogeneity of lung microbiota and their roles in advanced IPF are unknown.We performed a retrospective, case-control study of explanted lung tissue obtained at the time of lung transplantation or rapid autopsy from patients with IPF and other chronic lung diseases (connective tissue disease-associated interstitial lung disease (CTD-ILD), cystic fibrosis (CF), COPD and donor lungs unsuitable for transplant from Center for Organ Recovery and Education (CORE)). We sampled subpleural tissue and airway-based specimens (bronchial washings and airway tissue) and quantified bacterial load and profiled communities by amplification and sequencing of the 16S rRNA gene.Explants from 62 patients with IPF, 15 patients with CTD …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:XD-gHx7UXLsC",
            "Publisher": "BMJ Publishing Group Ltd"
        },
        {
            "Title": "Causal inference using deep-learning variable selection identifies and incorporates direct and indirect causalities in complex biological systems",
            "Publication year": 2021,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2021.07.17.452800.abstract",
            "Abstract": "In complex diseases, causal structure learning across biological variables is critical to identify modifiable triggers or potential therapeutic agents. A limitation of existing causal learning methods is that they cannot identify indirect causal relations, those that would interact through latent mediating variables. We developed the first computational method that identifies both direct and indirect causalities, causal inference using deep-learning variable-selection (causalDeepVASE). To accurately identify indirect causalities and incorporate them with direct causalities, causalDeepVASE develops a deep neural network approach and extends a flexible causal inference method. In simulated and biological data of various contexts, causalDeepVASE outperforms existing methods in identifying expected or validated causal relations. Further, causalDeepVASE facilitates a systematic understanding of complex diseases. For example, causalDeepVASE uniquely identified a possible causal relation between IFNγ and creatinine suggested in a polymicrobial sepsis model. In future biomedical studies, causalDeepVASE can facilitate the identification of driver genes and therapeutic agents.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Web-Based Primer Design Software for Genome-Scale Genotyping by Pyrosequencing®",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1385/1-59745-377-3:25.pdf",
            "Abstract": "Design of locus-specific primers for use during genetic analysis requires combining information from multiple sources and can be a time-consuming process when validating large numbers of assays. Data warehousing of genomic DNA sequences and genetic variations when coupled with software applications for optimizing the generation of locus-specific primers can increase the efficiency of assay development. Selection of oligonucleotide primers for PCR and Pyrosequencing® (SOP3) software allows user-directed queries of warehoused data collected from the human and mouse genome sequencing projects. The software automates collection of DNA sequence flanking single-nucleotide polymorphisms (SNPs) as well as the incorporation of locus-associated functional information, such as whether the SNP occurs in an exon, intron, or untranslated region. SOP3 software accepts three types of user …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:isC4tDSrTZIC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "High throughput determination of TGFβ1/SMAD3 targets in A549 lung epithelial cells",
            "Publication year": 2011,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0020319",
            "Abstract": "Background Transforming growth factor beta 1 (TGFβ1) plays a major role in many lung diseases including lung cancer, pulmonary hypertension, and pulmonary fibrosis. TGFβ1 activates a signal transduction cascade that results in the transcriptional regulation of genes in the nucleus, primarily through the DNA-binding transcription factor SMAD3. The objective of this study is to identify genome-wide scale map of SMAD3 binding targets and the molecular pathways and networks affected by the TGFβ1/SMAD3 signaling in lung epithelial cells.   Methodology We combined chromatin immunoprecipitation with human promoter region microarrays (ChIP-on-chip) along with gene expression microarrays to study global transcriptional regulation of the TGFβ1/SMAD3 pathway in human A549 alveolar epithelial cells. The molecular pathways and networks associated with TGFβ1/SMAD3 signaling were identified using computational approaches. Validation of selected target gene expression and direct binding of SMAD3 to promoters were performed by quantitative real time RT-PCR and electrophoretic mobility shift assay on A549 and human primary lung epithelial cells.   Results and Conclusions Known TGFβ1 target genes such as SERPINE1, SMAD6, SMAD7, TGFB1 and LTBP3, were found in both ChIP-on-chip and gene expression analyses as well as some previously unrecognized targets such as FOXA2. SMAD3 binding of FOXA2 promoter and changed expression were confirmed. Computational approaches combining ChIP-on-chip and gene expression microarray revealed multiple target molecular pathways affected by the TGFβ1/SMAD3 …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Compensatory hepatic adaptation accompanies permanent absence of intrahepatic biliary network due to YAP1 loss in liver progenitors",
            "Publication year": 2021,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.10.21.349159v2.abstract",
            "Abstract": "YAP1 regulates cell plasticity during liver injury, regeneration and cancer, but its role in liver development is unknown. YAP1 activity was detected in biliary cells and in cells at the hepato-biliary bifurcation in single-cell RNA-sequencing analysis of developing livers. Hepatoblast deletion of Yap1 led to no impairment in Notch-driven SOX9+ ductal plate formation, but prevented the formation of the abutting second layer of SOX9+ ductal cells, blocking the formation of a patent intrahepatic biliary tree. Intriguingly, the mice survived for 8 months with severe cholestatic injury and without any hepatocyte-to-biliary transdifferentiation. Ductular reaction in the perihilar region suggested extrahepatic biliary proliferation likely seeking the missing intrahepatic biliary network. Long-term survival of these mice occurred through hepatocyte adaptation via reduced metabolic and synthetic function including altered bile acid metabolism and transport. Overall, we show YAP1 as a key regulator of bile duct development while highlighting a profound adaptive capability of hepatocytes.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:4MWp96NkSFoC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Mesenchymal glioma stem cells are maintained by activated glycolytic metabolism involving aldehyde dehydrogenase 1A3",
            "Publication year": 2013,
            "Publication url": "https://www.pnas.org/content/110/21/8644.short",
            "Abstract": "Tumor heterogeneity of high-grade glioma (HGG) is recognized by four clinically relevant subtypes based on core gene signatures. However, molecular signaling in glioma stem cells (GSCs) in individual HGG subtypes is poorly characterized. Here we identified and characterized two mutually exclusive GSC subtypes with distinct dysregulated signaling pathways. Analysis of mRNA profiles distinguished proneural (PN) from mesenchymal (Mes) GSCs and revealed a pronounced correlation with the corresponding PN or Mes HGGs. Mes GSCs displayed more aggressive phenotypes in vitro and as intracranial xenografts in mice. Further, Mes GSCs were markedly resistant to radiation compared with PN GSCs. The glycolytic pathway, comprising aldehyde dehydrogenase (ALDH) family genes and in particular ALDH1A3, were enriched in Mes GSCs. Glycolytic activity and ALDH activity were significantly elevated in …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:RYcK_YlVTxYC",
            "Publisher": "National Academy of Sciences"
        },
        {
            "Title": "A pipeline for integrated theory and data-driven modeling of genomic and clinical data",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2005.02521",
            "Abstract": "High throughput genome sequencing technologies such as RNA-Seq and Microarray have the potential to transform clinical decision making and biomedical research by enabling high-throughput measurements of the genome at a granular level. However, to truly understand causes of disease and the effects of medical interventions, this data must be integrated with phenotypic, environmental, and behavioral data from individuals. Further, effective knowledge discovery methods that can infer relationships between these data types are required. In this work, we propose a pipeline for knowledge discovery from integrated genomic and clinical data. The pipeline begins with a novel variable selection method, and uses a probabilistic graphical model to understand the relationships between features in the data. We demonstrate how this pipeline can improve breast cancer outcome prediction models, and can provide a biologically interpretable view of sequencing data.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MC13-0078 PARP1 variants associated with response to Temozolomide in metastatic melanoma patients",
            "Publication year": 2013,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-af117609-bb97-3dfb-95c9-5a28dfbc9cbe",
            "Abstract": "MC13-0078 PARP1 variants associated with response to Temozolomide in metastatic \nmelanoma patients × Close The Infona portal uses cookies, ie strings of text saved by a \nbrowser on the user's device. The portal can access those files and use them to remember the \nuser's data, such as their chosen settings (screen view, interface language, etc.), or their login \ndata. By using the Infona portal the user accepts automatic saving and using this information for \nportal operation purposes. More information on the subject can be found in the Privacy Policy \nand Terms of Service. By closing this window the user confirms that they have read the \ninformation on cookie usage, and they accept the privacy policy and the way cookies are used \nby the portal. You can change the cookie settings in your browser. I accept Polski English Login \nor register account remember me Password recovery INFONA - science communication portal -I…",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Genome-wide interaction study of dust mite allergen on lung function in children with asthma",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0091674917301549",
            "Abstract": "Childhood asthma is likely the result of gene-by-environment (G × E) interactions. Dust mite is a known risk factor for asthma morbidity. Yet, there have been no genome-wide G × E studies of dust mite allergen on asthma-related phenotypes.We sought to identify genetic variants whose effects on lung function in children with asthma are modified by the level of dust mite allergen exposure.A genome-wide interaction analysis of dust mite allergen level and lung function was performed in a cohort of Puerto Rican children with asthma (Puerto Rico Genetics of Asthma and Lifestyle [PRGOAL]). Replication was attempted in 2 independent cohorts, the Childhood Asthma Management Program (CAMP) and the Genetics of Asthma in Costa Rica Study.Single nucleotide polymorphism (SNP) rs117902240 showed a significant interaction effect on FEV1 with dust mite allergen level in …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:LI9QrySNdTsC",
            "Publisher": "Mosby"
        },
        {
            "Title": "Rna Sequencing Of Bronchoalveolar Lavage Cells In Subjects With Sarcoidosis Reveals Gene Expression Patterns Associated With Advanced Scadding Stage And Treatment Effects",
            "Publication year": 2017,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A1056",
            "Abstract": "Introduction: involvement. To better understand the genomic networks underlying this classification we analyzed the association of gene expression changes in bronchoalveolar lavage (BAL) cells by with the Scadding stage in a cohort of well characterized subjects with sarcoidosis.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "An insulin-responsive sensor in the SIRT1 disordered region binds DBC1 and PACS-2 to control enzyme activity",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1097276518308396",
            "Abstract": "Current models of SIRT1 enzymatic regulation primarily consider the effects of fluctuating levels of its co-substrate NAD+, which binds to the stably folded catalytic domain. By contrast, the roles of the sizeable disordered N- and C-terminal regions of SIRT1 are largely unexplored. Here we identify an insulin-responsive sensor in the SIRT1 N-terminal region (NTR), comprising an acidic cluster (AC) and a 3-helix bundle (3HB), controlling deacetylase activity. The allosteric assistor DBC1 removes a distal N-terminal shield from the 3-helix bundle, permitting PACS-2 to engage the acidic cluster and the transiently exposed helix 3 of the 3-helix bundle, disrupting its structure and inhibiting catalysis. The SIRT1 activator (STAC) SRT1720 binds and stabilizes the 3-helix bundle, protecting SIRT1 from inhibition by PACS-2. Identification of the SIRT1 insulin-responsive sensor and its engagement by the DBC1 and PACS-2 …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:hkOj_22Ku90C",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Next-Generation Sequencing of the Respiratory Microbiome as a Diagnostic Tool of Severe Bacterial Pneumonia in Mechanically Ventilated Patients",
            "Publication year": 2018,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2018.197.1_MeetingAbstracts.A4177",
            "Abstract": "RATIONALE: Current diagnosis of severe bacterial pneumonia relies on identification of causative pathogens by microbiologic cultures, which require extended incubation periods and have limited sensitivity. Next-generation sequencing of microbial DNA directly from patient samples may improve diagnostic accuracy and lead to timely, tailored antibiotic prescriptions. OBJECTIVE: To examine whether bacterial 16S rRNA sequencing would improve respiratory pathogen detection in mechanically-ventilated patients and correlate with host-responses. METHODS: We prospectively recruited mechanically ventilated patients with acute respiratory failure within 72hrs from intubation. We collected mouth swabs (oral) and tracheal aspirates (lung) for bacterial DNA extraction and 16S rRNA gene sequencing (V4 region), and plasma samples for measurement of lung epithelial injury (RAGE) and host-inflammation (IL-6 …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:9vf0nzSNQJEC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Large scale comparison of innate responses to viral and bacterial pathogens in mouse and macaque",
            "Publication year": 2011,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0022401",
            "Abstract": "Viral and bacterial infections of the lower respiratory tract are major causes of morbidity and mortality worldwide. Alveolar macrophages line the alveolar spaces and are the first cells of the immune system to respond to invading pathogens. To determine the similarities and differences between the responses of mice and macaques to invading pathogens we profiled alveolar macrophages from these species following infection with two viral (PR8 and Fuj/02 influenza A) and two bacterial (Mycobacterium tuberculosis and Francisella tularensis Schu S4) pathogens. Cells were collected at 6 time points following each infection and expression profiles were compared across and between species. Our analyses identified a core set of genes, activated in both species and across all pathogens that were predominantly part of the interferon response pathway. In addition, we identified similarities across species in the way innate immune cells respond to lethal versus non-lethal pathogens. On the other hand we also found several species and pathogen specific response patterns. These results provide new insights into mechanisms by which the innate immune system responds to, and interacts with, invading pathogens.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:r0BpntZqJG4C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "From DNA Motifs to Gene Networks: A Review of Physical Interaction Models",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UO3VM58KLrkC&oi=fnd&pg=PA283&dq=info:ZfkBi9xPfpoJ:scholar.google.com&ots=J-DDq9u-PV&sig=RoNaowkulf9Z1665oaz0ACUIaME",
            "Abstract": "Understanding the interactions between biomolecules within a cell and between cells and their environment is one of the major challenges in computational biology. Although every cell in an organism contains the same genetic material, its expression profile depends on the tissue type, developmental stage, and the extracellular signals it receives at the given point in time. Cells exert various ways to regulate the expression of their genes. Chromatin structure, for example, can make large parts of the genome transcriptionally silent or potentially active. Also, posttranscriptional and posttranslational mechanisms can influence the amount and the activity of the available proteins and noncoding genes in a cell. The best studied mechanism for gene expression control, however, is the transcription regulation at the individual",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:dhFuZR0502QC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Bifurcated monocyte states are predictive of mortality in severe COVID-19",
            "Publication year": 2021,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2021.02.10.430499v1.abstract",
            "Abstract": "Coronavirus disease 2019 (COVID-19) caused by SARS-CoV-2 infection presents with varied clinical manifestations, ranging from mild symptoms to acute respiratory distress syndrome (ARDS) with high mortality. Despite extensive analyses, there remains an urgent need to delineate immune cell states that contribute to mortality in severe COVID-19. We performed high-dimensional cellular and molecular profiling of blood and respiratory samples from critically ill COVID-19 patients to define immune cell genomic states that are predictive of outcome in severe COVID-19 disease. Critically ill patients admitted to the intensive care unit (ICU) manifested increased frequencies of inflammatory monocytes and plasmablasts that were also associated with ARDS not due to COVID-19. Single-cell RNAseq (scRNAseq)-based deconvolution of genomic states of peripheral immune cells revealed distinct gene modules that were associated with COVID-19 outcome. Notably, monocytes exhibited bifurcated genomic states, with expression of a cytokine gene module exemplified by CCL4 (MIP-1β) associated with survival and an interferon signaling module associated with death. These gene modules were correlated with higher levels of MIP-1β and CXCL10 levels in plasma, respectively. Monocytes expressing genes reflective of these divergent modules were also detectable in endotracheal aspirates. Machine learning algorithms identified the distinctive monocyte modules as part of a multivariate peripheral immune system state that was predictive of COVID-19 mortality. Follow-up analysis of the monocyte modules on ICU day 5 was consistent with bifurcated …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "DNA familial binding profiles made easy: comparison of various motif alignment and clustering strategies",
            "Publication year": 2007,
            "Publication url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.0030061",
            "Abstract": "Transcription factor (TF) proteins recognize a small number of DNA sequences with high specificity and control the expression of neighbouring genes. The evolution of TF binding preference has been the subject of a number of recent studies, in which generalized binding profiles have been introduced and used to improve the prediction of new target sites. Generalized profiles are generated by aligning and merging the individual profiles of related TFs. However, the distance metrics and alignment algorithms used to compare the binding profiles have not yet been fully explored or optimized. As a result, binding profiles depend on TF structural information and sometimes may ignore important distinctions between subfamilies. Prediction of the identity or the structural class of a protein that binds to a given DNA pattern will enhance the analysis of microarray and ChIP–chip data where frequently multiple putative targets of usually unknown TFs are predicted. Various comparison metrics and alignment algorithms are evaluated (a total of 105 combinations). We find that local alignments are generally better than global alignments at detecting eukaryotic DNA motif similarities, especially when combined with the sum of squared distances or Pearson's correlation coefficient comparison metrics. In addition, multiple-alignment strategies for binding profiles and tree-building methods are tested for their efficiency in constructing generalized binding models. A new method for automatic determination of the optimal number of clusters is developed and applied in the construction of a new set of familial binding profiles which improves upon TF classification …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Whole Transcriptome Study Of Mesenchymal Stem Cell Response To TGF-Beta 1",
            "Publication year": 2011,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2011.183.1_MeetingAbstracts.A6007",
            "Abstract": "Rationale: Adult mesenchymal Stem Cell (MSC) treatment has been suggested as a potential therapy for several lung diseases including idiopathic pulmonary fibrosis (IPF), a chronic, progressive and often lethal lung disease. The precise molecular mechanisms underlying MSC's beneficial effects are still poorly understood. In this study we use gene expression microarrays to determine the effect of TGF-beta 1, the growth factor most implicated in fibrosis, on MSCs gene expression. Methods: Total RNA from TGF-beta-treated mouse MSCs and 3T3 fibroblasts was labeled and hybridized to Agilent Mouse Microarrays. Signal intensities were normalized by cyclic Lowess, and analyzed using the BRB array tool suite. Significance cutoff was defined by a False Discovery Rate (FDR) of 0.05 at a confidence interval of 90%. Results: 1793 genes were regulated by TGF-beta 1 in 3T3 cells compared to 2500 in MSC cells. Of …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:3s1wT3WcHBgC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "D29 UNRAVELING THE EXTRACELLULAR MATRIX: Emt And Matrisome Pathways Are Activated In Structurally Normal Regions In Explanted Lungs Of Idiopathic Pulmonary Fibrosis Patients",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/0c8e21d4161ba0fe7dd128477f026cc6/1?pq-origsite=gscholar&cbl=40575",
            "Abstract": "Idiopathic Pulmonary Fibrosis (IPF) is a chronic progressive lung disease leading to progressive dyspnea and finally death. From each lung, 6 core samples were imaged by micrCT (Skyscan) and measures of surface area/volume (surface density, SD) and Tissue%, together with with total collagen measured on histology, were used to separate samples into Low Fibrosis (LF) which are structurally similar to control lungs, Moderate Fibrosis (MF), and High Fibrosis (HF) regions.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:MLfJN-KU85MC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "From first base: the sequence of the tip of the X chromosome of Drosophila melanogaster, a comparison of two sequencing strategies",
            "Publication year": 2001,
            "Publication url": "https://genome.cshlp.org/content/11/5/710.short",
            "Abstract": "We present the sequence of a contiguous 2.63 Mb of DNA extending from the tip of the X chromosome ofDrosophila melanogaster. Within this sequence, we predict 277 protein coding genes, of which 94 had been sequenced already in the course of studying the biology of their gene products, and examples of 12 different transposable elements. We show that an interval between bands 3A2 and 3C2, believed in the 1970s to show a correlation between the number of bands on the polytene chromosomes and the 20 genes identified by conventional genetics, is predicted to contain 45 genes from its DNA sequence. We have determined the insertion sites ofP-elements from 111 mutant lines, about half of which are in a position likely to affect the expression of novel predicted genes, thus representing a resource for subsequent functional genomic analysis. We compare the European Drosophila Genome Project …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:UebtZRa9Y70C",
            "Publisher": "Cold Spring Harbor Lab"
        },
        {
            "Title": "Host-response subphenotypes offer prognostic enrichment in patients with or at risk for acute respiratory distress syndrome",
            "Publication year": 2019,
            "Publication url": "https://journals.lww.com/ccmjournal/fulltext/2019/12000/Host_Response_Subphenotypes_Offer_Prognostic.7.aspx",
            "Abstract": "Supported, in part, by grants from National Institutes of Health (NIH)(K23 HL139987 [to Dr. Kitsios]; U01 HL098962 [to Dr. Morris]; P01 HL114453 [to Drs. Ray, Mallampalli, and McVerry]; R01 HL097376 [to Drs. Mallampalli and McVerry]; R01 HL116472 [to Dr. Chen]; K24 HL123342 [to Dr. Morris]; U01 HL137159 [to Drs. Manatakis and Benos]; R01 LM012087 [to Drs. Manatakis and Benos]; R01 HL142084 [to Dr. Lee]; R01 HL136143 [to Dr. Lee]; F32 HL137258 [to Dr. Evankovich]; F32 HL142172 [to Dr. Bain]; K08 HS025455 [to Dr. Barbash]; K23 GM122069 [to Dr. Shah]; R35 HL139860 [to Dr. Chen]; and R01 HL133184 [to Dr. Chen]).",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "LWW"
        },
        {
            "Title": "MicroRNAs: Target Prediction and Involvement in Gene Regulatory Networks",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=AElLCgAAQBAJ&oi=fnd&pg=PA291&dq=info:lTVLxWDsmJsJ:scholar.google.com&ots=uptE5bYjzB&sig=VhnRdfN3BsDrXaSUqX7CW4L8cK4",
            "Abstract": "MicroRNAs (miRNAs), the small, noncoding RNA molecules, were first discovered by Victor Ambros in 1993 as negative regulators of C. elegans gene lin-4. They were later identified as key regulators of gene expression in plants and animals. Their role in disease mechanisms and disease prognosis and diagnosis as well as in the precise regulation of the developmental program of many animals has been undisputable. In this chapter, we discuss two key issues related to their function:(1) miRNA: mRNA targeting and (2) miRNA involvement in gene regulatory networks. We present the fundamental principles on which the major computational algorithms are based for predicting miRNA targets and inferring miRNA-involving regulatory networks.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Transcriptomics of bronchoalveolar lavage cells identifies new molecular endotypes of sarcoidosis",
            "Publication year": 2021,
            "Publication url": "https://erj.ersjournals.com/content/early/2021/04/22/13993003.02950-2020.abstract",
            "Abstract": "Sarcoidosis is a multisystem granulomatous disease of unknown origin with a variable and often unpredictable course and pattern of organ involvement. In this study we sought to identify specific bronchoalveolar lavage (BAL) cell gene expression patterns indicative of distinct disease phenotypic traits.RNA sequencing by Ion Torrent Proton was performed on BAL cells obtained from 215 well characterised patients with pulmonary sarcoidosis enrolled in the multicenter Genomic Research in Alpha-1 Antitrypsin Deficiency and Sarcoidosis (GRADS) study. Weighted Gene Co-expression Network Analysis (WGCNA) and non-parametric statistics were used to analyse genome wide BAL transcriptome. Validation of results was performed using a microarray expression data set of an independent sarcoidosis cohort (Freiburg, Germany (n=50)).Our supervised analysis found associations between distinct transcriptional …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:URolC5Kub84C",
            "Publisher": "European Respiratory Society"
        },
        {
            "Title": "Learning mixed graphical models with separate sparsity parameters and stability-based model selection",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/s12859-016-1039-0",
            "Abstract": "Mixed graphical models (MGMs) are graphical models learned over a combination of continuous and discrete variables. Mixed variable types are common in biomedical datasets. MGMs consist of a parameterized joint probability density, which implies a network structure over these heterogeneous variables. The network structure reveals direct associations between the variables and the joint probability density allows one to ask arbitrary probabilistic questions on the data. This information can be used for feature selection, classification and other important tasks. We studied the properties of MGM learning and applications of MGMs to high-dimensional data (biological and simulated). Our results show that MGMs reliably uncover the underlying graph structure, and when used for classification, their performance is comparable to popular discriminative methods (lasso regression and support vector machines). We also …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Rna Sequencing Of Peripheral Blood Mononuclear Cells Reveals Gene Expression Changes Associated With Disease Progression And Response To Therapy In Sarcoidosis",
            "Publication year": 2017,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A1058",
            "Abstract": "Introduction: sarcoidosis subjects by genome scale RNA sequencing to better understand disease progression and severity.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:geHnlv5EZngC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Integrated theory-and data-driven feature selection in gene expression data analysis",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7930120/",
            "Abstract": "The exponential growth of high dimensional biological data has led to a rapid increase in demand for automated approaches for knowledge production. Existing methods rely on two general approaches to address this challenge: 1) the Theorydriven approach, which utilizes prior accumulated knowledge, and 2)the Data-driven approach, which solely utilizes the data to deduce scientific knowledge. Both of these approaches alone suffer from bias toward past/present knowledge, as they fail to incorporate all of the current knowledge that is available to make new discoveries. In this paper, we show how an integrated method can effectively address the high dimensionality of big biological data, which is a major problem for pure datadriven analysis approaches. We realize our approach in a novel two-step analytical workflow that incorporates a new feature selection paradigm as the first step to handling high-throughput …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "In silico discovery of DNA regulatory sites and modules",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-59745-440-7_18",
            "Abstract": "In this chapter we describe methods commonly applied for pattern representation and some analogies to the physical world of protein–DNA interactions. Next we present the general methodology for de novo DNA pattern discovery in a set of promoter sequences with and without prior information and we discuss some well-established algorithms. The common problems of pattern matching, i.e., the prediction of a site based on prior information are discuss along with the contribution of the evolutionary information to the pattern discovery and pattern matching algorithms. Finally, in we introduce the topic of cis-regulatory modules (CRMs) and some of the algorithms designed to find them.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Protecting the lungs but hurting the kidneys: causal inference study for the risk of ventilation-induced kidney injury in ARDS",
            "Publication year": 2020,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc7475484/",
            "Abstract": "The acute respiratory distress syndrome (ARDS) is the most serious form of acute respiratory failure in the intensive care unit (ICU), defined by hypoxemia and bilateral opacities on chest radiographic imaging (1). ARDS can represent the end-result of many different insults—such as sepsis, pneumonia, aspiration or pancreatitis—leading to injury of the alveolar epithelial/endothelial interface with resultant permeability edema (2). Epidemiologically, ARDS accounts for up 10% of all ICU admissions and can be diagnosed in up to 23% of mechanically-ventilated patients (2). Severe ARDS carries 30–40% mortality risk, whereas ARDS survivors often suffer from chronic critical illness and longterm neurocognitive deficits (3). Despite advancements in understanding ARDS pathogenesis, no pharmacologic therapy for ARDS has shown efficacy in clinical trials. Thus, invasive mechanical ventilation (IMV) remains the …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "AME Publications"
        },
        {
            "Title": "RNA deep sequencing reveals differential microRNA expression during development of sea urchin and sea star",
            "Publication year": 2011,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0029217",
            "Abstract": "microRNAs (miRNAs) are small (20–23 nt), non-coding single stranded RNA molecules that act as post-transcriptional regulators of mRNA gene expression. They have been implicated in regulation of developmental processes in diverse organisms. The echinoderms, Strongylocentrotus purpuratus (sea urchin) and Patiria miniata (sea star) are excellent model organisms for studying development with well-characterized transcriptional networks. However, to date, nothing is known about the role of miRNAs during development in these organisms, except that the genes that are involved in the miRNA biogenesis pathway are expressed during their developmental stages. In this paper, we used Illumina Genome Analyzer (Illumina, Inc.) to sequence small RNA libraries in mixed stage population of embryos from one to three days after fertilization of sea urchin and sea star (total of 22,670,000 reads). Analysis of these data revealed the miRNA populations in these two species. We found that 47 and 38 known miRNAs are expressed in sea urchin and sea star, respectively, during early development (32 in common). We also found 13 potentially novel miRNAs in the sea urchin embryonic library. miRNA expression is generally conserved between the two species during development, but 7 miRNAs are highly expressed in only one species. We expect that our two datasets will be a valuable resource for everyone working in the field of developmental biology and the regulatory networks that affect it. The computational pipeline to analyze Illumina reads is available at http://www.benoslab.pitt.edu/services.html.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Reduced Proportion and Activity of Natural Killer Cells in the Lung of Patients with Idiopathic Pulmonary Fibrosis",
            "Publication year": 2021,
            "Publication url": "https://scholar.google.com/scholar?cluster=6372760707830706200&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:k8Z6L05lTy4C",
            "Publisher": "AMER THORACIC SOC"
        },
        {
            "Title": "Epigenomic Regulation Of MicroRNA Expression In Human Normal Lung Fibroblasts",
            "Publication year": 2010,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2010.181.1_MeetingAbstracts.A2016",
            "Abstract": "BACKGROUNDDrugs that inhibit DNA methylation and histone deacetylation, known as chromatin-modifying drugs, can reactivate genes that have been abnormally silenced in the disease. MicroRNA (miRNA) are small noncoding RNAs that can regulate gene expression by inhibiting protein translation. Most intergenic miRNAs and 26% of the intragenic miRNAs are transcribed by their own promoter. MicroRNAs located in introns of protein-coding genes and can be co-regulated with their host genes. The epigenetic regulation of microRNAs is unknown. To determine whether microRNA expression in lung fibroblasts is epigenetically regulated and whether this regulationOBJECTIVES: affects the pro-fibrotic properties of lung fibroblasts. Primary human lung fibroblasts grown in culture were treated by HDAC METHODS: inhibitors (SAHA and TSA), by a DMNT inhibitor (5-AZA) and by tobacco-nitrosamine (NNK) is …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:SeFeTyx0c_EC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "MRNA And MicroRNA Expression Profiles Indicate Disease Severity In Patients With Idiopathic Pulmonary Fibrosis",
            "Publication year": 2011,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2011.183.1_MeetingAbstracts.A6005",
            "Abstract": "Background: Idiopathic Pulmonary Fibrosis (IPF) is a chronic progressive and often lethal fibrotic lung disease. IPF lungs exhibit mRNA and microRNAs (miRNAs) expression that are very different from control, however it is unclear whether and how gene expression patterns correlate with disease severity and progression. Our aim is to identify genes and miRNAs that correlate with disease severity. Methods:Total RNA was extracted from fresh frozen lung tissue of 50 patients with IPF using QIAzol. Labeled cRNA and miRNA were hybridized to Agilent whole human genome microarray 4 x 44K and 8 x 15K human miRNAs microarrays. Data was normalized using cyclic loess and BRB array tools software was used for statistical analysis. Pearson correlation test was performed between the miRNAs-gene expression values and FVC, DLCO and composite physiologic index (CPI) using quantitative trait analysis …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:ZHo1McVdvXMC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Human ex vivo lung perfusion: a novel model to study human lung diseases",
            "Publication year": 2021,
            "Publication url": "https://www.nature.com/articles/s41598-020-79434-4",
            "Abstract": "Experimental animal models to predict physiological responses to injury and stress in humans have inherent limitations. Therefore, the development of preclinical human models is of paramount importance. Ex vivo lung perfusion (EVLP) has typically been used to recondition donor lungs before transplantation. However, this technique has recently advanced into a model to emulate lung mechanics and physiology during injury. In the present study, we propose that the EVLP of diseased human lungs is a well-suited preclinical model for translational research on chronic lung diseases. Throughout this paper, we demonstrate this technique's feasibility in pulmonary arterial hypertension (PAH), idiopathic pulmonary fibrosis (IPF), emphysema, and non-disease donor lungs not suitable for transplantation. In this study, we aimed to perfuse the lungs for 6 h with the EVLP system. This facilitated a robust and continuous …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:vbGhcppDl1QC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "FOOTER: a web tool for finding mammalian DNA regulatory regions using phylogenetic footprinting",
            "Publication year": 2005,
            "Publication url": "https://academic.oup.com/nar/article-abstract/33/suppl_2/W442/2505572",
            "Abstract": " FOOTER is a newly developed algorithm that analyzes homologous mammalian promoter sequences in order to identify transcriptional DNA regulatory ‘signals’. FOOTER uses prior knowledge about the binding site preferences of the transcription factors (TFs) in the form of position-specific scoring matrices (PSSMs). The PSSM models are generated from known mammalian binding sites from the TRANSFAC database. In a test set of 72 confirmed binding sites (most of them not present in TRANSFAC) of 19 TFs, it exhibited 83% sensitivity and 72% specificity. FOOTER is accessible over the web at http://biodev.hgen.pitt.edu/Footer/ . ",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Downregulation of estrogen receptor and modulation of growth of breast cancer cell lines mediated by paracrine stromal cell signals",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10549-016-4052-0.pdf",
            "Abstract": "Breast cancers have a poorer prognosis if estrogen receptor expression was lost during recurrence. It is unclear whether this conversion is cell autonomous or whether it can be promoted by the microenvironment during cancer dormancy. We explored the ability of marrow-derived stromal cell lines to arrest co-cultured breast cancer cells and suppress estrogen receptor alpha (ER) expression during arrest, facilitating the emergence of estrogen-independent breast cancer clones.Cancer cell growth, ER protein, microRNA, and mRNA levels were measured in breast cancer cell lines exposed to conditioned medium from marrow stromal lines in the presence and absence of estrogen and of signaling pathway modulators.We demonstrate that paracrine signaling from the stromal cell line HS5 …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Human Transcriptome Subtraction by",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.568.2919&rep=rep1&type=pdf",
            "Abstract": "Digital transcript subtraction (DTS) was developed to subtract in silico known human sequences from expression library data sets, leaving candidate nonhuman sequences for further analysis. This approach requires precise discrimination between human and nonhuman cDNA sequences. Database comparisons show high likelihood that small viral sequences can be successfully distinguished from human sequences. DTS analysis of 9,026 20-bp tags from an expression library of BCBL-1 cells infected with Kaposi’s sarcomaassociated herpesvirus (KSHV) resolved all but three candidate sequences. Two of these sequences belonged to KSHV transcripts, and the third belonged to an unannotated human expression sequence tag. Overall, 0.24% of transcripts from this cell line were of viral origin. DTS analysis of 241,122 expression tags from three squamous cell conjunctival carcinomas revealed that only 21 sequences did not align with sequences from human databases. All 21 candidates amplify human transcripts and have secondary evidence for being of human origin. This analysis shows that it is unlikely that distinguishable viral transcripts are present in conjunctival carcinomas at 20 transcripts per million or higher, which is the equivalent of approximately 4 transcripts per cell. DTS is a simple screening method to discover novel viral nucleic acids. It provides, for the first time, quantitative evidence against some classes of viral etiology when no viral transcripts are found, thereby reducing the uncertainty involved in new pathogen discovery.Although infection contributes to over 20% of human cancers worldwide, the list of confirmed …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A21 IMMUNE MECHANISMS OF SARCOIDOSIS AND OTHER GRANULOMATOUS DISEASES: A Comparison Of Bronchoalveolar Lavage Cells (bal) And Peripheral Blood Mononuclear Cells (pbmc) Genome Wide Expression Patterns In Sarcoidosis",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/ae69c003354b11787aff7d998afc0ac1/1?pq-origsite=gscholar&cbl=40575",
            "Abstract": "Materials and Methods: 252 sarcoidosis subjects enrolled in the Genomic Research in Alpha-1 Antitrypsin Deficiency and Sarcoidosis study (GRADS) had paired BAL and PBMC samples according to GRADS study protocols (Moller et al., Ann Am Thorac Soc, 2015 PMID: 26193069). Conclusion: Gene expression profiles are compartment specific in sarcoidosis.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:_B80troHkn4C",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Feasibility of lung cancer prediction from low-dose CT scan and smoking factors using causal models",
            "Publication year": 2019,
            "Publication url": "https://thorax.bmj.com/content/74/7/643.abstract",
            "Abstract": "Low-dose CT (LDCT) is currently used in lung cancer screening of high-risk populations for early lung cancer diagnosis. However, 96% of individuals with detected nodules are false positives.In order to develop an efficient early lung cancer predictor from clinical, demographic and LDCT features, we studied a total of 218 subjects with lung cancer or benign nodules. Probabilistic graphical models (PGMs) were used to integrate demographics, clinical data and LDCT features from 92 subjects (training cohort) from the Pittsburgh Lung Screening Study cohort.Learnt PGMs identified three variables directly (causally) linked to malignant nodules and the largest benign nodule and used them to build the Lung Cancer Causal Model (LCCM), which was validated in a separate cohort of 126 subjects. Nodule and vessel numbers and years since the subject quit smoking were sufficient to …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "BMJ Publishing Group Ltd"
        },
        {
            "Title": "Non-coding single nucleotide variants affecting estrogen receptor binding and activity",
            "Publication year": 2016,
            "Publication url": "https://genomemedicine.biomedcentral.com/articles/10.1186/s13073-016-0382-0",
            "Abstract": "Estrogen receptor (ER) activity is critical for the development and progression of the majority of breast cancers. It is known that ER is differentially bound to DNA leading to transcriptomic and phenotypic changes in different breast cancer models. We investigated whether single nucleotide variants (SNVs) in ER binding sites (regSNVs) contribute to ER action through changes in the ER cistrome, thereby affecting disease progression. Here we developed a computational pipeline to identify SNVs in ER binding sites using chromatin immunoprecipitation sequencing (ChIP-seq) data from ER+ breast cancer models. ER ChIP-seq data were downloaded from the Gene Expression Omnibus (GEO). GATK pipeline was used to identify SNVs and the MACS algorithm was employed to call DNA-binding sites. Determination of the potential effect of a given SNV in a binding site was inferred using reimplementation of the is-rSNP algorithm. The Cancer Genome Atlas (TCGA) data were integrated to correlate the regSNVs and gene expression in breast tumors. ChIP and luciferase assays were used to assess the allele-specific binding. Analysis of ER ChIP-seq data from MCF7 cells identified an intronic SNV in the IGF1R gene, rs62022087, predicted to increase ER binding. Functional studies confirmed that ER binds preferentially to rs62022087 versus the wild-type allele. By integrating 43 ER ChIP-seq datasets, multi-omics, and clinical data, we identified 17 regSNVs associated with altered expression of adjacent genes in ER+ disease. Of these, the top candidate was in the promoter of the GSTM1 gene and was associated with higher expression of GSTM1 in …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "MicroRNA Sequencing of Peripheral Blood Mononuclear Cells and Disease Staging and Severity in Sarcoidosis",
            "Publication year": 2018,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2018.197.1_MeetingAbstracts.A2912",
            "Abstract": "Rationale: MicroRNAs (miRNAs) are small non-coding RNAs that post-transcriptionally regulate the expression of thousands of genes in normal and disease states. We analyzed the miRNA profiles of peripheral blood mononuclear cells (PBMC) in a large cohort of well characterized sarcoidosis subjects by genome scale miRNA sequencing and correlated the miRNAs with scadding stage and disease severity. Methods: PBMC were isolated from sarcoidosis subjects recruited in Genomic Research in Alpha-1 Antitrypsin Deficiency and Sarcoidosis study (GRADS)(Moller et al., Ann Am Thorac Soc, 2015 PMID: 26193069). RNA was extracted using Qiazol following Qiagen’s miRNeasy protocol. After determination of RNA quality, cDNA libraries were prepared and sequenced by Ion Torrent Proton Sequencer with Ion PITM Chip which produced∼ 30 million single-end reads/sample with average read length of 150bps …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:dTyEYWd-f8wC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Expression patterns of small numbers of transcripts from functionally-related pathways predict survival in multiple cancers",
            "Publication year": 2019,
            "Publication url": "https://bmccancer.biomedcentral.com/articles/10.1186/s12885-019-5851-6",
            "Abstract": "Genetic profiling of cancers for variations in copy number, structure or expression of certain genes has improved diagnosis, risk-stratification and therapeutic decision-making. However the tumor-restricted nature of these changes limits their application to certain cancer types or sub-types. Tests with broader prognostic capabilities are lacking. Using RNAseq data from 10,227 tumors in The Cancer Genome Atlas (TCGA), we evaluated 212 protein-coding transcripts from 12 cancer-related pathways. We employed t-distributed stochastic neighbor embedding (t-SNE) to identify expression pattern difference among each pathway’s transcripts. We have previously used t-SNE to show that survival in some cancers correlates with expression patterns of transcripts encoding ribosomal proteins and enzymes for cholesterol biosynthesis and fatty acid oxidation. Using the above 212 transcripts, t-SNE-assisted transcript pattern profiling identified patient cohorts with significant survival differences in 30 of 34 different cancer types comprising 9350 tumors (91.4% of all TCGA cases). Small subsets of each pathway’s transcripts, comprising no more than 50–60 from the original group, played particularly prominent roles in determining overall t-SNE patterns. In several cases, further refinements in long-term survival could be achieved by sequential t-SNE profiling with two pathways’ transcripts, by a combination of t-SNE plus whole transcriptome profiling or by employing t-SNE on immuno-histochemically defined breast cancer subtypes. In two cancer types, individuals with Stage IV disease at presentation could be readily subdivided into groups with highly …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:-_dYPAW6P2MC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Respiratory tract dysbiosis is associated with worse outcomes in mechanically ventilated patients",
            "Publication year": 2020,
            "Publication url": "https://www.atsjournals.org/doi/abs/10.1164/rccm.201912-2441OC",
            "Abstract": "Rationale: Host inflammatory responses have been strongly associated with adverse outcomes in critically ill patients, but the biologic underpinnings of such heterogeneous responses have not been defined.Objectives: We examined whether respiratory tract microbiome profiles are associated with host inflammation and clinical outcomes of acute respiratory failure.Methods: We collected oral swabs, endotracheal aspirates (ETAs), and plasma samples from mechanically ventilated patients. We performed 16S ribosomal RNA gene sequencing to characterize upper and lower respiratory tract microbiota and classified patients into host-response subphenotypes on the basis of clinical variables and plasma biomarkers of innate immunity and inflammation. We derived diversity metrics and composition clusters with Dirichlet multinomial models and examined our data for associations with subphenotypes and clinical …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:uWiczbcajpAC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Deregulation of common genes by c-Myc and its direct target, MT-MC1",
            "Publication year": 2005,
            "Publication url": "https://www.pnas.org/content/102/52/18968.short",
            "Abstract": "In addition to its role in cancer, the c-Myc oncoprotein controls many normal cellular processes as a consequence of its function as a basic helix–loop–helix leucine zipper transcription factor. Determining which of the myriad genes under c-Myc control are relevant for these various roles is thus a major challenge. mt-mc1 is a direct c-Myc target gene whose overexpression recapitulates multiple c-Myc phenotypes, including transformation. Using transcriptional profiling, we now show that MT-MC1-overexpressing myeloid cells misregulate a total of 47 distinct transcripts, a large proportion of which are involved in signal transduction and/or cancer. Analysis of these genes reveals a consensus promoter structure consisting of multiple, often closely spaced c-Myc binding sites and three additional Wilm9s tumor and Egr1-like motifs. More than one-third of MT-MC1 target genes are also clustered on six cancer-associated …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:MXK_kJrjxJIC",
            "Publisher": "National Academy of Sciences"
        },
        {
            "Title": "SASP from lung senescent fibroblasts induces immunesenescence and fibrosis",
            "Publication year": 2020,
            "Publication url": "https://faseb.onlinelibrary.wiley.com/doi/abs/10.1096/fasebj.2020.34.s1.04750",
            "Abstract": "MethodsHuman lung fibroblasts were isolated from explanted lungs and healthy donors. Conditioned media (CM) from lung fibroblasts were used to study the effects of the SASP on healthy fibroblasts and NKs. We used the BioID technique for the identification of the secreted proteins to study the fibroblast SASP. Fresh lung tissue was analyzed by flow cytometry to determine the lung immune response and senescence status. Single cell RNAseq was performed on 3 controls and 3 IPF. Blood from IPF and controls was collected for the study of plasma cytokines and PBMCs were analyzed by flow cytometry.ResultsCM from IPF fibroblasts induce a pro‐fibrotic and senescent phenotype on healthy control fibroblasts. Mass spectrometry of the secreted proteins in the SASP show increased secretion of extracellular matrix proteins and growth factors. Analysis of lung homogenates shows a decrease in the number of NK …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:lmc2jWPfTJgC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Mixed graphical models for causal analysis of multi-modal variables",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1704.02621",
            "Abstract": "Graphical causal models are an important tool for knowledge discovery because they can represent both the causal relations between variables and the multivariate probability distributions over the data. Once learned, causal graphs can be used for classification, feature selection and hypothesis generation, while revealing the underlying causal network structure and thus allowing for arbitrary likelihood queries over the data. However, current algorithms for learning sparse directed graphs are generally designed to handle only one type of data (continuous-only or discrete-only), which limits their applicability to a large class of multi-modal biological datasets that include mixed type variables. To address this issue, we developed new methods that modify and combine existing methods for finding undirected graphs with methods for finding directed graphs. These hybrid methods are not only faster, but also perform better than the directed graph estimation methods alone for a variety of parameter settings and data set sizes. Here, we describe a new conditional independence test for learning directed graphs over mixed data types and we compare performances of different graph learning strategies on synthetic data.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Features of mammalian microRNA promoters emerge from polymerase II chromatin immunoprecipitation data",
            "Publication year": 2009,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0005279",
            "Abstract": "Background MicroRNAs (miRNAs) are short, non-coding RNA regulators of protein coding genes. miRNAs play a very important role in diverse biological processes and various diseases. Many algorithms are able to predict miRNA genes and their targets, but their transcription regulation is still under investigation. It is generally believed that intragenic miRNAs (located in introns or exons of protein coding genes) are co-transcribed with their host genes and most intergenic miRNAs transcribed from their own RNA polymerase II (Pol II) promoter. However, the length of the primary transcripts and promoter organization is currently unknown.  Methodology We performed Pol II chromatin immunoprecipitation (ChIP)-chip using a custom array surrounding regions of known miRNA genes. To identify the true core transcription start sites of the miRNA genes we developed a new tool (CPPP). We showed that miRNA genes can be transcribed from promoters located several kilobases away and that their promoters share the same general features as those of protein coding genes. Finally, we found evidence that as many as 26% of the intragenic miRNAs may be transcribed from their own unique promoters.  Conclusion miRNA promoters have similar features to those of protein coding genes, but miRNA transcript organization is more complex.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Aldosterone regulates microRNAs in the cortical collecting duct to alter sodium transport (vol 25, pg 2445, 2014)",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=11260435647977717775&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:EUQCXRtRnyEC",
            "Publisher": "AMER SOC NEPHROLOGY"
        },
        {
            "Title": "ComiR: combinatorial microRNA target prediction tool",
            "Publication year": 2013,
            "Publication url": "https://academic.oup.com/nar/article-abstract/41/W1/W159/1096901",
            "Abstract": "ComiR is a web tool for combinatorial microRNA (miRNA) target prediction. Given an messenger RNA (mRNA) in human, mouse, fly or worm genomes, ComiR computes the potential of being targeted by a set of miRNAs, each of which can have zero, one or more targets on its 3′untranslated region. In determining the regulatory potential of an mRNA from a set of miRNAs, ComiR uses user-provided miRNA expression levels in a combination of appropriate thermodynamic modeling and machine learning techniques to make more accurate predictions. For each gene, ComiR returns the probability of being a functional target of a set of miRNAs, which depends on the relative miRNA expression levels. The tool provides a user-friendly interface to input a miRNA expression table containing many sample information and filter out the most relevant miRNAs. ComiR results can be downloaded or visualized on a …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:35N4QoGY0k4C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Reconstructing an ancestral mammalian immune supercomplex from a marsupial major histocompatibility complex",
            "Publication year": 2006,
            "Publication url": "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.0040046",
            "Abstract": "The first sequenced marsupial genome promises to reveal unparalleled insights into mammalian evolution. We have used theMonodelphis domestica (gray short-tailed opossum) sequence to construct the first map of a marsupial major histocompatibility complex (MHC). The MHC is the most gene-dense region of the mammalian genome and is critical to immunity and reproductive success. The marsupial MHC bridges the phylogenetic gap between the complex MHC of eutherian mammals and the minimal essential MHC of birds. Here we show that the opossum MHC is gene dense and complex, as in humans, but shares more organizational features with non-mammals. The Class I genes have amplified within the Class II region, resulting in a unique Class I/II region. We present a model of the organization of the MHC in ancestral mammals and its elaboration during mammalian evolution. The opossum genome, together with other extant genomes, reveals the existence of an ancestral “immune supercomplex” that contained genes of both types of natural killer receptors together with antigen processing genes and MHC genes.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Human transcriptome subtraction by using short sequence tags to search for tumor viruses in conjunctival carcinoma",
            "Publication year": 2007,
            "Publication url": "https://journals.asm.org/doi/abs/10.1128/jvi.00875-07",
            "Abstract": "Digital transcript subtraction (DTS) was developed to subtract in silico known human sequences from expression library data sets, leaving candidate nonhuman sequences for further analysis. This approach requires precise discrimination between human and nonhuman cDNA sequences. Database comparisons show high likelihood that small viral sequences can be successfully distinguished from human sequences. DTS analysis of 9,026 20-bp tags from an expression library of BCBL-1 cells infected with Kaposi's sarcoma-associated herpesvirus (KSHV) resolved all but three candidate sequences. Two of these sequences belonged to KSHV transcripts, and the third belonged to an unannotated human expression sequence tag. Overall, 0.24% of transcripts from this cell line were of viral origin. DTS analysis of 241,122 expression tags from three squamous cell conjunctival carcinomas revealed that only 21 …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:ufrVoPGSRksC",
            "Publisher": "American Society for Microbiology"
        },
        {
            "Title": "Plasma 1, 3-beta-D-glucan levels predict adverse clinical outcomes in critical illness",
            "Publication year": 2021,
            "Publication url": "https://insight.jci.org/articles/view/141277?utm_source=TrendMD&utm_medium=cpc&utm_campaign=JCI_Insight_TrendMD_0",
            "Abstract": "Background: The fungal cell-wall constituent 1, 3-beta-D-glucan (BDG) is a pathogen-associated molecular pattern that can stimulate innate immunity. We hypothesized that BDG from colonizing fungi in critically-ill patients may translocate into the systemic circulation and be associated with host inflammation and outcomes.Methods: We enrolled 453 mechanically-ventilated patients with acute respiratory failure (ARF) without invasive fungal infection and measured BDG, innate immunity and epithelial permeability biomarkers in serially collected plasma samples.Results: Compared to healthy controls, ARF patients had significantly higher BDG levels (median [interquartile-range] 26 [15-49] pg/ml, p< 0.001), whereas ARF patients with high BDG levels (≥ 40pg/ml, 31%) had higher odds for assignment to the prognostically adverse hyperinflammatory subphenotype (odds ratio [confidence interval] 2.88 [1.83-4.54], p< 0.001). Baseline BDG levels were predictive of fewer ventilator-free days and worse 30-day survival (adjusted p< 0.05). Integrative analyses of fungal colonization and epithelial barrier disruption suggested that BDG may translocate from either the lung or gut compartment. We validated the associations between plasma BDG and host inflammatory responses in 97 hospitalized patients with COVID-19.Conclusions: BDG measurements offered prognostic information in critically-ill patients without fungal infections. Further research in the mechanisms of translocation and innate immunity recognition and stimulation may offer new therapeutic opportunities in critical illness.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:kuK5TVdYjLIC",
            "Publisher": "American Society for Clinical Investigation"
        },
        {
            "Title": "Mixed graphical models for integrative causal analysis with application to chronic lung disease diagnosis and prognosis",
            "Publication year": 2019,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/35/7/1204/5091182",
            "Abstract": "Integration of data from different modalities is a necessary step for multi-scale data analysis in many fields, including biomedical research and systems biology. Directed graphical models offer an attractive tool for this problem because they can represent both the complex, multivariate probability distributions and the causal pathways influencing the system. Graphical models learned from biomedical data can be used for classification, biomarker selection and functional analysis, while revealing the underlying network structure and thus allowing for arbitrary likelihood queries over the data.In this paper, we present and test new methods for finding directed graphs over mixed data types (continuous and discrete variables). We used this new algorithm, CausalMGM, to identify variables directly linked to disease diagnosis and progression in various multi-modal …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Inhibition and role of let-7d in idiopathic pulmonary fibrosis",
            "Publication year": 2010,
            "Publication url": "https://www.atsjournals.org/doi/abs/10.1164/rccm.200911-1698OC",
            "Abstract": "Rationale: Idiopathic pulmonary fibrosis (IPF) is a chronic, progressive, and usually lethal fibrotic lung disease characterized by profound changes in epithelial cell phenotype and fibroblast proliferation.Objectives: To determine changes in expression and role of microRNAs in IPF.Methods: RNA from 10 control and 10 IPF tissues was hybridized on Agilent microRNA microarrays and results were confirmed by quantitative real-time polymerase chain reaction and in situ hybridization. SMAD3 binding to the let-7d promoter was confirmed by chromatin immunoprecipitation, electrophoretic mobility shift assay, luciferase assays, and reduced expression of let-7d in response to transforming growth factor-β. HMGA2, a let-7d target, was localized by immunohistochemistry. In mice, let-7d was inhibited by intratracheal administration of a let-7d antagomir and its effects were determined by immunohistochemistry …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:WF5omc3nYNoC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Combined Dysbiosis in Upper and Lower Respiratory Tract Microbial Communities Is Associated with Inflammatory Host Responses and Worse Clinical Outcomes in Mechanically-Ventilated Patients",
            "Publication year": 2020,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2020.201.1_MeetingAbstracts.A6213",
            "Abstract": "Background: Heterogeneity in host innate-immune responses has been strongly associated with severity of critical illness and outcomes, but the biological underpinnings of heterogeneous hostresponses have not been defined. We hypothesized that respiratory tract microbiota may be responsible for stimulating inflammatory responses in mechanically-ventilated patients and that microbiome alterations could thus account for differences in clinical outcomes. Methods: We enrolled consecutive mechanically-ventilated patients with acute respiratory failure and collected oral swabs, endotracheal aspirates (ETA) and plasma samples within 48hrs of intubation. We performed 16S rRNA gene sequencing on extracted DNA from oral swabs and ETAs to characterize upper and lower respiratory tract microbiota. In addition, we quantified plasma biomarkers of innate immunity and inflammation. For comparisons with healthy …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:0KyAp5RtaNEC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "The Drosophila alcohol dehydrogenase gene may have evolved independently of the functionally homologous medfly, olive fly, and flesh fly genes",
            "Publication year": 2001,
            "Publication url": "https://academic.oup.com/mbe/article-abstract/18/3/322/1073219",
            "Abstract": "cDNAs for alcohol dehydrogenase (ADH) isozymes were cloned and sequenced from two tephritid fruit flies, the medfly Ceratitis capitata and the olive fly Bactrocera oleae. Because of the high sequence divergence compared with the Drosophila sequences, the medfly cDNAs were cloned using sequence information from the purified proteins, and the olive fly cDNAs were cloned by functional complementation in yeast. The medfly peptide sequences are about 83% identical to each other, and the corresponding mRNAs have the tissue distribution shown by the corresponding isozymes, ADH-1 and ADH-2. The olive fly peptide sequence is more closely related to medfly ADH-2. The tephritid ADHs share less than 40% sequence identity with Drosophila ADH and ADH-related genes but are >57% identical to the ADH of the flesh fly Sarcophaga peregrina, a more distantly related species. To explain this …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:0EnyYjriUFMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Weighted Gene Co-Expression Network Analysis of Bronchoalveolar Lavage Cells Transcriptome Identifies New Molecular Endotypes in a Large Cohort of Subjects with Sarcoidosis",
            "Publication year": 2018,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2018.197.1_MeetingAbstracts.A4820",
            "Abstract": "Introduction: Sarcoidosis is a multisystem chronic granulomatous disease with high clinical heterogeneity and lung involvement in more than 90% cases. We applied advanced computational approaches to our dataset of genome scale profiles of bronchoalveolar lavage (BAL) from a well characterized cohort with sarcoidosis to identify novel molecular endotypes. Materials and Methods: BAL was performed on subjects enrolled in the Genomic Research in Alpha-1 Antitrypsin Deficiency and Sarcoidosis study (GRADS) following the GRADS study protocol (Moller et al., Ann Am Thorac Soc, 2015 PMID: 26193069). Cell pellet RNA was extracted, cDNA libraries were prepared and sequenced by Ion Torrent Proton Sequencer with Ion PITM Chip which produced∼ 30 million single-end reads/sample. Reads were mapped to UCSC hg19 human genome. Cufflinks was used to calculate Fragments per Kilobase of exon …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:PELIpwtuRlgC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "SOP 3 v2: web-based selection of oligonucleotide primer trios for genotyping of human and mouse polymorphisms",
            "Publication year": 2005,
            "Publication url": "https://academic.oup.com/nar/article-abstract/33/suppl_2/W548/2505702",
            "Abstract": " SOP 3 v2 is a database-driven graphical web-based application for facilitating genotyping assay design. SOP 3 v2 accepts data input in numerous forms, including gene names, reference sequence numbers and physical location. For each entry, the application presents a set of recommended forward and reverse PCR primers, along with a sequencing primer, which is optimized for sequence-based genotyping assays. SOP 3 v2-generated oligonucleotide primer trios enable analysis of single nucleotide polymorphisms (SNPs) as well as insertion/deletion polymorphisms found in genomic DNA. The application's database was generated by warehousing information from the National Center for Biotechnology Information (NCBI) dbSNP database, genomic DNA sequences from human and mouse, and LocusLink gene attribute information. Query results can be sorted by their biological relevance, such as …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:NhqRSupF_l8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Insights from RNA-sequencing of bronchoalveolar lavage cells in a large sarcoidosis cohort",
            "Publication year": 2017,
            "Publication url": "https://erj.ersjournals.com/content/50/suppl_61/OA2907.abstract",
            "Abstract": "Introduction: We analyzed the transcriptome of bronchoalveolar lavage cells (BAL) in a large cohort of well characterized sarcoidosis subjects by RNA-sequencing to better understand disease progression and severity, and potentially identify novel molecular phenotypes.Methods: BAL was performed on subjects enrolled in the Genomic Research in Alpha-1 Antitrypsin Deficiency and Sarcoidosis study (GRADS) as described (Moller et al., Ann Am Thorac Soc, 2015 PMID: 26193069). cDNA libraries were prepared from 1ug of RNA and sequenced by Ion Torrent Proton Sequencer. Cufflinks calculated Fragments per Kilobase of exon per Million (FPKM) values. Non-parametric correlation methods and Metacore identified significant genes and pathways. Weighted gene co-expression network analysis (WGCNA) revealed correlation networks between gene expression and clinical traits. Multiple hypothesis testing was …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:eMMeJKvmdy0C",
            "Publisher": "European Respiratory Society"
        },
        {
            "Title": "Profibrotic role of miR-154 in pulmonary fibrosis",
            "Publication year": 2012,
            "Publication url": "https://www.atsjournals.org/doi/abs/10.1165/rcmb.2011-0377OC",
            "Abstract": "In this study, we explored the regulation and the role of up-regulated microRNAs in idiopathic pulmonary fibrosis (IPF), a progressive interstitial lung disease of unknown origin. We analyzed the expression of microRNAs in IPF lungs and identified 43 significantly up-regulated microRNAs. Twenty-four of the 43 increased microRNAs were localized to the chromosome 14q32 microRNA cluster. We validated the increased expression of miR-154, miR-134, miR-299–5p, miR-410, miR-382, miR-409–3p, miR-487b, miR-31, and miR-127 by quantitative RT-PCR and determined that they were similarly expressed in embryonic lungs. We did not find evidence for differential methylation in this region, but analysis of transcription factor binding sites identified multiple SMAD3-binding elements in the 14q32 microRNA cluster. TGF-β1 stimulation of normal human lung fibroblasts (NHLF) caused up-regulation of microRNAs on …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:YFjsv_pBGBYC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "HHMMiR: efficient de novo prediction of microRNAs using hierarchical hidden Markov models",
            "Publication year": 2009,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/1471-2105-10-S1-S35",
            "Abstract": "MicroRNA s (miRNAs) are small non-coding single-stranded RNAs (20–23 nts) that are known to act as post-transcriptional and translational regulators of gene expression. Although, they were initially overlooked, their role in many important biological processes, such as development, cell differentiation, and cancer has been established in recent times. In spite of their biological significance, the identification of miRNA genes in newly sequenced organisms is still based, to a large degree, on extensive use of evolutionary conservation, which is not always available. We have developed HHMMiR, a novel approach for de novo miRNA hairpin prediction in the absence of evolutionary conservation. Our method implements a Hierarchical Hidden Markov Model (HHMM) that utilizes region-based structural as well as sequence information of miRNA precursors. We first established a template for the structure of a typical miRNA hairpin by summarizing data from publicly available databases. We then used this template to develop the HHMM topology. Our algorithm achieved average sensitivity of 84% and specificity of 88%, on 10-fold cross-validation of human miRNA precursor data. We also show that this model, trained on human sequences, works well on hairpins from other vertebrate as well as invertebrate species. Furthermore, the human trained model was able to correctly classify ~97% of plant miRNA precursors. The success of this approach in such a diverse set of species indicates that sequence conservation is not necessary for miRNA prediction. This may lead to efficient prediction of miRNA genes in virtually any organism.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:3fE2CSJIrl8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Impaired NK activity in the IPF lungs",
            "Publication year": 2020,
            "Publication url": "https://erj.ersjournals.com/content/56/suppl_64/3708.short",
            "Abstract": "Rationale: One of the features of IPF is the accumulation of senescent cells that produce the senescence-associated secretory phenotype (SASP) that modifies the lung microenvironment. We focus on the alteration of the lung immune response by the SASP, specifically on the natural killer (NK) lymphocytes cytotoxicity against senescence cells.Methods: Fresh lung samples were used for scRNAseq and flow. Blood was collected for the study of plasma cytokines and PBMCs.Results: There was decreased proportion of NK cells in the IPF lung, specifically of the circulatory/cytotoxic NK cells. Such NKs are more senescent, there is a higher proportion of IL6 producing cells and reduced expression of the chemokine receptor CCR2, which is involved in NK recruitment to the lung. scRNAseq analysis of the NK cluster in IPF patients revealed an impaired expression in some of the main NK genes and the fibroblast cluster …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:nrtMV_XWKgEC",
            "Publisher": "European Respiratory Society"
        },
        {
            "Title": "The Role of miR-154 microRNA Family in IPF.",
            "Publication year": 2009,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2009.179.1_MeetingAbstracts.A2732",
            "Abstract": "Rationale: Idiopathic pulmonary fibrosis (IPF) is a progressive interstitial lung disease of unknown origin characterized by abnormal activation of developmental pathways. We have previously demonstrated significant and biologically relevant down− regulation of microRNAs in the alveolar epithelium in IPF. In this study we focus on upregulated microRNAs in IPF. Methods and Results: We analyzed the expression of microRNAs in IPF lungs using Agilent microRNA arrays and identified 26 significantly (P< 0.05) up regulated microRNAs in IPF samples. Impressively, 14 of the 26 increased microRNAs were located at the chromosome 14q32. 31 microRNA cluster, a region regulated through a germline derived differentially methylated region located 200kb upstream. The miR− 154 family was over represented among the up regulated microRNAs with 7 members (hsa− miR− 409− 3p, hsa− miR− 377, hsa− miR− 382 …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:2P1L_qKh6hAC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Combined analysis reveals a core set of cycling genes",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1186/gb-2007-8-7-r146",
            "Abstract": "Global transcript levels throughout the cell cycle have been characterized using microarrays in several species. Early analysis of these experiments focused on individual species. More recently, a number of studies have concluded that a surprisingly small number of genes conserved in two or more species are periodically transcribed in these species. Combining and comparing data from multiple species is challenging because of noise in expression data, the different synchronization and scoring methods used, and the need to determine an accurate set of homologs. To solve these problems, we developed and applied a new algorithm to analyze expression data from multiple species simultaneously. Unlike previous studies, we find that more than 20% of cycling genes in budding yeast have cycling homologs in fission yeast and 5% to 7% of cycling genes in each of four species have cycling homologs in all other …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:hqOjcs7Dif8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Finding subtypes of transcription factor motif pairs with distinct regulatory roles",
            "Publication year": 2011,
            "Publication url": "https://academic.oup.com/nar/article-abstract/39/11/e76/1152896",
            "Abstract": "DNA sequences bound by a transcription factor (TF) are presumed to contain sequence elements that reflect its DNA binding preferences and its downstream-regulatory effects. Experimentally identified TF binding sites (TFBSs) are usually similar enough to be summarized by a ‘consensus’ motif, representative of the TF DNA binding specificity. Studies have shown that groups of nucleotide TFBS variants (subtypes) can contribute to distinct modes of downstream regulation by the TF via differential recruitment of cofactors. A TFA may bind to TFBS subtypes a1 or a2 depending on whether it associates with cofactors TFB or TFC, respectively. While some approaches can discover motif pairs (dyads), none address the problem of identifying ‘variants’ of dyads. TFs are key components of multiple regulatory pathways targeting different sets of genes perhaps with different binding preferences. Identifying the …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "The evolution of radiographic edema in ARDS and its association with clinical outcomes: A prospective cohort study in adult patients",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0883944119310019",
            "Abstract": "To assess the longitudinal evolution of radiographic edema using chest X-rays (CXR) in patients with Acute Respiratory Distress Syndrome (ARDS) and to examine its association with prognostic biomarkers, ARDS subphenotypes and outcomes.We quantified radiographic edema on CXRs from patients with ARDS or cardiogenic pulmonary edema (controls) using the Radiographic Assessment of Lung Edema (RALE) score on day of intubation and up to 10 days after. We measured baseline plasma biomarkers and recorded clinical variables.The RALE score had good inter-rater agreement (r = 0.83, p < 0.0001) applied on 488 CXRs from 129 patients, with higher RALE scores in patients with ARDS (n = 108) compared to controls (n = 21, p = 0.01). Baseline RALE scores were positively correlated with levels of the receptor for end-glycation end products (RAGE) in ARDS …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "WB Saunders"
        },
        {
            "Title": "Reduce Proportion and Activity of NK Cells in the Lung of Idiopathic Pulmonary Fibrosis Patients",
            "Publication year": 2021,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/rccm.202012-4418LE",
            "Abstract": "Idiopathic pulmonary fibrosis (IPF) is a chronic, progressive, fibrosing interstitial pneumonia of unknown origin leading to severe fibrosis1. Age is a primary risk factor in IPF, as its prevalence and incidence increase with age, and most of the hallmarks of aging have been described in IPF. Among those hallmarks, the accumulation of senescent cells reduces the regenerative potential and lung response to stress2. Senescent cells show lower levels of proliferation, resist apoptosis, express increased levels of β-galactosidase, and secrete the senescence-associated secretory phenotype (SASP). In young individuals, the SASP directs the immune-mediated clearance of damaged cells and initiates tissue regeneration. However, the persistence of senescent cells can have unwanted side effects, namely chronic inflammation and organ fibrosis3.Natural killer (NK) cells are innate cytotoxic lymphocytes that clear senescent …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PARP1 rs1805407 increases sensitivity to PARP1 inhibitors in cancer cells suggesting an improved therapeutic strategy",
            "Publication year": 2019,
            "Publication url": "https://www.nature.com/articles/s41598-019-39542-2",
            "Abstract": "Personalized cancer therapy relies on identifying patient subsets that benefit from a therapeutic intervention and suggest alternative regimens for those who don’t. A new data integrative approach, based on graphical models, was applied on our multi-modal–omics, and clinical data cohort of metastatic melanoma patients. We found that response to chemotherapy is directly linked to ten gene expression, four methylation variables and PARP1 SNP rs1805407. PARP1 is a DNA repair gene critical for chemotherapy response and for which FDA-approved inhibitors are clinically available (olaparib). We demonstrated that two PARP inhibitors (ABT-888 and olaparib) make SNP carrier cancer cells of various histologic subtypes more sensitive to alkylating agents, but they have no effect in wild-type cells. Furthermore, PARP1 inhibitors act synergistically with chemotherapy in SNP carrier cells (especially in ovarian cancer …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "The genome sequence of Drosophila melanogaster",
            "Publication year": 2000,
            "Publication url": "https://science.sciencemag.org/content/287/5461/2185.abstract",
            "Abstract": "The fly Drosophila melanogaster is one of the most intensively studied organisms in biology and serves as a model system for the investigation of many developmental and cellular processes common to higher eukaryotes, including humans. We have determined the nucleotide sequence of nearly all of the ∼120-megabase euchromatic portion of theDrosophila genome using a whole-genome shotgun sequencing strategy supported by extensive clone-based sequence and a high-quality bacterial artificial chromosome physical map. Efforts are under way to close the remaining gaps; however, the sequence is of sufficient accuracy and contiguity to be declared substantially complete and to support an initial analysis of genome structure and preliminary gene annotation and interpretation. The genome encodes ∼13,600 genes, somewhat fewer than the smaller Caenorhabditis elegansgenome, but with comparable …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:u5HHmVD_uO8C",
            "Publisher": "American Association for the Advancement of Science"
        },
        {
            "Title": "Myofibroblast transcriptome indicates SFRP2+ fibroblast progenitors in systemic sclerosis skin",
            "Publication year": 2021,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2021.04.30.442148v1.abstract",
            "Abstract": "Skin and lung fibrosis in systemic sclerosis (SSc) is driven by myofibroblasts, alpha-smooth muscle actin  expressing cells that arise from a variety of cell types in murine fibrosis models. Utilizing single cell RNA-sequencing to examine the transcriptome changes, we show that SSc dermal myofibroblasts arise from an SFRP2/DPP4-expressing progenitor fibroblast population that globally upregulates expression of transcriptome markers, such as PRSS23 and THBS1. Only a fraction of SSc fibroblasts differentiate into myofibroblasts, as shown by expression of additional markers, SFRP4 and FNDC1. The myofibroblast transcriptome implicates upstream transcription factors that drive myofibroblast differentiation.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:hMsQuOkrut0C",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Electrostatic hot spot on DNA-binding domains mediates phosphate desolvation and the pre-organization of specificity determinant side chains",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/nar/article-abstract/38/7/2134/3100495",
            "Abstract": "A major obstacle towards elucidating the molecular basis of transcriptional regulation is the lack of a detailed understanding of the interplay between non-specific and specific protein–DNA interactions. Based on molecular dynamics simulations of C2H2 zinc fingers (ZFs) and engrailed homeodomain transcription factors (TFs), we show that each of the studied DNA-binding domains has a set of highly constrained side chains in preset configurations ready to form hydrogen bonds with the DNA backbone. Interestingly, those domains that bury their recognition helix into the major groove are found to have an electrostatic hot spot for Cl− ions located on the same binding cavity as the most buried DNA phosphate. The spot is characterized by three protein hydrogen bond donors, often including two basic side chains. If bound, Cl− ions, likely mimicking phosphates, steer side chains that end up forming specific …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:4TOpqqG69KYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Novel modeling of combinatorial miRNA targeting identifies SNP with potential role in bone density",
            "Publication year": 2012,
            "Publication url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1002830",
            "Abstract": "MicroRNAs (miRNAs) are post-transcriptional regulators that bind to their target mRNAs through base complementarity. Predicting miRNA targets is a challenging task and various studies showed that existing algorithms suffer from high number of false predictions and low to moderate overlap in their predictions. Until recently, very few algorithms considered the dynamic nature of the interactions, including the effect of less specific interactions, the miRNA expression level, and the effect of combinatorial miRNA binding. Addressing these issues can result in a more accurate miRNA:mRNA modeling with many applications, including efficient miRNA-related SNP evaluation. We present a novel thermodynamic model based on the Fermi-Dirac equation that incorporates miRNA expression in the prediction of target occupancy and we show that it improves the performance of two popular single miRNA target finders. Modeling combinatorial miRNA targeting is a natural extension of this model. Two other algorithms show improved prediction efficiency when combinatorial binding models were considered. ComiR (Combinatorial miRNA targeting), a novel algorithm we developed, incorporates the improved predictions of the four target finders into a single probabilistic score using ensemble learning. Combining target scores of multiple miRNAs using ComiR improves predictions over the naïve method for target combination. ComiR scoring scheme can be used for identification of SNPs affecting miRNA binding. As proof of principle, ComiR identified rs17737058 as disruptive to the miR-488-5p:NCOA1 interaction, which we confirmed in vitro. We also found …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:GnPB-g6toBAC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "A pipeline for integrated theory and data-driven modeling of biomedical data",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9177274/",
            "Abstract": "Genome sequencing technologies have the potential to transform clinical decision making and biomedical research by enabling high-throughput measurements of the genome at a granular level. However, to truly understand mechanisms of disease and predict the effects of medical interventions, high-throughput data must be integrated with demographic, phenotypic, environmental, and behavioral data from individuals. Further, effective knowledge discovery methods must infer relationships between these data types. We recently proposed a pipeline (CausalMGM) to achieve this. CausalMGM uses probabilistic graphical models to infer the relationships between variables in the data; however, CausalMGM's graphical structure learning algorithm can only handle small datasets efficiently. We propose a new methodology (piPref-Div) that selects the most informative variables for CausalMGM, enabling it to scale. We …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Biclustering of dna microarray data: Theory, evaluation, and applications",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/biclustering-dna-microarray-data/52315",
            "Abstract": "In this chapter, different methods and applications of biclustering algorithms to DNA microarray data analysis that have been developed in recent years are discussed and compared. Identification of biological significant clusters of genes from microarray experimental data is a very daunting task that emerged, especially with the development of high throughput technologies. Various computational and evaluation methods based on diverse principles were introduced to identify new similarities among genes. Mathematical aspects of the models are highlighted, and applications to solve biological problems are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:EkHepimYqZsC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Self-organizing neural networks to support the discovery of DNA-binding motifs",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0893608006000773",
            "Abstract": "Identification of the short DNA sequence motifs that serve as binding targets for transcription factors is an important challenge in bioinformatics. Unsupervised techniques from the statistical learning theory literature have often been applied to motif discovery, but effective solutions for large genomic datasets have yet to be found. We present here three self-organizing neural networks that have applicability to the motif-finding problem. The core system in this study is a previously described SOM-based motif-finder named SOMBRERO. The motif-finder is integrated in this work with a SOM-based method that automatically constructs generalized models for structurally related motifs and initializes SOMBRERO with relevant biological knowledge. A self-organizing tree method that displays the relationships between various motifs is also presented, and it is shown that such a method can act as an effective structural …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:5nxA0vEk-isC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Race Distinct Gene Expression Patterns In Peripheral Blood Mononuclear Cells And Bronchoalveolar Lavage Cells Of Sarcoidosis Subjects",
            "Publication year": 2017,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A1055",
            "Abstract": "Introduction: analyzed the effect of race on the transcriptional profiles of peripheral blood mononuclear cells (PBMC) and bronchoalveolar lavage cells (BAL) obtained from sarcoidosis subjects.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:sSrBHYA8nusC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Epigenetic and transcriptomic regulation of lung repair during recovery from influenza infection",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0002944017300627",
            "Abstract": "Seasonal and pandemic influenza is a cause of morbidity and mortality worldwide. Most people infected with influenza virus display mild-to-moderate disease phenotypes and recover within a few weeks. Influenza is known to cause persistent alveolitis in animal models; however, little is known about the molecular pathways involved in this phenotype. We challenged C57BL/6 mice with influenza A/PR/8/34 and examined lung pathologic processes and inflammation, as well as transcriptomic and epigenetic changes at 21 to 60 days after infection. Influenza induced persistent parenchymal lung inflammation, alveolar epithelial metaplasia, and epithelial endoplasmic reticulum stress that were evident after the clearance of virus and resolution of morbidity. Influenza infection induced robust changes in the lung transcriptome, including a significant impact on inflammatory and extracellular matrix protein expression …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:08ZZubdj9fEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A21 IMMUNE MECHANISMS OF SARCOIDOSIS AND OTHER GRANULOMATOUS DISEASES: Rna Sequencing Of Peripheral Blood Mononuclear Cells Reveals Gene Expression Changes Associated With Disease Progression And Response To Therapy In Sarcoidosis",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/1f40776631d7a7dec20f6114d8dc29f0/1?pq-origsite=gscholar&cbl=40575",
            "Abstract": "On behalf of the GRADS Investigators Corresponding author's email: milica. vukmirovic@ yale. edu Introduction: We analyzed transcriptional profiles of peripheral blood mononuclear cells (PBMC) in a large cohort of well characterized sarcoidosis subjects by genome scale RNA sequencing to better understand disease progression and severity. Conclusion: Reduction in lung function is associated with an increase in IL-6, IL-7 immune response pathways and JAK/STAT pathway, and a decline in G protein, Ca2+ and NF-AT signaling in PBMC.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:tkaPQYYpVKoC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "piMGM: incorporating multi-source priors in mixed graphical models for learning disease networks",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/34/17/i848/5093235",
            "Abstract": "Learning probabilistic graphs over mixed data is an important way to combine gene expression and clinical disease data. Leveraging the existing, yet imperfect, information in pathway databases for mixed graphical model (MGM) learning is an understudied problem with tremendous potential applications in systems medicine, the problems of which often involve high-dimensional data.We present a new method, piMGM, which can learn with accuracy the structure of probabilistic graphs over mixed data by appropriately incorporating priors from multiple experts with different degrees of reliability. We show that piMGM accurately scores the reliability of prior information from a given expert even at low sample sizes. The reliability scores can be used to determine active pathways in healthy and disease samples. We tested piMGM on both simulated and real data …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:ye4kPcJQO24C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A tumor and immune related miRNA signature predicts progression-free survival of melanoma patients treated with ipilimumab",
            "Publication year": 2016,
            "Publication url": "https://cancerres.aacrjournals.org/content/76/14_Supplement/473.short",
            "Abstract": "BackgroundPatients with regionally advanced melanoma were treated with neoadjuvant ipilimumab in a previously reported study (Tarhini et al, PLOS One 2014). MicroRNA (miRNA) expression profiles of tumors of treated patients were investigated for their therapeutic predictive value.MethodsPatients were treated with ipilimumab (10 mg/kg IV every 3 weeks x2 doses) bracketing surgery. Tumor specimens were obtained at baseline and following ipilimumab at definitive surgery (week 6-8). MiRNA expression profiling was performed on the tumor biopsies of 30 patients using Affymetrix miRNA array (v.4). Significance Analysis of Microarrays (SAM) was performed to test the association of each differentially expressed miRNA molecule with outcome. Targets of the selected miRNAs were obtained from miRTarBase (http://mirtarbase.mbc.nctu.edu.tw). Functional annotation analysis of the list of miRNA target genes …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:738O_yMBCRsC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "SOP3: a web-based tool for selection of oligonucleotide primers for single nucleotide polymorphism analysis by Pyrosequencing®",
            "Publication year": 2005,
            "Publication url": "https://www.future-science.com/doi/abs/10.2144/05381RR01",
            "Abstract": "SOP3 is a web-based software tool for designing oligonucleotide primers for use in the analysis of single nucleotide polymorphisms (SNPs). Accessible via the Internet, the application is optimized for developing the PCR and sequencing primers that are necessary for Pyrosequencing®. The application accepts as input gene name, SNP reference sequence number, or chromosomal nucleotide location. Output can be parsed by gene name, SNP reference number, heterozygosity value, location, chromosome, or function. The location of an individual polymorphism, such as an intron, exon, or 5′ or 3′ untranslated region is indicated, as are whether nucleotide changes in an exon are associated with a change in an amino acid sequence. SOP3 presents for each entry a set of forward and biotinylated reverse PCR primers as well as a sequencing primer for use during the analysis of SNPs by Pyrosequencing …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Future Science Ltd"
        },
        {
            "Title": "The role of RNA folding free energy in the evolution of the polymerase genes of the influenza A virus",
            "Publication year": 2009,
            "Publication url": "https://genomebiology.biomedcentral.com/articles/10.1186/gb-2009-10-2-r18",
            "Abstract": "The influenza A virus genome is composed of eight single-stranded RNA segments of negative polarity. Although the hemagglutinin and neuraminidase genes are known to play a key role in host adaptation, the polymerase genes (which encode the polymerase segments PB2, PB1, PA) and the nucleoprotein gene are also important for the efficient propagation of the virus in the host and for its adaptation to new hosts. Current efforts to understand the host-specificity of the virus have largely focused on the amino acid differences between avian and human isolates. Here we show that the folding free energy of the RNA segments may play an equally important role in the evolution and host adaptation of the influenza virus. Folding free energy may affect the stability of the viral RNA and influence the rate of viral protein translation. We found that there is a clear distinction between the avian and human folding free energy distributions for the polymerase and the nucleoprotein genes, with human viruses having substantially higher folding free energy values. This difference is independent of the amino acid composition and the codon bias. Furthermore, the folding free energy values of the commonly circulating human viruses tend to shift towards higher values over the years, after they entered the human population. Finally, our results indicate that the temperature in which the cells grow affects infection efficiency. Our data suggest for the first time that RNA structure stability may play an important role in the emergence and host shift of influenza A virus. The fact that cell temperature affects virus propagation in mammalian cells could help identify those …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:Zph67rFs4hoC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "enoLOGOS: a versatile web tool for energy normalized sequence logos",
            "Publication year": 2005,
            "Publication url": "https://academic.oup.com/nar/article-abstract/33/suppl_2/W389/2505611",
            "Abstract": " enoLOGOS is a web-based tool that generates sequence logos from various input sources. Sequence logos have become a popular way to graphically represent DNA and amino acid sequence patterns from a set of aligned sequences. Each position of the alignment is represented by a column of stacked symbols with its total height reflecting the information content in this position. Currently, the available web servers are able to create logo images from a set of aligned sequences, but none of them generates weighted sequence logos directly from energy measurements or other sources. With the advent of high-throughput technologies for estimating the contact energy of different DNA sequences, tools that can create logos directly from binding affinity data are useful to researchers. enoLOGOS generates sequence logos from a variety of input data, including energy measurements, probability matrices, alignment …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:qjMakFHDy7sC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Mitochondria are a substrate of cellular memory",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0891584918316241",
            "Abstract": "Cellular memory underlies cellular identity, and thus constitutes a unifying mechanism of genetic disposition, environmental influences, and cellular adaptation. Here, we demonstrate that enduring physicochemical changes of mitochondrial networks invoked by transient stress, a phenomenon we term ‘mitoengrams’, underlie the transgenerational persistence of epigenetically scripted cellular behavior. Using C2C12 myogenic stem-like cells, we show that stress memory elicited by transient, low-level arsenite exposure is stored within a self-renewing subpopulation of progeny cells in a mitochondrial-dependent fashion. Importantly, we demonstrate that erasure of mitoengrams by administration of mitochondria-targeted electron scavenger was sufficient to reset key epigenetic marks of cellular memory and redirect the identity of the mitoengram-harboring progeny cells to a non-stress-like state. Together, our findings …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "ARDS subphenotypes beyond ARDS: prognostic enrichment in mechanically-ventilated patients with or at risk for ARDS.",
            "Publication year": 2019,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6865808/",
            "Abstract": "Objective:Classification of patients with Acute Respiratory Distress Syndrome (ARDS) into hyper-and hypo-inflammatory subphenotypes using plasma biomarkers may facilitate more effective targeted therapy. We examined whether established subphenotypes are present not only in patients with ARDS, but also in patients at-risk for ARDS (ARFA), and then assessed the prognostic information of baseline subphenotyping on the evolution of host-response biomarkers and clinical outcomes.Design:Prospective, observational cohort study.Setting:Medical intensive care unit at a tertiary academic medical center.Patients:Mechanically-ventilated patients with ARDS or ARFA.Interventions:None.Measurements and Main Results:We performed longitudinal measurements of ten plasma biomarkers of host injury and inflammation. We applied unsupervised Latent Class Analysis (LCA) methods utilizing baseline clinical and …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:ILKRHgRFtOwC",
            "Publisher": "NIH Public Access"
        },
        {
            "Title": "Modeling miRNA induced silencing in breast cancer with PARADIGM",
            "Publication year": 2017,
            "Publication url": "https://cancerres.aacrjournals.org/content/77/13_Supplement/479.short",
            "Abstract": "Introduction: MicroRNAs play an important role in regulation of gene expression and are known biomarkers for breast cancer as well as other malignancies. PARADIGM is a pathway based algorithm that allows for integration of multiple genomic data types with a curated pathway database to make pathway activity predictions. We added a model of gene silencing due to miRNA to the PARADIGM algorithm in order to study miRNA expression in a pathway context.Results: We curated a set of 7751 miRNA-mRNA interactions from the intersection of 3 target prediction algorithms. These interactions involved 66 miRNA and 2814 mRNA transcripts. We ran this model on global DNA copy number, RNAseq and miRNAseq data from 697 patients in the TCGA breast cancer cohort, and studied changes in the interactions between miRNAs and their targets between different tumor subtypes. The median activity of the RNA …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:D_sINldO8mEC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Expression and Role of miR-30 in Idiopathic Pulmonary Fibrosis.",
            "Publication year": 2009,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2009.179.1_MeetingAbstracts.A5310",
            "Abstract": "Introduction: MicroRNAs are small non− coding RNAs that cause post− transcriptional silencing of their target genes. MicroRNAs have been shown to have regulatory roles in cellular phenotype in cancer and development. Considering that the lung in idiopathic pulmonary fibrosis (IPF) is characterized by profound changes in the phenotype of fibroblasts and epithelial cells, as well as drastic changes in gene expression, we hypothesized that miRNAs will be differentially expressed in IPF. Methods: miRNA profiling was carried out on 10 IPF lungs and 10 control lungs using the Agilent miRNA microarray whose results were verified by qRT− PCR. miR− 30 was localized in the lung by in situ hybridization. miR− 30a, miR− 30d and miR− 30e, the three members having highly similar sequences were inhibited with a locked nucleic acid (LNA)/DNA oligonucleotide. Results: 46 miRNAs were differentially expressed in IPF …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:HoB7MX3m0LUC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Hepatoblast Loss of YAP1 Leads to Alagille Syndrome-Like Phenotype and Severe Chronic Kidney Disease",
            "Publication year": 2020,
            "Publication url": "https://asip.confex.com/asip/2020/meetingapp.cgi/Paper/1136",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:gsN89kCJA0AC",
            "Publisher": "ASIP"
        },
        {
            "Title": "A sequence alignment-independent method for protein classification",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.2165/00822942-200403020-00008",
            "Abstract": "Annotation of the rapidly accumulating body of sequence data relies heavily on the detection of remote homologues and functional motifs in protein families. The most popular methods rely on sequence alignment. These include programs that use a scoring matrix to compare the probability of a potential alignment with random chance and programs that use curated multiple alignments to train profile hidden Markov models (HMMs). Related approaches depend on bootstrapping multiple alignments from a single sequence. However, alignment-based programs have limitations. They make the assumption that contiguity is conserved between homologous segments, which may not be true in genetic recombination or horizontal transfer. Alignments also become ambiguous when sequence similarity drops below 40%. This has kindled interest in classification methods that do not rely on alignment. An approach …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "To bind or not to bind-FoxA1 determines estrogen receptor action in breast cancer progression",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1186/bcr3146",
            "Abstract": "Chromatin immunoprecipitation followed by massively parallel sequencing (ChIP-seq) is rapidly enabling the comprehensive characterization of genome-wide transcription factor-binding sites, thus defining the cistrome (cis-acting DNA targets of a trans-acting factor). Estrogen receptor (ER) ChIP-seq studies have been performed mainly in cell lines, but Ross-Innes and colleagues have now completed the first such study in clinical breast cancer samples. The study aimed at determining the dynamics of ER binding and differences between more and less aggressive primary breast tumors and metastases. The authors found that ER bound to DNA in both aggressive and drug-resistant tumors but to different sites and with different affinities. Given previous findings from cell lines, FoxA1 appears to play a critical role in this reprogramming of ER binding.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:hMod-77fHWUC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "A Comparison Of Bronchoalveolar Lavage Cells (bal) And Peripheral Blood Mononuclear Cells (pbmc) Genome Wide Expression Patterns In Sarcoidosis",
            "Publication year": 2017,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A1059",
            "Abstract": "Introduction: relationship between systemic inflammatory response lung alveolar inflammatory milieu we compared transcriptomic profiles of PBMC and BAL cells in a large cohort of well characterized sarcoidosis subjects.252 sarcoidosis subjects enrolled in the Genomic Research in Alpha-1 Antitrypsin Deficiency and SarcoidosisMaterials and Methods: study (GRADS) had paired BAL and PBMC samples according to GRADS study protocols (Moller et al., Ann Am Thorac Soc, 2015 PMID: 26193069). Pulmonary function tests (PFT): FVC, FEV1 and DLCO, were performed. RNA, was isolated from PBMC and BAL cells was used to generate cDNA libraries and sequenced by Ion Torrent Proton Sequencer. Reads were mapped to UCSC hg19 human genome. Cufflinks was used to calculate Fragments per Kilobase of exon per Million (FPKM) values. Multiple hypothesis testing was addressed by controlling the false …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:B3FOqHPlNUQC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "WoodageT",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=1111327509070233142&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Regional molecular signature of the symptomatic atherosclerotic carotid plaque",
            "Publication year": 2019,
            "Publication url": "https://academic.oup.com/neurosurgery/article-abstract/85/2/E284/5134282",
            "Abstract": "Many studies have explored molecular markers of carotid plaque development and vulnerability to rupture, usually having examined whole carotid plaques. However, there are regional differences in plaque morphology and known shear-related mechanisms in areas surrounding the lipid core.To determine whether there are regional differences in protein expression along the long axis of the carotid plaque and how that might produce gaps in our understanding of the carotid plaque molecular signature.Levels of 7 inflammatory cytokines (IL-1β, IL-6, IL-8, IL-10, IL-12 p70, IFN-γ, and TNF-α) and caspase-3 were analyzed in prebifurcation, bifurcation, and postbifurcation segments of internal carotid plaques surgically removed from symptomatic and asymptomatic patients. Expression profiles of miRNAs and mRNAs …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:N5tVd3kTz84C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Ribosomopathy-like properties of murine and human cancers",
            "Publication year": 2017,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0182705",
            "Abstract": "Ribosomopathies comprise a heterogeneous group of hematologic and developmental disorders, often characterized by bone marrow failure, skeletal and other developmental abnormalities and cancer predisposition. They are associated with mutations and/or haplo-insufficiencies of ribosomal proteins (RPs) and inefficient ribosomal RNA (rRNA) processing. The resulting ribosomal stress induces the canonical p19ARF/Mdm2/p53 tumor suppressor pathway leading to proliferative arrest and/or apoptosis. It has been proposed that this pathway is then inactivated during subsequent neoplastic evolution. We show here that two murine models of hepatoblastoma (HB) and hepatocellular carcinoma (HCC) unexpectedly possess features that mimic the ribosomopathies. These include loss of the normal stoichiometry of RP transcripts and proteins and the accumulation of unprocessed rRNA precursors. Silencing of p19ARF, cytoplasmic sequestration of p53, binding to and inactivation of Mdm2 by free RPs, and up-regulation of the pro-survival protein Bcl-2 may further cooperate to drive tumor growth and survival. Consistent with this notion, re-instatement of constitutive p19ARF expression in the HB model completely suppressed tumorigenesis. In >2000 cases of human HCC, colorectal, breast, and prostate cancer, RP transcript deregulation was a frequent finding. In HCC and breast cancer, the severity of this dysregulation was associated with inferior survival. In HCC, the presence of RP gene mutations, some of which were identical to those previously reported in ribosomopathies, were similarly negatively correlated with long-term survival. Taken …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:eflP2zaiRacC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "ECCB 2018: The 17th European Conference on Computational Biology",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/34/17/i595/5093250",
            "Abstract": "The Conference is being held jointly with ISMB in the oddnumbered years and independently in the even-numbered years. This year, the 17th ECCB (ECCB 2018) will take place in Athens, at the Stavros Niarchos Foundation Cultural Center (SNFCC), from September 8 to 12, 2018. SNFCC, which was opened in June 2017, is a multifunctional arts, education and entertainment complex located on the edge of Faliro Bay, 4.5 km south of the center of Athens. Information on the ECCB 2018 can be found at eccb18. org and will be later archived at www. ebi. ac. uk/eccb/2018/. With more than 1,000 participants from academia and industry, ECCB is the leading European Conference on computational biology and bioinformatics and the second largest internationally, next to ISMB (Intelligent Systems in Molecular Biology). The work presented in ECCB is related to all domains of the field of computational biology and …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "EMT And Matrisome Pathways Are Activated In Structurally Normal Regions In Explanted Lungs Of Idiopathic Pulmonary Fibrosis Patients",
            "Publication year": 2017,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A7252",
            "Abstract": "RESULTS: GSEA identified epithelial to mesenchymal transition pathway as being enriched with increasing significance as IPF regions become more fibrotic (LF: p= 1.79 x10; MF: p= 2.68 x10; HF: p= 2.4 x10). This is also seen in matrisome pathway genes (LF: p=-5-16-236.01 x10; MF: p= 3.69 x10; HF: p= 5.79 x10). A total of 112 of 445 ECM and 113 of 625 protease genes were among the-13-32-50 differentially expressed genes between IPF and Control. The metalloproteinases MMP7 and MMP16 (MT3-MMP) were found to be expressed in all IPF regions. Primary fibrillar collagen genes (COL1A1 and COL3A1) were present in MF and HF regions but not in LF. CONCLUSIONS: Essential pathways of fibrosis that include EMT and matrisome production are activated at an early stage of IPF before structural changes or collagen deposition occurs.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:tuHXwOkdijsC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Probabilistic Graphical Models Identify Causal Predictors Of Fev1 Decline In COPD Patients",
            "Publication year": 2017,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2017.195.1_MeetingAbstracts.A2724",
            "Abstract": "Results.FEV1 progression (2yrΔ–FEV1% pred). These included: a history of asthma (asthma hx); change in FEV (L), FEF 25-75iso and Impulse 1 oscillometry airway resistance variable before and after bronchodilation (BDΔ_FEV1 (L), BDΔ_FEF25-75iso, BDΔ_R5vt); current smoking history; and functional residual capacity, a measure of air trapping FRC (L). In addition, we found that the blood levels of creatinine, estradiol and IL6 to be direct predictors of FEV longitudinal decline. One advantage of MGM-Learn graphs is that one can use the",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:tS2w5q8j5-wC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Sombrero: Integrating self-organizing neural networks in the search for dna binding motifs",
            "Publication year": 2005,
            "Publication url": "https://einstein.pure.elsevier.com/en/publications/sombrero-integrating-self-organizing-neural-networks-in-the-searc-2",
            "Abstract": "Identification of the short DNA sequence motifs that serve as binding domains for transcription factors continues to be a challenging problem in computational biology. Currently popular methods of motif discovery are based on unsupervised techniques from the statistical learning theory literature. We present here a working prototype of a neural networks based system that aims to tackle the DNA regulatory motif identification problem. The system consists of three modules, the core module being a SOM-based motif-finder named SOMBRERO. The motif-finder is integrated in the prototype with a SOM-based pre-processing method that initialises SOMBRERO with relevant biological knowledge, as well as a self-organizing tree method that helps the user to interpret SOMBRERO's results. The system is demonstrated here using various datasets.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "mirConnX: condition-specific mRNA-microRNA network integrator",
            "Publication year": 2011,
            "Publication url": "https://academic.oup.com/nar/article-abstract/39/suppl_2/W416/2505804",
            "Abstract": " mirConnX is a user-friendly web interface for inferring, displaying and parsing mRNA and microRNA (miRNA) gene regulatory networks. mirConnX combines sequence information with gene expression data analysis to create a disease-specific, genome-wide regulatory network. A prior, static network has been constructed for all human and mouse genes. It consists of computationally predicted transcription factor (TF)-gene associations and miRNA target predictions. The prior network is supplemented with known interactions from the literature. Dynamic TF- and miRNA-gene associations are inferred from user-provided expression data using an association measure of choice. The static and dynamic networks are then combined using an integration function with user-specified weights. Visualization of the network and subsequent analysis are provided via a very responsive graphic user interface. Two organisms are …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:qUcmZB5y_30C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Additivity in protein–DNA interactions: how good an approximation is it?",
            "Publication year": 2002,
            "Publication url": "https://academic.oup.com/nar/article-abstract/30/20/4442/1465365",
            "Abstract": "Man and Stormo and Bulyk et al. recently presented their results on the study of the DNA binding affinity of proteins. In both of these studies the main conclusion is that the additivity assumption, usually applied in methods to search for binding sites, is not true. In the first study, the analysis of binding affinity data from the Mnt repressor protein bound to all possible DNA (sub)targets at positions 16 and 17 of the binding site, showed that those positions are not independent. In the second study, the authors analysed DNA binding affinity data of the wild‐type mouse EGR1 protein and four variants differing on the middle finger. The binding affinity of these proteins was measured to all 64 possible trinucleotide (sub)targets of the middle finger using microarray technology. The analysis of the measurements also showed interdependence among the positions in the DNA target. In the present report, we review the data of …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Improved detection of DNA motifs using a self-organized clustering of familial binding profiles",
            "Publication year": 2005,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/21/suppl_1/i283/203186",
            "Abstract": " Motivation: One of the limiting factors in deciphering transcriptional regulatory networks is the effectiveness of motif-finding software. An emerging avenue for improving motif-finding accuracy aims to incorporate generalized binding constraints of related transcription factors (TFs), named familial binding profiles (FBPs), as priors in motif identification methods. A motif-finder can thus be ‘biased’ towards finding motifs from a particular TF family. However, current motif-finders allow only a single FBP to be used as a prior in a given motif-finding run. In addition, current FBP construction methods are based on manual clustering of position specific scoring matrices (PSSMs) according to the known structural properties of the TF proteins. Manual clustering assumes that the binding preferences of structurally similar TFs will also be similar. This assumption is not true, at least not for some TF families. Automatic …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Inferring protein–DNA dependencies using motif alignments and mutual information",
            "Publication year": 2007,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/23/13/i297/235473",
            "Abstract": " Motivation: Mutual information can be used to explore covarying positions in biological sequences. In the past, it has been successfully used to infer RNA secondary structure conformations from multiple sequence alignments. In this study, we show that the same principles allow the discovery of transcription factor amino acids that are coevolving with nucleotides in their DNA-binding targets. Results: Given an alignment of transcription factor binding domains, and a separate alignment of their DNA target motifs, we demonstrate that mutually covarying base-amino acid positions may indicate possible protein–DNA contacts. Examples explored in this study include C2H2 zinc finger, homeodomain and bHLH DNA-binding motif families, where a number of known base-amino acid contacting positions are identified. Mutual information analyses may aid the prediction of base-amino acid contacting …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "From sequence to chromosome: the tip of the X chromosome of D. melanogaster",
            "Publication year": 2000,
            "Publication url": "https://science.sciencemag.org/content/287/5461/2220.abstract",
            "Abstract": "One of the rewards of having a Drosophila melanogaster whole-genome sequence will be the potential to understand the molecular bases for structural features of chromosomes that have been a long-standing puzzle. Analysis of 2.6 megabases of sequence from the tip of the X chromosome ofDrosophila identifies 273 genes. Cloned DNAs from the characteristic bulbous structure at the tip of the Xchromosome in the region of the broad complex display an unusual pattern of in situ hybridization. Sequence analysis revealed that this region comprises 154 kilobases of DNA flanked by 1.2-kilobases of inverted repeats, each composed of a 350–base pair satellite related element. Thus, some aspects of chromosome structure appear to be revealed directly within the DNA sequence itself.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:roLk4NBRz8UC",
            "Publisher": "American Association for the Advancement of Science"
        },
        {
            "Title": "Overexpression of microRNA-1 promotes cardiomyocyte commitment from human cardiovascular progenitors via suppressing WNT and FGF signaling pathways",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022282813002526",
            "Abstract": "Early heart development takes place through a complex series of steps, including the induction of cardiac mesoderm, formation of the cardiovascular progenitor cells and the commitment of cardiovascular lineage cells, such as cardiomyocytes (CMs), smooth muscle cells (SMCs) and endothelial cells (ECs). Recently, microRNAs, a family of endogenous, small non-coding RNAs, have been identified as critical regulators in cardiogenesis and cardiovascular disease. Previous studies demonstrated that microRNA-1 (miR-1) could promote cardiac differentiation from mouse and human embryonic stem (ES) cells. However, the underlying mechanism remained largely unclear. We performed microRNA deep sequencing among human ES cells, ES cell derived-multipotent cardiovascular progenitors (MCPs), and MCP-specified CMs, ECs, and SMCs. A specific enrichment of miR-1 was found in CMs, not in SMCs or ECs …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A21 IMMUNE MECHANISMS OF SARCOIDOSIS AND OTHER GRANULOMATOUS DISEASES: Rna Sequencing Of Bronchoalveolar Lavage Cells In Subjects With Sarcoidosis Reveals Gene Expression Patterns Associated With Advanced Scadding Stage And Treatment Effects",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/99d0d5003f661d44e9d5802c85c32b2c/1?pq-origsite=gscholar&cbl=40575",
            "Abstract": "Pathway enrichment analysis of the 24 genes decreased with increased stage revealed cytoskeleton remodeling and cell adhesion, Treatment affected 89 genes (including HDL, APOA1, WNT) in stage II-III and 192 genes (including IFN-gamma, CD40L, IL-21) in stage IV subjects. Conclusion: Advanced Scadding stage is associated with an increase in inflammatory pathway genes, and a decline in cell adhesion and cytoskeleton remodeling in BAL cells.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:AXPGKjj_ei8C",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Lipidomic Signatures Align with Inflammatory Patterns and Outcomes in Critical Illness",
            "Publication year": 2021,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7805459/",
            "Abstract": "Alterations in lipid metabolism have the potential to be markers as well as drivers of the pathobiology of acute critical illness. Here, we took advantage of the temporal precision offered by trauma as a common cause of critical illness to identify the dynamic patterns in the circulating lipidome in critically ill humans. The major findings include an early loss of all classes of circulating lipids followed by a delayed and selective lipogenesis in patients destined to remain critically ill. Early in the clinical course, Fresh Frozen Plasma administration led to improved survival in association with preserved lipid levels that related to favorable changes in coagulation and inflammation biomarkers. Late over-representation of phosphatidylethanolamines with critical illness led to the validation of a Lipid Reprogramming Score that was prognostic not only in trauma but also severe COVID-19 patients. Our lipidomic findings provide a …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:p__nRnzSRKYC",
            "Publisher": "American Journal Experts"
        },
        {
            "Title": "Global Microrna Profiles Of Idiopathic Pulmonary Fibrosis Lungs Indicate Reversal Of Lung Differentiation",
            "Publication year": 2011,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2011.183.1_MeetingAbstracts.A5528",
            "Abstract": "RATIONALE: from diagnosis. Since it has been reported that IPF lungs are enriched with genes associated with lung development and lung cancer, we analyzed the microRNA expression patterns in IPF lungs and compared it to that of fetal lungs and lung cancer tissue. RNA from IPF lungs, fetal lungs, lung cancer tissues and their matching controls was hybridized on Agilent microRNAMETHODS: microarrays. Microarray data analysis was performed with Genespring. Pathway analysis was done with Ingenuity Pathway Analysis. To identify the timing of the shift in microRNA profile during the course of lung development, we analyzed the microRNA repertoire of post-natal mouse lungs harvested at days 1, 4, 7, 14 and 42 after birth. 51 microRNAs were decreased and 45 increased in IPF lungs compared to controls. The expression of 34 microRNAs wasRESULTS: confirmed by real time PCR. Among the decreased …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:u_35RYKgDlwC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "COPD Patient Subphenotyping Using Probabilistic Causal Models",
            "Publication year": 2019,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2019.199.1_MeetingAbstracts.A4055",
            "Abstract": "Rationale. Chronic obstructive pulmonary disease (COPD) is associated with significant variation in radiographic, symptomatic, and physiologic presentation. Identifying disease subtypes from molecular data collected from accessible tissue can help stratify patients and guide disease management treatment. Methods. We developed a new method, ssNPA, that learns a gene expression network from reference samples and determines which part of it is dysregulated in each patient sample and uses dysregulation features to cluster patients. We applied ssNPA on blood-derived RNA-sequencing gene expression measurements from 252 COPDGene® former smokers. Results. Our reference population consisted of unaffected subjects without disease progression (n= 55). ssNPA identified four distinct clusters in this cohort, one of which was able to recover the majority of the controls (41 of 55). Two of the clusters …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:tzM49s52ZIMC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Biological evaluation of biclustering algorithms using gene ontology and ChIP-chip data",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4517690/",
            "Abstract": "In this paper, we propose a new framework for assessing the biological significance of the outputs of any biclustering algorithm. The framework relies on the p-value computed by a Fisher's exact test on a 2x2 contingency table derived from gene ontology (GO) enrichment level and chromatin immunoprecipitation (ChIP) data enrichment level. We illustrate the framework using our published robust biclustering algorithm (RoBA), the Cheng and Church (CC) algorithm, and a well-defined set of yeast cell cycle gene expression data and chip-chip data. Our evaluation also shows that the biclusters identified by RoBA are biologically more homogeneous than the ones identified by the Cheng and Church (CC) algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CausER-a framework for inferring causal latent factors using multi-omic human datasets",
            "Publication year": 2021,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2021.05.03.442513v1.abstract",
            "Abstract": "High-dimensional cellular and molecular profiling of human samples highlights the need for analytical approaches that can integrate multi-omic datasets to generate predictive biomarkers that are in turn accompanied with strong causal inferences. Current methodologies are challenged by the high dimensionality of the combined datasets, the differences in distributions across the datasets, and their integration in a plausible causal framework, beyond merely correlative biomarkers. Here we present CausER, a first-in-class two-step interpretable machine learning approach for high-dimensional multi-omic datasets, that addresses these problems by identifying latent factors and their cause-effect relationships with the system-wide outcome/property of interest. The first step consists of Essential Regression (ER), a novel data-distribution-free regression model that integrates multi-omic datasets and identifies latent factors significantly associated with an outcome. The second involves probabilistic graphical modeling of the significant latent factors to infer plausible causal associations between them and mechanisms that affect outcomes, thereby significantly moving beyond predictive associative markers. By analyzing varied human immunological multi-omic datasets, we demonstrate that CausER significantly outperforms a wide range of state-of-the-art approaches. It generates novel cellular and molecular predictions in a range of contexts, including immunosenescence and sustained immune dysregulation associated with pre-term birth, that are corroborated by biological findings in model systems.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:g3aElNc5_aQC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Aldosterone regulates microRNAs in the cortical collecting duct to alter sodium transport",
            "Publication year": 2014,
            "Publication url": "https://jasn.asnjournals.org/content/25/11/2445.short",
            "Abstract": "A role for microRNAs (miRs) in the physiologic regulation of sodium transport in the kidney has not been established. In this study, we investigated the potential of aldosterone to alter miR expression in mouse cortical collecting duct (mCCD) epithelial cells. Microarray studies demonstrated the regulation of miR expression by aldosterone in both cultured mCCD and isolated primary distal nephron principal cells. Aldosterone regulation of the most significantly downregulated miRs, mmu-miR-335–3p, mmu-miR-290–5p, and mmu-miR-1983 was confirmed by quantitative RT-PCR. Reducing the expression of these miRs separately or in combination increased epithelial sodium channel (ENaC)–mediated sodium transport in mCCD cells, without mineralocorticoid supplementation. Artificially increasing the expression of these miRs by transfection with plasmid precursors or miR mimic constructs blunted aldosterone …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:D03iK_w7-QYC",
            "Publisher": "American Society of Nephrology"
        },
        {
            "Title": "Surveillance for melanoma (MEL): Results of a database study of stage I-III MEL.",
            "Publication year": 2018,
            "Publication url": "https://ascopubs.org/doi/abs/10.1200/JCO.2018.36.15_suppl.9586",
            "Abstract": "9586 Background: Optimal surveillance for MEL recurrence is elusive. While consensus guidelines agree on surveillance imaging for high-risk MEL, there is no consensus regarding optimal modality for surveillance and routine imaging surveillance is not recommended for stage IA-IIA MEL. We examined the utility of surveillance in stage I-III MEL. Methods: Patients (pts) at the University of Pittsburgh's Melanoma Program 1991-2011 were queried using a clinical database. Eligible pts had stage I-III MEL and underwent routine surveillance with clinical examination, chest x-rays (CXR). Minimum follow-up was 9 months (mos). CXR positivity was determined by primary review of attending radiologist report. Pt documentation was queried for information pertaining to relapse, details of advanced imaging, pathology and treatment. Primary endpoints were the incidence of pulmonary (pulm) and extra-pulm metastases …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:SdhP9T11ey4C",
            "Publisher": "American Society of Clinical Oncology"
        },
        {
            "Title": "Expression of regulatory platelet microRNAs in patients with sickle cell disease",
            "Publication year": 2013,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0060932",
            "Abstract": "Background Increased platelet activation in sickle cell disease (SCD) contributes to a state of hypercoagulability and confers a risk of thromboembolic complications. The role for post-transcriptional regulation of the platelet transcriptome by microRNAs (miRNAs) in SCD has not been previously explored. This is the first study to determine whether platelets from SCD exhibit an altered miRNA expression profile.   Methods and Findings We analyzed the expression of miRNAs isolated from platelets from a primary cohort (SCD = 19, controls = 10) and a validation cohort (SCD = 7, controls = 7) by hybridizing to the Agilent miRNA microarrays. A dramatic difference in miRNA expression profiles between patients and controls was noted in both cohorts separately. A total of 40 differentially expressed platelet miRNAs were identified as common in both cohorts (p-value 0.05, fold change>2) with 24 miRNAs downregulated. Interestingly, 14 of the 24 downregulated miRNAs were members of three families - miR-329, miR-376 and miR-154 - which localized to the epigenetically regulated, maternally imprinted chromosome 14q32 region. We validated the downregulated miRNAs, miR-376a and miR-409-3p, and an upregulated miR-1225-3p using qRT-PCR. Over-expression of the miR-1225-3p in the Meg01 cells was followed by mRNA expression profiling to identify mRNA targets. This resulted in significant transcriptional repression of 1605 transcripts. A combinatorial approach using Meg01 mRNA expression profiles following miR-1225-3p overexpression, a computational prediction analysis of miRNA target sequences and a previously published set of …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "SAMIE: statistical algorithm for modeling interaction energies",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814447362_0013",
            "Abstract": "We are investigating the rules that govern protein-DNA interactions, using a statistical mechanics based formalism that is related to the Boltzmann Machine of the neural net literature. Our approach is data-driven, in which probabilistic algorithms are used to model protein-DNA interactions, given SELEX and/or phage data as input. In the current report, we trained the network using SELEX data, under the “one-to-one” model of interactions (i.e. one amino acid contacts one base). The trained network was able to successfully identify the wild-type binding sites of EGR and MIG protein families. The predictions using our method are the same or better than that of methods existing in the literature. However our methodology offers the potential to capitalise in quantitative detail, as well as to be used to explore more general model of interactions, given availability of data.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Genome of the marsupial Monodelphis domestica reveals innovation in non-coding sequences",
            "Publication year": 2007,
            "Publication url": "https://www.nature.com/articles/nature05805",
            "Abstract": "We report a high-quality draft of the genome sequence of the grey, short-tailed opossum (Monodelphis domestica). As the first metatherian (‘marsupial’) species to be sequenced, the opossum provides a unique perspective on the organization and evolution of mammalian genomes. Distinctive features of the opossum chromosomes provide support for recent theories about genome evolution and function, including a strong influence of biased gene conversion on nucleotide sequence composition, and a relationship between chromosomal characteristics and X chromosome inactivation. Comparison of opossum and eutherian genomes also reveals a sharp difference in evolutionary innovation between protein-coding and non-coding functional elements. True innovation in protein-coding genes seems to be relatively rare, with lineage-specific differences being largely due to diversification and rapid turnover in gene …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Promiscuous Gene Activation (PGA): Reduced Transcriptional Activity of Islet Autoantigen Contributes to Loss of Self-Tolerance",
            "Publication year": 2005,
            "Publication url": "https://search.proquest.com/openview/7884c2c6a781987ce0c0ba5575d505d4/1?pq-origsite=gscholar&cbl=34443",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:lSLTfruPkqcC",
            "Publisher": "American Diabetes Association"
        },
        {
            "Title": "Probabilistic code for DNA recognition by proteins of the EGR family",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022283602009178",
            "Abstract": "A recognition code for protein–DNA interactions would allow for the prediction of binding sites based on protein sequence, and the identification of binding proteins for specific DNA targets. Crystallographic studies of protein–DNA complexes showed that a simple, deterministic recognition code does not exist. Here, we present a probabilistic recognition code (P-code) that assigns energies to all possible base-pair–amino acid interactions for the early growth response factor (EGR) family of zinc-finger transcription factors. The specific energy values are determined by a maximum likelihood method using examples from in vitro randomisation experiments (namely, SELEX and phage display) reported in the literature. The accuracy of the model is tested in several ways, including the ability to predict in vivo binding sites of EGR proteins and other non-EGR zinc-finger proteins, and the correlation between predicted and …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Causal network perturbations for instance-specific analysis of single cell and disease samples",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/36/8/2515/5686385",
            "Abstract": "Complex diseases involve perturbation in multiple pathways and a major challenge in clinical genomics is characterizing pathway perturbations in individual samples. This can lead to patient-specific identification of the underlying mechanism of disease thereby improving diagnosis and personalizing treatment. Existing methods rely on external databases to quantify pathway activity scores. This ignores the data dependencies and that pathways are incomplete or condition-specific.ssNPA is a new approach for subtyping samples based on deregulation of their gene networks. ssNPA learns a causal graph directly from control data. Sample-specific network neighborhood deregulation is quantified via the error incurred in predicting the expression of each gene from its Markov blanket. We evaluate the performance of ssNPA on liver development single-cell …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:2KloaMYe4IUC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Estrogen represses gene expression through reconfiguring chromatin structures",
            "Publication year": 2013,
            "Publication url": "https://academic.oup.com/nar/article-abstract/41/17/8061/2411212",
            "Abstract": "             Estrogen regulates over a thousand genes, with an equal number of them being induced or repressed. The distinct mechanisms underlying these dual transcriptional effects remain largely unknown. We derived comprehensive views of the transcription machineries assembled at estrogen-responsive genes through integrating multiple types of genomic data. In the absence of estrogen, the majority of genes formed higher-order chromatin structures, including DNA loops tethered to protein complexes involving RNA polymerase II (Pol II), estrogen receptor alpha (ERα) and ERα-pioneer factors. Genes to be ‘repressed’ by estrogen showed active transcription at promoters and throughout the gene bodies; genes to be ‘induced’ exhibited active transcription initiation at promoters, but with transcription paused in gene bodies. In the presence of estrogen, the majority of estrogen-induced genes retained the …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:M05iB0D1s5AC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "STAMP: a web tool for exploring DNA-binding motif similarities",
            "Publication year": 2007,
            "Publication url": "https://academic.oup.com/nar/article-abstract/35/suppl_2/W253/2920802",
            "Abstract": "STAMP is a newly developed web server that is designed to support the study of DNA-binding motifs. STAMP may be used to query motifs against databases of known motifs; the software aligns input motifs against the chosen database (or alternatively against a user-provided dataset), and lists of the highest-scoring matches are returned. Such similarity-search functionality is expected to facilitate the identification of transcription factors that potentially interact with newly discovered motifs. STAMP also automatically builds multiple alignments, familial binding profiles and similarity trees when more than one motif is inputted. These functions are expected to enable evolutionary studies on sets of related motifs and fixed-order regulatory modules, as well as illustrating similarities and redundancies within the input motif collection. STAMP is a highly flexible alignment platform, allowing users to ‘mix-and-match …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Is there a code for protein–DNA recognition? Probab (ilistical) ly…",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/bies.10073",
            "Abstract": "Transcriptional regulation of all genes is initiated by the specific binding of regulatory proteins called transcription factors to specific sites on DNA called promoter regions. Transcription factors employ a variety of mechanisms to recognise their DNA target sites. In the last few decades, attempts have been made to describe these mechanisms by general sets of rules and associated models. We give an overview of these models, starting with a historical review of the somewhat controversial issue of a “recognition code” governing protein–DNA interaction. We then present a probabilistic framework in which advantages and disadvantages of various models can be discussed. Finally, we conclude that simplifying assumptions about additivity of interactions are sufficiently justified in many situations (and can be suitably extended in other situations) to allow a unifying concept of a “probabilistic code” for protein–DNA …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Spectral clustering strategies for heterogeneous disease expression data",
            "Publication year": 2013,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814447973_0021",
            "Abstract": "Clustering of gene expression data simplifies subsequent data analyses and forms the basis of numerous approaches for biomarker identification, prediction of clinical outcome, and personalized therapeutic strategies. The most popular clustering methods such as K-means and hierarchical clustering are intuitive and easy to use, but they require arbitrary choices on their various parameters (number of clusters for K-means, and a threshold to cut the tree for hierarchical clustering). Human disease gene expression data are in general more difficult to cluster efficiently due to background (genotype) heterogeneity, disease stage and progression differences and disease subtyping; all of which cause gene expression datasets to be more heterogeneous. Spectral clustering has been recently introduced in many fields as a promising alternative to standard clustering methods. The idea is that pairwise comparisons can …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gene expression profiling distinguishes proneural glioma stem cells from mesenchymal glioma stem cells",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2213596015001518",
            "Abstract": "Tumor heterogeneity of high-grade glioma (HGG) is recognized by four clinically relevant subtypes based on core gene signatures. However, molecular signaling in glioma stem cells (GSCs) in individual HGG subtypes is poorly characterized. Previously we identified and characterized two mutually exclusive GSC subtypes with distinct activated signaling pathways and biological phenotypes. One GSC subtype presented with a gene signature resembling Proneural (PN) HGG, whereas the other was similar to mesenchymal (Mes) HGG. Classical HGG-derived GSCs were sub-classified as either one of these two subtypes. Differential mRNA expression analysis of PN and Mes GSCs identified 5796 differentially expressed genes, revealing a pronounced correlation with the corresponding PN or Mes HGGs. Mes GSCs displayed more aggressive phenotypes in vitro and as intracranial xenografts in mice. Further, Mes …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Acquisition of a potential marker for insect transformation: isolation of a novel alcohol dehydrogenase gene from Bactrocera oleae by functional complementation in yeast",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1007/PL00008679",
            "Abstract": " The alcohol dehydrogenase genes make up one of the best studied gene families in Drosophila, both in terms of expression and evolution. Moreover, alcohol dehydrogenase genes constitute potential versatile markers in insect transformation experiments. However, due to their rapid evolution, these genes cannot be cloned from other insect genera by DNA hybridization or PCR-based strategies. We have therefore explored an alternative strategy: cloning by functional complementation of appropriate yeast mutants. Here we report that two alcohol dehydrogenase genes from the medfly Ceratitis capitata can functionally replace the yeast enzymes, even though the medfly and yeast genes have evolved independently, acquiring their enzymatic function convergently. Using this method, we have cloned an alcohol dehydrogenase gene from the olive pest Bactrocera oleae. We conclude that functional …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Interpretable Factors in scRNA-seq Data with Disentangled Generative Models",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9288091/",
            "Abstract": "Single-cell RNA sequencing (scRNA-seq) experiments measure transcriptional profiles that encode diverse sources of variation, both biological and technical, and complex coordinations among them. PCA is a popular method for interpretable dimension reduction. However, it assumes a linear mapping between data and latent components and this may not be warranted in complex data. Single cell variational inference (scVI) offers a nonlinear method for latent space mapping, but the latent factors are not in general interpretable. In light of disentangled representations that learn independent data generative factors of single cell data in an unsupervised way, we propose factor variational inference (factorVI). FactorVI learns the disentangled factors among biologically relevant latent variables directly by penalizing correlations between them. We evaluate the factorVI through clustering in publicly available datasets …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "miR-1207-5p can contribute to dysregulation of inflammatory response in COVID-19 via targeting SARS-CoV-2 RNA",
            "Publication year": 2020,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fcimb.2020.586592/full",
            "Abstract": "The present study focuses on the role of human miRNAs in SARS-CoV-2 infection. An extensive analysis of human miRNA binding sites on the viral genome led to the identification of miR-1207-5p as potential regulator of the viral Spike protein. It is known that exogenous RNA can compete for miRNA targets of endogenous mRNAs leading to their overexpression. Our results suggest that SARS-CoV-2 virus can act as an exogenous competing RNA, facilitating the over-expression of its endogenous targets. Transcriptomic analysis of human alveolar and bronchial epithelial cells confirmed that the CSF1 gene, a known target of miR-1207-5p, is over-expressed following SARS-CoV-2 infection. CSF1 enhances macrophage recruitment and activation and its overexpression may contribute to the acute inflammatory response observed in severe COVID-19. In summary, our results indicate that dysregulation of miR-1207-5p-target genes during SARS-CoV-2 infection may contribute to uncontrolled inflammation in most severe COVID-19 cases.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Probabilistic Graphical Models Identify SNP Causal Predictors of COPD Markers and Comorbidities in Extreme Trait COPD Patients",
            "Publication year": 2018,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2018.197.1_MeetingAbstracts.A1707",
            "Abstract": "Rationale. Chronic obstructive pulmonary disease (COPD) is associated with significant variation in radiographic, symptomatic, and physiologic presentation. The underlying genetic basis of these phenotypic traits is not well understood. Identifying single nucleotide polymorphisms (SNPs) that are directly (causally) linked to COPD comorbidities and phenotypes is a useful step toward understanding the molecular basis of disease severity and progression. Methods. We analyzed the Pittsburgh SCCOR cohort data including pulmonary radiographic, physiologic, symptom scores, comorbid measures (including quantitive vascular and body composition measures), serum protein biomarkers and 130 targeted SNPs. We used a probabilistic graphical model method for mixed data (CausalMGM) that can distinguish between direct (causal) associations and simple correlations on multi-scale data, such as omics, imaging …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:JoZmwDi-zQgC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Regulatory conservation of protein coding and microRNA genes in vertebrates: lessons from the opossum genome",
            "Publication year": 2007,
            "Publication url": "https://genomebiology.biomedcentral.com/articles/10.1186/gb-2007-8-5-r84",
            "Abstract": "Being the first noneutherian mammal sequenced, Monodelphis domestica (opossum) offers great potential for enhancing our understanding of the evolutionary processes that take place in mammals. This study focuses on the evolutionary relationships between conservation of noncoding sequences, cis-regulatory elements, and biologic functions of regulated genes in opossum and eight vertebrate species. Analysis of 145 intergenic microRNA and all protein coding genes revealed that the upstream sequences of the former are up to twice as conserved as the latter among mammals, except in the first 500 base pairs, where the conservation is similar. Comparison of promoter conservation in 513 protein coding genes and related transcription factor binding sites (TFBSs) showed that 41% of the known human TFBSs are located in the 6.7% of promoter regions that are conserved between human and opossum. Some core biologic processes exhibited significantly fewer conserved TFBSs in human-opossum comparisons, suggesting greater functional divergence. A new measure of efficiency in multigenome phylogenetic footprinting (base regulatory potential rate [BRPR]) shows that including human-opossum conservation increases specificity in finding human TFBSs. Opossum facilitates better estimation of promoter conservation and TFBS turnover among mammals. The fact that substantial TFBS numbers are located in a small proportion of the human-opossum conserved sequences emphasizes the importance of marsupial genomes for phylogenetic footprinting-based motif discovery strategies. The BRPR measure is expected to help select …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:Se3iqnhoufwC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Mapping and identification of essential gene functions on the X chromosome of Drosophila",
            "Publication year": 2002,
            "Publication url": "https://www.embopress.org/doi/full/10.1093/embo-reports/kvf012",
            "Abstract": "The Drosophila melanogaster genome consists of four chromosomes that contain 165 Mb of DNA, 120 Mb of which are euchromatic. The two Drosophila Genome Projects, in collaboration with Celera Genomics Systems, have sequenced the genome, complementing the previously established physical and genetic maps. In addition, the Berkeley Drosophila Genome Project has undertaken large‐scale functional analysis based on mutagenesis by transposable P element insertions into autosomes. Here, we present a large‐scale P element insertion screen for vital gene functions and a BAC tiling map for the X chromosome. A collection of 501 X‐chromosomal P element insertion lines was used to map essential genes cytogenetically and to establish short sequence tags (STSs) linking the insertion sites to the genome. The distribution of the P element integration sites, the identified genes and transcription units as …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Mixed Graphical Model Learning to Predict Risk of Developing Neurological Complications in the Pediatric Intensive Care Unit",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=17774035720128201280&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:ZuybSZzF8UAC",
            "Publisher": "WILEY"
        },
        {
            "Title": "CausalMGM: an interactive web-based causal discovery tool",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/nar/article-abstract/48/W1/W597/5835810",
            "Abstract": "High-throughput sequencing and the availability of large online data repositories (e.g. The Cancer Genome Atlas and Trans-Omics for Precision Medicine) have the potential to revolutionize systems biology by enabling researchers to study interactions between data from different modalities (i.e. genetic, genomic, clinical, behavioral, etc.). Currently, data mining and statistical approaches are confined to identifying correlates in these datasets, but researchers are often interested in identifying cause-and-effect relationships. Causal discovery methods were developed to infer such cause-and-effect relationships from observational data. Though these algorithms have had demonstrated successes in several biomedical applications, they are difficult to use for non-experts. So, there is a need for web-based tools to make causal discovery methods accessible. Here, we present CausalMGM (http://causalmgm.org/), the …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A21 IMMUNE MECHANISMS OF SARCOIDOSIS AND OTHER GRANULOMATOUS DISEASES: Race Distinct Gene Expression Patterns In Peripheral Blood Mononuclear Cells And Bronchoalveolar Lavage Cells Of Sarcoidosis Subjects",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/adb573edd7698853961276f427dc20f4/1?pq-origsite=gscholar&cbl=40575",
            "Abstract": "Results: 147 and 45 paired PBMC and BAL cell samples, from black and white subjects, respectively, passed data quality control, and were included in the analysis. 76 and 417 genes were increased, 113 and 541 genes were decreased in BAL and PBMC, respectively in black compared to white subjects. 55 of the race related genes overlapped between PBMC and BAL. Other pathways increased in PBMC from black subjects included T cell receptor, CD28, MHCI immune response, and cell cycle pathways.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:Mojj43d5GZwC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Web-Based Identification of Evolutionary Conserved DNA cis-Regulatory Elements",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-59745-514-5_26.pdf",
            "Abstract": "Transcription regulation on a gene-by-gene basis is achieved through transcription factors, the DNA-binding proteins that recognize short DNA sequences in the proximity of the genes. Unlike other DNA-binding proteins, each transcription factor recognizes a number of sequences, usually variants of a preferred, “consensus” sequence. The degree of dissimilarity of a given target sequence from the consensus is indicative of the binding affinity of the transcription factor–DNA interaction. Because of the short size and the degeneracy of the patterns, it is frequently difficult for a computational algorithm to distinguish between the true sites and the background genomic “noise.” One way to overcome this problem of low signal-to-noise ratio is to use evolutionary information to detect signals that are conserved in two or more species. FOOTER is an algorithm that uses this phylogenetic footprinting concept and …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Respiratory microbiome profiling for etiologic diagnosis of pneumonia in mechanically ventilated patients",
            "Publication year": 2018,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fmicb.2018.01413/full",
            "Abstract": "Etiologic diagnosis of bacterial pneumonia relies on identification of causative pathogens by cultures, which require extended incubation periods and have limited sensitivity. Next-generation sequencing of microbial DNA directly from patient samples may improve diagnostic accuracy for guiding antibiotic prescriptions. In this study, we hypothesized that enhanced pathogen detection using sequencing can improve upon culture-based diagnosis and that certain sequencing profiles correlate with host response. We prospectively collected endotracheal aspirates and plasma within 72 hours of intubation from patients with acute respiratory failure. We performed 16S rRNA gene sequencing to determine pathogen abundance in lung samples and measured plasma biomarkers to assess host responses to detected pathogens. Among 56 patients, 12 patients (21%) had positive respiratory cultures. Sequencing revealed lung communities with low diversity (p50% relative abundance) corresponding to clinically isolated pathogens (concordance p=0.009). Importantly, sequencing detected dominant pathogens in 20% of the culture-negative patients exposed to broad-spectrum empiric antibiotics. Regardless of culture results, pathogen dominance correlated with increased plasma markers of host injury (receptor of advanced glycation end-products-RAGE) and inflammation (interleukin-6, tumor necrosis factor receptor 1-TNFR1) (p<0.05), compared to subjects without dominant pathogens in their lung communities. Machine-learning algorithms identified pathogen abundance by sequencing as the most informative predictor of culture positivity. Thus …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Plasma β-d-Glucan Levels Are Associated with Host Inflammation, Impaired Gut Barrier Function, Gut Bacterial Dysbiosis and Clinical Outcomes in Critical Illness",
            "Publication year": 2020,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2020.201.1_MeetingAbstracts.A2764",
            "Abstract": "Background: Plasma levels of (1, 3)-β-d-glucan (BDG), a fungal cell-wall constituent, can be used in the diagnosis of invasive fungal infections (IFI), but whether BDG is detectable and whether it carries prognostic information in critically-ill patients without IFI has not been thoroughly studied. Detectable plasma BDG, in critically-ill patients in the absence of IFI, may reflect gut translocation of fungi, or fungal wall components, to the bloodstream, where they may stimulate host innate immune responses. We hypothesized that BDG levels correlate with host-response and gut permeability biomarkers as well as clinical outcomes. Methods: We collected plasma samples for BDG and biomarker measurements, as well as stool specimens and/or rectal swabs for microbiome analyses (16S rRNA gene sequencing) from consecutive mechanically-ventilated patients with acute respiratory failure within 48 hours of intubation. We …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:yB1At4FlUx8C",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Regulation Telomerase and Telomere Length In IPF By MicroRNAs.",
            "Publication year": 2010,
            "Publication url": "https://www.atsjournals.org/doi/pdf/10.1164/ajrccm-conference.2010.181.1_MeetingAbstracts.A2297",
            "Abstract": "Rationale telomerase complex underlie inheritance in a subset of families with IPF. MicroRNAs (miRNAs) are regulators of myriad cellular events. We have earlier shown differential regulation of a number of miRNA in IPF lungs compared to control. Here we report that miRNAs are a potential determinant of telomere length in IPF by regulating the expression of telomerase (TERT) and protective shelterin subunits.: Each component of the telomerase and shelterin complexes were scanned by mirBASE, a tool for miRNA genomics, for the",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "Genomic analysis of immediate/early response to shear stress in human coronary artery endothelial cells",
            "Publication year": 2002,
            "Publication url": "https://journals.physiology.org/doi/abs/10.1152/physiolgenomics.00016.2002",
            "Abstract": "The involvement of shear stress in the pathogenesis of vascular disease has motivated efforts to define the endothelial cell response to applied shear stress in vitro. A central question has been the mechanisms by which endothelial cells perceive and respond to changes in fluid flow. We have utilized cDNA microarrays to characterize the immediate/early genomic response to applied laminar shear stress (LSS) in primary cultures of human coronary artery endothelial cells (HCAECs). Cells were exposed, in a parallel plate flow chamber, to 0, 15, or 45 dyn/cm2 LSS for 1 h, and gene expression profiles were determined using human GEM1 cDNA microarrays. We find that a high proportion of LSS-responsive genes are transcription factors, and these are related by their involvement in growth arrest. These likely play a central role in the reprogramming of endothelial homeostasis following the switch from a static to a …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:abG-DnoFyZgC",
            "Publisher": "American Physiological Society"
        },
        {
            "Title": "Biomarker identification for statin sensitivity of cancer cell lines",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0006291X1732243X",
            "Abstract": "Statins are potent cholesterol reducing drugs that have been shown to reduce tumor cell proliferation in vitro and tumor growth in animal models. Moreover, retrospective human cohort studies demonstrated decreased cancer-specific mortality in patients taking statins. We previously implicated membrane E-cadherin expression as both a marker and mechanism for resistance to atorvastatin-mediated growth suppression of cancer cells; however, a transcriptome-profile-based biomarker signature for statin sensitivity has not yet been reported. Here, we utilized transcriptome data from fourteen NCI-60 cancer cell lines and their statin dose-response data to produce gene expression signatures that identify statin sensitive and resistant cell lines. We experimentally confirmed the validity of the identified biomarker signature in an independent set of cell lines and extended this signature to generate a proposed statin …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "An improvement of ComiR algorithm for microRNA target prediction by exploiting coding region sequences of mRNAs",
            "Publication year": 2020,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/s12859-020-3519-5",
            "Abstract": "MicroRNA are small non-coding RNAs that post-transcriptionally regulate the expression levels of messenger RNAs. MicroRNA regulation activity depends on the recognition of binding sites located on mRNA molecules. ComiR is a web tool realized to predict the targets of a set of microRNAs, starting from their expression profile. ComiR was trained with the information regarding binding sites in the 3’utr region, by using a reliable dataset containing the targets of endogenously expressed microRNA in D. melanogaster S2 cells. This dataset was obtained by comparing the results from two different experimental approaches, i.e., inhibition, and immunoprecipitation of the AGO1 protein--a component of the microRNA induced silencing complex. In this work, we tested whether including coding region binding sites in ComiR algorithm improves the performance of the tool in predicting microRNA targets. We focused the analysis on the D. melanogaster species and updated the ComiR underlying database with the currently available releases of mRNA and microRNA sequences. As a result, we find that ComiR algorithm trained with the information related to the coding regions is more efficient in predicting the microRNA targets, with respect to the algorithm trained with 3’utr information. On the other hand, we show that 3’utr based predictions can be seen as complementary to the coding region based predictions, which suggests that both predictions, from 3’utr and coding regions, should be considered in comprehensive analysis. Furthermore, we observed that the lists of targets obtained by analyzing data from one experimental approach only, that is …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:BUYA1_V_uYcC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Plasma (1-3)-β-d-glucan levels are associated with host inflammatory responses and predict adverse clinical outcomes in critical illness",
            "Publication year": 2020,
            "Publication url": "https://www.medrxiv.org/content/10.1101/2020.06.11.20128264v1.abstract",
            "Abstract": "Background: The fungal cell-wall constituent (1,3)-beta-d-glucan (BDG) is a pathogen-associated molecular pattern (PAMP) that can stimulate innate immunity. We hypothesized that BDG from colonizing fungi in critically-ill patients may translocate into the systemic circulation and thus be associated with host inflammatory responses and outcomes.   Methods: We enrolled 453 mechanically-ventilated patients with acute respiratory failure with no evidence of invasive fungal infection (IFI). From serial plasma samples, we measured BDG, innate immunity and epithelial permeability biomarkers. From lower respiratory tract and stool samples we quantified bacterial and fungal DNA load using culture-independent techniques.   Results: A positive BDG test (>60pg/ml) at baseline was detected in 19% of patients. BDG levels were significantly associated with markers of innate immunity (interleukin-6, tumor necrosis factor receptor-1 and procalcitonin), epithelial barrier disruption (receptor for advanced glycation end-products and fatty-acid binding protein-2, for lung and gut respectively) and with higher probability of classification in an adverse prognosis hyperinflammatory subphenotype (all p<0.05). No differences in fungal or bacterial DNA load were found by BDG test positivity. Positive BDG testing was associated with higher incidence of acute kidney injury, fewer ventilator free days and worse 30-day survival (adjusted p<0.05). Patients with positive BDG test on follow-up sampling (>3 days from intubation) had higher mortality than patients with persistently negative test on follow-up (p<0.05).   Conclusions: This is the first study to demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:ipzZ9siozwsC",
            "Publisher": "Cold Spring Harbor Laboratory Press"
        },
        {
            "Title": "MicroRNA expression profiling predicts clinical outcome of carboplatin/paclitaxel-based therapy in metastatic melanoma treated on the ECOG-ACRIN trial E2603",
            "Publication year": 2015,
            "Publication url": "https://clinicalepigeneticsjournal.biomedcentral.com/articles/10.1186/s13148-015-0092-2",
            "Abstract": "Carboplatin/paclitaxel (CP), with or without sorafenib, result in objective response rates of 18–20 % in unselected chemotherapy-naïve patients. Molecular predictors of survival and response to CP-based chemotherapy in metastatic melanoma (MM) are critical to improving the therapeutic index. Intergroup trial E2603 randomized MM patients to CP with or without sorafenib. Expression data were collected from pre-treatment formalin-fixed paraffin-embedded (FFPE) tumor tissues from 115 of 823 patients enrolled on E2603. The selected patients were balanced across treatment arms, BRAF status, and clinical outcome. We generated data using Nanostring array (microRNA (miRNA) expression) and DNA-mediated annealing, selection, extension and ligation (DASL)/Illumina microarrays (HT12 v4) (mRNA expression) with protocols optimized for FFPE samples. Integrative computational analysis was performed using a novel Tree-guided Recursive Cluster Selection (T-ReCS) [1] algorithm to select the most informative features/genes, followed by TargetScan miRNA target prediction (Human v6.2) and mirConnX [2] for network inference. T-ReCS identified PLXNB1 as negatively associated with progression-free survival (PFS) and miR-659-3p as the primary miRNA associated positively with PFS. miR-659-3p was differentially expressed based on PFS but not based on treatment arm, BRAF or NRAS status. Dichotomized by median PFS (less vs greater than 4 months), miR-659-3p expression was significantly different. High miR-659-3p expression distinguished patients with responsive disease (complete or partial response) from patients with stable …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:bFI3QPDXJZMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "T-ReCS: stable selection of dynamically formed groups of features with application to prediction of clinical outcomes",
            "Publication year": 2014,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814644730_0041",
            "Abstract": "Feature selection is used extensively in biomedical research for biomarker identification and patient classification, both of which are essential steps in developing personalized medicine strategies. However, the structured nature of the biological datasets and high correlation of variables frequently yield multiple equally optimal signatures, thus making traditional feature selection methods unstable. Features selected based on one cohort of patients, may not work as well in another cohort. In addition, biologically important features may be missed due to selection of other co-clustered features We propose a new method, Tree-guided Recursive Cluster Selection (T-ReCS), for efficient selection of grouped features. T-ReCS significantly improves predictive stability while maintains the same level of accuracy. T-ReCS does not require an a priori knowledge of the clusters like group-lasso and also can handle “orphan …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A72 MECHANISMS DRIVING FIBROSIS: Towards Understanding Spatial Lung Tissue Heterogeneity In Idiopathic Pulmonary Fibrosis (ipf)",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/c50e300c3b93a63a1f71de141dd5240f/1?pq-origsite=gscholar&cbl=40575",
            "Abstract": "While significant research has been into describing gene expression patterns characteristic to IPF, the causal relations between tissue morphology and gene expression has not been studied. Here, we study these causal mechanisms by integrating newly developed digital image processing methods with RNA-sequencing (RNA-seq) of formalin fixed paraffin embedded (FFPE) tissues and detailed clinical information.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "American Thoracic Society"
        },
        {
            "Title": "The center for causal discovery of biomedical knowledge from big data",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/jamia/article-abstract/22/6/1132/2357622",
            "Abstract": "The Big Data to Knowledge (BD2K) Center for Causal Discovery is developing and disseminating an integrated set of open source tools that support causal modeling and discovery of biomedical knowledge from large and complex biomedical datasets. The Center integrates teams of biomedical and data scientists focused on the refinement of existing and the development of new constraint-based and Bayesian algorithms based on causal Bayesian networks, the optimization of software for efficient operation in a supercomputing environment, and the testing of algorithms and software developed using real data from 3 representative driving biomedical projects: cancer driver mutations, lung disease, and the functional connectome of the human brain. Associated training activities provide both biomedical and data scientists with the knowledge and skills needed to apply and extend these tools. Collaborative …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:_xSYboBqXhAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Proliferating SPP1/MERTK-expressing macrophages in idiopathic pulmonary fibrosis",
            "Publication year": 2019,
            "Publication url": "https://erj.ersjournals.com/content/54/2/1802441.short",
            "Abstract": "A comprehensive understanding of the changes in gene expression in cell types involved in idiopathic pulmonary fibrosis (IPF) will shed light on the mechanisms underlying the loss of alveolar epithelial cells and development of honeycomb cysts and fibroblastic foci. We sought to understand changes in IPF lung cell transcriptomes and gain insight into innate immune aspects of pathogenesis.We investigated IPF pathogenesis using single-cell RNA-sequencing of fresh lung explants, comparing human IPF fibrotic lower lobes reflecting late disease, upper lobes reflecting early disease and normal lungs.IPF lower lobes showed increased fibroblasts, and basal, ciliated, goblet and club cells, but decreased alveolar epithelial cells, and marked alterations in inflammatory cells. We found three discrete macrophage subpopulations in normal and fibrotic lungs, one expressing monocyte markers, one highly expressing …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:evX43VCCuoAC",
            "Publisher": "European Respiratory Society"
        },
        {
            "Title": "COPDGene® 2019: redefining the diagnosis of chronic obstructive pulmonary disease",
            "Publication year": 2019,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7020846/",
            "Abstract": "Background: Chronic obstructive pulmonary disease (COPD) remains a major cause of morbidity and mortality. Present-day diagnostic criteria are largely based solely on spirometric criteria. Accumulating evidence has identified a substantial number of individuals without spirometric evidence of COPD who suffer from respiratory symptoms and/or increased morbidity and mortality. There is a clear need for an expanded definition of COPD that is linked to physiologic, structural (computed tomography [CT]) and clinical evidence of disease. Using data from the COPD Genetic Epidemiology study (COPDGene®), we hypothesized that an integrated approach that includes environmental exposure, clinical symptoms, chest CT imaging and spirometry better defines disease and captures the likelihood of progression of respiratory obstruction and mortality.Methods: Four key disease characteristics–environmental exposure …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:9Nmd_mFXekcC",
            "Publisher": "COPD Foundation"
        },
        {
            "Title": "Evaluation of causal structure learning methods on mixed data types",
            "Publication year": 2018,
            "Publication url": "http://proceedings.mlr.press/v92/raghu18a.html",
            "Abstract": "Causal structure learning algorithms are very important in many fields, including biomedical sciences, because they can uncover the underlying causal network structure from observational data. Several such algorithms have been developed over the years, but they usually operate on datasets of a single data type: continuous or discrete variables only. More recently, we and others have proposed new causal structure learning algorithms for mixed data types. However, to-date there is no study that critically evaluates these methods’ performance. In this paper, we provide the first extensive empirical evaluation of several popular causal structure learning methods on mixed data types and in a variety of parameter settings and sample sizes. Our results serve as a guide as to which method performs the best in a given context, and as such they are a first step towards a “method selection guide” for those running causal modeling methods on real life datasets.",
            "Abstract entirety": 1,
            "Author pub id": "B5NDW0EAAAAJ:WqliGbK-hY8C",
            "Publisher": "PMLR"
        },
        {
            "Title": "Transcriptional regulatory model of fibrosis progression in the human lung",
            "Publication year": 2019,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6948862/",
            "Abstract": "To develop a systems biology model of fibrosis progression within the human lung we performed RNA sequencing and microRNA analysis on 95 samples obtained from 10 idiopathic pulmonary fibrosis (IPF) and 6 control lungs. Extent of fibrosis in each sample was assessed by microCT-measured alveolar surface density (ASD) and confirmed by histology. Regulatory gene expression networks were identified using linear mixed-effect models and dynamic regulatory events miner (DREM). Differential gene expression analysis identified a core set of genes increased or decreased before fibrosis was histologically evident that continued to change with advanced fibrosis. DREM generated a systems biology model (www. sb. cs. cmu. edu/IPFReg) that identified progressively divergent gene expression tracks with microRNAs and transcription factors that specifically regulate mild or advanced fibrosis. We confirmed …",
            "Abstract entirety": 0,
            "Author pub id": "B5NDW0EAAAAJ:j8SEvjWlNXcC",
            "Publisher": "American Society for Clinical Investigation"
        }
    ]
}]