[{
    "name": "Περικλής Μήτκας",
    "romanize name": "Periklis Mitkas",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 7874,
    "Scholar name": "Pericles A. Mitkas",
    "Scholar id": "t58rc8QAAAAJ",
    "Affiliation": "Professor of Electrical and Computer Engineering, Aristotle University of Thessaloniki, Greece",
    "Citedby": 3766,
    "Interests": [
        "Databases",
        "Intelligent Systems",
        "Data Mining",
        "Software Engineering",
        "Software Agents"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=t58rc8QAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "CASSANDRA-A simulation-based, decision-support tool for energy market stakeholders",
            "Publication year": 2015,
            "Publication url": "http://eprints.eudl.eu/id/eprint/2221/",
            "Abstract": "Energy gives personal comfort to people, and is essential for the generation of commercial and societal wealth. Nevertheless, energy production and consumption place considerable pressures on the environment, such as the emission of green- house gases and air pollutants. They contribute to climate change, damage natural ecosystems and the man-made environment, and cause adverse effects to human health. Lately, novel market schemes emerge, such as the formation and operation of customer coalitions aiming to improve their market power through the pursuit of common benefits.  In this paper we present CASSANDRA, an open source 1 , expandable software platform for modelling the demand side of power systems, focusing on small scale consumers. The structural elements of the platform are a) the electrical installations (i.e. households, commercial stores, small industries etc.), b) the respective appliances installed, and c) the electrical consumption-related activities of the people residing in the installations.  CASSANDRA serves as a tool for simulation of real demand- side environments providing decision support for energy market stakeholders. The ultimate goal of the CASSANDRA simulation functionality is the identification of good practices that lead to energy efficiency, clustering electric energy consumers according to their consumption patterns, and the studying consumer change behaviour when presented with various demand response programs.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:nZcligLrVowC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applying machine learning techniques on air quality data for real-time decision support",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.101.5848&rep=rep1&type=pdf",
            "Abstract": "Fairly rapid environmental changes call for continuous surveillance and decision making, areas where IT technologies can be valuable. In the aforementioned context this work describes the application of a novel classifier, namely σ-",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance Evaluation of Agents and Multi-agent Systems Using Formal Specifications in Z Notation",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20230-3_6",
            "Abstract": "Despite the plethora of frameworks and tools for developing agent systems, there is a remarkable lack of generalised methodologies for assessing their performance. Existing methods in the field of software engineering do not adequately address the unpredictable and complex nature of intelligent agents. We introduce a generic methodology for evaluating agent performance; the Agent Performance Evaluation (APE) methodology consists of representation tools, guidelines and techniques for organizing, categorizing and using metrics, measurements and aggregated characterizations of agent performance. The core of APE is the Metrics Representation Tree, a generic structure that enables efficient manipulation of evaluation-specific information. This paper provides a formal specification of the proposed methodology in Z notation and demonstrates how to apply it on an existing multi-agent system.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:dBIO0h50nwkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Fuzzy lattice reasoning (FLR) classifier and its application for ambient ozone estimation",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0888613X06000909",
            "Abstract": "The fuzzy lattice reasoning (FLR) classifier is presented for inducing descriptive, decision-making knowledge (rules) in a mathematical lattice data domain including space RN. Tunable generalization is possible based on non-linear (sigmoid) positive valuation functions; moreover, the FLR classifier can deal with missing data. Learning is carried out both incrementally and fast by computing disjunctions of join-lattice interval conjunctions, where a join-lattice interval conjunction corresponds to a hyperbox in RN. Our testbed in this work concerns the problem of estimating ambient ozone concentration from both meteorological and air-pollutant measurements. The results compare favorably with results obtained by C4.5 decision trees, fuzzy-ART as well as back-propagation neural networks. Novelties and advantages of classifier FLR are detailed extensively and in comparison with related work from the literature.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A neat way for evolving echo state networks",
            "Publication year": 2010,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-60750-606-5-909",
            "Abstract": "The Reinforcement Learning (RL) paradigm is an appropriate formulation for agent, goal-directed, sequential decision making. In order though for RL methods to perform well in difficult, complex, real-world tasks, the choice and the architecture of an appropriate function approximator is of crucial importance. This work presents a method of automatically discovering such function approximators, based on a synergy of ideas and techniques that are proven to be working on their own. Using Echo State Networks (ESNs) as our function approximators of choice, we try to adapt them, by combining evolution and learning, for developing the appropriate ad-hoc architectures to solve the problem at hand. The choice of ESNs was made for their ability to handle both non-linear and non-Markovian tasks, while also being capable of learning online, through simple gradient descent temporal difference learning. For creating …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A grid-enabled algorithm yields figure-eight molecular knot",
            "Publication year": 2009,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08927020902833103",
            "Abstract": "The recently proposed general molecular knotting algorithm and its associated package, MolKnot, introduce programming into certain sections of stereochemistry. This work reports the G-MolKnot procedure that was deployed over the grid infrastructure; it applies a divide-and-conquer approach to the problem by splitting the initial search space into multiple independent processes and, combining the results at the end, yields significant improvements with regards to the overall efficiency. The algorithm successfully detected the smallest ever reported alkane configured to an open-knotted shape with four crossings.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Areas of Application & Future Directions",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-25757-8_10",
            "Abstract": "We have mentioned repeatedly in this book that the agent paradigm can be adopted by a great variety of application domains, since agents constitute the software building blocks of a new generation. Nevertheless, for a fruitful coupling of agent technology with data mining, either historical data (of any type) must be available, or the knowledge mechanisms of agents must allow self-organization. In Chapters 6 to 8 we have discussed in considerable detail three representative application domains. Here, we briefly outline some additional areas that exhibit the above characteristics and, thus, are good candidates for agent training.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Rapp: a robotic-oriented ecosystem for delivering smart user empowering applications for older people",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s12369-016-0361-z",
            "Abstract": "It is a general truth that increase of age is associated with a level of mental and physical decline but unfortunately the former are often accompanied by social exclusion leading to marginalization and eventually further acceleration of the aging process. A new approach in alleviating the social exclusion of older people involves the use of assistive robots. As robots rapidly invade everyday life, the need of new software paradigms in order to address the user’s unique needs becomes critical. In this paper we present a novel architectural design, the RAPP [a software platform to deliver smart, user empowering robotic applications (RApps)] framework that attempts to address this issue. The proposed framework has been designed in a cloud-based approach, integrating robotic devices and their respective applications. We aim to facilitate seamless development of RApps compatible with a wide range of …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:Bg7qf7VwUHIC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Agent mining: The synergy of agents and data mining",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4983383/",
            "Abstract": "Autonomous agents and multiagent systems (or agents) and data mining and knowledge discovery (or data mining) are two of the most active areas in information technology. Ongoing research has revealed a number of intrinsic challenges and problems facing each area, which can't be addressed solely within the confines of the respective discipline. A profound insight of bringing these two communities together has unveiled a tremendous potential for new opportunities and wider applications through the synergy of agents and data mining. With increasing interest in this synergy, agent mining is emerging as a new research field studying the interaction and integration of agents and data mining. In this paper, we give an overall perspective of the driving forces, theoretical underpinnings, main research issues, and application domains of this field, while addressing the state-of-the-art of agent mining research and …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards improving multiagent simulation in safety management and hazards control environments",
            "Publication year": 2002,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2017/01/TOWARDS-IMPROVING-MULTI-AGENT-SIMULATION-IN-SAFETY-MANAGEMENT-AND-HAZARD-CONTROL-ENVIRONMENTS.pdf",
            "Abstract": "This paper introduces the capabilities of Agent Academy in the area of Safety Management and Hazard Control Systems. Agent Academy is a framework under development, which uses data mining techniques for training intelligent agents. This framework generates software agents with an initial degree of intelligence and trains them to manipulate complex tasks. The agents, are further integrated into a simulation multi-agent environment capable of managing issues in a hazardous environment, as well as regulating the parameters of the safety management strategy to be deployed in order to control the hazards. The initially created agents take part in long agentto-agent transactions and their activities are formed into behavioural data, which are stored in a database. As soon as the amount of collected data increases sufficiently, a data mining process is initiated, in order to extract specific trends adapted by agents and improve their intelligence. The result of the overall procedure aims to improve the simulation environment of safety management. The communication of agents as well as the architectural characteristics of the simulation environment adheres to the set of specifications imposed by the Foundation for Intelligent Physical Agents (FIPA).",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hive Collective Intelligence for Cloud Robotics: A Hybrid Distributed Robotic Controller Design for Learning and Adaptation",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-15847-1_7",
            "Abstract": "The recent advent of Cloud Computing, inevitably gave rise to Cloud Robotics. Whilst the field is arguably still in its infancy, great promise is shown regarding the problem of limited computational power in Robotics. This is the most evident advantage of Cloud Robotics, but, other much more significant yet subtle advantages can now be identified. Moving away from traditional Robotics, and approaching Cloud Robotics through the prism of distributed systems or Swarm Intelligence offers quite an interesting composure; physical robots deployed across different areas, may delegate tasks to higher intelligence agents residing in the cloud. This design has certain distinct attributes, similar with the organisation of a Hive or bee colony. Such a parallelism is crucial for the foundations set hereinafter, as they express through the hive design, a new scheme of distributed robotic architectures. Delegation of agent …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:yMeIxYmEMEAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Redefining the market power of small-scale electricity consumers through consumer social networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6686237/",
            "Abstract": "Energy markets have undergone important changes at the conceptual level over the last years. Decentralized supply, small-scale production and smart grid optimization and control are the new building blocks. These changes offer substantial opportunities for all energy market stakeholders, some of which however, remain largely unexploited. Small-scale consumers, as a whole, account for significant amount of energy in current markets (up to 40%), as individuals though their consumption is trivial, and their market power practically non-existent. Thus, it is necessary to assist small-scale energy market stakeholders combine their market power. Within the context of this work we propose Consumer Social Networks (CSNs) as a means for achieve the objective. We present a simulation environment for the creation of CSNs and provide a proof of concept on how CSNs can be formulated based on various criteria. Each …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated infrastructure for monitoring and evaluating agent-based systems",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417408006738",
            "Abstract": "Driven by the urging need to thoroughly identify and accentuate the merits of agent technology, we present in this paper, MEANDER, an integrated framework for evaluating the performance of agent-based systems. The proposed framework is based on the Agent Performance Evaluation (APE) methodology, which provides guidelines and representation tools for performance metrics, measurement collection and aggregation of measurements. MEANDER comprises a series of integrated software components that implement and automate various parts of the methodology and assist evaluators in their tasks. The main objective of MEANDER is to integrate performance evaluation processes into the entire development lifecycle, while clearly separating any evaluation-specific code from the application code at hand. In this paper, we describe in detail the architecture and functionality of the MEANDER components and …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A semantic tag recommendation framework for collaborative tagging systems",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6113185/",
            "Abstract": "In this work we focus on folksonomies. Our goal is to develop techniques that coordinate information processing, by taking advantage of user preferences, in order to automatically produce semantic tag recommendations. To this end, we propose a generalized tag recommendation framework that conveys the semantics of resources according to different user profiles. We present the integration of various models that take into account content, historic values, user preferences and tagging behavior to produce accurate personalized tag recommendations. Based on this information we build several Bayesian models, we evaluate their performance, and we discuss differences in accuracy with respect to semantic matching criteria, and other approaches.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:EYYDruWGBe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating knowledge intensive multi-agent systems",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72839-9_6",
            "Abstract": "As modern applications tend to stretch between large, ever-growing datasets and increasing demand for meaningful content at the user end, more elaborate and sophisticated knowledge extraction technologies are needed. Towards this direction, the inherently contradicting technologies of deductive software agents and inductive data mining have been integrated, in order to address knowledge intensive problems. However, there exists no generalized evaluation methodology for assessing the efficiency of such applications. On the one hand, existing data mining evaluation methods focus only on algorithmic precision, ignoring overall system performance issues. On the other hand, existing systems evaluation techniques are insufficient, as the emergent intelligent behavior of agents introduce unpredictable factors of performance. In this paper, we present a generalized methodology for performance …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Science4Fashion: An Autonomous Recommendation System for Fashion Designers",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-79150-6_57",
            "Abstract": "In the clothing industry, design, development, and procurement teams have been affected more than any other industry and are constantly under pressure to present more products with fewer resources in a shorter time. The diversity of garment designs created as new products is not found in any other industry and is almost independent of the size of the business. Science4Fashion is a semi-autonomous intelligent personal assistant for fashion product designers. Our system consists of an interactive environment where a user utilizes different modules responsible for a) data collection from online sources, b) knowledge extraction, c) clustering, and d) trend/product recommendation. This paper is focusing on two core modules of the implemented system. The Clustering Module combines various clustering algorithms and offers a consensus that arranges data in clusters. At the same time, the Product …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:-7ulzOJl1JYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Classification techniques for air quality forecasting",
            "Publication year": 2006,
            "Publication url": "https://athanasiadis.info/assets/pdf/besai2006.pdf",
            "Abstract": "Air quality forecasting is one of the core elements of contemporary Urban Air Quality Management and Information Systems. Such systems are usually set up in order to serve environmental legislation needs and are tailored towards decision makers (for atmospheric quality problem abatement) and citizens (for early warning and information provision). The pluralism of forecasting methods that are available does not always lead to forecasting success, as the specific characteristics of each area of interest and the complicated, mostly chaotic relationships between air quality, meteorology, emissions and topography, limit the effectiveness of the methods used. On the other hand, the timescale of air quality problems dictate the usage of relatively “fast” methods, while the varying quality of input data calls for methods that have a low sensitivity in this factor and a high operational potential. For this reason, it is always interesting to perform a comparative study between various air quality forecasting methods and tools. The present paper describes the comparison work performed between several statistical methods and classification algorithms, on the basis of their performance for specific air quality time series in Athens, Greece.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "VenueRank: Identifying Venues that Contribute to Artist Popularity.",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil-Krasanakis/publication/332574670_VenueRank_Identifying_Venues_that_Contribute_to_Artist_Popularity/links/5cbefceea6fdcc1d49a89f3e/VenueRank-Identifying-Venues-that-Contribute-to-Artist-Popularity.pdf",
            "Abstract": "An important problem in the live music industry is finding venues that help expose artists to wider audiences. However, it is often difficult to obtain live music audience data to tackle this task. In this work, we investigate whether important venues can instead be inferred through social media data. Our approach consists of employing bipartite graph ranking algorithms to help discover important venues in artist-venue graphs mined from Facebook. We use both well-established algorithms, such as BiRank, and a modification of their common iterative scheme that avoids the impact of possibly erroneous heuristics to the ranking, which we call VenueRank. Resulting venue ranks are compared to those obtained from feature extraction for predicting the most listened artists and large listener increments in Spotify. This comparison yields high correlation between venue importance for listener prediction and bipartite graph ranking algorithms, with VenueRank found more robust against overfitting.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:nRpfm8aw39MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data Mining Air Quality Data for Athens, Greece.",
            "Publication year": 2006,
            "Publication url": "http://enviroinfo.eu/sites/default/files/pdfs/vol114/0505.pdf",
            "Abstract": "Urban air quality management and information systems are required to include advanced capabilities of quick, effective and easy to operate environmental data analysis applications, for information extraction and analysis and for the support of decision making. These systems are based on the need of city authorities and national governments to establish a framework which enables them to take actions, in order to ensure that air quality is improved and relevant standards are maintained in urban areas. In this context, quantitative data-driven decision support models are challenged by the difficulties in handling dynamic and uncertain features of real-world environmental systems. In addition, conditions for environmental management keep changing with time, demanding periodically updated decision support. These properties can be realized by learning from environmental data, using knowledge discovery techniques. In the present paper, data mining techniques are applied for data analysis and for the construction of forecasting modules towards decision making, on the basis of selected air quality information for Athens, Greece. Conclusions are drawn concerning the performance of algorithms, and for the research to be conducted in the future.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Clustering-based initialization of learning classifier systems",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00500-012-0811-y.pdf",
            "Abstract": "The present paper investigates whether an “informed” initialization process can help supervised LCS algorithms evolve rulesets with better characteristics, including greater predictive accuracy, shorter training times, and/or more compact knowledge representations. Inspired by previous research suggesting that the initialization phase of evolutionary algorithms may have a considerable impact on their convergence speed and the quality of the achieved solutions, we present an initialization method for the class of supervised Learning Classifier Systems (LCS) that extracts information about the structure of studied problems through a pre-training clustering phase and exploits this information by transforming it into rules suitable for the initialization of the learning process. The effectiveness of our approach is evaluated through an extensive experimental phase, involving a variety of real-world classification …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "An agent framework for dynamic agent retraining: Agent academy",
            "Publication year": 2004,
            "Publication url": "https://arxiv.org/abs/cs/0407025",
            "Abstract": "Agent Academy (AA) aims to develop a multi-agent society that can train new agents for specific or general tasks, while constantly retraining existing agents in a recursive mode. The system is based on collecting information both from the environment and the behaviors of the acting agents and their related successes/failures to generate a body of data, stored in the Agent Use Repository, which is mined by the Data Miner module, in order to generate useful knowledge about the application domain. Knowledge extracted by the Data Miner is used by the Agent Training Module as to train new agents or to enhance the behavior of agents already running. In this paper the Agent Academy framework is introduced, and its overall architecture and functionality are presented. Training issues as well as agent ontologies are discussed. Finally, a scenario, which aims to provide environmental alerts to both individuals and public authorities, is described an AA-based use case.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A dockerized string analysis workflow for Big Data",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-30278-8_55",
            "Abstract": "Nowadays, a wide range of sciences are moving towards the Big Data era, producing large volumes of data that require processing for new knowledge extraction. Scientific workflows are often the key tools for solving problems characterized by computational complexity and data diversity, whereas cloud computing can effectively facilitate their efficient execution. In this paper, we present a generative big data analysis workflow that can provide analytics, clustering, prediction and visualization services to datasets coming from various scientific fields, by transforming input data into strings. The workflow consists of novel algorithms for data processing and relationship discovery, that are scalable and suitable for cloud infrastructures. Domain experts can interact with the workflow components, set their parameters, run personalized pipelines and have support for decision-making processes. As case studies in this …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:wKETBy42zhYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Data Mining and Agent Technology: a fruitful symbiosis",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-69935-6_14",
            "Abstract": "Multi-agent systems (MAS) have grown quite popular in a wide spectrum of applications where argumentation, communication, scaling and adaptability are requested. And though the need for well-established engineering approaches for building and evaluating such intelligent systems has emerged, currently no widely accepted methodology exists, mainly due to lack of consensus on relevant definitions and scope of applicability. Even existing well-tested evaluation methodologies applied in traditional software engineering, prove inadequate to address the unpredictable emerging factors of the behavior of intelligent components. The following chapter aims to present such a unified and integrated methodology for a specific category of MAS. It takes all constraints and issues into account and denotes the way knowledge extracted with the use of Data mining (DM) techniques can be used for the formulation initially …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Social influence and water conservation: An agent-based approach",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1377081/",
            "Abstract": "Every day, consumers are exposed to advertising campaigns that attempt to influence their decisions and affect their behavior. Word-of-mouth communication - the informal channels of daily interactions among friends, relatives, coworkers, neighbors, and acquaintances - plays a much more significant role in how consumer behavior is shaped, fashion is introduced, and product reputation is built. Macrolevel simulations that include this kind of social parameter are usually limited to generalized, often simplistic assumptions. In an effort to represent the phenomenon in a semantically coherent way and model it more realistically, we developed an influence-diffusion mechanism that follows agent-based social simulation primitives. The model is realized as a multiagent software platform, which we call Dawn (for distributed agents for water simulation).",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A protein classification engine based on stochastic finite state automata",
            "Publication year": 2005,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/02/A-protein-classification-engine-based-on-stochastic-finite-state-automata-.pdf",
            "Abstract": "Protein classification is currently one of the most interesting problems in computational biology. The biological action of proteins is traditionally identified by time consuming and expensive in-vitro experiments. However, recent developments in bioinformatics have enabled the use of computational tools and techniques towards this end [1]. Clustering algorithms [2], artificial neural networks [3], decision trees [4, 5] and statistical models [6] are few of the methods currently employed. Motifs that can be found in a protein chain have provided a higher level of abstraction to the problem, since protein properties are mainly defined by them. Motifs can be either patterns, which are short aminoacid chains with a specific order, or profiles, which are computational representations of multiple sequence alignments derived by the use of hidden Markov models.On the other hand, proteins can be assorted into families, each family …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visual event summarization on social media using topic modelling and graph-based ranking algorithms",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2671188.2749407",
            "Abstract": "Due to the increasing popularity of microblogging platforms, the amount of messages (posts) related to public events, especially posts encompassing multimedia content, is steadily increasing. The inclusion of images can convey much more information about the event, compared to their text, which is typically very short (eg, tweets). Although such messages can be quite informative regarding different aspects of the event, there is a lot of spam and redundancy making it challenging to extract pertinent insights. In this work, we describe a summarization framework that, given a set of social media messages about an event, aims to select a subset of images derived from them, that, at the same time, maximizes the relevance of the selected images and minimizes their redundancy. To this end, we propose a topic modeling technique to capture the relevance of messages to event topics and a graph-based algorithm to …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:LhH-TYMQEocC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for constructing multi-agent applications and training intelligent agents",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24620-6_7",
            "Abstract": "As agent-oriented paradigm is reaching a significant level of acceptance by software developers, there is a lack of integrated high-level abstraction tools for the design and development of agent-based applications. In an effort to mitigate this deficiency, we introduce Agent Academy, an integrated development framework, implemented itself as a multi-agent system, that supports, in a single tool, the design of agent behaviours and reusable agent types, the definition of ontologies, and the instantiation of single agents or multi-agent communities. In addition to these characteristics, our framework goes deeper into agents, by implementing a mechanism for embedding rule-based reasoning into them. We call this procedure “agent training” and it is realized by the application of AI techniques for knowledge discovery on application-specific data, which may be available to the agent developer. In this respect, Agent …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "AMNOS: an integrated WEB-based platform for dairy sheep breeding management",
            "Publication year": 2002,
            "Publication url": "http://wcgalp.org/system/files/proceedings/2002/amnos-integrated-web-based-platform-dairy-sheep-breeding-management.pdf",
            "Abstract": "A successful program for the genetic improvement of dairy sheep depends on a) reliable recording of milk and other economically important traits, b) appropriate data analysis and genetic evaluation to identify superior breeding animals, and c) development of genetic resource management and mating strategies. Information Technology has been used to effectively integrate these procedures (eg Gootwine et al., 1994).The objective of this paper is to describe AMNOS, an integrated web-based platform, developed to record, monitor, evaluate and manage the dairy sheep population of the Chios breed in Greece. The operating environment of AMNOS is illustrated in Figure 1. Three main categories of users may input data into the AMNOS database through the web: a) the sheep owners, b) the inspectors, and c) the inseminators. AMNOS analyzes the stored data and returns valuable feedback to the owners.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agent Retraining and Dynamical Improvement of Agent Intelligence",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_9.pdf",
            "Abstract": "A major advantage of the methodology presented in this book is agent retraining, the process of revising the knowledge model (s) of agent (s) by re-applying DM techniques. Retraining aspires to improve agent intelligence/performance and can be applied periodically or on a needbased mode. Since there is no point in repeating the DM process on the same dataset, retraining requires either the existence of new application data (Case 1-Chapter 6)) the existence of new behavior data (Case 2-Chapter 7), or the application of an evolutionary DM technique (Case 3-Chapter 8).It is through retraining that we intent to show that certain DM techniques can be used to augment agent intelligence and therefore improve MAS overall performance. In this chapter we provide the formal retraining model for the four DM techniques presented and we appose a number of experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "A Multi-metric Algorithm for Hierarchical Clustering of Same-Length Protein Sequences",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=XIlcDwAAQBAJ&oi=fnd&pg=PA189&dq=info:NM4o7MFoRikJ:scholar.google.com&ots=M-Hjoy20nM&sig=yz30aYd9M_KdGm5pIuxBz8Q5qaQ",
            "Abstract": "The identification of meaningful groups of proteins has always been a major area of interest for structural and functional genomics. Successful protein clustering can lead to significant insight, assisting in both tracing the evolutionary history of the respective molecules as well as in identifying potential functions and interactions of novel sequences. Here we propose a clustering algorithm for same-length sequences, which allows the construction of subset hierarchy and facilitates the identification of the underlying patterns for any given subset. The proposed method utilizes the metrics of sequence identity and amino-acid similarity simultaneously as direct measures. The algorithm was applied on a real-world dataset consisting of clonotypic immunoglobulin (IG) sequences from Chronic lymphocytic leukemia (CLL) patients, showing promising results.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:kVjdVfd2voEC",
            "Publisher": "Springer"
        },
        {
            "Title": "Towards a generic methodology for evaluating MAS performance",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4227544/",
            "Abstract": "As agent technology (AT) becomes a well-established engineering field of computing, the need for generalized, standardized methodologies for agent evaluation is imperative. Despite the plethora of available development tools and theories that researchers in agent computing have access to, there is a remarkable lack of general metrics, tools, benchmarks and experimental methods for formal validation and comparison of existing or newly developed systems. It is argued that AT has reached a certain degree of maturity, and it is therefore feasible to move from ad-hoc, domain-specific evaluation methods to standardized, repeatable and easily verifiable procedures. In this paper, we outline a first attempt towards a generic evaluation methodology for MAS performance. Instead of following the research path towards defining more powerful mathematical description tools for determining intelligence and performance …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multi-agent system for meteorological radar data management and decision support",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1364815209001066",
            "Abstract": "The continuous processing and evaluation of meteorological radar data require significant efforts by scientists, both for data processing, storage, and maintenance, and for data interpretation and visualization. To assist meteorologists and to automate a large part of these tasks, we have designed and developed Abacus, a multi-agent system for managing radar data and providing decision support. Abacus' agents undertake data management and visualization tasks, while they are also responsible for extracting statistical indicators and assessing current weather conditions. Abacus agent system identifies potentially hazardous incidents, disseminates preprocessed information over the web, and enables warning services provided via email notifications. In this paper, Abacus' agent architecture is detailed and agent communication for information diffusion is presented. Focus is also given on the customizable logical …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Science4Fashion: an end-to-end decision support system for fashion designers",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s12530-021-09372-7",
            "Abstract": "Nowadays, the fashion clothing industry is moving towards “fast” fashion, offering a wide variety of products based on different patterns and styles, usually characterized by lower costs and ambiguous quality. The retails markets are trying to present regularly new fashion collections while trying to follow the latest fashion trends at the same time. The main reason is to remain competitive and keep up with ever-changing customer demands. Fashion designers draw inspiration from social media, e-shops, and fashion shows that set the new fashion trends. In this direction, we propose Science4Fashion, an AI end-to-end system that facilitates fashion designers by collecting and analyzing data from many different sources and suggesting products according to their needs. An overview of the system’s modules is presented, emphasizing data collection, data annotation using deep learning models, and product …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:jFemdcug13IC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Algebraic Interpretations Towards Clustering Protein Homology Data",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44722-2_15",
            "Abstract": "The identification of meaningful groups of proteins has always been a principal goal in structural and functional genomics. A successful protein clustering can lead to significant insight, both in the evolutionary history of the respective molecules and in the identification of potential functions and interactions of novel sequences. In this work we propose a novel metric for distance evaluation, when applied to protein homology data. The metric is based on a matrix manipulation approach, defining the homology matrix as a form of block diagonal matrix. A first exploratory implementation of the overall process is shown to produce interesting results when using a well explored reference set of genomes. Near future steps include a thorough theoretical validation and comparison against similar approaches.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:bKqednn6t2AC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Rdote-transforming relational databases into semantic web data",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.231.4262&rep=rep1&type=pdf#page=131",
            "Abstract": "During the last decade, there has been intense research and development in creating methodologies and tools able to map Relational Databases with the Resource Description Framework. Although some systems have gained wider acceptance in the Semantic Web community, they either require users to learn a declarative language for encoding mappings, or have limited expressivity. Thereupon we present RDOTE, a framework for easily transporting data residing in Relational Databases into the Semantic Web. RDOTE is available under GNU/GPL license and provides friendly graphical interfaces, as well as enough expressivity for creating custom RDF dumps.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A robust agent design for dynamic SCM environments",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_15",
            "Abstract": "The leap from decision support to autonomous systems has often raised a number of issues, namely system safety, soundness and security. Depending on the field of application, these issues can either be easily overcome or even hinder progress. In the case of Supply Chain Management (SCM), where system performance implies loss or profit, these issues are of high importance. SCM environments are often dynamic markets providing incomplete information, therefore demanding intelligent solutions which can adhere to environment rules, perceive variations, and act in order to achieve maximum revenue. Advancing on the way such autonomous solutions deal with the SCM process, we have built a robust, highly-adaptable and easily-configurable mechanism for efficiently dealing with all SCM facets, from material procurement and inventory management to goods production and shipment. Our agent …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Information technologies in environmental engineering. Proceedings",
            "Publication year": 2009,
            "Publication url": "https://www.osti.gov/etdeweb/biblio/21197452",
            "Abstract": "Information technologies have evolved to an enabling science for natural resource management and conservation, environmental engineering, scientific simulation and integrated assessment studies. Computing plays a significant role in every day practices of environmental engineers, natural scientists, economists, and social scientists. The complexity of natural phenomena requires interdisciplinary approaches, where computing science offers the infrastructure for environmental data collection and management, scientific simulations, decision support documentation and reporting. Ecology, environmental engineering and natural resource management comprise an excellent real-world testbed for IT system demonstration, while raising new challenges for computer science. Complexity, uncertainty and scaling issues of natural systems form a demanding application domain for sensor networks and earth observation systems; modelling, simulation and scientific workflows, data management and reporting, decision support and intelligent systems, distributed computing environments, geographical information systems, heterogeneous systems integration, software engineering, accounting systems and control systems. This books offers a collection of papers presented at the 4th International Symposium on Environmental Engineering, held in May 2009, in Thessaloniki, Greece. Recent success stories in ecoinformatics, promising ideas and new challenges are discussed among computer scientists, environmental engineers, economists and social scientists, demonstrating new paradigms for problem solving and decision making. (orig.)",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:WHdLCjDvYFkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mgraph: multimodal event summarization in social media using topic models and graph-based ranking",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s13735-015-0089-9.pdf",
            "Abstract": "Due to the increasing popularity of social media platforms, the amount of messages (posts) related to public events, especially posts sharing multimedia content, is steadily increasing. Sharing images can contribute to a rich and live coverage of the event. Yet, despite the value and interestingness of some posts, there is a lot of spam and redundancy, which makes it challenging to select the most important and characteristic posts for the event. In this work, we describe MGraph, a summarization framework that, given a set of social media posts about an event, selects a subset of shared images, simultaneously maximizing their relevance and minimizing their visual redundancy. MGraph employs a topic modelling technique based on different modalities to capture the relevance of posts to event topics, and a graph-based ranking algorithm to produce a diverse ranking of the selected high-relevance images. A …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:GFxP56DSvIMC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Data mining for agent reasoning: A synergy for training intelligent agents",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0952197607000176",
            "Abstract": "The task-oriented nature of data mining (DM) has already been dealt successfully with the employment of intelligent agent systems that distribute tasks, collaborate and synchronize in order to reach their ultimate goal, the extraction of knowledge. A number of sophisticated multi-agent systems (MAS) that perform DM have been developed, proving that agent technology can indeed be used in order to solve DM problems. Looking into the opposite direction though, knowledge extracted through DM has not yet been exploited on MASs. The inductive nature of DM imposes logic limitations and hinders the application of the extracted knowledge on such kind of deductive systems. This problem can be overcome, however, when certain conditions are satisfied a priori. In this paper, we present an approach that takes the relevant limitations and considerations into account and provides a gateway on the way DM techniques …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Inference of Pathway Decomposition Across Multiple Species Through Gene Clustering",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213015400035",
            "Abstract": "In the wake of gene-oriented data analysis in large-scale bioinformatics studies, focus in research is currently shifting towards the analysis of the functional association of genes, namely the metabolic pathways in which genes participate. The goal of this paper is to attempt to identify the core genes in a specific pathway, based on a user-defined selection of genomes. To this end, a novel algorithm has been developed that uses data from the KEGG database, and through the application of the MCL clustering algorithm, identifies clusters that correspond to different “layers” of genes, either on a phylogenetic or a functional level. The algorithm's complexity, evaluated experimentally, is presented and the results on three characteristic case studies are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:OR75R8vi5nAC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Multi-genome core pathway identification through gene clustering",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33412-2_56",
            "Abstract": "In the wake of gene-oriented data analysis in large-scale bioinformatics studies, focus in research is currently shifting towards the analysis of the functional association of genes, namely the metabolic pathways in which genes participate. The goal of this paper is to attempt to identify the core genes in a specific pathway, based on a user-defined selection of genomes. To this end, a novel methodology has been developed that uses data from the KEGG database, and through the application of the MCL clustering algorithm, identifies clusters that correspond to different “layers” of genes, either on a phylogenetic or a functional level. The algorithm’s complexity, evaluated experimentally, is presented and the results on a characteristic case study are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:-FonjvnnhkoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Agent-based Middleware for Environmental Information Management.",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.521.3717&rep=rep1&type=pdf",
            "Abstract": "Managing environmental information is a demanding task, which engages serious amounts of efforts by environmental scientists working in public institutes or the industrial sector. In order to reduce the workload required and disengage environmental scientists from trivial tasks, as data transformation and reviewing, we developed an Agent-based Middleware for Environmental Information Management (AMEIM for short). Our approach, presented in this paper, utilizes software agents that undertake environmental data management tasks. Software agents in AMEIM are capable to fuse and preprocess environmental data. Taking under account the requirements of the application domain, AMEIM's core functionalities, the agent-based architecture and the platform developed in Java are detailed. The AMEIM system is fully customizable and follows an extendable architecture. Also, reasoning capabilities can be incorporated into AMEIM agents for supporting decision-support features.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information agents cooperating with heterogenous data sources for customer-order management",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/967900.967915",
            "Abstract": "As multi-agent systems and information agents obtain an increasing acceptance by application developers, existing legacy Enterprise Resource Planning (ERP) systems still provide the main source of data used in customer, supplier and inventory resource management. In this paper we present a multi-agent system, comprised of information agents, which cooperates with a legacy ERP in order to carry out orders posted by customers in an enterprise environment. Our system is enriched by the capability of producing recommendations to the interested customer through agent cooperation. At first, we address the problem of information workload in an enterprise environment and explore the opportunity of a plausible solution. Secondly we present the architecture of our system and the types of agents involved in it. Finally, we show how it manipulates retrieved information for efficient and facile customer-order …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Customized time-of-use pricing for small-scale consumers using multi-objective particle swarm optimization",
            "Publication year": 2018,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17512549.2017.1325397",
            "Abstract": "Contemporary electricity markets necessitate balancing supply and demand in real time, as well as the active involvement of all participating entities in the price-setting procedure. To this end, Demand Response pricing schemes are often introduced, encouraging customers to contribute to power system stability by reducing their load during peak periods. In recent years, various Time-of-Use strategies have been designed and applied in real life scenarios without yielding the expected results. Analysis of several unsuccessful test cases revealed that customers are not willing to alter their consumption habits and reduce their comfort by responding to price signals, unless they are presented with tangible benefits (cost reduction, better energy services, etc.). In this context, current work introduces an optimization methodology for individualized ToU pricing policies, building upon authors' previous work on small-scale …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:jL-93Qbq4QoC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Improving agent bidding in power stock markets through a data mining enhanced agent platform",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03603-3_9",
            "Abstract": "Like in any other auctioning environment, entities participating in Power Stock Markets have to compete against other in order to maximize own revenue. Towards the satisfaction of their goal, these entities (agents - human or software ones) may adopt different types of strategies - from na?ve to extremely complex ones - in order to identify the most profitable goods compilation, the appropriate price to buy or sell etc, always under time pressure and auction environment constraints. Decisions become even more difficult to make in case one takes the vast volumes of historical data available into account: goods’ prices, market fluctuations, bidding habits and buying opportunities. Within the context of this paper we present Cassandra, a multi-agent platform that exploits data mining, in order to extract efficient models for predicting Power Settlement prices and Power Load values in typical Day-ahead Power …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Agent-based small-scale energy consumer models for energy portfolio management",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6690776/",
            "Abstract": "In contemporary power systems, residential consumers may account for up to 50% of a country's total electrical energy consumption. Even though they constitute a significant portion of the energy market, not much has been achieved towards eliminating the inability for energy suppliers to perform long-term portfolio management, thus maximizing their revenue. The root cause of these problems is the difficulty in modeling consumers' behavior, based on their everyday activities and personal comfort. If one were able to provide targeted incentives based on consumer profiles, the expected impact and market benefits would be significant. This paper introduces a formal residential consumer modeling methodology, that allows (i) the decomposition of the observed electrical load curves into consumer activities and, (ii) the evaluation of the impact of behavioral changes on the household's aggregate load curve. Analyzing …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:2VqYfGB8ITEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A zeroth-level classifier system for real time strategy games",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6040785/",
            "Abstract": "Real Time Strategy games (RTS) provide an interesting test bed for agents that use Reinforcement Learning (RL) algorithms. From an agent's point of view, RTS games constitute a Markovian, partially observable and dynamic environment with a huge state space. In this paper, we present an agent that uses a Zeroth-level Classifier System (ZCS) in order to construct winning policies for this type of games. We also combine ZCS with the replacing traces method in an attempt to improve the behaviour of our agent. We tested the learning abilities of our agent against a static opponent. For the evaluation of our agent, we compare its results with those of a random-acting agent and an agent that uses the SARSA RL algorithm. Results are encouraging since, our ZCS agent managed to outperform the SARSA agent. On the other hand, applying replacing traces to ZCS did not yield the expected results.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A decision-tree-based alarming system for the validation of national genetic evaluations",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168169906000135",
            "Abstract": "The aim of this work was to explore possibilities to build an alarming system based on the results of the application of data mining (DM) techniques in genetic evaluations of dairy cattle, in order to assess and assure data quality. The technique used combined data mining using classification and decision-tree algorithms, Gaussian binned fitting functions, and hypothesis tests. Data were quarterly national genetic evaluations, computed between February 1999 and February 2003 in nine countries. Each evaluation run included 73,000–90,000 bull records complete with their genetic values and evaluation information. Milk production traits were considered. Data mining algorithms were applied separately for each country and evaluation run to search for associations across several dimensions, including bull origin, type of proof, age of bull, and number of daughters. Then, data in each node were fitted to the Gaussian …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Association studies on cervical cancer facilitated by inference and semantic technologies: the ASSIST approach",
            "Publication year": 2008,
            "Publication url": "https://person.hst.aau.dk/ska/MIE2008/ParalleSessions/PapersForDownloads/03.DS&KM/SHTI136-0241.pdf",
            "Abstract": "Cervical cancer (CxCa) is currently the second leading cause of cancerrelated deaths, for women between 20 and 39 years old. As infection by the human papillomavirus (HPV) is considered as the central risk factor for CxCa, current research focuses on the role of specific genetic and environmental factors in determining HPV persistence and subsequent progression of the disease. ASSIST is an EU-funded research project that aims to facilitate the design and execution of genetic association studies on CxCa in a systematic way by adopting inference and semantic technologies. Toward this goal, ASSIST provides the means for seamless integration and virtual unification of distributed and heterogeneous CxCa data repositories, and the underlying mechanisms to undertake the entire process of expressing and statistically evaluating medical hypotheses based on the collected data in order to generate medically important associations. The ultimate goal for ASSIST is to foster the biomedical research community by providing an open, integrated and collaborative framework to facilitate genetic association studies.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:hMod-77fHWUC",
            "Publisher": "IOS Press; 1999"
        },
        {
            "Title": "Designing Pricing Mechanisms for Autonomous Agents Based on Bid‐Forecasting",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10196780500035340",
            "Abstract": "Autonomous agents that participate in the electronic market environment introduce an advanced paradigm for realizing automated deliberations over offered prices of auctioned goods. These agents represent humans and their assets, therefore it is critical for them not only to act rationally but also efficiently. By enabling agents to deploy bidding strategies and to compete with each other in a marketplace, a valuable amount of historical data is produced. An optimal dynamic forecasting of the maximum offered bid would enable more gainful behaviours by agents. In this respect, this paper presents a methodology that takes advantage of price offers generated in e‐auctions, in order to provide an adequate short‐term forecasting schema based on time‐series analysis. The forecast is incorporated into the reasoning mechanism of a group of autonomous e‐auction agents to improve their bidding behaviour. In order to …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "GenMiner: A data mining tool for protein analysis",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.330.7872&rep=rep1&type=pdf",
            "Abstract": "We present an integrated tool for preprocessing and analysis of genetic data through data mining. Our goal is the prediction of the functional behavior of proteins, a critical problem in functional genomics. During the last years, many programming approaches have been developed for the identification of short amino-acid chains, which are included in families of related proteins. These chains are called motifs and they are widely used for the prediction of the protein’s behavior, since the latter is dependent on them. The idea to use data mining techniques stems from the sheer size of the problem. Since every protein consists of a specific number of motifs, some stronger than others, the identification of the properties of a protein requires the examination of immeasurable combinations. The presence or absence of stronger motifs affects the way in which a protein reacts. GenMiner is a preprocessing software tool that can receive data from three major protein databases and transform them in a form suitable for input to the WEKA data mining suite. A decision tree model was created using the derived training set and an efficiency test was conducted. Finally, the model was applied to unknown proteins. Our experiments have shown that the use of the decision tree model for mining protein data is an efficient and easy-to-implement solution, since it possesses a high degree of parameterization and therefore, it can be used in a plethora of cases.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing the quality of phylogenetic analysis using fuzzy hidden Markov model alignments",
            "Publication year": 2007,
            "Publication url": "http://ndl.ethernet.edu.et/bitstream/123456789/18106/1/1691.pdf#page=1275",
            "Abstract": "Any effective phylogeny inference based on molecular data begins by performing efficient multiple sequence alignments. So far, the Hidden Markov Model (HMM) method for multiple sequence alignment has been proved competitive to the classical deterministic algorithms with respect to phylogenetic analysis; nevertheless, its stochastic nature does not help it cope with the existing dependence among the sequence elements. This paper deals with phylogenetic analysis of protein and gene data using multiple sequence alignments produced by fuzzy profile Hidden Markov Models. Fuzzy profile HMMs are a novel type of profile HMMs based on fuzzy sets and fuzzy integrals, which generalize the classical stochastic HMM by relaxing its independence assumptions. In this paper, alignments produced by the fuzzy HMM model are used in phylogenetic analysis of protein data, enhancing the quality of phylogenetic trees. The new methodology is implemented in HPV virus phylogenetic inference. The results of the analysis are compared against those obtained by the classical profile HMM model and depict the superiority of the fuzzy profile HMM in this field.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Bioinformatics algorithm development for Grid environments",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121210000373",
            "Abstract": "A Grid environment can be viewed as a virtual computing architecture that provides the ability to perform higher throughput computing by taking advantage of many computers geographically dispersed and connected by a network. Bioinformatics applications stand to gain in such a distributed environment in terms of increased availability, reliability and efficiency of computational resources. There is already considerable research in progress toward applying parallel computing techniques on bioinformatics methods, such as multiple sequence alignment, gene expression analysis and phylogenetic studies. In order to cope with the dimensionality issue, most machine learning methods either focus on specific groups of proteins or reduce the size of the original data set and/or the number of attributes involved. Grid computing could potentially provide an alternative solution to this problem, by combining multiple …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multimodal graph-based event detection and summarization in social media streams",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2733373.2809933",
            "Abstract": "The paper describes a multimodal graph-based system for addressing the Yahoo-Flickr Event Summarization Challenge of ACM Multimedia 2015. The objective is to automatically uncover structure within a collection of 100 million photos/videos in the form of detecting and identifying events, and summarizing them succinctly for consumer consumption. The presented system uses a sliding window over the stream of multimedia items to build and maintain a multimodal same-event image graph and applies a graph clustering algorithm to detect events. In addition, it makes use of a graph-based diversity-oriented ranking approach and a versatile event retrieval mechanism to access summarized instances of the events of interest. A demo of the system is online at http://mklab. iti. gr/acmmm2015-gc/.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:Ehil0879vHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data Mining on the Application Level of a Mas",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_6.pdf",
            "Abstract": "In the first case of dynamic knowledge diffusion to MAS, knowledge is extracted by the application of DM techniques on historical application data. In such systems, an adequately large dataset is required (the bigger the better!), in order to produce a valid knowledge model, which reflects the trends in the data. A wide range of application domains may produce and maintain such large data volumes, including environmental systems, transaction systems, data warehouses, web logs etc. Special attention should be drawn, however, to Enterprise Resource Planning (ERP) systems, which are employed by all kinds of companies and for diverse purposes. Managing enterprise resources is an inherently distributed problem, that requires intelligent solutions. In addition, ERP systems generate and maintain large data volumes and DM techniques have already been exploited for improving several of the processes that are …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Knowledge discovery for operational decision support in air quality management",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.500.6068&rep=rep1&type=pdf",
            "Abstract": "Operational decision-making in air quality management systems requires intense efforts for assessing monitored data streams on time. In contrary with the previous works, which focus on air quality forecasting, this paper concentrates on near real time air quality assessment. Data uncertainty problems associated with environmental monitoring networks bring forth issues such as measurement validation and estimation of missing or erroneous values, which are critical for taking trustworthy decisions in a timely fashion. A remedy to these problems is proposed through knowledge discovery techniques. By employing classification techniques, an empirical approach is presented for supporting the decision making process involved in an environmental management system that monitors ambient air quality and triggers alerts when incidents occur. Specifically, exhaustive experiments with large, real world datasets have resulted to trustworthy predictive models, capable operational decision-making for measurement validation and estimation of missing or erroneous data. The outstanding performance of the induced predictive models signifies the added value of using data-driven approaches in operational air quality assessment.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Variable structure robot control systems: The RAPP approach",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921889016306248",
            "Abstract": "This paper presents a method of designing variable structure control systems for robots. As the on-board robot computational resources are limited, but in some cases the demands imposed on the robot by the user are virtually limitless, the solution is to produce a variable structure system. The task dependent part has to be exchanged, however the task governs the activities of the robot. Thus not only exchange of some task-dependent modules is required, but also supervisory responsibilities have to be switched. Such control systems are necessary in the case of robot companions, where the owner of the robot may demand from it to provide many services.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:QD3KBmkZPeQC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A retraining methodology for enhancing agent intelligence",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1427118/",
            "Abstract": "Data mining has proven a successful gateway for discovering useful knowledge and for enhancing business intelligence in a range of application fields. Incorporating this knowledge into already deployed applications, though, is highly impractical, since it requires reconfigurable software architectures, as well as human expert consulting. In an attempt to overcome this deficiency, we have developed agent academy, an integrated development framework that supports both design and control of multiagent systems (MAS), as well as agent training. We define agent training as the automated incorporation of logic structures generated through data mining into the agents of the system. The increased flexibility and cooperation primitives of MAS, augmented with the training and retraining capabilities of agent academy, provide a powerful means for the dynamic exploitation of data mining extracted knowledge. In this …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Agent academy: a data mining framework for training intelligent agents",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=3622090959801898274&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "db4OWL: An alternative approach to organizing and storing semantic data",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5318701/",
            "Abstract": "The complex structure of semantic data still poses a challenge in storing, querying, and organizing Web information. Although researchers have proposed various semantic database system approaches over the years, it seems that most systems have tried to provide industrial-strength scalability too soon. Consequently, most semantic databases still rely on the relational model of storing data and still use SQL-like query languages for data retrieval. The db4OWL semantic database prototype addresses many of the shortcomings of current systems and features native OWL-querying as well as the ability to store and query multiple ontologies concurrently.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Relieving Robots from Their Burdens: The Cloud Agent Concept (Short Paper)",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7776599/",
            "Abstract": "The consumer robotics concept has already invaded our everyday lives, however two major drawbacks have become apparent both for the roboticists and the consumers. The first is that these robots are pre-programmed to perform specific tasks and usually their software is proprietary, thus not open to \"interventions\". The second is that even if their software is open source, low-cost robots usually lack sufficient resources such as CPU power or memory capabilities, thus forbidding advanced algorithms to be executed in-robot. Within the context of RAPP (Robotic Applications for Delivering Smart User Empowering Applications) we treat robots as platforms, where applications can be downloaded and automatically deployed. Furthermore, we propose and implement a novel multi-agent architecture, empowering robots to offload computations in entities denoted as Cloud Agents. This paper discusses the respective …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:4X0JR2_MtJMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A dockerized framework for hierarchical frequency-based document clustering on cloud computing infrastructures",
            "Publication year": 2020,
            "Publication url": "https://journalofcloudcomputing.springeropen.com/articles/10.1186/s13677-019-0150-y",
            "Abstract": "Scalable big data analysis frameworks are of paramount importance in the modern web society, which is characterized by a huge number of resources, including electronic text documents. Document clustering is an important field in text mining and is commonly used for document organization, browsing, summarization and classification. Hierarchical clustering methods construct a hierarchy structure that, combined with the produced clusters, can be useful in managing documents, thus making the browsing and navigation process easier and quicker, and providing only relevant information to the users’ queries by leveraging the structure relationships. Nevertheless, the high computational cost and memory usage of baseline hierarchical clustering algorithms render them inappropriate for the vast number of documents that must be handled daily. In this paper, we propose a new scalable hierarchical clustering framework, which uses the frequency of the topics in the documents to overcome these limitations. Our work consists of a binary tree construction algorithm that creates a hierarchy of the documents using three metrics (Identity, Entropy, Bin Similarity), and a branch breaking algorithm which composes the final clusters by applying thresholds to each branch of the tree. The clustering algorithm is followed by a meta-clustering module which makes use of graph theory to obtain insights in the leaf clusters’ connections. The feature vectors representing each document derive from topic modeling. At the implementation level, the clustering method has been dockerized in order to facilitate its deployment on cloud computing infrastructures. Finally, the …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:LPtt_HFRSbwC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Event identification in web social media through named entity recognition and topic modeling",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X13000827",
            "Abstract": "The problem of identifying important online or real life events from large textual document streams that are freely available on the World Wide Web is increasingly gaining popularity, given the flourishing of the social web. An event triggers discussion and comments on the WWW, especially in the blogosphere and in microblogging services. Consequently, one should be able to identify the involved entities, topics, time, and location of events through the analysis of information publicly available on the web, create semantically rich representations of events, and then use this information to provide interesting results, or summarize news to users.In this paper, we define the concept of important event and propose an efficient methodology for performing event detection from large time-stamped web document streams. The methodology successfully integrates named entity recognition, dynamic topic map discovery, topic …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:umqufdRvDiIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A correlation analysis of web social media",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1988688.1988752",
            "Abstract": "In this paper we analyze and compare three popular content creation and sharing websites, namely Panoramio, YouTube and Epinions. This analysis aims in advancing our understanding of Web Social Media and their impact, and may be useful in creating feedback mechanisms for increasing user participation and sharing. For each of the three websites, we select five fundamental factors appearing in all content centered Web Social Media and we use regression analysis to calculate their correlation. We present findings of statistically important correlations among these key factors and we rank the discovered correlations according to the degree of their influence. Furthermore, we perform analysis of variance in distinct subgroups of the collected data and we discuss differences found in the characteristics of these subgroups and how these differences may affect correlation results.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic integration of cervical cancer data repositories to facilitate multicenter association studies: the ASSIST approach",
            "Publication year": 2009,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.4137/CIN.S963",
            "Abstract": "The current work addresses the unification of Electronic Health Records related to cervical cancer into a single medical knowledge source, in the context of the EU-funded ASSIST research project. The project aims to facilitate the research for cervical precancer and cancer through a system that virtually unifies multiple patient record repositories, physically located in different medical centers/hospitals, thus, increasing flexibility by allowing the formation of study groups “on demand” and by recycling patient records in new studies. To this end, ASSIST uses semantic technologies to translate all medical entities (such as patient examination results, history, habits, genetic profile) and represent them in a common form, encoded in the ASSIST Cervical Cancer Ontology. The current paper presents the knowledge elicitation approach followed, towards the definition and representation of the disease's medical concepts and …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:7PzlFSSx8tAC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Policy search through adaptive function approximation for bidding in tac scm",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40864-9_2",
            "Abstract": "Agent autonomy is strongly related to learning and adaptation. Machine learning models generated through the use of historical data or current environmental signals, provide agents with the necessary decision-making and generalization capabilities in competitive, dynamic, partially observable and stochastic environments. In this work, we discuss learning and adaptation in the context of the TAC SCM game. We apply a variety of machine learning and computational intelligence methods for generating the most efficient sales component of the agent, dealing with customer orders and production throughput. Along with utility maximization and bid acceptance probability estimation methods, we evaluate regression trees, particle swarm optimization, heuristic control and policy search via adaptive function approximation in order to build an efficient, near-real time, bidding mechanism. Results indicate that a …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:MLfJN-KU85MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Deep reinforcement learning for Doom using unsupervised auxiliary tasks",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1807.01960",
            "Abstract": "Recent developments in deep reinforcement learning have enabled the creation of agents for solving a large variety of games given a visual input. These methods have been proven successful for 2D games, like the Atari games, or for simple tasks, like navigating in mazes. It is still an open question, how to address more complex environments, in which the reward is sparse and the state space is huge. In this paper we propose a divide and conquer deep reinforcement learning solution and we test our agent in the first person shooter (FPS) game of Doom. Our work is based on previous works in deep reinforcement learning and in Doom agents. We also present how our agent is able to perform better in unknown environments compared to a state of the art reinforcement learning algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:MpfHP-DdYjUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic Web in cultural heritage after 2020",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.492.4352&rep=rep1&type=pdf",
            "Abstract": "In this paper we present the current status of semantic data management in the cultural heritage field and we focus on the challenges imposed by the multidimensionality of the information in this domain. We identify current shortcomings, thus needs, that should be addressed in the coming years to enable the integration and exploitation of the rich information deriving from the multidisciplinary analysis of cultural heritage objects, monuments and sites. Our goal is to disseminate the needs of the cultural heritage community and drive Semantic web research towards these directions.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:WZBGuue-350C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mertacor: a successful autonomous trading agent",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1160633.1160847",
            "Abstract": "In this paper we present the internal architecture and bidding mechanisms designed for Mertacor, a successful trading agent, which ended up first in the Classic Trading Agent Competition (TAC) of 2005. TAC provides a realistic benchmarking environment in which different trading agents compete with each other in order to best satisfy their clients' preferences and maximize their total profit. The\" travel game\" scenario of TAC involves three types of auctions; a) continuous one-sided that sell flight tickets, b) ascending multi-unit auctions for booking hotel rooms, and c) continuous double auctions for entertainment tickets. For each one of these types, we describe the techniques deployed by Mertacor. In flight auctions prices are updated according to a random walk process, thus the accurate prediction of the next update is not feasible. A key element of agent behavior in these auctions is its ability to accurately deduce …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of Market Design Agents: The Mertacor Perspective",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15117-0_15",
            "Abstract": "The annual Trading Agent Competition for Market Design, cat, provides a testbed to study the mechanisms that modern stock exchanges use in their effort to attract potential traders while maximizing their profit. This paper presents an evaluation of the agents that participated in the 2008 competition. The evaluation is based on the analysis of the cat finals as well as on the results obtained from post-tournament experiments. We present Mertacor, our entrant for 2008, and compare it with the other available agents. In addition, we introduce a simple yet effective way of computing the global competitive equilibrium that Mertacor utilizes and discuss its importance for the game.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A finite state automata based technique for protein classification rules induction",
            "Publication year": 2004,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2017/01/A_finite_state_automata_based_technique_for_protei.pdf",
            "Abstract": "An important challenge in modern functional proteomics is the prediction of the functional behavior of proteins. Motifs in protein chains can make such a prediction possible. The correlation between protein properties and their motifs is not always obvious, since more than one motifs can exist within a protein chain. Thus, the behavior of a protein is a function of many motifs, where some overpower others. In this paper a data-mining approach for motif-based classification of proteins is presented. A new classification rules inducing algorithm that exploits finite state automata is introduced. First, data are modeled by terms of prefix tree acceptors, which are later merged into finite state automata. Finally, we propose a new algorithm for the induction of protein classification rules from finite state automata. The data-mining model is trained and tested using various protein and protein class subsets, as well as the whole dataset of known proteins and protein classes. Results indicate the efficiency of our technique compared to other known data-mining algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Genecity: A multi agent simulation environment for hereditary diseases",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.107.9282&rep=rep1&type=pdf",
            "Abstract": "Simulating the psycho-societal aspects of a human community is an issue always intriguing and challenging, aspiring us to help better understand, macroscopically, the way (s) humans behave. The mathematical models that have extensively been used for the analytical study of the various related phenomena prove inefficient, since they cannot conceive the notion of population heterogeneity, a parameter highly critical when it comes to community interactions. Following the more successful paradigm of artificial societies, coupled with multi-agent systems and other Artificial Intelligence primitives, and extending previous epidemiological research work, we have developed GeneCity: an extended agent community, where agents live and interact under the veil of a hereditary epidemic. The members of the community, which can be either healthy, carriers of a trait, or patients, exhibit a number of human-like social (and medical) characteristics: wealth, acceptance and influence, fear and knowledge, phenotype and reproduction ability. GeneCity provides a highly-configurable interface for simulating social environments and the way they are affected with the appearance of a hereditary disease, either Autosome or X-linked. This paper presents an analytical overview of the work conducted and examines a testhypothesis based on the spreading of Thalassaemia major.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multilingual sentiment analysis using emoticons and keywords",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6927613/",
            "Abstract": "Nowadays the World Wide Web has evolved into a leading communication channel and information exchange medium. Especially after the introduction of the so-called web 2.0 and the explosion that followed regarding user generated content, the amount of data available over the internet has attracted the interest of both the scientific and business community. Their efforts focus on identifying the inner structures of data and the knowledge that can be derived by analyzing them. Web 2.0 is the subject of study and research in a number of areas. One of these areas is sentiment analysis, where the main goal is to study and draw conclusions about subjectivity, polarity and the feeling that is expressed in user generated content, which mainly consist of free text documents. The goal of this paper is to apply sentiment analysis on multilingual data, focusing on documents written in Greek. We developed an integrated …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:yFnVuubrUp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Knowledge discovery for training intelligent agents: methodology, tools and applications",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11492870_2",
            "Abstract": "In this paper we address a relatively young but important area of research: the intersection of agent technology and data mining. This intersection can take two forms: a) the more mundane use of intelligent agents for improved knowledge discovery and b) the use of data mining techniques for producing smarter, more efficient agents. The paper focuses on the second approach. Knowledge, hidden in voluminous data repositories routinely created and maintained by today’s applications, can be extracted by data mining. The next step is to transform this knowledge into the inference mechanisms or simply the behavior of agents in multi-agent systems. We call this procedure “agent training.” We define different levels of agent training and we present a software engineering methodology that combines the application of deductive logic for generating intelligence from data with a process for transferring this …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Sketching a methodology for efficient Supply Chain Management agents enhanced through Data Mining",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJIIDS.2008.017244",
            "Abstract": "Supply Chain Management (SCM) environments demand intelligent solutions, which can perceive variations and achieve maximum revenue. This highlights the importance of a commonly accepted design methodology, since most current implementations are application-specific. In this work, we present a methodology for building an intelligent trading agent and evaluating its performance at the Trading Agent Competition (TAC) SCM game. We justify architectural choices made, ranging from the adoption of specific Data Mining (DM) techniques, to the selection of the appropriate metrics for agent performance evaluation. Results indicate that our agent has proven capable of providing advanced SCM solutions in demanding SCM environments.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Application of data mining and intelligent agent technologies to concurrent engineering",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/33600174/ce2003application.pdf",
            "Abstract": "Software agent technology has matured enough to produce intelligent agents, which can be used to control a large number of concurrent engineering tasks. Multi-agent systems are communities of agents that exchange information and data in the form of messages. The agents’ intelligence can range from rudimentary sensor monitoring and data reporting to more advanced forms of decision making and autonomous behavior. The behavior and intelligence of each agent in the community can be obtained by performing data mining on available application data and the respected knowledge domain. We have developed Agent Academy, a software platform for the design, creation, and deployment of multi-agent systems, which combines the power of knowledge discovery algorithms with the versatility of agents. Using this platform, we show how agents, equipped with a data-driven inference engine, can be dynamically and continuously trained. We also discuss a few prototype multi-agent systems developed with Agent Academy.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agents and Multi-Agent Systems in Supply Chain Management: An Overview",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/strategic-information-systems/36730",
            "Abstract": "This chapter discusses the current state-of-the-art of agents and multi-agent systems (MAS) in supply chain management (SCM). Following a general description of SCM and the challenges it is currently ed with we present MAS as a possible solution to these challenge. We argue that an application involving multiple autonomous actors, such as SCM, can best be served by a software paradigm that relies on multiple independent software entities, like agents. The most significant current trends in this area and focusing on potential areas of further research. Furthermore, the authors believe that a clearer view on the current state-of-the-art and future extension will help researchers improve existing standards and solve remaining issues, eventually helping MAS-based SCM systems to replace legacy ERP software, but also give a boost on both areas of research separately.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards an integrated robotics architecture for social inclusion–The RAPP paradigm",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389041716300535",
            "Abstract": "Scientific breakthroughs have led to an increase in life expectancy, to the point where senior citizens comprise an ever increasing percentage of the general population. In this direction, the EU funded RAPP project “Robotic Applications for Delivering Smart User Empowering Applications” introduces socially interactive robots that will not only physically assist, but also serve as a companion to senior citizens. The proposed RAPP framework has been designed aiming towards a cloud-based integrated approach that enables robotic devices to seamlessly deploy robotic applications, relieving the actual robots from computational burdens. The Robotic Applications (RApps) developed according to the RAPP paradigm will empower consumer social robots, allowing them to adapt to versatile situations and materialize complex behaviors and scenarios. The RAPP pilot cases involve the development of RApps for the NAO …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:F1b5ZUV5XREC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Assistive robots as future caregivers: The rapp approach",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-15847-1_17",
            "Abstract": "As our societies are affected by a dramatic demographic change, the percentage of elderly and people requiring support in their daily life is expected to increase in the near future and caregivers will not be enough to assist and support them. Socially interactive robots can help confront this situation not only by physically assisting people but also by functioning as a companion. The rising sales figures of robots point towards a trend break concerning robotics. To lower the cost for developers and to increase their interest in developing robotic applications, the RAPP approach introduces the idea of robots as platforms. RAPP (A Software Platform for Delivering Smart User Empowering Robotic Applications) aims to provide a software platform in order to support the creation and delivery of robotic applications (RApps) targeting people at risk of exclusion, especially older people. The open-source software platform …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:fFSKOagxvKUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A methodology for developing environmental information systems with software agents",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7643-8900-0_6",
            "Abstract": "This article presents a unifying methodology for developing environmental information systems with software agents. Based on the experience reported in recent literature, we abstract common requirements of environmental information systems into agent types, combine state-of-the-art tools from computer science, service-oriented software engineering and artificial intelligence domains, as software agents and machine learning, and illustrate their potential for solving real-world problems. Specifically, two generic agent types are specified that behave as information carriers and decision makers, which provide an appropriate abstraction for deployment of added-value services in environmental information systems.A concrete pathway for applying these instruments throughout the software life cycle of an environmental information system is outlined, along with suggestions for software specification and …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Birkhäuser Basel"
        },
        {
            "Title": "Information Technologies in Environmental Engineering: Proceedings of the 4th International ICSC Symposium Thessaloniki, Greece, May 28-29, 2009",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=VZUYOyR83NMC&oi=fnd&pg=PR7&dq=info:rw_sdNKMJZcJ:scholar.google.com&ots=31Nu7t5vRy&sig=_Wdc93-R3c05nM_B1Or7brB6tW4",
            "Abstract": "Information technologies have evolved to an enabling science for natural resource management and conservation, environmental engineering, scientific simulation and integrated assessment studies. Computing plays a significant role in every day practices of environmental engineers, natural scientists, economists, and social scientists. The complexity of natural phenomena requires interdisciplinary approaches, where computing science offers the infrastructure for environmental data collection and management, scientific simulations, decision support documentation and reporting. Ecology, environmental engineering and natural resource management comprise an excellent real-world testbed for IT system demonstration, while raising new challenges for computer science. Complexity, uncertainty and scaling issues of natural systems form a demanding application domain for sensor networks and earth observation systems; modelling, simulation and scientific workflows, data management and reporting, decision support and intelligent systems, distributed computing environments, geographical information systems, heterogeneous systems integration, software engineering, accounting systems and control systems. This books offers a collection of papers presented at the 4th International Symposium on Environmental Engineering, held in May 2009, in Thessaloniki, Greece. Recent success stories in ecoinformatics, promising ideas and new challenges are discussed among computer scientists, environmental engineers, economists and social scientists, demonstrating new paradigms for problem solving and decision making.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Agent-based modelling and simulation in the irrigation management sector: applications and potential",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.592.8077&rep=rep1&type=pdf",
            "Abstract": "In the field of sustainable development, the management of common-pool resources is an issue of major importance. Several models that attempt to address the problem can be found in the literature, especially in the case of irrigation management. In fact, the latter task represents a great challenge for researchers and decision makers, as it has to cope with various water-related activities and conflicting user perspectives within a specified geographic area. Simulation models, and particularly Agent-Based Modelling and Simulation (ABMS), can facilitate overcoming these limitations: their inherent ability of integrating ecological and socio-economic dimensions, allows their effective use as tools for evaluating the possible effects of different management plans, as well as for communicating with stakeholders. This great potential has already been recognized in the irrigation management sector, where a great number of test cases have already adopted the modelling paradigm of multi-agent simulation. Our current study of agent-based models for irrigation management draws some interesting conclusions, regarding the geographic and representation scale of the reviewed models, as well as the degree of stakeholder involvement in the various development phases. Overall, we argue that ABMS tools have a great potential in representing dynamic processes in integrated assessment tools for irrigation management. Such tools, when effectively capturing social interactions and coupling them with environmental and economical models, can promote active involvement of interested parties and produce sustainable and approvable solutions to irrigation …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multimodal event detection and summarization in large scale image collections",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2911996.2912031",
            "Abstract": "This paper describes a multimodal graph-based approach to address the problem of event detection and summarization in large scale image collections. A first version of our system was presented in the Yahoo-Flickr Event Summarization Challenge of ACM Multimedia 2015 [6]. The objective of the approach is to automatically detect events within millions of photos and summarizing them efficiently for user consumption. The presented approach uses a moving time window over the collection of multimedia items to build a same-event image graph and applies graph clustering to detect events. In addition, it makes use of a graph-based diversity-oriented ranking algorithm to summarize instances of the detected events. A demo of the system is online at: http://mklab. iti. gr/acmmm2015-gc/.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:vDZJ-YLwNdEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Adaptive Proportional Value-per-Click Agent for Bidding in Ad Auctions",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34889-1_2",
            "Abstract": "Sponsored search auctions constitutes the most important source of revenue for search engine companies, offering new opportunities for advertisers. The Trading Agent Competition (TAC) Ad Auctions tournament is one of the first attempts to study the competition among advertisers for their placement in sponsored positions along with organic search engine results. In this paper, we describe agent Mertacor, a simulation-based game theoretic agent coupled with on-line learning techniques to optimize its behavior that successfully competed in the 2010 tournament. In addition, we evaluate different facets of our agent to draw conclusions about certain aspects of its strategy.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:LI9QrySNdTsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Supporting Agent-Oriented Software Engineering for Data Mining Enhanced Agent Development",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-36288-0_3",
            "Abstract": "The emergence of Multi-Agent systems as a software paradigm that most suitably fits all types of problems and architectures is already experiencing significant revisions. A more consistent approach on agent programming, and the adoption of Software Engineering standards has indicated the pros and cons of Agent Technology and has limited the scope of the, once considered, programming ‘panacea’. Nowadays, the most active area of agent development is by far that of intelligent agent systems, where learning, adaptation, and knowledge extraction are at the core of the related research effort. Discussing knowledge extraction, data mining, once infamous for its application on bank processing and intelligence agencies, has become an unmatched enabling technology for intelligent systems. Naturally enough, a fruitful synergy of the aforementioned technologies has already been proposed that would …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "RDOTE–Publishing Relational Databases into the Semantic Web",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121212002117",
            "Abstract": "A necessary step for the evolution of the traditional Web into a Semantic Web is the transformation of the vast quantities of data, currently residing in Relational Databases into semantically aware data. In addition, in cases where new ontology schemata are developed, considerable experimentation with real data for testing the consistency of classes, properties and entailment rules is required. During the last decade, there has been intense research and development in creating methodologies and tools able to map Relational Databases with the Resource Description Framework (RDF). Although some systems have gained wider acceptance in the Semantic Web community, they either require users to learn a declarative language for encoding mappings or, in case they support friendly user interfaces, they provide limited expressivity.Thereupon, we present RDOTE, a framework for easily transporting data residing …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "BADGE: Bioinformatics Algorithm Development for Grid Environments",
            "Publication year": 2009,
            "Publication url": "http://ikee.lib.auth.gr/record/224665",
            "Abstract": "A Grid environment can be viewed as a virtual computing architecture that provides the ability to perform higher throughput computing by taking advantage of many computers geographically dispersed and connected by a network. Bioinformatics applications stand to gain in such a distributed environment in term s of availability, reliability and efficiency of computational resources. There is already consid erable research in progress toward applying parallel computing techniques on bioinformatics methods, such as multiple sequence alignment, gene expression analysis and phylogenetic studies. In order to cope with the dimensionality issue, most machine learning methods focus on specific groups of proteins or reduce either the size of the orig inal data set or the number of attributes involved. Grid computing could potentially provide an alternative solution to this problem, by combining multiple approaches in a …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Mining Agent Behaviors",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_7.pdf",
            "Abstract": "The second level of dynamic knowledge infusion to MAS requires the existence of historical data describing the actions of agents within the MAS they reside. Such systems are mainly focused on the prediction of agent behaviors, and special attention is given on the way agent actions are modeled and represented. The core objective of agent action-based personalization is the discovery of a recommendation «set, that will better predict the behavior of the agent\" in action\". In order for the reader to better comprehend the notions of agent behavior modeling and prediction, we have developed an agent-based framework (a recommendation engine for navigating the web), where agent actions are directly mapped to web user traversal decisions. The main issues related to the design and development of such a framework for predicting agent actions are discussed in this chapter, while the basic concessions made to …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Agent Academy: An integrated tool for developing multi-agent systems and embedding decision structures into agents",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Symeonidis/publication/228933259_Agent_Academy_An_integrated_tool_for_developing_multi-agent_systems_and_embedding_decision_structures_into_agents/links/0c96051dfe57c35060000000/Agent-Academy-An-integrated-tool-for-developing-multi-agent-systems-and-embedding-decision-structures-into-agents.pdf",
            "Abstract": "In this paper we present Agent Academy, a framework that enables software developers to quickly develop multi-agent applications, when prior historical data relevant to a desired rule-based behaviour are available. Agent Academy is implemented itself as a multi-agent system, that supports, in a single tool, the design of agent behaviours and reusable agent types, the definition of ontologies, and the instantiation of single agents or multi-agent communities. Once an agent has been designed within the framework, the agent developer can create a specific ontology that describes the historical data. In this way, agents become capable of having embedded rule-based reasoning. We call this procedure “agent training” and it is realized by the application of data mining and knowledge discovery techniques on the application-specific historical data. From this point of view, Agent Academy provides a tool for both creating multi-agent systems and embedding rule-based decision structures into one or more of the participating agents.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event detection and retrieval on social media",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1807.03675",
            "Abstract": "In the recent years, we have witnessed the rapid adoption of social media platforms, such as Twitter, Facebook and YouTube, and their use as part of the everyday life of billions of people worldwide. Given the habit of people to use these platforms to share thoughts, daily activities and experiences it is not surprising that the amount of user generated content has reached unprecedented levels, with a substantial part of that content being related to real-world events, i.e. actions or occurrences taking place at a certain time and location. Given the key role of events in our life, the task of annotating and organizing social media content around them is of crucial importance for ensuring real-time and future access to multimedia content about an event of interest. In this chapter, we present several research efforts from recent years that tackle two main problems: a) event detection and b) event-based media retrieval and summarization. Given archived collections or live streams of social media items, the purpose of event detection methods is to identify previously unknown events in the form of sets of items that describe them. In general, the events could be of any type, but there are also approaches aiming at events of specific type. Given a target event the goal of event summarization is first to identify relevant content and then to represent it in a concise way, selecting the most appealing and representative content.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:PaBasH6fAo0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contemporary air quality forecasting methods: a comparative analysis between classification algorithms and statistical methods",
            "Publication year": 2005,
            "Publication url": "https://people.idsia.ch/~ioannis/publications/pdf/uaq2005.pdf",
            "Abstract": "Urban air quality management involves forecasting modules, which are an essential component of related decision making processes, especially in densely populated cities, such as the Greater Athens Area (GAA). As many forecasting methods are being proposed, it is interesting to perform a comparative study between various categories. In the present paper we describe the comparison work performed between several statistical methods (LRA, ARIMA, PCA) and classification algorithms, as artificial neural networks, decision trees, conjunctive rules, support vector machines, decision tables and fuzzy lattice rules. Useful results are drawn concerning the performance and the operational potential of such methods.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:r_AWSJRzSzQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A retraining methodology for enhancing agent intelligence",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950705106001687",
            "Abstract": "Data mining has proven a successful gateway for discovering useful knowledge and for enhancing business intelligence in a range of application fields. Incorporating this knowledge into already deployed applications, though, is highly impractical, since it requires reconfigurable software architectures, as well as human expert consulting. In an attempt to overcome this deficiency, we have developed Agent Academy, an integrated development framework that supports both design and control of multi-agent systems (MAS), as well as “agent training”. We define agent training as the automated incorporation of logic structures generated through data mining into the agents of the system. The increased flexibility and cooperation primitives of MAS, augmented with the training and retraining capabilities of Agent Academy, provide a powerful means for the dynamic exploitation of data mining extracted knowledge. In this …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "WebOWL: A Semantic Web search engine development experiment",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417411015776",
            "Abstract": "This paper presents WebOWL, an experiment in using the latest technologies to develop a Semantic Web search engine. WebOWL consists of a community of intelligent agents, acting as crawlers, that are able to discover and learn the locations of Semantic Web neighborhoods on the Web, a semantic database to store data from different ontologies, a query mechanism that supports semantic queries in OWL, and a ranking algorithm that determines the order of the returned results based on the semantic relationships of classes and individuals. The system has been implemented using Jade, Jena and the db4o object database engine and has successfully stored over one million OWL classes, individuals and properties.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Towards fashion recommendation: an AI system for clothing data retrieval and analysis",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49186-4_36",
            "Abstract": " Nowadays, the fashion industry is moving towards fast fashion, offering a large selection of garment products in a quicker and cheaper manner. To this end, the fashion designers are required to come up with a wide and diverse amount of fashion products in a short time frame. At the same time, the fashion retailers are oriented towards using technology, in order to design and provide products tailored to their consumers’ needs, in sync with the newest fashion trends. In this paper, we propose an artificial intelligence system which operates as a personal assistant to a fashion product designer. The system’s architecture and all its components are presented, with emphasis on the data collection and data clustering subsystems. In our use case scenario, datasets of garment products are retrieved from two different sources and are transformed into a specific format by making use of Natural Language Processes …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:WC9gN4BGCRcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Rapp system architecture",
            "Publication year": 2014,
            "Publication url": "https://hal.inria.fr/hal-01090891/",
            "Abstract": "— Robots are fast becoming a part of everyday life. This rise can be evidenced both through the public news and announcements, as well as in recent literature in the robotics scientific communities. This expanding development requires new paradigms in producing the necessary software to allow for the users' particular needs. In this paper we present a novel architectural design of the RAPP framework that attempts to address this issue, developed within the context of the EU funded project RAPP \"Robotic Applications for Delivering Smart User Empowering Application\". The proposed framework has been designed aiming towards a cloud-based approach to integrating robotic devices and their respective applications. This goal was defined going beyond the up-coming trends in infrastructures, and focusing on alternative approaches to conventional robotic controllers, while at the same time expanding the capabilities of the RAPP framework in a seamless and scaling manner.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:ODE9OILHJdcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PROTEAS: A Finite State Automata based data mining algorithm for rule extraction in protein classification",
            "Publication year": 2006,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/02/PROTEAS-A-Finite-State-Automata-based-data-mining-algorithm-for-rule-extraction-in-protein-classification-.pdf",
            "Abstract": "An important challenge in modern functional proteomics is the prediction of the functional behavior of proteins. Motifs in protein chains can make such a prediction possible. The correlation between protein properties and their motifs is not always obvious, since more than one motifs may exist within a protein chain. Thus, the behavior of a protein is a function of many motifs, where some overpower others. In this paper a data mining approach for a motif-based classification of proteins is presented. A new classification algorithm that induces rules and exploits finite state automata is introduced. First, data are modeled by terms of prefix tree acceptors, which are later merged into finite state automata. Finally, a new algorithm is proposed, for the induction of protein classification rules from finite state automata. The data mining model is trained and tested using various protein and protein class subsets, as well as the whole …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A long-term profit seeking strategy for continuous double auctions in a trading agent competition",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_14",
            "Abstract": "This paper presents a new bidding strategy for continuous double auctions (CDA) designed for Mertacor, a successful trading agent, which won the first price in the “travel game” of Trading Agent Competition (TAC) for 2005. TAC provides a realistic benchmarking environment in which various travel commodities are offered in simultaneous online auctions. Among these, entertainment tickets are traded in CDA. The latter, represent the most dynamic part of the TAC game, in which agents are both sellers and buyers. In a CDA many uncertainty factors are introduced, because prices are constantly changing during the game and price fluctuations are hard to be predicted. In order to deal with these factors of uncertainty we have designed a strategy based on achieving a pre-defined long-term profit. This preserves the bidding attitude of our agent and shows flexibility in changes of the environment. We finally …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Web Services Technology: An Overview",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/web-services-technology/4990",
            "Abstract": "This chapter examines the concept of Service-Oriented Architecture (SOA) in conjunction with the Web Services technology as an implementation of the former’s design principles. Following a brief introduction of SOA and its advantages, a high-level overview of the structure and composition of the Web Services platform is provided. This overview covers the core Web services specifications as well as features of the extended architecture stack, which together form a powerful and robust foundation for building distributed systems. The chapter concludes with a discussion of the scope of applicability of SOA and Web services. The overall goal of this chapter is to portray the key assets of the presented technologies and evaluate them as tools for handling adaptability, portability, and interoperability issues that arise in modern business environments.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A methodology for predicting agent behavior by the use of data mining techniques",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11492870_13",
            "Abstract": "One of the most interesting issues in agent technology has always been the modeling and enhancement of agent behavior. Numerous approaches exist, attempting to optimally reflect both the inner states, as well as the perceived environment of an agent, in order to provide it either with reactivity or proactivity. Within the context of this paper, an alternative methodology for enhancing agent behavior is presented. The core feature of this methodology is that it exploits knowledge extracted by the use of data mining techniques on historical data, data that describe the actions of agents within the MAS they reside. The main issues related to the design, development, and evaluation of such a methodology for predicting agent actions are discussed, while the basic concessions made to enable agent cooperation are outlined. We also present κ-Profile, a new data mining mechanism for discovering action profiles …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Supporting the decision-making process in environmental monitoring systems with knowledge discovery techniques",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.583.3308&rep=rep1&type=pdf",
            "Abstract": "In this paper an empirical approach for supporting the decision making process involved in an Environmental Management System (EMS) that monitors air quality and triggers air quality alerts is presented. Data uncertainty problems associated with an air quality monitoring network, such as measurement validation and estimation of missing or erroneous values, are addressed through the exploitation of data mining techniques. Exhaustive experiments with real world data have produced trustworthy predictive models, capable of supporting the decision-making process. The outstanding performance of the induced predictive models indicate the added value of this approach for supporting the decision making process in an EMS.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robotic frameworks, architectures and middleware comparison",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1711.06842",
            "Abstract": "Nowadays, the construction of a complex robotic system requires a high level of specialization in a large number of diverse scientific areas. It is reasonable that a single researcher cannot create from scratch the entirety of this system, as it is impossible for him to have the necessary skills in the necessary fields. This obstacle is being surpassed with the existent robotic frameworks. This paper tries to give an extensive review of the most famous robotic frameworks and middleware, as well as to provide the means to effortlessly compare them. Additionally, we try to investigate the differences between the definitions of a robotic framework, a robotic middleware and a robotic architecture.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:43bX7VzcjpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hive Collective Intelligence for Cloud Robotics",
            "Publication year": 2011,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/04/Hive-Collective-Intelligence-for-Cloud-Robotics-A-Hybrid-Distributed-Robotic-Controller-Design-for-Learning-and-Adaptation.pdf",
            "Abstract": "The recent advent of Cloud Computing, inevitably gave rise to Cloud Robotics. Whilst the field is arguably still in its infancy, great promise is shown regarding the problem of limited computational power in Robotics. This is the most evident advantage of Cloud Robotics, but, other much more significant yet subtle advantages can now be identified. Moving away from traditional Robotics, and approaching Cloud Robotics through the prism of distributed systems or Swarm Intelligence offers quite an interesting composure; physical robots deployed across different areas, may delegate tasks to higher intelligence agents residing in the cloud. This design has certain distinct attributes, similar with the organisation of a Hive or bee colony. Such a parallelism is crucial for the foundations set hereinafter, as they express through the hive design, a new scheme of distributed robotic architectures. Delegation of agent intelligence, from the physical robot swarms to the cloud controllers, creates a unique type of Hive Intelligence, where the controllers residing in the cloud, may act as the brain of a ubiquitous group of robots, whilst the robots themselves act as proxies for the Hive Intelligence. The sensors of the hive system providing the input and output are the robots, yet the information processing may take place collectively, individually or on a central hub, thus offering the advantages of a hybrid swarm and cloud controller. The realisation that radical robotic architectures can be created and implemented with current Artificial Intelligence models, raises interesting questions, such as if robots belonging to a hive, can perform tasks and procedures better or faster …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:5icHVeHT4IsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards understanding how personality, motivation, and events trigger Web user activity",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5616449/",
            "Abstract": "Web 2.0 provided internet users with a dynamic medium, where information is updated continuously and anyone can participate. Though preliminary analysis exists, there is still little understanding on what exactly stimulates users to actively participate, create and share content in online communities. In this paper we present a methodology that aspires to identify and analyze those events that trigger web user activity, content creation and sharing in Web 2.0. Our approach is based on user personality and motivation, and on the occurrence of events with a personal or global impact. The proposed methodology was applied on data collected from Flickr and analysis was performed through the use of statistics and data mining techniques.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind robust 3-D mesh watermarking based on oblate spheroidal harmonics",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4721598/",
            "Abstract": "In this paper, a novel transform-based, blind and robust 3-D mesh watermarking scheme is presented. The 3-D surface of the mesh is firstly divided into a number of discrete continuous regions, each of which is successively sampled and mapped onto oblate spheroids, using a novel surface parameterization scheme. The embedding is performed in the spheroidal harmonic coefficients of the spheroids, using a novel embedding scheme. Changes made to the transform domain are then reversed back to the spatial domain, thus forming the watermarked 3-D mesh. The embedding scheme presented herein resembles, in principal, the ones using the multiplicative embedding rule (inherently providing high imperceptibility). The watermark detection is blind and by far more powerful than the various correlators typically incorporated by multiplicative schemes. Experimental results have shown that the proposed blind …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of Data Mining and intelligent agent technologies to Concurrent Engineering",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJPLM.2007.014278",
            "Abstract": "Software agent technology has matured enough to produce intelligent agents, which can be used to control a large number of Concurrent Engineering tasks. Multi-Agent Systems (MAS) are communities of agents that exchange information and data in the form of messages. The agents' intelligence can range from rudimentary sensor monitoring and data reporting, to more advanced forms of decision-making and autonomous behaviour. The behaviour and intelligence of each agent in the community can be obtained by performing Data Mining on available application data and the respected knowledge domain. We have developed Agent Academy (AA), a software platform for the design, creation, and deployment of MAS, which combines the power of knowledge discovery algorithms with the versatility of agents. Using this platform, we illustrate how agents, equipped with a data-driven inference engine, can be …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Data Mining in Proteomics Using Grid Computing",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/64522",
            "Abstract": "The scope of this chapter is the presentation of Data Mining techniques for knowledge extraction in proteomics, taking into account both the particular features of most proteomics issues (such as data retrieval and system complexity), and the opportunities and constraints found in a Grid environment. The chapter discusses the way new and potentially useful knowledge can be extracted from proteomics data, utilizing Grid resources in a transparent way. Protein classification is introduced as a current research issue in proteomics, which also demonstrates most of the domain–specific traits. An overview of common and custom-made Data Mining algorithms is provided, with emphasis on the specific needs of protein classification problems. A unified methodology is presented for complex Data Mining processes on the Grid, highlighting the different application types and the benefits and drawbacks in each case. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Exploiting Data Mining on Mas",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_4.pdf",
            "Abstract": "The synergy of two rather diverse technologies, such as DM and AT, has been attempted at many levels. A great number of researchers with varied scientific backgrounds have been involved in the development of systems that use agents to automate data collection while satisfying the imperative need for the interpretation and exploitation of massive data volumes. In fact, each research community defines the basic concepts of AT and DM technologies in a way that increases comprehension and familiarity among its members. This the reason for having summarized the basic DM and AT concepts through the prism of the current work. As already mentioned in Chapter 1, the main objective of this book is the presentation of a unified methodology for building MAS that have the ability of dynamically incorporating DM-extracted knowledge. Two are the main issues that hinder the coupling of Data Mining with Intelligent …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Embedding data-driven decision strategies on software agents: the case of a multi-agent system for monitoring air-quality indexes.",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/32703230/ce2003embedding.pdf",
            "Abstract": "This paper describes the design and deployment of an agent community, which is responsible for monitoring and assessing air quality, based on measurements generated by a meteorological station. Software agents acting as mediators or decision makers deliver validated information to the appropriate destinations. We outline the procedure for creating agent ontologies, agent types, and finally, for training agents based on historical data volumes. The C4. 5 algorithm for decision tree extraction is applied on meteorological and air-pollutant measurements. The decision models extracted are related to the validation of incoming measurements and to the estimation of missing or erroneous measurements. Emphasis is given on the agent training process, which must embed these data-driven decision models on software agents in a simple and effortless way. We developed a prototype system, which demonstrates the advantages of agent-based solutions for intelligent environmental applications.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AMNOS: An integrated web-based platform for sheep breeding management",
            "Publication year": 2002,
            "Publication url": "https://www.research.ed.ac.uk/en/publications/amnos-an-integrated-web-based-platform-for-sheep-breeding-managem",
            "Abstract": "AMNOS: An integrated web-based platform for sheep breeding management — University \nof Edinburgh Research Explorer Skip to main navigation Skip to search Skip to main \ncontent University of Edinburgh Research Explorer Logo Help & FAQ Home Research \noutput Profiles Research Units Projects Datasets Prizes Activities Press / Media Equipment \nSearch by expertise, name or affiliation AMNOS: An integrated web-based platform for \nsheep breeding management Z. Abas, Georgios Banos, PA Mitkas, P. Saragiotis , I. Maltaris \nRoyal (Dick) School of Veterinary Studies Research output: Contribution to conference › \nPaper Overview Original language English Pages 28-21 Number of pages 4 Publication \nstatus Published - 2002 Event 7th World Congress on Genetics Applied to Livestock \nProduction [WCGALP] - Montpelier, France Duration: 19 Aug 2002 → 23 Aug 2002 \nConference Conference 7th World Congress on …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:KaMxkj08jr0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Merging robotics and aal ontologies: The rapp methodology",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-15847-1_28",
            "Abstract": "Cloud robotics is becoming a trend in the modern robotics field, as it became evident that true artificial intelligence can be achieved only by sharing collective knowledge. In the ICT area, the most common way to formulate knowledge is via the ontology concept, where different meanings connect semantically. Additionally, a considerable effort to merge robotics with assisted living concepts exists, as the modern societies suffer from lack of caregivers for the persons in need. In the current work, an attempt is made to merge a robotic and an AAL ontology, as well as utilize it in the RAPP Project (EU-FP7).",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:KbBQZpvPDL4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Detection of genomic idiosyncrasies using fuzzy phylogenetic profiles",
            "Publication year": 2013,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0052854",
            "Abstract": "Phylogenetic profiles express the presence or absence of genes and their homologs across a number of reference genomes. They have emerged as an elegant representation framework for comparative genomics and have been used for the genome-wide inference and discovery of functionally linked genes or metabolic pathways. As the number of reference genomes grows, there is an acute need for faster and more accurate methods for phylogenetic profile analysis with increased performance in speed and quality. We propose a novel, efficient method for the detection of genomic idiosyncrasies, i.e. sets of genes found in a specific genome with peculiar phylogenetic properties, such as intra-genome correlations or inter-genome relationships. Our algorithm is a four-step process where genome profiles are first defined as fuzzy vectors, then discretized to binary vectors, followed by a de-noising step, and finally a comparison step to generate intra- and inter-genome distances for each gene profile. The method is validated with a carefully selected benchmark set of five reference genomes, using a range of approaches regarding similarity metrics and pre-processing stages for noise reduction. We demonstrate that the fuzzy profile method consistently identifies the actual phylogenetic relationship and origin of the genes under consideration for the majority of the cases, while the detected outliers are found to be particular genes with peculiar phylogenetic patterns. The proposed method provides a time-efficient and highly scalable approach for phylogenetic stratification, with the detected groups of genes being either similar to their own genome …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:q3CdL3IzO_QC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Data-aware optimization of bioinformatics workflows in hybrid clouds",
            "Publication year": 2016,
            "Publication url": "https://journalofbigdata.springeropen.com/articles/10.1186/s40537-016-0055-2",
            "Abstract": "Life Sciences have been established and widely accepted as a foremost Big Data discipline; as such they are a constant source of the most computationally challenging problems. In order to provide efficient solutions, the community is turning towards scalable approaches such as the utilization of cloud resources in addition to any existing local computational infrastructures. Although bioinformatics workflows are generally amenable to parallelization, the challenges involved are however not only computationally, but also data intensive. In this paper we propose a data management methodology for achieving parallelism in bioinformatics workflows, while simultaneously minimizing data-interdependent file transfers. We combine our methodology with a novel two-stage scheduling approach capable of performing load estimation and balancing across and within heterogeneous distributed computational resources. Beyond an exhaustive experimentation regime to validate the scalability and speed-up of our approach, we compare it against a state-of-the-art high performance computing framework and showcase its time and cost advantages.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:sJsF-0ZLhtgC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Data mining and knowledge discovery: A brief overview",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_2.pdf",
            "Abstract": "Data Mining has evolved into a mainstream technology because of two complementary, yet antagonistic phenomena: a) the data deluge, fueled by the maturing of database technology and the development of advanced automated data collection tools and, b) the starvation for knowledge, defined as the need to filter and interpret all these massive data volumes stored in databases, data warehouses and other information repositories. DM can be thought of as the logical succession to Information Technology (IT). Considering IT evolution over the past 50 years (Figure 2.1), the first radical step was taken in the 60's with the implementation of data collection, while in the 70's, the first Relational Database Management Systems (RDBMS) were developed. During the 80's, enhanced data access techniques began to emerge, the relational model was widely applied, and suitable programming languages were developed …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:0izLItjtcgwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "CAT 2008 post-tournament evaluation: the Mertacor’s perspective",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/272363/",
            "Abstract": "TAC Market Design (or CAT) tournament is an effort to study the competition among modern stock exchanges trying to attract potential traders while maximizing their profit. This paper shortly presents Mertacor, our entrant for 2008, and makes an attempt to evaluate its performance. We compare Mertacor with the other available entries for the setting of CAT 2008 as well as beyond the tournament. What’s more, we introduce a simple yet effective way of computing the global competitive equilibrium that Mertacor utilizes and discuss about its importance for the game.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Experimental Evaluation of ZCS-DM for the Prediction of Urban Air Quality",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-88351-7_22",
            "Abstract": "Understanding and forecasting urban Air Quality (AQ) is not only a multi-faceted and computationally challenging problem for machine learning algorithms, but also a difficult task for human-decision makers: the strict regulatory framework, in combination with the public demand for better information services poses the need for robust, efficient and, more importantly, understandable forecasting models. Unlike neural network or regression-based techniques traditionally used in the domain of AQ, our current approach adopts ZCS-DM – Zeroth-level Classifier System for Data Mining – for the production of a set of AQ prediction rules in the urban domain. On this basis, the aim of our experimental investigation is two-fold and includes (i) the handling of incomplete data matrices and (ii) the evaluation of ZCS-DM effectiveness against methods widely used in the target domain, namely multi-layer perceptron (MLP …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A multi-agent simulation framework for spiders traversing the semantic web",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4061462/",
            "Abstract": "Although search engines traditionally use spiders for traversing and indexing the Web, there has not yet been any methodological attempt to model, deploy and test learning spiders. The flourishing of the semantic Web provides understandable information that may improve the accuracy of search engines. In this paper, we introduce BioSpider, an agent-based simulation framework for developing and testing autonomous, intelligent, semantically-focused Web spiders. BioSpider assumes a direct analogy of the problem at hand with a multi-variate ecosystem, where each member is self-maintaining. The population of the ecosystem comprises cooperative spiders incorporating communication, mobility and learning skills, striving to improve efficiency. Genetic algorithms and classifier rules have been employed for spider adaptation and learning. A set of experiments has been performed in order to qualitatively test the …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bottom-up modeling of small-scale energy consumers for effective demand response applications",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0952197614001377",
            "Abstract": "In contemporary power systems, small-scale consumers account for up to 50% of a country׳s total electrical energy consumption. Nevertheless, not much has been achieved towards eliminating the problems caused by their inelastic consumption habits, namely the peaks in their daily power demand and the inability of energy suppliers to perform short-term forecasting and/or long-term portfolio management. Typical approaches applied in large-scale consumers, like providing targeted incentives for behavioral change, cannot be employed in this case due to the lack of models for everyday habits, activities and consumption patterns, as well as the inability to model consumer response based on personal comfort. Current work aspires to tackle these issues; it introduces a set of small-scale consumer models that provide statistical descriptions of electrical consumption patterns, parameterized from the analysis of real …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:HtS1dXgVpQUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "TRIP-T cell receptor/immunoglobulin profiler",
            "Publication year": 2020,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/s12859-020-03669-1",
            "Abstract": "Antigen receptors are characterized by an extreme diversity of specificities, which poses major computational and analytical challenges, particularly in the era of high-throughput immunoprofiling by next generation sequencing (NGS). The T cell Receptor/Immunoglobulin Profiler (TRIP) tool offers the opportunity for an in-depth analysis based on the processing of the output files of the IMGT/HighV-Quest tool, a standard in NGS immunoprofiling, through a number of interoperable modules. These provide detailed information about antigen receptor gene rearrangements, including variable (V), diversity (D) and joining (J) gene usage, CDR3 amino acid and nucleotide composition and clonality of both T cell receptors (TR) and B cell receptor immunoglobulins (BcR IG), and characteristics of the somatic hypermutation within the BcR IG genes. TRIP is a web application implemented in R shiny. Two sets of experiments have been performed in order to evaluate the efficiency and performance of the TRIP tool. The first used a number of synthetic datasets, ranging from 250k to 1M sequences, and established the linear response time of the tool (about 6 h for 1M sequences processed through the entire BcR IG data pipeline). The reproducibility of the tool was tested comparing the results produced by the main TRIP workflow with the results from a previous pipeline used on the Galaxy platform. As expected, no significant differences were noted between the two tools; although the preselection process seems to be stricter within the TRIP pipeline, about 0.1% more rearrangements were filtered out, with no impact on the final results. TRIP is a software …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:rHJHxKgnXwkC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "A hierarchical multi-metric framework for item clustering",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8606651/",
            "Abstract": "Item clustering is commonly used for dimensionality reduction, uncovering item similarities and connections, gaining insights of the market structure and recommendations. Hierarchical clustering methods produce a hierarchy structure along with the clusters that can be useful for managing item categories and sub-categories, dealing with indirect competition and new item categorization as well. Nevertheless, baseline hierarchical clustering algorithms have high computational cost and memory usage. In this paper we propose an innovative scalable hierarchical clustering framework, which overcomes these limitations. Our work consists of a binary tree construction algorithm that creates a hierarchy of the items using three metrics, a) Identity, b) Similarity and c) Entropy, as well as a branch breaking algorithm which composes the final clusters by applying thresholds to each branch of the tree. The proposed framework …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:j7_hQOaDUrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Constructing optimal fuzzy metric trees for agent performance evaluation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4740645/",
            "Abstract": "The field of multi-agent systems has reached a significant degree of maturity with respect to frameworks, standards and infrastructures. Focus is now shifted to performance evaluation of real-world applications, in order to quantify the practical benefits and drawbacks of agent systems. Our approach extends current work on generic evaluation methodologies for agents by employing fuzzy weighted trees for organizing evaluation-specific concepts/metrics and linguistic terms to intuitively represent and aggregate measurement information.Furthermore, we introduce meta-metrics that measure the validity and complexity of the contribution of each metric in the overall performance evaluation. These are all incorporated for selecting optimal subsets of metrics and designing the evaluation process incompliance with the demands/restrictions of various evaluation setups, thus minimizing intervention by domain experts. The …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Agent Intelligence Through Data Mining (Multiagent Systems, Artificial Societies, and Simulated Organizations)",
            "Publication year": 2006,
            "Publication url": "http://digilib.moe.gov.ir/handle/moel/19318",
            "Abstract": "Subject: ENGINEERING:; COMPUTER SCIENCE & ENGINEERING:; COMPUTER SCIENCE, ARTIFICIAL INTELLIGENCE, ENGINEERING:; COMPUTER SCIENCE & ENGINEERING:; COMPUTER SCIENCE, INFORMATION TECHNOLOGY, ENGINEERING:; COMPUTER SCIENCE & ENGINEERING:; COMPUTER SCIENCE, SOFTWARE ENGINEERING, ENGINEERING:; MINING & MINERAL PROCESSING, ENGINEERING:; ROBOTICS, Humanities & Social Science:; ART (uncategorised), Humanities & Social Science:; BUSINESS, MANAGEMENT AND ECONOMICS",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:jE2MZjpN3IcC",
            "Publisher": "Springer"
        },
        {
            "Title": "Event Detection via LDA for the MediaEval2012 SED Task.",
            "Publication year": 2012,
            "Publication url": "http://ceur-ws.org/Vol-927/mediaeval2012_submission_37.pdf",
            "Abstract": "In this paper we present our methodology for the Social Event Detection Task of the MediaEval 2012 Benchmarking Initiative. We adopt topic discovery using Latent Dirichlet Allocation (LDA), city classification using TF-IDF analysis, and other statistical and natural language processing methods. After describing the approach we employed, we present the corresponding results, and discuss the problems we faced, as well as the conclusions we drew.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using data-mining techniques for PM10 forecasting in the metropolitan area of Thessaloniki, Greece",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4371394/",
            "Abstract": "Knowledge extraction and acute forecasting are among the most challenging issues concerning the use of computational intelligence (CI) methods in real world applications. Both aspects are essential in cases where decision making is required, especially in domains directly related to the quality of life, like the quality of the atmospheric environment. In the present paper we emphasize on short term Air Quality (AQ) forecasting as a key constituent of every AQ management system, and we apply various CI methods and tools for assessing PMio concentration values. We report our experimental strategy and preliminary results that reveal interesting interrelations between AQ and various city operations, while performing satisfactory in predicting concentration values.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Coupling Data Mining with Intelligent Agents",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_5.pdf",
            "Abstract": "1. The Unified Methodology 1.1 Formal Model Let O be the ontology of the MAS. Let A={A\\, A2,..., An} be the set of attributes described in O and defined on V, the application data domain. Let D C V be a set of data, where each dataset tuple is a vector t={ti,£ 2,••• 5^ n} 5 and£ ij i= 1... n, is a value for the corresponding attribute A {. Missing values are allowed within t. Let us now consider a MAS with k different agent types Qi, i—\\,..., k. For each type, qi agent instances Qi (j) may exist with 1< Qi< m-Thus, the total number of agents in the MAS is equal to: Y! fi= iQi'Fr these agents, three are the training cases, with respect to the knowledge types extracted:",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:FAceZFleit8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Monitoring Agent Communication in Soft Real-time Environments",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5616080/",
            "Abstract": "Real-time systems can be defined as systems operating under specific timing constraints, either hard or soft ones. In principle, agent systems are considered inappropriate for such kinds of systems, due to the asynchronous nature of their communication protocols, which directly influences their temporal behavior. Nevertheless, multi-agent systems could be successfully employed for solving problems where failure to meet a deadline does not have serious consequences, given the existence of a fail-safe system mechanism. Current work focuses on the analysis of multi-agent systems behavior under such soft real-time constraints. To this end, ERMIS has been developed: an integrated framework that provides the agent developer with the ability to benchmark his/her own architecture and identify its limitations and its optimal timing behavior, under specific hardware/software constraints. A variety of MAS configurations …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Agent Mertacor: A robust design for dealing with uncertainty and variation in SCM environments",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417407002710",
            "Abstract": "Supply Chain Management (SCM) has recently entered a new era, where the old-fashioned static, long-term relationships between involved actors are being replaced by new, dynamic negotiating schemas, established over virtual organizations and trading marketplaces. SCM environments now operate under strict policies that all interested parties (suppliers, manufacturers, customers) have to abide by, in order to participate. And, though such dynamic markets provide greater profit potential, they also conceal greater risks, since competition is tougher and request and demand may vary significantly in the quest for maximum benefit. The need for efficient SCM actors is thus implied, actors that may handle the deluge of (either complete or incomplete) information generated, perceive variations and exploit the full potential of the environments they inhabit. In this context, we introduce Mertacor, an agent that employs …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Applying agent technology in environmental management systems under real-time constraints",
            "Publication year": 2004,
            "Publication url": "https://scholarsarchive.byu.edu/iemssconference/2004/all/50/",
            "Abstract": "Changes in the natural environment affect our quality of life. Thus, government, industry, and the public call for integrated environmental management systems capable of supplying all parties with validated, accurate and timely information. The ‘near real-time’constraint reveals two critical problems in delivering such tasks: the low quality or absence of data, and the changing conditions over a long period. These problems are common in environmental monitoring networks and although harmless for off-line studies, they may be serious for near real-time systems. In this work, we discuss the problem space of near real-time reporting Environmental Management Systems and present a methodology for applying agent technology this area. The proposed methodology applies powerful tools from the IT sector, such as software agents and machine learning, and identifies the potential use for solving real-world problems. An experimental agent-based prototype developed for monitoring and assessing air-quality in near real time is presented. A community of software agents is assigned to monitor and validate measurements coming from several sensors, to assess air-quality, and, finally, to deliver air quality indicators and alarms to appropriate recipients, when needed, over the web. The architecture of the developed system is presented and the deployment of a real-world test case is demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Abacus: A multi-agent system for meteorological radar data management and decision support",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.485.323&rep=rep1&type=pdf",
            "Abstract": "The Meteorological Service of Cyprus operates a Doppler radar at the mountainous region of the island. Data-streams recorded by the radar are used for weather forecasting and, especially, for identifying oncoming precipitation incidents and issuing (potential) warnings. However, the continuous processing and evaluation of radar data requires significant efforts by the meteorologists, both for data processing, storage, and maintenance, as well as for data interpretation and visualization. To assist meteorologists and to automate a large part of these tasks, we have developed Abacus, a multi-agent system for managing radar data and providing decision support. Abacus' agents undertake data-management and visualization tasks, while they are also responsible for extracting statistical indicators and assessing current weather conditions. In addition, Abacus' agents can identify potentially hazardous incidents, disseminate preprocessed information over the web, and enable warning services are provided via email. In this paper, Abacus' agent architecture is detailed and agent communication for information diffusion is discussed. Focus is also given on the fully customizable logical rule-bases used for agent reasoning required in decision-support. The platform has been tested with real-world data from the Meteorological Service of Cyprus.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multi-agent infrastructure for enhancing ERP system intelligence",
            "Publication year": 2007,
            "Publication url": "https://scpe.org/index.php/scpe/article/view/401/75",
            "Abstract": "НК Свижг й и гвК ви ждж з Ъ згйж Ша вв в Д ЪШЕ знзи бз ж йз в зз б в б ви иггаз и и йЙ игб и в ви ж и аа гбд вн изИ в ай в ж аЙи б да вв в И б вй ийж в И з а зИ в б ж и в К Ь з джг зз з джг й а ж бгйвиз г ви ждж з и и и ж И в ийжвИ йз н б в жз в бдагн з иг в а аа згжиз г йз в зз и з з зй з вк вигжн гвижгаИ гж ж иж в И йзигб ж з жк И в в в в йб в ж згйж з Н℄ К зд и и зйддгжи йжж ви ЪШ знзи бз джгк гв джг зз ггж в и гв в и гж в о и гвИ бгзи г и б зд аан а н знзи бз а к в з гвЙЫйддгжи Д ЫЕ д а и зИ ж зйаи в и ж гж в ж з гбд вн гбд и и к в ззК Св и гвИ жгб йв и гв а ин д жзд и к И бгзи ЪШ знзи бз ж а б и иг б ж иж вз и гв а СЬ знзи бзИ д а г ей ж в И джг зз в И в гббйв и в ж л гж йвзгд зи и джг зз и гв и гбд внГз д зи в дж з ви зйддан в гд ж и гвз О℄ К Св гж ж иг гди б о йз в зз джг зз з в и и и а зйддан в б в б ви а к аИ и в гж в ани а СЬ знзи бз и и л аа лгж в агз ггд ж и гв л и и аж н взи аа ЪШ знзи бз з аж н в ви И в ЫЙ в а знзи бз зи в гйи з и бгзи зй зз йа и л н игл ж з и к агдб ви г бгж ви в бгж джг и а згайи гвзК Шжг в к в йжи жИ к вдгжи℄ зй зиз и и з гвЙб в д а и з з гйа и з в ми вз гв г и йб в а ин иг джг зз вгла в джгдгз з и йв и гв г вгла б в б ви знзи бз л и и а зз а иж вз и гвЙ з знзи бзИ л а жаззгв в Ьйж в П℄ а б и и и ви ж и гв г зб жи Йгв бг йа з иг и аж н зи а з ЪШ знзи бз гйа б зи в ж зг ил ж бгж и к в джг й и к гж и в Ййз жзК",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving Multilingual Interaction for Consumer Robots through Signal Enhancement in Multichannel Speech",
            "Publication year": 2016,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=18337",
            "Abstract": "In order for social robots to be truly successful, they need the ability to orally communicate with humans, providing feedback and accepting commands. Social robots need automatic speech recognition (ASR) tools that function with different users, using different languages, voice pitches, pronunciations, and speech speeds over a wide range of sound and noise levels. This paper describes different methodologies for voice activity detection and noise elimination when used with ASR-based oral interaction within an affordable budget robot. Acoustically quasi-stationary environments are assumed, which in conjunction with the high background noise of the robot’s microphones makes the ASR challenging. This work has been performed in the context of project RAPP, which attempts to deliver a cloud repository of applications and services that can be utilized by heterogeneous robots, aiming at assisting people with a …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:Ak0FvsSvgGUC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Open-source monitoring, search and analytics over social media",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-70284-1_28",
            "Abstract": "The paper describes a technical demonstration of an open-source framework for monitoring, analysis and search over multiple social media platforms. The framework is intended to be a valuable tool for media intelligence professionals, as well as a framework and testbed for scientists and developers with interest in social media research.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:jgBuDB5drN8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Spatial light modulators for multimedia database processing",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4457/0000/Spatial-light-modulators-for-multimedia-database-processing/10.1117/12.447742.short",
            "Abstract": "Multimedia databases are characterized by massive storage requirements and the need for an extremely high processor/memory bandwidth. In addition, the diversity of data types and their varying sizes and formats make multimedia database processing a formidable task. Optical and optoelectronic technology can contribute devices and system solutions with high time-space bandwidth. Spatial light modulators constitute one such class of devices. In this paper, we outline the desirable properties of spatial light modulators for multimedia database processing and review a number of devices and the systems they have been used in. Special attention is paid to holographic associative processing. We also describe a free-space optoelectronic system that employs arrays of vertical cavity surface emitting lasers integrated on CMOS to perform similarity searches on databases of biological data.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:BwyfMAYsbu0C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Quality control of national genetic evaluation results using data-mining techniques; a progress report",
            "Publication year": 2003,
            "Publication url": "https://journal.interbull.org/index.php/ib/article/view/790/781",
            "Abstract": "BackgroundData quality constitutes one of the most critical issues in genetic evaluations both at national and international level. International genetic evaluations computed by Interbull are based on the analysis of national genetic evaluation results. Therefore, the validity of international comparisons depends on the quality of the output of the various national genetic evaluation systems. The current method for data quality assurance is mainly determined by the consistency of consecutive evaluation results and is based on thorough statistical examination (Klei et al., 2002). In a separate project, national genetic evaluation programs are being tested on simulated datasets with known properties (Täubert et al., 2002).Data-mining (DM) provides a different perspective on data quality control. DM is an algorithm-based, data-driven approach in the knowledge discovery process. It is defined as the extraction of interesting …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measuring the specialization of agents in a multi-agent system using entropy and complexity",
            "Publication year": 2011,
            "Publication url": "https://www.actapress.com/Abstract.aspx?paperId=451466",
            "Abstract": "MEASURING THE SPECIALIZATION OF AGENTS IN A MULTI-AGENT SYSTEM USING \nENTROPY AND COMPLEXITY Vivia Nikolaidou and Pericles A. Mitkas Department of Electrical \nand Computer Engineering Aristotle University of Thessaloniki 54124 Thessaloniki, Greece \nvivia@ee.auth.gr, mitkas@eng.auth.gr ABSTRACT This work discusses the quantification of \nspecialization in a multi-agent system as an evaluation metric. There is currently no commonly \naccepted evaluation methodology for multi-agent systems and their complexity emphasizes the \nneed to quantify high-level abstract evaluation met- rics. Based on previous work, we measure \nspecialization in two dimensions, horizontal and vertical, using Lopez- Ruiz, Mancini and \nCalbet complexity, Kolmogorov com- plexity and Shannon entropy to quantify it. We measured \nboth horizontal and vertical specialization in the Trading Agent Competition agents and […",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:WbkHhVStYXYC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Adaptive pricing functions for open outcry auctions",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1565618/",
            "Abstract": "In agent-mediated marketplaces, autonomous agents deploy automated bidding mechanisms in order to increase revenue for humans. The ability of agents to estimate the next prices to be revealed in an auction, by applying forecasting, is a key element for efficient and successful bidding. In open outcry auctions, such as English and Dutch, information about bidders behavior is revealed at each round. This paper proposes a bid calculation function based on forecasting of the next price in English and Dutch auctions. The forecasting is based on two linear adaptive filters for stochastic estimation, whose parameters are calculated using a genetic algorithm. In order to test the efficiency of the two bidding methods and to benchmark the performance of the two filters, we conduct a set of experiments and present the results.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Designing tariffs in a competitive energy market using particle swarm optimization techniques",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13218-1_10",
            "Abstract": "The main challenge of the Smart Grid Paradigm is achieving a tight balance between supply and demand of electrical energy. A contemporary approach to address this challenge is the use of autonomous broker agents. These intelligent entities are able to interact with both producers and consumers by offering tariffs, in order to buy or sell energy, respectively, within a new energy market mechanism: the Tariff Market. Agents are incentivized to level supply and demand within their portfolio, in line with maximizing their profit. In this work, we study a profit optimization strategy that was implemented for Mertacor broker-agent, always considering the customized needs of his customers. The agent was developed and tested in the PowerTAC Competition platform, which provides a powerful benchmark for researching Tariff Markets. To fulfill the agent’s objectives, two types of strategies were implemented: (i) a tariff …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:HIFyuExEbWQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An integrated framework for enhancing the semantic transformation, editing and querying of relational databases",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S095741741001002X",
            "Abstract": "The transition from the traditional to the Semantic Web has proven much more difficult than initially expected. The volume, complexity and versatility of data of various domains, the computational limitations imposed on semantic querying and inferencing have drastically reduced the thrust semantic technologies had when initially introduced. In order for the semantic web to actually ‘work’ efficient tools are needed, allowing the semantic transformation of legacy data, which can then be queried, processed and reasoned upon. And, though remarkable efforts exist towards tackling part of the required functionality, no system integrates all tasks in a user-friendly, easy-to-adapt manner. In this context, we introduce Iconomy, an integrated framework for enhancing the Semantic Transformation, Editing and Querying of Relational Databases. Aiming to ease-of-use, scalability and extensibility, Iconomy supports state-of-the-art …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An Ontology for Supporting Clinical Research on Cervical Cancer.",
            "Publication year": 2009,
            "Publication url": "http://olympus.ee.auth.gr/~chmaramis/website/documents/keod2009.pdf",
            "Abstract": "Manolis Falelakisa, b, Christos Maramisa, b, Irini Lekkac, Pericles A. Mitkasa, b and Anastasios Delopoulosa, b a. Department of Electrical and Computer Engineering, Aristotle University of Thessaloniki b. Informatics and Telematics Institute, Centre for Research and Technology Hellas c. School of Medicine, Aristotle University of Thessaloniki {manf, chmaramis}@ mug. ee. auth. gr, lekka@ med. auth. gr,{mitkas, adelo}@ eng. auth. gr",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards Fashion Image Annotation: A Clothing Category Recognition Procedure.",
            "Publication year": 2020,
            "Publication url": "http://ceur-ws.org/Vol-2844/fashion2.pdf",
            "Abstract": "In contemporary clothing industry, design, development and procurement teams are constantly asked to present more products with fewer resources in a shorter time. Thus, clothing companies that aim to remain competitive in today’s market have to deploy new Artificial Intelligence techniques aiming at the automation of their traditional procedures. In this direction, the presented approach utilizes a deep learning model to accurately classify fashion images. The predictions are intended to be used on a personalized recommendation system, that acts as an assistant for the fashion designers. Two well established architectures are studied, VGG and ResNet, as well as a variation of ResNet. The realized experiments include:(a) architecture comparison,(b) hyperparameter tuning and classification, and (c) transfer learning. Two fashion datasets are used for the model training and classification: DeepFashion (for training the model from scratch) and iMaterialist (used to evaluate the transferability of the produced model). The results show that the first set of experiments achieved 80.5% accuracy, whereas the pre-trained model used on the second dataset led to a decrease of 60% on training time, while attaining satisfying results.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:1Ye0OR6EYb4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multi-metric algorithm for hierarchical clustering of same-length protein sequences",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-92016-0_18",
            "Abstract": "The identification of meaningful groups of proteins has always been a major area of interest for structural and functional genomics. Successful protein clustering can lead to significant insight, assisting in both tracing the evolutionary history of the respective molecules as well as in identifying potential functions and interactions of novel sequences. Here we propose a clustering algorithm for same-length sequences, which allows the construction of subset hierarchy and facilitates the identification of the underlying patterns for any given subset. The proposed method utilizes the metrics of sequence identity and amino-acid similarity simultaneously as direct measures. The algorithm was applied on a real-world dataset consisting of clonotypic immunoglobulin (IG) sequences from Chronic lymphocytic leukemia (CLL) patients, showing promising results.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:v1_lew4L6wgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Applying semantic technologies in cervical cancer research",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X13000220",
            "Abstract": "In this paper we present a research system that follows a semantic approach to facilitate medical association studies in the area of cervical cancer. Our system, named ASSIST and developed as an EU research project, assists in cervical cancer research by unifying multiple patient record repositories, physically located in different medical centers or hospitals. Semantic modeling of medical data and rules for inferring domain-specific information allow the system to (i) homogenize the information contained in the isolated repositories by translating it into the terms of a unified semantic representation, (ii) extract diagnostic information not explicitly stored in the individual repositories, and (iii) automate the process of evaluating medical hypotheses by performing case–control association studies, which is the ultimate goal of the system.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Agent-based short-term load and price forecasting using a parallel implementation of an adaptive PSO-trained local linear wavelet neural network",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7216611/",
            "Abstract": "Short-Term Load and Price forecasting are crucial to the stability of electricity markets and to the profitability of the involved parties. The work presented here makes use of a Local Linear Wavelet Neural Network (LLWNN) trained by a special adaptive version of the Particle Swarm Optimization algorithm and implemented as parallel process in CUDA. Experiments for short term load and price forecasting, up to 24 hours ahead, were conducted for energy market datasets from Greece and the USA. In addition, the fast response time of the system enabled its encapsulation in a PowerTAC agent, competing in a real time environment. The system displayed robust all-around performance in a plethora of real and simulated energy markets, each characterized by unique patterns and deviations. The low forecasting error, real time performance and the significant increase in the profitability of an energy market agent show …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:OP4eGU-M3BUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A sequence mining method to predict the bidding strategy of trading agents",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03603-3_11",
            "Abstract": "In this work, we describe the process used in order to predict the bidding strategy of trading agents. This was done in the context of the Reverse TAC, or CAT, game of the Trading Agent Competition. In this game, a set of trading agents, buyers or sellers, are provided by the server and they trade their goods in one of the markets operated by the competing agents. Better knowledge of the strategy of the trading agents will allow a market maker to adapt its incentives and attract more agents to its own market. Our prediction was based on the time series of the traders’ past bids, taking into account the variation of each bid compared to its history. The results proved to be of satisfactory accuracy, both in the game’s context and when compared to other existing approaches.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Exploiting data mining techniques for improving the efficiency of a supply chain management agent",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4053196/",
            "Abstract": "Supply chain management (SCM) environments are often dynamic markets providing a plethora of information, either complete or incomplete. It is, therefore, evident that such environments demand intelligent solutions, which can perceive variations and act in order to achieve maximum revenue. To do so, they must also provide some sophisticated mechanism for exploiting the full potential of the environments they inhabit. Advancing on the way autonomous solutions usually deal with the SCM process, we have built a robust and highly-adaptable mechanism for efficiently dealing with all SCM facets, while at the same time incorporating a module that exploits data mining technology in order to forecast the price of the winning bid in a given order and, thus, adjust its bidding strategy. The paper presents our agent, Mertacor, and focuses on the forecasting mechanism it incorporates, aiming to optimal agent efficiency",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring optimization strategies in board game abalone for alpha-beta search",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6374139/",
            "Abstract": "This paper discusses the design and implementation of a highly efficient MiniMax algorithm for the game Abalone. For perfect information games with relatively low branching factor for their decision tree (such as Chess, Checkers etc.) and a highly accurate evaluation function, Alpha-Beta search proved to be far more efficient than Monte Carlo Tree Search. In recent years many new techniques have been developed to improve the efficiency of the Alpha-Beta tree, applied to a variety of scientific fields. This paper explores several techniques for increasing the efficiency of Alpha-Beta Search on the board game of Abalone while introducing some new innovative techniques that proved to be very effective. The main idea behind them is the incorporation of probabilistic features to the otherwise deterministic Alpha-Beta search.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:i2xiXl-TujoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient E-commerce agent design based on clustering eBay data",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4427636/",
            "Abstract": "In this paper we present the use of data mining techniques on data derived from eBay auctions in order to design a decision making mechanism for autonomous agents. These agents operate as parallel threads that concurrently receive data from multiple online auctions, where a specific item is traded. The agent objective is to select the auction, in which the traded item will be sold at the lowest price. Trading agents are armed with a realtime decision-making mechanism, adaptable to changes occurring in the auctions environment. The paper shows how a particular data mining technique can be incorporated into the design of trading agents and provides the theoretical basis of the agent decision mechanism.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "G-MolKnot: A grid enabled systematic algorithm to produce open molecular knots",
            "Publication year": 2008,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/02/G-MolKnot-A-grid-enabled-systematic-algorithm-to-produce-open-molecular-knots-.pdf",
            "Abstract": "Molecular intertwining entities are increasingly found in nature as knotted proteins and DNA while synthesized molecular knots along with catenanes and rotaxanes have been proposed as parts of potential molecular machines, entropy-driven molecular shuttles or scaffolds for drug carriers. The General Molecular Knotting algorithm (GMK)[1, 2] is capable to produce open knotted alkanes, polyethylene oxides and peptides with high or low steric energy at will. The method is quite efficient for small chain lengths, where all other methods fail. The results are validated by applying high level ab initio calculations for selected molecular knots. Although the GMK algorithm is by design a sequential process, it can be decomposed to four distinct domains; molecule generation, knot evaluation, molecular mechanics optimization and quantum mechanics optimization. Moreover, each conformation generated during the first …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining Knowledge for Agent Communities",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_8.pdf",
            "Abstract": "The third application level of knowledge diffusion differs substantially from the first two, because in this case there are no historical data to perform data mining on and extract knowledge models. Both the multiagent systems and the DM techniques are evolutionary. Interactions between the members of the system and the influence that some of them exert on others, play a significant role in the overall behavior of the system. We refer to such systems as agent communities, because the agents are faced with common problems (or goals), which they attempt to overcome (or reach) through either collaboration or competition. In either case, agent interaction is a pivotal element of the system. As already described in Chapter 5, key issues for agent communities are the proper modeling of the problem and the efficient representation of the agent knowledge model. As a typical example of this class of MAS, we have chosen to …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:GtLg2Ama23sC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A Robust Agent Design for Dynamic SCM",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=5034572528380403841&hl=en&oi=scholarr",
            "Abstract": "The leap from decision support to autonomous systems has often raised a number of issues, namely system safety, soundness and security. Depending on the field of application, these issues can either be easily overcome or even hinder progress. In the case of Supply Chain Management (SCM), where system performance implies loss or profit, these issues are of high importance. SCM environments are often dy-namic markets providing incomplete information, therefore demanding intelligent solutions which can adhere to environment rules, perceive vari-ations, and act in order to achieve maximum revenue. Advancing on the way such autonomous solutions deal with the SCM process, we have built a robust, highly-adaptable and easily-configurable mechanism for efficiently dealing with all SCM facets, from material procurement and inventory management to goods production and shipment. Our agent has been crash-tested in one of the most challenging SCM environments, the trading agent competition SCM game and has proven capable of providing advanced SCM solutions on behalf of its owner. This paper introduces Mertacor and its main architectural primitives, provides an overview of the TAC SCM environment, and discusses Mertacor's performance.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:q-HalDI95KYC",
            "Publisher": "Springer"
        },
        {
            "Title": "DAWN: A platform for evaluating water-pricing policies using a software agent society",
            "Publication year": 2004,
            "Publication url": "https://scholarsarchive.byu.edu/iemssconference/2004/all/49/",
            "Abstract": "Lately there is a transition in water management: policy makers leave aside traditional methods focused on additional-supply policies and focus on water conservation using demand control methods. Water Agencies use water-pricing policies as an instrument for controlling residential water demand. However, design and evaluation of a water-pricing policy is a complex task, as economic, social and political constraints have to be incorporated. In order to support policy makers in their tasks, we developed DAWN, a software tool for evaluating water-pricing policies, implemented as a multi-agent system. DAWN simulates the residential water demand-supply chain and enables the design, creation, modification and execution of different scenarios. Software agents behave as water consumers, while econometric and social models are incorporated into them for estimating future consumptions. Scenarios and models can be parameterized through a friendly graphical user interface and software agents are instantiated at runtime. DAWN’s main advantage is that it supports social interaction between consumers, which is activated using agent communication. Thus, variables affecting water consumption and associated with consumer’s social behavior can be included into DAWN scenarios. In this paper, DAWN’s agent architecture is detailed and agent communication using ontologies is discussed. Focus is given on the econometric and social simulation models used for agent reasoning. Finally, the platform developed is presented along with real-world results of its application at the region of Thessaloniki, Greece.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agents and Data Mining Interaction: 6th International Workshop on Agents and Data Mining Interaction, ADMI 2010, Toronto, ON, Canada, May 11, 2010, Revised Selected Papers",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=I15sCQAAQBAJ&oi=fnd&pg=PP2&dq=info:8h1r-8bolpsJ:scholar.google.com&ots=8xiXB-r7tR&sig=fhYPjYDtP2wKQdJFemHznNf299I",
            "Abstract": "Annotation. This book constitutes the refereed proceedings of the 6th International Workshop on Agents and Data Mining Interaction, ADMI 2010, held in Toronto, Canada, in May 2010. The 15 revised full papers presented were carefully reviewed and selected from 37 submissions. The papers are organized in topical sections on agents for data mining; data mining for agents; data mining in agents; and agent mining applications.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Springer"
        },
        {
            "Title": "AMNOS-mobile®: Exploiting handheld computers in efficient sheep recording",
            "Publication year": 2007,
            "Publication url": "https://www.research.ed.ac.uk/en/publications/amnos-mobile-exploiting-handheld-computers-in-efficient-sheep-rec",
            "Abstract": "AMNOS-mobile®: Exploiting handheld computers in efficient sheep recording — University of \nEdinburgh Research Explorer Skip to main navigation Skip to search Skip to main content \nUniversity of Edinburgh Research Explorer Logo Help & FAQ Home Research output Profiles \nResearch Units Projects Datasets Prizes Activities Press / Media Equipment Search by \nexpertise, name or affiliation AMNOS-mobile®: Exploiting handheld computers in efficient sheep \nrecording Z. Abas, AL Symeonidis, A. Batzios, Z. Basdagianni, Georgios Banos, PA Mitkas, E. \nSinapis, A Pampoukidou Royal (Dick) School of Veterinary Studies Research output: Chapter \nin Book/Report/Conference proceeding › Conference contribution Overview Original language \nEnglish Title of host publication Breeding, production recording, health and the evaluation \nof farm animals Subtitle of host publication Proceedings of the 35th biennial Session of , , , /…",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:a0OBvERweLwC",
            "Publisher": "Wageningen, The Netherlands: Wageningen Academic Publishers"
        },
        {
            "Title": "Hermes: Seamless delivery of containerized bioinformatics workflows in hybrid cloud (HTC) environments",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2352711017300304",
            "Abstract": "Hermes introduces a new “describe once, run anywhere” paradigm for the execution of bioinformatics workflows in hybrid cloud environments. It combines the traditional features of parallelization-enabled workflow management systems and of distributed computing platforms in a container-based approach. It offers seamless deployment, overcoming the burden of setting up and configuring the software and network requirements. Most importantly, Hermes fosters the reproducibility of scientific workflows by supporting standardization of the software execution environment, thus leading to consistent scientific workflow results and accelerating scientific output.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:lgwcVrK6X84C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "ERGASIOGNOMON-a Model System of Advanced Digital Services Designed and Developed to Support the Job Marketplace",
            "Publication year": 2003,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/02/Ergasiognomon-A-Model-System-of-Advanced-Digital-Services-Designed-and-Developed-to-Support-the-Job-Marketplace.pdf",
            "Abstract": "The continuous expansion of Internet has enabled the development of a wide range of advanced digital services. Real-time data diffusion has eliminated processing bottlenecks and has led to fast, easy and no-cost communications. This primitive has been widely exploited in the process of job searching. Numerous systems have been developed offering job candidates with the opportunity to browse for vacancies, submit resumes, and even contact the most appealing of the employers. Although effective, most of these systems are characterized by their simplicity, acting more like an enhanced bulletin board, rather than an integrated, fully functional system. Even for the more advanced of these systems user interaction is obligatory, in order to couple job seekers with job providers, thus continuous supervising of the process is unavoidable. Advancing on the way primitive job recruitment techniques apply on Internet-based systems, and dealing with their lack of efficiency and interactivity, we have developed a robust software system that employs intelligent techniques for coupling candidates and jobs, according to the formers’ skills and the latter’s requirements. A thorough analysis of the system specifications has been conducted, and all issues concerning information retrieval and data filtering, coupling intelligence, storage, security, user interaction and ease-of-use have been integrated into one web-based job portal.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Volume holographic optical correlators",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-47864-5_29",
            "Abstract": "Volume holograms have received considerable recent interest for high-capacity data storage [1–3] because of the ability to multiplex many holograms within the same volume. Volume holographic memories may also provide an attractive solution to the massive capacity and transfer rate requirements of multimedia applications [4]. The page-oriented data format of holographic memories is a natural match for the format of certain database objects such as tables of records, images, and video frames. The massive parallelism provides both high capacity and high data rates, which can alleviate the I/O bottleneck of multimedia databases [5].",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Contemporary air quality forecasting methods: A comparative analysis between statistical methods and classification algorithms",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=13995029713371788992&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent Agents and Multi-Agent Systems",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-25757-8_3.pdf",
            "Abstract": "This definition can be applied to software agents, which are instantiated and act instead of a user or a software program that controls them. Thus, one of the most characteristic agent features is its agency. In the rest of this book, the term agent is synonymous to a software agent. The difficulty in defining an agent arises from the fact that the various aspects of agency are weighted differently, with respect to the application domain at hand. Although, for example, agent learning is considered of pivotal importance in certain applications, for others it may be considered not only trivial, but even undesirable. Consequently, a number of definitions could be provided with respect to agent objectives. Wooldridge & Jennings have succeeded in combining general agent features into the following generic, nevertheless abstract, definition:",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:4hFrxpcac9AC",
            "Publisher": "Springer US"
        },
        {
            "Title": "StreamGrid: Summarization of Large Scale Events using Topic Modelling and Temporal Analysis.",
            "Publication year": 2014,
            "Publication url": "http://ceur-ws.org/Vol-1198/schinas.pdf?kS4rVfCwOKXHmAWr1IHICQ&ved=0CEgQFjAJ&usg=AFQjCNFRVrmaI6Gj84ljyQzGBAsWKnmOmQ",
            "Abstract": "Due to the increasing popularity of microblogging platforms, the amount of messages related to large scale public events reach impressive levels. Although such messages can be quite informative regarding different aspects of the main event, there is a lot of spam and redundancy that makes it challenging to extract insights regarding the event of interest. In this work we describe a summarization framework that captures the important moments of an event by using a combination of topic modelling and bursty activity detection. We propose a data structure named StreamGrid, that maintains the information of active topics in regular time intervals at several scales. This structure is used for the creation of concise summaries for any time interval. Finally, the evaluation on a large Twitter dataset around the Sundance Film Festival demonstrates the potential of the proposed framework.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:DJbcl8HfkQkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A pan-genome approach and application to species with photosynthetic capabilities",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=13660581700149021147&hl=en&oi=scholarr",
            "Abstract": "Copyright© 2016 Psomopoulos FE et al. This is an open access work distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:MhiOAD_qIWkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "BioCrawler: An intelligent crawler for the semantic web",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417407002990",
            "Abstract": "Web crawling has become an important aspect of web search, as the WWW keeps getting bigger and search engines strive to index the most important and up to date content. Many experimental approaches exist, but few actually try to model the current behaviour of search engines, which is to crawl and refresh the sites they deem as important, much more frequently than others. BioCrawler mirrors this behaviour on the semantic web, by applying the learning strategies adopted in previous work on ecosystem simulation, called BioTope. BioCrawler employs the principles of BioTope’s intelligent agents on the semantic web, learns which sites are rich in semantic content and which sites link to them and adjusts its crawling habits accordingly. In the end, it learns to behave much like the state of the art search engine crawlers do. However, BioCrawler reaches that behavior solely by exploiting on-page factors, rather …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:Zph67rFs4hoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Sparse episode identification in environmental datasets: The case of air quality assessment",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S095741741001105X",
            "Abstract": "Sparse episode identification in environmental datasets is not only a multi-faceted and computationally challenging problem for machine learning algorithms, but also a difficult task for human-decision makers: the strict regulatory framework, in combination with the public demand for better information services, poses the need for robust, efficient and, more importantly, understandable forecasting models. Additionally, these models need to provide decision-makers with “summarized” and valuable knowledge, that has to be subjected to a thorough evaluation procedure, easily translated to services and/or actions in actual decision making situations, and integratable with existing Environmental Management Systems (EMSs).On this basis, our current study investigates the potential of various machine learning algorithms as tools for air quality (AQ) episode forecasting and assesses them – given the corresponding …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:P5F9QuxV20EC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A framework for the implementation of large scale Demand Response",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6642380/",
            "Abstract": "The rationalization of electrical energy consumption is a constant goal driving research over the last decades. The pursuit of efficient solutions requires the involvement of electrical energy consumers through Demand Response programs. In this study, a framework is presented that can serve as a tool for designing and simulating Demand Response programs, aiming at energy efficiency through consumer behavioral change. It provides the capability to dynamically model groups of electrical energy consumers with respect to their consumption, as well as their behavior. This framework is currently under development within the scope of the EU funded FP7 project “CASSANDRA - A multivariate platform for assessing the impact of strategic decisions in electrical power systems”.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:DUooU5lO8OsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data Mining-Driven Analysis and Decomposition in Agent Supply Chain Management Networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4740842/",
            "Abstract": "In complex and dynamic environments where interdependencies cannot monotonously determine causality, data mining techniques may be employed in order to analyze the problem, extract key features and identify pivotal factors. Typical cases of such complexity and dynamicity are supply chain networks, where a number of involved stakeholders struggle towards their own benefit. These stakeholders may be agents with varying degrees of autonomy and intelligence, in a constant effort to establish beneficiary contracts and maximize own revenue. In this paper, we illustrate the benefits of data mining analysis on a well-established agent supply chain management network. We apply data mining techniques, both at a macro and micro level, analyze the results and discuss them in the context of agent performance improvement.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "SoFoCles: feature filtering for microarray classification based on gene ontology",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1532046409000926",
            "Abstract": "Marker gene selection has been an important research topic in the classification analysis of gene expression data. Current methods try to reduce the “curse of dimensionality” by using statistical intra-feature set calculations, or classifiers that are based on the given dataset. In this paper, we present SoFoCles, an interactive tool that enables semantic feature filtering in microarray classification problems with the use of external, well-defined knowledge retrieved from the Gene Ontology. The notion of semantic similarity is used to derive genes that are involved in the same biological path during the microarray experiment, by enriching a feature set that has been initially produced with legacy methods. Among its other functionalities, SoFoCles offers a large repository of semantic similarity methods that are used in order to derive feature sets and marker genes. The structure and functionality of the tool are discussed in …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Robot-assisted cognitive exercise in mild cognitive impairment patients: The RAPP approach",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7391355/",
            "Abstract": "Medical advances have increased life expectancy to the point where senior citizens comprise a larger than ever percentage of the general population. The RAPP project introduces socially interactive robots that will not only physically assist, but also serve as a companion to senior citizens. In this paper, a novel system is presented, designed as part of the RAPP project that aims to assist senior citizens with mild cognitive impairment in performing cognitive tests as a means of exercise, while also keeping track of their performance. Our goal is to provide an interactive and intriguing user friendly alternative to the classic cognitive tests that will keep the patient interested and thus increase compliance. Tracking the patient's performance in the cognitive tests can prove invaluable as the data can be further associated with medical treatment or lifestyle changes and conclusively lead to better understanding of the nature of …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:lvd772isFD0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Personalization and the Conversational Web",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-35330-8_4",
            "Abstract": " Hyper-personalization intends to maximize the opportunities a marketer has to tailor content that fits each and every customer’s wants and needs. Naturally, gathering and analyzing more data is the key to those opportunities. This is were the “Conversation Web” comes in, which in the near future is expected to transform to so much more than just conversational interfaces (chat-bots). In a truly Conversation Web, websites and users implicitly “discuss” in the form of clicks, mouse scrolls and movements, as well as page views and product purchases. Websites use this information for decoding user interests and profile and provide customized one-to-one services. In this work we proposed an integrated architecture for the conversational Web; consequently we propose a novel hybrid approach for recommendations using offline and online analysis, as well as we propose a novel personalized search strategy that takes …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:3NQIlFlcGxIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Symbiosis: Using predator-prey games as a test bed for studying competitive co-evolution",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4227534/",
            "Abstract": "The animal approach constitutes an intriguing attempt to study and comprehend the behavior of adaptive, learning entities in complex environments. Further inspired by the notions of co-evolution and evolutionary ''arms races\", we have developed Symbiosis, a virtual ecosystem that hosts two self-organizing, combating species - preys and predators. All animats live and evolve in this shared environment, they are self-maintaining and engage in a series of vital activities - nutrition, growth, communication - with the ultimate goals of survival and reproduction. The main objective of Symbiosis is to study the behavior of ecosystem members, especially in terms of the emergent learning mechanisms and the effect of co-evolution on the evolved behavioral strategies. In this direction, several indicators are used to assess individual behavior, with the overall effectiveness metric depending strongly on the animats net energy …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software agents in multiple adaptive double auction markets",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5298794/",
            "Abstract": "The prevalence of on-line auctions has stimulated the interest of both the economists and computer scientists in an effort to understand and improve their rules. One famous form of these economic mechanisms is the double auction and, more specifically, the continuous double auction which is commonly used in today's major stock exchanges worldwide. Software agents constitute a promising tool for the study and implementation of novel double auction mechanisms. TAC Market Design Tournament makes an attempt to study the competition among such dynamically adjusted market institutions trying to attract potential traders while maximizing their profit. In this paper we describe the tournament and discuss about the importance of the global competitive equilibrium in its economy. Moreover,we provide a simple, yet effective estimation technique for the latter that our entrant, Mertacor, has utilized during the games …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reinforcement learning based scheduling in a workflow management system",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0952197619300351",
            "Abstract": "Any computational process from simple data analytics tasks to training a machine learning model can be described by a workflow. Many workflow management systems (WMS) exist that undertake the task of scheduling workflows across distributed computational resources. In this work, we introduce a WMS that leverages machine learning to predict workflow task runtime and the probability of failure of task assignments to execution sites. The expected runtime of workflow tasks can be used to approximate the weight of the workflow graph branches in respect to the total workflow workload and the ability to anticipate task failures can discourage task assignments that are unlikely to succeed. We demonstrate that the proposed machine learning models can lead to significantly more informed scheduling decisions that minimize task failures and utilize execution sites more efficiently, thus leading to reduced workflow …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:kw52XkFRtyQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Effective rule-based multi-label classification with learning classifier systems",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-37213-1_48",
            "Abstract": "In recent years, multi-label classification has attracted a significant body of research, motivated by real-life applications such as text classification and medical diagnoses. However, rule-based methods, and especially Learning Classifier Systems (LCS), for tackling such problems have only been sparsely studied. This is the motivation behind our current work that introduces a generalized multi-label rule format and uses it as a guide for further adapting the general Michigan-style LCS framework. The resulting LCS algorithm is thoroughly evaluated and found competitive to other state-of-the-art multi-label classification methods.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Development and evaluation of data mining models for air quality prediction in Athens, Greece",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-88351-7_25",
            "Abstract": "Air pollution is a major problem in the world today, causing undesirable effects on both the environment and human health and, at the same time, stressing the need for effective simulation and forecasting models of atmospheric quality. Targeting this adverse situation, our current work focuses on investigating the potential of data mining algorithms in air pollution modeling and short-term forecasting problems. In this direction, various data mining methods are adopted for the qualitative forecasting of concentration levels of air pollutants or the quantitative prediction of their values (through the development of different classification and regression models respectively) in five locations of the greater Athens area. An additional aim of this work is the systematic assessment of the quality of experimental results, in order to discover the best performing algorithm (or set of algorithms) that can be proved to be …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Fuzzy Hidden Markov Models: a new approach in multiple sequence alignment",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.97.4835&rep=rep1&type=pdf",
            "Abstract": "This paper proposes a novel method for aligning multiple genomic or proteomic sequences using a fuzzyfied Hidden Markov Model (HMM). HMMs are known to provide compelling performance among multiple sequence alignment (MSA) algorithms, yet their stochastic nature does not help them cope with the existing dependence among the sequence elements. Fuzzy HMMs are a novel type of HMMs based on fuzzy sets and fuzzy integrals which generalizes the classical stochastic HMM, by relaxing its independence assumptions. In this paper, the fuzzy HMM model for MSA is mathematically defined. New fuzzy algorithms are described for building and training fuzzy HMMs, as well as for their use in aligning multiple sequences. Fuzzy HMMs can also increase the model capability of aligning multiple sequences mainly in terms of computation time. Modeling the multiple sequence alignment procedure with fuzzy HMMs can yield a robust and time-effective solution that can be widely used in bioinformatics in various applications, such as protein classification, phylogenetic analysis and gene prediction, among others.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:IWHjjKOFINEC",
            "Publisher": "IOS Press; 1999"
        },
        {
            "Title": "An agent structure for evaluating micro-level MAS performance",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1660877.1660910",
            "Abstract": "Although the need for well-established engineering approaches in Intelligent Systems (IS) performance evaluation is urging, currently no widely accepted methodology exists, mainly due to lack of consensus on relevant definitions and scope of applicability, multi-disciplinary issues and immaturity of the field of IS. Even existing well-tested evaluation methodologies applied in other domains, such as (traditional) software engineering, prove inadequate to address the unpredictable emerging factors of the behavior of intelligent components. In this paper, we present a generic methodology and associated tools for evaluating the performance of IS, by exploiting the software agent paradigm as a representative modeling concept for intelligent systems. Based on the assessment of observable behavior of agents or multi-agent systems, the proposed methodology provides a concise set of guidelines and representation …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An alarm firing system for national genetic evaluation quality control",
            "Publication year": 2004,
            "Publication url": "https://journal.interbull.org/index.php/ib/article/view/858/849",
            "Abstract": "National genetic evaluation results form the basis of Interbull services. The current method for quality assurance is mainly determined by the consistency of consecutive evaluation results and is based on thorough statistical examination (Klei et al., 2002). In a separate project, national genetic evaluation programs are being tested on simulated data sets with known properties (Täubert et al., 2002). Datamining (DM) offers an alternative way to examine data and extract valuable information (Han and Kamber, 2000), potentially leading to inference on data quality. In a recent progress report, the development of a DM algorithm for the analysis of national genetic evaluation results was presented (Banos et al., 2003). Data quality was assessed by subjective inspection of DM results. The present study introduces a method to evaluate DM application results with objective criteria leading, when necessary, to the automatic …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Protein classification with multiple algorithms",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_42",
            "Abstract": "Nowadays, the number of protein sequences being stored in central protein databases from labs all over the world is constantly increasing. From these proteins only a fraction has been experimentally analyzed in order to detect their structure and hence their function in the corresponding organism. The reason is that experimental determination of structure is labor-intensive and quite time-consuming. Therefore there is the need for automated tools that can classify new proteins to structural families. This paper presents a comparative evaluation of several algorithms that learn such classification models from data concerning patterns of proteins with known structure. In addition, several approaches that combine multiple learning algorithms to increase the accuracy of predictions are evaluated. The results of the experiments provide insights that can help biologists and computer scientists design high …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A distributed system for managing and diffusing environmental information",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/53083892/heleco2005distributed.pdf",
            "Abstract": "In an effort to support Environmental Monitoring and Surveillance Centers (EMSC) to fuse, manage and diffuse environmental data in a more efficient manner, we developed a distributed system for managing and diffusing environmental information. The developed system, called AISLE, is an adaptive, intelligent tool for supporting advanced information management services. Its main characteristic is the provision of decision support and information diffusion abilities through electronic services to several users with diverse needs. Specifically, software agents are in charge of integrating and managing environmental data recorded by field sensors or other monitoring devices, along with their diffusion to a wide range of end-user applications, such as environmental databases, terminal applications, or public information services over the internet. The system has been demonstrated in two pilot cases. In the first case, AISLE has been applied for assessing and reporting ambient air quality in Valencia, Spain. In the second case, AISLE was used for monitoring weather conditions in Cyprus.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Segmentation of low voltage consumers for designing individualized pricing policies",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7981862/",
            "Abstract": "In recent years, the liberation of distribution and energy services has led towards competitive Energy Market environments. In these Markets, the participating suppliers need to provide more reliable services, specifically tailored to each customer or group of customers with similar needs. Thus, it is important to identify the consumer types in their portfolio, through Customer Load Profiling. In this paper, algorithms that provide robust and reliable clustering results are examined, as tools for meaningful Low Voltage consumers' segmentation. A number of experiments on two different data sets were implemented to provide an insight to the proposed attributes' input selection. Additionally, a set of custom pricing schemes was produced based on the segmentation results and the peak and cost reduction are estimated. The results are promising and enhance our understanding of the long-term gains that can be obtained by …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:CaZNVDsoPx4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An agent‐based intelligent environmental monitoring system",
            "Publication year": 2004,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/14777830410531216/full/html",
            "Abstract": "Fairly rapid environmental changes call for continuous surveillance and on‐line decision making. There are two main areas where IT technologies can be valuable. In this paper we present a multi‐agent system for monitoring and assessing air‐quality attributes, which uses data coming from a meteorological station. A community of software agents is assigned to monitor and validate measurements coming from several sensors, to assess air‐quality, and, finally, to fire alarms to appropriate recipients, when needed. Data mining techniques have been used for adding data‐driven, customized intelligence into agents. The architecture of the developed system, its domain ontology, and typical agent interactions are presented. Finally, the deployment of a real‐world test case is demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Mertacor 2009 Demystified: Strategies and Guidelines for Market Design in TAC",
            "Publication year": 2010,
            "Publication url": "https://eprints.soton.ac.uk/272364/",
            "Abstract": "Current global economy involves highly interconnected markets competing with each other for market share and profit. The recent global financial crisis has revived research interest in this competition and has brought out the need for novel, efficient rules. TAC Market Design tournament is one of the first efforts in studying the interaction between opponent stock exchanges. In this paper, we describe our entrant for 2009, Mertacor, and reason about the importance of proper pricing in this global setting.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic Holographic Image Projection: The Key to Optical Interfacing",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-56965-4_3",
            "Abstract": "Holographic information systems may stimulate further novel applications in the future, provided their inherent abilities to deal with three-dimensional image fields are explored. The concept of holographic interfacing among machine layers and the user is addressed here in the frame of optical storage, processing and delivery. Preliminary results on the amplified projection of three-dimensional, holographically reconstructed images indicate that dynamic holographic projectors can facilitate efficient three-dimensional data transfer. The fruitful exploitation of tandem photorefractive amplification and phase-conjugation stages, potentially operating in a combined pulsed/ continuous-wave mode, may open up new avenues in cineholographic archiving, large scene dynamic holographic projection and multimedia.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:4MWp96NkSFoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Enhancing agent intelligence through evolving reservoir networks for predictions in power stock markets",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-27609-5_15",
            "Abstract": "In recent years, Time Series Prediction and clustering have been employed in hyperactive and evolving environments –where temporal data play an important role– as a result of the need for reliable methods to estimate and predict the pattern or behavior of events and systems. Power Stock Markets are such highly dynamic and competitive auction environments, additionally perplexed by constrained power laws in the various stages, from production to transmission and consumption. As with all real-time auctioning environments, the limited time available for decision making provides an ideal testbed for autonomous agents to develop bidding strategies that exploit time series prediction. Within the context of this paper, we present Cassandra, a dynamic platform that fosters the development of Data-Mining enhanced Multi-agent systems. Special attention was given on the efficiency and reusability of …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:p__nRnzSRKYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Mining patterns and rules for improving agent intelligence through an integrated multi-agent platform",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=10748839465580445152&hl=en&oi=scholarr",
            "Abstract": "Andreas L. Symeonidis Pericles A. Mitkas Dionisis D. Kechagias Tel.+ 30-310-99-6349 Tel.+ 30-310-99-6390 Tel.+ 30-310-99-6349 Fax+ 30-310-99-6398 Fax+ 30-310-99-6396 Fax+ 30-310-99-6398 email: asymeon@ ee. auth. gr email: mitkas@ eng. auth. gr email: diok@ iti. gr",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MULTI-LEVEL CLUSTERING OF PHYLOGENETIC PROFILES",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213012400234",
            "Abstract": "The prediction of gene function from genome sequences is one of the main issues in Bioinformatics. Most computational approaches are based on the similarity between sequences to infer gene function. However, the availability of several fully sequenced genomes has enabled alternative approaches, such as phylogenetic profiles. Phylogenetic profiles are vectors which indicate the presence or absence of a gene in other genomes. The main concept of phylogenetic profiles is that proteins participating in a common structural complex or metabolic pathway are likely to evolve in a correlated fashion. In this paper, a multi-level clustering algorithm of phylogenetic profiles is presented, which aims to detect inter- and intra-genome gene clusters.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:u9iWguZQMMsC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "ZCS Revisited: Zeroth-level classifier systems for data mining",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4733996/",
            "Abstract": "Learning classifier systems (LCS) are machine learning systems designed to work for both multi-step and single-step decision tasks. The latter case presents an interesting,though not widely studied, challenge for such algorithms,especially when they are applied to real-world data mining problems. The present investigation departs from the popular approach of applying accuracy-based LCS to data mining problems and aims to uncover the potential of strength-based LCS in such tasks. In this direction, ZCS-DM, a Zeroth-level Classifier System for data mining, is applied to a series of real-world classification problems and its performance is compared to that of other state-of-the-art machine learning techniques (C4.5, HIDER and XCS). Results are encouraging, since with only a modest parameter exploration phase, ZCS-DM manages to outperform its rival algorithms in eleven out of the twelve benchmark datasets …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Intelligent Recommendation Framework for ERP Systems.",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/48665699/An_Intelligent_Recommendation_Framework_20160908-11424-1vg5w2l.pdf",
            "Abstract": "Enterprise Resource Planning systems efficiently administer all tasks concerning real-time planning and manufacturing, material procurement and inventory monitoring, customer and supplier management. Nevertheless, the incorporation of domain knowledge and the application of adaptive decision making into such systems require extreme customization with a cost that becomes unaffordable, especially in the case of SMEs. We present an alternative approach for incorporating adaptive business intelligence into the company’s backbone. We have designed and developed a highly reconfigurable, adaptive, cost efficient multi-agent framework that acts as an add-on to ERP software, employing Data Mining and Soft Computing techniques in order to provide intelligent recommendations on customer, supplier and inventory management. In this paper, we present the architectural details of the developed framework.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting parallel data mining processing for protein annotation",
            "Publication year": 2008,
            "Publication url": "http://ikee.lib.auth.gr/record/224032",
            "Abstract": "Proteins are large organic compounds consisting of amino acids arranged in a linear chain and joined together by peptide bonds. One of the most important challenges in modern Bioinformatics is the accurate prediction of the fu nctional behavior of proteins. In this paper a novel parallel methodology for automatic protein function annotation is presented. Data mining techniques are employed in order to co nstruct models based on data generated from already annotated protein sequences. The first step of the methodology is to obtain the motifs present in these sequences, whic h are then provided as input to the data mining algorithms in order to create a model for every term. Experiments conducted using the EGEE Grid environment as a source of multiple CPUs clear ly indicate that the methodology is highly efficient and accurate, as the utilization of many processors substantially reduces the execution time.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:Br1UauaknNIC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "A Scalable Grid Computing Framework for Extensible Phylogenetic Profile Construction",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-44944-9_39",
            "Abstract": "Current research in Life Sciences without doubt has been established as a Big Data discipline. Beyond the expected domain-specific requirements, this perspective has put scalability as one of the most crucial aspects of any state-of-the-art bioinformatics framework. Sequence alignment and construction of phylogenetic profiles are common tasks evident in a wide range of life science analyses as, given an arbitrary big volume of genomes, they can provide useful insights on the functionality and relationships of the involved entities. This process is often a computational bottleneck in existing solutions, due to its inherent complexity. Our proposed distributed framework manages to perform both tasks with significant speed-up by employing Grid Computing resources provided by EGI in an efficient and optimal manner. The overall workflow is both fully automated, thus making it user friendly, and fully detached …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:LgRImbQfgY4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Agents and data mining interaction",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-27609-5.pdf",
            "Abstract": "© Springer-Verlag Berlin Heidelberg 2012",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:mlAyqtXpCwEC",
            "Publisher": "Springer-Verlag Heidelberg"
        },
        {
            "Title": "An automatic speech detection architecture for social robot oral interaction",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2814895.2814931",
            "Abstract": "Social robotics have become a trend in contemporary robotics research, since they can be successfully used in a wide range of applications. One of the most fundamental communication skills a robot must have is the oral interaction with a human, in order to provide feedback or accept commands. And, although text-to-speech is an almost solved problem, this isn't the case for speech detection, since it includes a large number of different conditions, many of which are literally unpredictable. There are quite a few well established ASR (Automatic Speech Recognition) tools, however without providing efficient results, especially in less popular languages. The current paper investigates different speech detection strategies via the utilization of the Sphinx-4 open-source library. The first is a way to incorporate languages for which no acoustic or language model exists (Greek in our case), following the grapheme-to …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:8xutWZnSdmoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Objectives towards stable adversarial training without gradient penalties",
            "Publication year": 2019,
            "Publication url": "https://sgo-workshop.github.io/CameraReady2019/23.pdf",
            "Abstract": "Recent advances in adversarial learning observe that stabilization with gradient penalties trades off generated sample quality. We try to address this limitation by proposing novel objectives inspired by the logical XOR operation, which should not depend on gradient penalty regularization in order to be locally stable. In the sections that follow, we will present a theoretical study on this type of objective functions. We will prove global optimality conditions with similar assumptions as those made in the original GAN paper by Goodfellow et al., we will notice connections between the XOR-type objectives and the original GAN, and we will define non zero-sum parametric objectives based on that connection. Finally, we will attempt to study the local stability of the continuous-time training dynamical system around desirable equilibria.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:prdVHNxh-e8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recommendation Systems in a Conversational Web.",
            "Publication year": 2018,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2019/02/WEBIST_2018_29.pdf",
            "Abstract": "In this paper we redefine the concept of Conversation Web in the context of hyper-personalization. We argue that hyper-personalization in the WWW is only possible within a conversational web where websites and users continuously “discuss”(interact in any way). We present a modular system architecture for the conversational WWW, given that adapting to various user profiles and multivariate websites in terms of size and user traffic is necessary, especially in e-commerce. Obviously there cannot be a unique fit-to-all algorithm, but numerous complementary personalization algorithms and techniques are needed. In this context, we propose PRCW, a novel hybrid approach combining offline and online recommendations using RFMG, an extension of RFM modeling. We evaluate our approach against the results of a deep neural network in two datasets coming from different online retailers. Our evaluation indicates that a) the proposed approach outperforms current state-of-art methods in small-medium datasets and can improve performance in large datasets when combined with other methods, b) results can greatly vary in different datasets, depending on size and characteristics, thus locating the proper method for each dataset can be a rather complex task, and c) offline algorithms should be combined with online methods in order to get optimal results since offline algorithms tend to offer better performance but online algorithms are necessary for exploiting new users and trends that turn up.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:1taIhTC69MYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "G-Class: A Divide and Conquer Application for Grid. Protein Classification",
            "Publication year": 2006,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/02/G-Class-A-Divide-and-Conquer-Application-for-Grid-Protein-Classification-.pdf",
            "Abstract": "Protein classification has always been one of the major challenges in modern functional proteomics. The presence of motifs in protein chains can make the prediction of the functional behavior of proteins possible. The correlation between protein properties and their motifs is not always obvious, since more than one motif may exist within a protein chain. Due to the complexity of this correlation most data mining algorithms are either non efficient or time consuming. In this paper a data mining methodology that utilizes grid technologies is presented. First, data are split into multiple sets while preserving the original data distribution in each set. Then, multiple models are created by using the data sets as independent training sets. Finally, the models are combined to produce the final classification rules, containing all the previously extracted information. The methodology is tested using various protein and protein class …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agents and data mining",
            "Publication year": 2009,
            "Publication url": "https://datasciences.org/publication/ieeeis09-ge.pdf",
            "Abstract": "We present an overview of this emergent field in the Expert Opinion department. The article establishes a synergetic framework and discusses theoretical underpinnings, key research issues, applications, and resources for agent-mining research and development. In particular, it outlines current issues in agent-driven distributed data mining, data-mining-driven agents, and mutual issues in agents and data mining.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:0CzhzZyukY4C",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "A hybrid agent-based model for estimating residential water demand",
            "Publication year": 2005,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0037549705053172",
            "Abstract": "The global effort toward sustainable development has initiated a transition                 in water management. Water utility companies use water-pricing policies as an                 instrument for controlling residential water demand. To support policy makers in                 their decisions, the authors have developed DAWN, a hybrid model for evaluating                 water-pricing policies. DAWN integrates an agent-based social model for the consumer                 with conventional econometric models and simulates the residential water                 demand-supply chain, enabling the evaluation of different scenarios for policy                 making. An agent community is assigned to behave as water consumers, while                 econometric and social models are incorporated into them for estimating water                 consumption. DAWN’s main advantage is that it supports social interaction                 between consumers, through an influence …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:qjMakFHDy7sC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Software Agents for Assessing Environmental Quality: Advantages and Limitations.",
            "Publication year": 2004,
            "Publication url": "http://enviroinfo.eu/sites/default/files/pdfs/vol110/0303.pdf",
            "Abstract": "The last decades, there has been a remarkable change in modern societies. Environmental values are appreciated to a greater extent, as it has become evident that they are highly correlated with our quality of life. The aftermath of the growing societal interest in the environment and sustainable development was the emerging need for providing environmental information to the public. The challenge for Environmental Management and Assessment Information Systems is to provide efficient, accurate and timely electronic services to the public. In this work, we examine the applicability of software agent technology for automating the environmental quality assessment process. Software agents are best suited in systems that are modular, decentralized, changeable, ill-structured and complex, according to Van Dyke Parunak (1999). Environmental management and assessment systems are of this kind, and employing software agents to realize them makes possible the provision of advanced features. However, certain limitations may arise. Both advantages and limitations of agent-based applications for environmental monitoring and assessment systems are connected with real-world functionality. Environmental Management and Assessment Information Systems is a generic term that covers software systems responsible for 1. gathering environmental information from dissimilar data sources, 2. managing environmental data for supporting the decision making process involved in environmental assessment, and 3. post-processing data and facts for supplying citizens, industry, public institutions and government with information services related to the …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AGELI: An integrated platform for the Assessment of national Genetic Evaluation results by Learning and Informing",
            "Publication year": 2005,
            "Publication url": "https://journal.interbull.org/index.php/ib/article/view/899/890",
            "Abstract": "We present an integrated platform for preprocessing, analysis, alarm issuing and presentation of national genetic evaluation data based on data-mining. Our goal is the integrated qualitative description of national genetic evaluation results, concerning three milk yield traits that constitute a critical issue in the range of services provided by Interbull. Although the standard method for quality assurance appears sufficiently functional (Klei et al., 2002), during the last years there has been a progress concerning an alternative validation method of genetic evaluation results using data-mining (Banos et al., 2003; Diplaris et al., 2004; Han and Kamber, 2000), potentially leading to inference on data quality. A new alarming technique based on multiple criteria was recently established in order to assess and assure data quality (Diplaris et al., 2004). The whole idea was to exploit datamining techniques, ie decision trees, and …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Photorefractive Volume Holographic Memories for Associative Storage and Processing in a Multimedia Environment",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-011-4096-6_30",
            "Abstract": "Photorefractive volume holographic memories can be used to realize fast data searches because they allow associative data recall. We have developed a prototype of a volume holographic database system and examined its potential use for a number of applications in a multimedia environment, including database management, video indexing, and interactive video. The experimental results presented in this paper demonstrate that associative recall is possible with any combination of digital (binary) and analog (image) data.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Eikonomia-an integrated semantically aware tool for description and retrieval of byzantine art information",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410392/",
            "Abstract": "Semantic annotation and querying is currently applied on a number of versatile disciplines, providing the added-value of such an approach and, consequently the need for more elaborate - either case-specific or generic - tools. In this context, we have developed Eikonomia: an integrated semantically-aware tool for the description and retrieval of Byzantine artwork Information. Following the needs of the ORMYLIA Art Diagnosis Center for adding semantics to their legacy data, an ontology describing Byzantine artwork based on CIDOC-CRM, along with the interfaces for synchronization to and from the existing RDBMS have been implemented. This ontology has been linked to a reasoning tool, while a dynamic interface for the automated creation of semantic queries in SPARQL was developed. Finally, all the appropriate interfaces were instantiated, in order to allow easy ontology manipulation, query results …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive reservoir computing through evolution and learning",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231212007758",
            "Abstract": "The development of real-world, fully autonomous agents would require mechanisms that would offer generalization capabilities from experience, suitable for a large range of machine learning tasks, like those from the areas of supervised and reinforcement learning. Such capacities could be offered by parametric function approximators that could either model the environment or the agent's policy. To promote autonomy, these structures should be adapted to the problem at hand with no or little human expert input. Towards this goal, we propose an adaptive function approximator method for developing appropriate neural networks in the form of reservoir computing systems through evolution and learning. Our neuro-evolution of augmenting reservoirs approach comprises of several ideas, successful on their own, in an effort to develop an algorithm that could handle a large range of problems, more efficiently. In …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Guest editors' introduction: Agents and data mining",
            "Publication year": 2009,
            "Publication url": "https://www.computer.org/csdl/magazine/ex/2009/03/mex2009030014/13rRUxC0SAp",
            "Abstract": "On top of two active research streams, agents and data mining, a most recent and exciting trend is their interaction and integration. Agent mining has emerged as a very promising field due to its unique contributions to complementary and innovative methodologies, techniques, and applications for complex problem-solving. This editorial summarizes the structure of this special issue.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Mendelian sample mining and cluster monitoring of national genetic evaluation data with the AGELI software platform",
            "Publication year": 2007,
            "Publication url": "https://journal.interbull.org/index.php/ib/article/view/989/980",
            "Abstract": "We present an innovative approach for preprocessing, analysis, alarm issuing and presentation of national genetic evaluation data with AGELI using Mendelian sampling mining and clustering techniques. AGELI (Eleftherohorinou et al., 2005) is a software platform that integrates the whole data mining procedure in order to produce a qualitative description of national genetic evaluation results, concerning three milk yield traits. Quality assurance constitutes a critical issue in the range of services provided by Interbull. Although the standard method appears sufficiently functional (Klei et al., 2002), during the last years there has been progress concerning an alternative validation method of genetic evaluation results using data mining",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Response modeling of small-scale energy consumers for effective demand response applications",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378779615003223",
            "Abstract": "The Smart Grid paradigm can be economically and socially sustainable by engaging potential consumers through understanding, trust and clear tangible benefits. Interested consumers may assume a more active role in the energy market by claiming new energy products/services on offer and changing their consumption behavior. To this end, suppliers, aggregators and Distribution System Operators can provide monetary incentives for customer behavioral change through demand response programs, which are variable pricing schemes aiming at consumption shifting and/or reduction. However, forecasting the effect of such programs on power demand requires accurate models that can efficiently describe and predict changes in consumer activities as a response to pricing alterations. Current work proposes such a detailed bottom-up response modeling methodology, as a first step towards understanding and …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:ZzlSgRqYykMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "AMoS: Agent-based Molecular Simulations",
            "Publication year": 2008,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/02/AMoS-Agent-based-Molecular-Simulations.pdf",
            "Abstract": "Molecular Dynamics (MD) is a form of computer simulation wherein atoms and molecules are allowed to interact for a period of time, utilizing theories from mathematics, physics and chemistry. At the core of any MD simulation lies the potential function (or force field), which describes the interactions between the particles of the simulation.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:86PQX7AUzd4C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Proceedings of the 6th international conference on Agents and data mining interaction",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1880493",
            "Abstract": "Proceedings of the 6th international conference on Agents and data mining interaction | Guide \nProceedings ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs \nConferences People More Search ACM Digital Library SearchSearch Advanced Search \nBrowse Browse Digital Library Collections More HomeBrowse by TitleProceedingsADMI'10 \nABSTRACT No abstract available. Comments Login options Check if you have access through \nyour login credentials or your institution to get full access on this article. Sign in Full Access Get \nthis Publication Information Contributors Published in Guide Proceedings cover image ADMI'10: \nProceedings of the 6th international conference on Agents and data mining interaction \nMay 2010 190 pages ISBN:3642154190 Editors: Longbing Cao profile image Longbing -…",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:SjuI4pbJlxcC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Transferring evolved reservoir features in reinforcement learning tasks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29946-9_22",
            "Abstract": "The major goal of transfer learning is to transfer knowledge acquired on a source task in order to facilitate learning on another, different, but usually related, target task. In this paper, we are using neuroevolution to evolve echo state networks on the source task and transfer the best performing reservoirs to be used as initial population on the target task. The idea is that any non-linear, temporal features, represented by the neurons of the reservoir and evolved on the source task, along with reservoir properties, will be a good starting point for a stochastic search on the target task. In a step towards full autonomy and by taking advantage of the random and fully connected nature of echo state networks, we examine a transfer method that renders any inter-task mappings of states and actions unnecessary. We tested our approach and that of inter-task mappings in two RL testbeds: the mountain car and the server …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Biotope: an integrated framework for simulating distributed multiagent computational systems",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1420670/",
            "Abstract": "The study of distributed computational systems issues, such as heterogeneity, concurrency, control, and coordination, has yielded a number of models and architectures, which aspire to provide satisfying solutions to each of the above problems. One of the most intriguing and complex classes of distributed systems are computational ecosystems, which add an \"ecological\" perspective to these issues and introduce the characteristic of self-organization. Extending previous research work on self-organizing communities, we have developed Biotope, which is an agent simulation framework, where each one of its members is dynamic and self-maintaining. The system provides a highly configurable interface for modeling various environments as well as the \"living\" or computational entities that reside in them, while it introduces a series of tools for monitoring system evolution. Classifier systems and genetic algorithms …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Inducing generalized multi-label rules with learning classifier systems",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1512.07982",
            "Abstract": "In recent years, multi-label classification has attracted a significant body of research, motivated by real-life applications, such as text classification and medical diagnoses. Although sparsely studied in this context, Learning Classifier Systems are naturally well-suited to multi-label classification problems, whose search space typically involves multiple highly specific niches. This is the motivation behind our current work that introduces a generalized multi-label rule format -- allowing for flexible label-dependency modeling, with no need for explicit knowledge of which correlations to search for -- and uses it as a guide for further adapting the general Michigan-style supervised Learning Classifier System framework. The integration of the aforementioned rule format and framework adaptations results in a novel algorithm for multi-label classification whose behavior is studied through a set of properly defined artificial problems. The proposed algorithm is also thoroughly evaluated on a set of multi-label datasets and found competitive to other state-of-the-art multi-label classification methods.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:Aul-kAQHnToC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EVADING: An Evolutionary Algorithm with Dynamic Niching for Data Classification.",
            "Publication year": 2009,
            "Publication url": "https://issel.ee.auth.gr/wp-content/uploads/2016/02/EVADING-An-Evolutionary-Algorithm-with-Dynamic-Niching-for-Data-Classification.pdf",
            "Abstract": "Multimodal optimization problems (MMOPs) have been widely studied in many fields of machine learning, including pattern recognition and data classification. Formulating the process of rule induction for the latter task as a MMOP and inspired by corresponding findings in the field of function optimization, our current work proposes an evolutionary algorithm (EVADING) capable of discovering a set of accurate and diverse classification rules. The proposed algorithm uses a dynamic clustering technique as a parallel niching method to maintain rule population diversity and converge to the optimal rules for the attribute-space defined by the target dataset. To demonstrate its applicability and potential, EVADING is applied to a series of real-life classification problems and its prediction accuracy is compared to that of other popular non-evolutionary machine learning techniques. Results are encouraging, since EVADING manages to achieve the best overall average ranking and performs significantly better (at significance level a= 0.05) from three out of the eight rival algorithms used in this study. This work is concluded with some insights on the factors affecting the proposed algorithm’s performance, along with the directions of our future research.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent policy recommendations on enterprise resource planning by the use of agent technology and data mining techniques",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S095741740300099X",
            "Abstract": "Enterprise Resource Planning systems tend to deploy Supply Chain Management and/or Customer Relationship Management techniques, in order to successfully fuse information to customers, suppliers, manufacturers and warehouses, and therefore minimize system-wide costs while satisfying service level requirements. Although efficient, these systems are neither versatile nor adaptive, since newly discovered customer trends cannot be easily integrated with existing knowledge. Advancing on the way the above mentioned techniques apply on ERP systems, we have developed a multi-agent system that introduces adaptive intelligence as a powerful add-on for ERP software customization. The system can be thought of as a recommendation engine, which takes advantage of knowledge gained through the use of data mining techniques, and incorporates it into the resulting company selling policy. The intelligent …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Agent intelligence through data mining",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=YwGmFDO8uv4C&oi=fnd&pg=PR5&dq=info:jqkKoGsxZOkJ:scholar.google.com&ots=GIcPIs6_YM&sig=s24vvL9XnX2YC_y2BNi-6USaAVY",
            "Abstract": "AGENT INTELLIGENCE THROUGH DATA MINING offers a self-contained overview of a relatively young but important area of research: the intersection of agent technology and data mining. This intersection leads to considerable advancements in the area of information technologies, drawing the increasing attention of both research and industrial communities. It can take two forms: a) the more mundane use of intelligent agents for improved data mining and; b) the use of data mining for smarter, more efficient agents. The second approach is the main focus of this volume. Knowledge, routinely created and maintained by today’s applications, is hidden in voluminous data repositories that can be extracted by data mining. The next step is to transform this discovered knowledge into the inference mechanisms or simply the behavior of agents and multi-agent systems. AGENT INTELLIGENCE THROUGH DATA MINING addresses this issue, as well as the arguable challenge of generating intelligence from data while transferring it to a separate, possibly autonomous, software entity. Following a brief review of data mining and agent technology fields, this book presents a methodology for developing multi-agent systems, describes available open-source tools to support this process, and demonstrates the application of the methodology on three different cases. AGENT INTELLIGENCE THROUGH DATA MINING is designed for a professional audience composed of researchers and practitioners in industry. This volume is also suitable for graduate-level students in computer science.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Strength-based learning classifier systems revisited: Effective rule evolution in supervised classification tasks",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0952197612002606",
            "Abstract": "Learning classifier systems (LCS) are machine learning systems designed to work for both multi-step and single-step decision tasks. The latter case presents an interesting challenge for such algorithms, especially when they are applied to real-world data mining (DM) problems. The present investigation departs from the popular approach of applying accuracy-based LCS to single-step classification and aims to uncover the potential of strength-based LCS in such tasks. Although the latter family of algorithms have often been associated with poor generalization and performance, we aim at alleviating these problems by defining appropriate extensions to the traditional strength-based LCS framework. These extensions are detailed and their effect on system performance is studied through the application of the proposed algorithm on a set of artificial problems, designed to challenge its scalability and generalization …",
            "Abstract entirety": 0,
            "Author pub id": "t58rc8QAAAAJ:foquWX3nUaYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A grid-enabled modular framework for efficient sequence analysis workflows",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23983-5_5",
            "Abstract": "In the era of Big Data in Life Sciences, efficient processing and analysis of vast amounts of sequence data is becoming an ever daunting challenge. Among such analyses, sequence alignment is one of the most commonly used procedures, as it provides useful insights on the functionality and relationship of the involved entities. Sequence alignment is one of the most common computational bottlenecks in several bioinformatics workflows. We have designed and implemented a time-efficient distributed modular application for sequence alignment, phylogenetic profiling and clustering of protein sequences, by utilizing the European Grid Infrastructure. The optimal utilization of the Grid with regards to the respective modules, allowed us to achieve significant speedups to the order of 1400%.",
            "Abstract entirety": 1,
            "Author pub id": "t58rc8QAAAAJ:P7Ujq4OLJYoC",
            "Publisher": "Springer, Cham"
        }
    ]
}]