[{
    "name": "Πολυξένη Παγγέ - Λέκκα",
    "romanize name": "Polyxeni Pange - Lekka",
    "School-Department": "Παιδαγωγικό Νηπιαγωγών",
    "University": "uoi",
    "Rank": "Καθηγητής",
    "Apella_id": 9339,
    "Scholar name": "Jenny Pagge Pange",
    "Scholar id": "FMxD7AMAAAAJ",
    "Affiliation": "Παγγέ Τζένη",
    "Citedby": 1887,
    "Interests": [
        "ICT",
        "e-learning",
        "applied statistics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=FMxD7AMAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Traditional and computer-based evaluation of preschoolers’ oral language in Greek–A review of the literature",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Eugenia-Toki/publication/258833594_Traditional_and_Computer-Based_evaluation_of_preschoolers'_oral_language_in_Greek_-_A_review_of_the_literature/links/02e7e52de66fdd7a61000000/Traditional-and-Computer-Based-evaluation-of-preschoolers-oral-language-in-Greek-A-review-of-the-literature.pdf",
            "Abstract": "Technology is truly everywhere (Gillard, Bailey, & Nolan, 2008) and its widespread adoption in various applications influence almost every aspect of modern life. Amongst them, the society’s prospect of the ICT (Information and Communication Technologies) role in education has also changed. Today learners seem to be more involved in the learning process, because they have the advantage of the technology special means to support their assignments (Toki & Pange, 2010). ICT in education can make teaching and learning more effective and efficient (Pange, 2006), as they do not involve just learning about technology (obviously one needs to have certain abilities to use ICT), but learning with technology. The early identification of speech and language disorders or delays is a crucial first step in the effective prevention of developmental and socioemotional problems (Carscadden et al., 2010; Steiner & Braun, 2009). Children’s early cognitive and language development has bearing on later development and readiness for learning and social competence (Carscadden et al., 2010). In the field of language learning and assessment, computerized applications are limited, particularly for the Greek language. Most diagnosticians use qualitative means of assessment based on their personal experience (Protopapas & Skaloumbakas, 2007). Computer capabilities, if used appropriately and responsibly, can expand the resources and improve the efficiency of language learning and assessment (Xi, 2010). The aim of this study is to examine and present the assessment procedures and available tools that are presented in the literature for early childhood …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Noise: A short simplified review on local estimation and reduction",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=14334907419431881664&hl=en&oi=scholarr",
            "Abstract": "We review the basic steps for estimating and reducing the measurement Gaussian white noise from chaotic time series. More precisely, we first explore the influence of noise on the correlation integral. The accurate estimation of the standard deviation helps on the correct noise reduction. We then reduce the noise by considering the averages from the attractor’s neighborhoods as the clean points. This aspect of nonlinear time series analysis is illustrated through examples from both artificial data of Hénon map and real data of Nasdaq Composite.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Is E-learning based on learning theories? A literature review",
            "Publication year": 2011,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17893",
            "Abstract": "Repository of UOI \"Olympias\": Is E-learning based on learning theories? A literature review Skip \nnavigation Home Browse Communities & Collections Browse Items by: Issue Date Author Title \nSubject Item Type Advanced Search Help About DSpace Sign on to: My DSpace Receive email \nupdates Edit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI \n2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών \n5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite \nor link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17893 Institution and \nSchool/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών και Τεχνολογιών. \nΤμήμα Βιολογικών Εφαρμογών και Τεχνολογιών Keywords: Design principles,E-learning,Learning \nTheories Content delivery,Design Principles,E-learning design,,,,,of …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Οι Εφημερίδες στο Πλαίσιο της Δια Βίου Μάθησης",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/671",
            "Abstract": "Η αξία των εφημερίδων για το ευρύ κοινό αναγνωρίζεται και επισημαίνεται συχνά από πολλούς ερευνητές, οι οποίοι τονίζουν ότι οι εφημερίδες παράγουν ιδεολογία, πολιτική και πολιτισμό. Στη σύγχρονη κοινωνία οι εφημερίδες θεωρούνται μέσο επικοινωνίας που παρέχουν πλήθος πληροφοριών και μπορούν να χρησιμοποιηθούν στο πλαίσιο της άτυπης μάθησης, καθότι, ορισμένα φυσικά αντικείμενα όπως τα κυρίως άρθρα των εφημερίδων, οι εικονογραφήσεις και οι πολιτικές γελοιογραφίες επιδρούν τόσο στην εκπαίδευση όσο και σε αντιλήψεις σχετικά με το παρελθόν. Ο στόχος αυτής της πιλοτικής έρευνας ήταν η διερεύνηση των απόψεων των φοιτητών όσον αφορά τις έντυπες και τις διαδικτυακές εφημερίδες. Τα αποτελέσματα της έρευνας ήταν ενθαρρυντικά και υποδηλώνουν ότι τα πληροφοριακά αντικείμενα των εφημερίδων μπορούν να αποτελέσουν ένα σημαντικό απόθεμα εκπαιδευτικού υλικού στο πλαίσιο της δια βίου μάθησης.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting undergraduate University's students MyCourse Application",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359597/",
            "Abstract": "This paper summarizes the work carried out in order to create and implement a method of supporting undergraduate students in Greek Universities' Schools of Education. The aim of this method is to help students bridge their knowledge gaps by providing them educational material that can be personalized depending on their prior knowledge. An online platform was created and was given to the students, complementary to their typical university course material. Apart from the theoretical framework in which this method relies on, this paper describes the design process of the platform called “MyCourse.gr” and presents some of the first results of its implementation.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Can probability combinations/estimations be assessed in preschoolers with the use of computers (powerpoint)",
            "Publication year": 2007,
            "Publication url": "https://www.stat.auckland.ac.nz/~iase/publications/sat07/Nikiforidou_Pange.pdf",
            "Abstract": "The aim of this study is to assess and investigate how many combinations can be manipulated by preschoolers in a probabilistic task. The task was computer-based and included 3 trials with alterations among the colour-combinations and proportions of the sample space. With the use of intuitive thinking or more concrete reasoning children at the age of 5-6, showed that they posses the notion of most/least likely when there are 2 and 3 combinations (not 4).",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Οι έννοιες του πιθανού και του «δίκαιου» σε παιδιά προσχολικής ηλικίας μέσα από σενάρια επίλυσης προβλημάτων",
            "Publication year": 2012,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/jret/article/view/8677",
            "Abstract": "Η έννοια του «δίκαιου» χαρακτηρίζει τη γνωστική και ηθική, κοινωνική ανάπτυξη των παιδιών προσχολικής ηλικίας. Ταυτόχρονα σε αυτήν την ηλικία τα παιδιά αναπτύσσουν την πιθανολογική τους σκέψη και πιο συγκεκριμένα αποκτούν την ικανότητα να διαχωρίζουν πιθανά και απίθανα σενάρια και να εκτιμούν ότι ένα ενδεχόμενο είναι πιο πιθανό να συμβεί από ένα άλλο. Σκοπός της παρούσας εργασίας είναι να διερευνήσει εάν τα μικρά παιδιά (N= 40), ηλικίας 46 χρόνων, εκφράζουν την έννοια του «δίκαιου» μέσα από σενάρια πιθανοτήτων. Εξετάστηκε και βρέθηκε πως μέσα από 3 διαφορετικά τεστ τα παιδιά εκτιμούν τα πιθανά αποτελέσματα και αποδίδουν μια «δίκαιη» λύση. Επιχειρείται σύνδεση στην ανάπτυξη της σκέψης που αφορά στη λήψη αποφάσεων μέσω της εκτίμησης της πιθανότητας συμβάντων και στην ανάπτυξη της ηθικής σκέψης και ιδιαίτερα της έννοιας του «δίκαιου» των νηπίων, με παιδαγωγικές και μεθοδολογικές διαστάσεις.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large noise level estimation",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218127403007965",
            "Abstract": "We generalize a method of noise estimation for chaotic time series due to [Schreiber, 1993] in cases where the noise level is relatively large. The noise estimation is based on the correlation integral, which, for small amounts of noise, is not affected by the attractor's curvature effects. When the noise is large, however, one has to increase the range of the correlation integral and this brings about significant inaccuracies in its evaluation due to both curvature effects and noise. In this Letter, we present a modification of Schreiber's noise level estimation method, which uses a robust error estimator based on L-∞ (rather than  the usual L2) norm in the computations. Since  L-∞ was proved less sensitive to curvature effects, it gives a more accurate estimation of the noise standard deviation compared with Schreiber's results. Here, we illustrate our approach on the Hénon map corrupted by Gaussian white noise with zero …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:u-x6o8ySG0sC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "New technologies in the Greek kindergartens as learning and communication tools",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/12090/",
            "Abstract": "Children learn how to use new technologies such as TV, video and computers from their every day classroom activities. The presence of a teacher proved to be rather unimportant, since the children learned through collaboration. The use of the new technology for entertainment is taught cooperatively from one child to the other. We observed children from Greek kindergartens learn from each other and then we asked them to draw a computer. The more experienced in the computer use a child is, the better details contained in its picture.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:dhFuZR0502QC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Literature review on educational games for learning statistics",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942945/",
            "Abstract": "New methods and applications in learning statistics are of the main interest nowadays. Learning mathematics and statistics is essential at all stages of school education. Statistics learning in a broad sense, starts from early years and never ends. In our society, it is well recognized that developing students' statistics thinking at all levels of education, is of great importance and has a significant objective in later development [l]l-2[2]. Over the last decade several main reasons contributed to the effective use in professional training and learning contexts and they are based on: action rather than explanations; active involving students in problem solving; facilitating numerous learning styles and fostering decision making [3]. Within such a context, games and simulations are seen as a vital complement to traditional learning process and a primary driver in transformation of education. According to our literature review on this …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Online Student-to-Student Interaction: Is It Feasible?",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-90677-1_24",
            "Abstract": "The COVID-19 pandemic has led to some important changes to teaching and learning. Many universities worldwide offered online learning courses. In an online course, the most challenging aspect is not only the teaching process, but also the student-to-student interaction. It is well documented that, during COVID-19 pandemic, online learning has changed the way students interact, communicate, and exchange ideas. Students experienced new ways of online communication and missed student-to-student interaction during the pandemic. University students, up to now, had the opportunity for socialization during their university studies. Nowadays, they face the challenge to interact only online without any contact with their closest friends. In a face-to-face environment, students build metacognitive skills and improve their communication skills, working in well-established partnerships. When students faced the …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:vbGhcppDl1QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Intuitive and informal knowledge in preschoolers’ development of probabilistic thinking",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s13158-013-0081-6",
            "Abstract": "Preschoolers develop a wide range of mathematical informal knowledge and intuitive thinking before they enter formal, goal-oriented education. In their everyday activities young children get engaged with situations that enhance them to develop skills, concepts, strategies, representations, attitudes, constructs and operations concerning a wide range of mathematical notions. Recently there is scientific interest in linking children’s informal and formal knowledge in order to provide them with opportunities to avoid biases aiming at formulating, perceiving, reflecting on and exercising probabilistic notions. The current study investigates preschoolers’ (N=90) intuitive understanding of the likelihood of events in a probabilistic task with spinners. Participants, at the age of 4 to 6, are tested on their predictions of the most probable outcome prior to and after an instructive session of reasoning. The probabilistic task …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Teaching ESP with ICT in higher education: Foreign language teachers’ perceptions and expectations of computer technology use in foreign language learning and teaching",
            "Publication year": 2012,
            "Publication url": "http://www.icicte.org/Proceedings2012/Papers/Grad-3-Dogoriti.pdf",
            "Abstract": "Introduction: In recent years, the rapid diffusion of knowledge and the use of the web have posed a number of challenges in the context of changing teaching and learning and have affected the traditional teaching and learning methodologies. Most teachers in the higher education sector recognize the need for a teaching method using VLEs (Virtual Learning Environments) facilities.Purpose: This study sets out to give a general overview of the availability of technology for foreign language (FL) teaching and learning today, to outline the various uses of ICTs (Information and Communication Technologies) in the higher education sector and to point towards future developments and possible implementation in the teaching of ESP (English for Specific Purposes) in higher education in Greece. The study aimed to examine teachers’ perception, motivations and engagement with learning technology in their ESP classes.Method: The study was carried out in 2011. A questionnaire was sent to university teachers of ESP in 6 universities and one technological institute. A sample of 97 ESP teachers from different departments was taken and data collection was done through a survey. 75 responses (77%) were received.Results and Discussion: ESP teachers in higher education employ traditional teaching methodology and do not use ICT in their classes. The majority (89%) uses ICT in their daily life but do not apply it in classroom practice. However, they have positive expectations of ICT use in foreign language learning.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Are university students ready for m-learning? A pilot study in Greece",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=1691785572317092339&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Use of the Socratic Teaching Method in E-Learning 2.0 Settings: Challenges and Limitations",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/chapter/the-use-of-the-socratic-teaching-method-in-e-learning-20-settings/102439",
            "Abstract": "The aim of this chapter is to outline the use of the Socratic Teaching Method (STM) in e-Learning 2.0 practice. The research included in this chapter is intended as an introductory handout in order to help educators, learners and course designers to identify the advantages and pitfalls of using this teaching method in e-Learning 2.0 applications. More precisely, this chapter gives the writer’s perspective regarding some very interesting issues, such as: a) the range of subjects that could be taught using the STM teaching practice, b) the educators’ additional skills needed in order to apply STM to their online teaching, and c) whether the STM is an adequate learning approach in order to assure learners’ mastery of a subject.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Απόψεις ομάδας φοιτητών για την εκπαιδευτική διάσταση του κοινωνικού δικτύου Facebook",
            "Publication year": 2015,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/85",
            "Abstract": "Η χρήση των κοινωνικών δικτύων στην εκπαίδευση αποτελεί διαδεδομένη πρακτική που απασχολεί αρκετούς ερευνητές του πεδίου. Στην παρούσα μελέτη έγινε προσπάθεια αποτύπωσης των στάσεων και του τρόπου χρήσης των κοινωνικών δικτύων από δείγμα φοιτητών της Σχολής Επιστημών Αγωγής του Πανεπιστημίου Ιωαννίνων. Η αποτύπωση των απόψεων των φοιτητών έγινε με χρήση έντυπου ερωτηματολογίου με ρωτήσεις ανοικτού και κλειστού τύπου. Από τα αποτελέσματα προέκυψε ότι οι φοιτητές χρησιμοποιούν στην συντριπτική τoυς πλειοψηφία το Facebook. Οι περισσότεροι θεωρούν χρήσιμη την αξιοποίηση του στην εκπαίδευση τους. Ένα ποσοστό φοιτητών ενημερώνονται από αυτό για θέματα που αφορούν τις σπουδές τους και το χρησιμοποιούν για να διακινήσουν διδακτικό υλικό. Τέλος, έγινε συσχέτιση των αποτελεσμάτων με τα αποτελέσματα αντίστοιχων ερευνών.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Does the nature and amount of posterior information affect preschoolers’ inferences",
            "Publication year": 2009,
            "Publication url": "http://ife.ens-lyon.fr/publications/edition-electronique/cerme6/wg3-05-nikiforidou.pdf",
            "Abstract": "Children as young as 5 have been found to possess basic notions of probability, in contradiction to the piagetian perspective. In the current pilot study, preschoolers (N= 25) participated in a probability task of single events, with alterations in the given posterior information. Children took into account the new sets of information and responded differently in each condition, depending on the nature and the amount of information. Such findings stress the importance of designing probability tasks in accordance to the children’s cognitive capacities and probabilistic understanding.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical significance of the LMS regression",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475403001927",
            "Abstract": "We propose the use of simulation in order to obtain a statistical significance measure of the least median of squares (LMS) regression coefficients. We shuffle the values of the dependent variable many times (e.g. 100), so as to preserve their distribution, and we calculate the LMS regression coefficients for every shuffled data. In this way we form a confidence interval for the slope centered on 0, because the slopes of the shuffled data are considered statistically equal to 0. The coefficients of the original data are considered significant if they are not belong on the above mentioned interval.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:W7OEmFMy1HYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Ο Ηλεκτρονικός Υπολογιστής ως εκπαιδευτικό εργαλείο στις στρατηγικές μάθησης και μελέτης.",
            "Publication year": 2002,
            "Publication url": "http://ejournals.lib.auth.gr/1105-3968/article/view/4390",
            "Abstract": "Η πιο συνηθισμένη μορφή διδασκαλίας στη Δευτεροβάθμια Εκπαίδευση ήταν παραδοσιακά η διάλεξη. Η μέθοδος αυτή εφαρμόστηκε στο παρελθόν, για πολλούς λόγους μεταξύ των οποίων είναι και η κυριαρχία της αυθεντίας του διδάσκοντος, τα περιορισμένα διαθέσιμα διδακτικά μέσα και τον μεγάλο αριθμό των μαθητών. Αποτέλεσμα αυτού του τρόπου διδασκαλίας ήταν να παραμελείται ουσιαστικά η προσωπικότητα του μαθητή, η παροχή ευκαιρίας για δημιουργική εργασία και να µην υποβοηθείται η ανάπτυξη ομαδικού πνεύματος συνεργασίας μέσα στην τάξη. Ασφαλώς η κατάσταση άλλαξε αισθητά κατά τα νεότερα χρόνια, κυρίως κάτω από την επίδραση σύγχρονων παιδαγωγικών αντιλήψεων, αλλά και την εισαγωγή της εκπαιδευτικής τεχνολογίας. Σύμφωνα µε...",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Considerations for Online English Language Learning",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=7889550041553785512&hl=en&oi=scholarr",
            "Abstract": "This chapter examines the influence of Facebook (FB) in formal and informal learning in the language classroom. The theoretical framework of Web-based language teaching is first introduced. A selection of studies concerning the use of Social Networking Sites in the teaching of English (ELT) and conclusions drawn from the literature follow suit. The studies have been selected on the grounds of discussing students’ engagement, motivation, collaboration, and communication through the use of SNS and, for the most part, Facebook in ELT. The studies also focus on the attitudes of higher education, foreign language learners towards FB, as well as the potential of FB as an academic teaching medium that may support other Information and Communication Technology (ICT) tools like Learning Management Systems. The review of the studies indicates that Facebook may reinforce communication skills and engagement in the learning process and support participation and collaborative learning in formal learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-evaluation and nearest neighbour learning as tools for learning in an ICT educational system",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=6455315265710902335&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "To internet και οι υπηρεσίες του: Η διδακτική αξιοποίηση τους από εκπαιδευτικούς προσχολικής ηλικίας",
            "Publication year": 2004,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/jret/article/download/966/985",
            "Abstract": "Οι περισσότεροι εκπαιδευτικοί χρησιμοποιούν καθημερινά το Internet (διαδίκτυο) στην εκπαιδευτική διαδικασία. Εκείνο ωστόσο που κάνει το Internet δημοφιλές στους εκπαιδευτικούς και στην εκπαιδευτική διαδικασία είναι ο πλούτος των πληροφοριών που διαθέτει. Το Internet, όπως είναι γνωστό, αποτελεί ένα από τα νεώτερα, δυναμικότερα αλλά και πιο πολυδιά στατα αποκτήματα της εκπαιδευτικής εργαλειοθήκης. Κατά γενική ομολογία το διαδίκτυο δεν ανήκει σε κάποιο εκπαιδευτικό οργανισμό ή εκπαιδευτική επι χείρηση με σαφή δομή και λειτουργία, αλλά είναι μια άναρχη, ευμετάβλητη και κυρίως αλληλεπιδραστική συλλογή από υπηρεσίες και ηλεκτρονικές δια συνδέσεις, η οποία συνεχώς αναπτύσσεται, τροποποιείται και εξαπλώνεται με ραγδαίους ρυθμούς. Σ’αυτό άλλωστε οφείλεται και η δυσκολία με την οποία επιφορτίζεται κανείς να καθορίσει με συνέπεια και σαφήνεια του τι ακριβώς θα είναι μελλοντικά το Internet και πως θα εξελιχθεί (Clements (1994),(1999)).Επιπλέον δεν είναι δυνατό να προβλεφθούν και να καταγραφούν αναλυτικά όλοι οι διαφορετικοί τρόποι με τους οποίους μπορεί να χρησιμοποιηθεί, καθώς και οι επιπτώσεις που θα έχει στη ζωή μας. Αναμφίβολα, λοιπόν, κάθε από πειρα προσδιορισμού των ορίων της εκπαιδευτικής του αξίας αποτελεί περί πλοκο εγχείρημα (Aubrey (1994), Shayer et al (1981) and Shade et al (1990) Bosch & Cardinale (1993)).",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparative study of some distance education aspects in the EEC country, Greece and the candidate country for EEC Bulgaria",
            "Publication year": 2006,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17922",
            "Abstract": "Repository of UOI \"Olympias\": Comparative study of some distance education aspects in the \nEEC country, Greece and the candidate country for EEC Bulgaria Skip navigation Home \nBrowse Communities & Collections Browse Items by: Issue Date Author Title Subject Item \nType Advanced Search Help About DSpace Sign on to: My DSpace Receive email updates \nEdit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \n\"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε \nεπιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite or link \nto this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17922 Institution and School/Department \nof submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών και Τεχνολογιών. Τμήμα \nΒιολογικών Εφαρμογών και Τεχνολογιών URI: https://olympias.lib.uoi.gr/jspui/handle//17922 '…",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large level noise estimation",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=10716777096854771024&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building on Strategic eLearning Initiatives of Hybrid Graduate Education a Case Study Approach: MHEI-ME Erasmus+ Project. Sustainability 2021, 13, 7675",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/books/pdfdownload/book/4385#page=264",
            "Abstract": "Online courses are gaining popularity because they provide extensive and varied course material, information, knowledge, and skills, whilst also creating an effective educational online community. This research adopts a case study approach to focus on the teaching method and the manner in which a strategic commitment to eLearning provides scope for the development and implementation of top quality educational online fully accredited programs. Entrepreneurship focuses on developing businesses that add value and create wealth and prosperity in our societies.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:p__nRnzSRKYC",
            "Publisher": "s Note: MDPI stays neutral with regard to jurisdictional claims in published maps and institutional affil-iations."
        },
        {
            "Title": "Η εφαρμογή της αντίστροφης τάξης στην εκπαιδευτική διαδικασία: Τάσεις και προοπτικές",
            "Publication year": 2017,
            "Publication url": "https://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/1197",
            "Abstract": "Η “αντίστροφη τάξη” είναι ένα μοντέλο μάθησης που στηρίζεται στην αντιστροφή της εκπαιδευτικής διαδικασίας. Το εκπαιδευτικό αυτό μοντέλο, προσφέρει πολλά πλεονεκτήματα όπως η ενεργός συμμετοχή των μαθητών, παροχή κινήτρων και η αλληλεπίδραση των μελών της τάξης σε συνδυασμό με την ανάπτυξη της αυτόνομης μάθησης. Στα μειονεκτήματα του συγκαταλέγονται η έλλειψη πρόσβασης των μαθητών στο διαδίκτυο, η ανάγκη για άρτια τεχνολογική κατάρτιση των εκπαιδευτικών και η αρνητική στάση που πιθανώς να έχουν ακόμη ορισμένοι εκπαιδευτικοί και μαθητές απέναντι στις τεχνολογίες. Στην παρούσα εργασία, επιχειρείται να προσεγγιστεί το μοντέλο της αντίστροφης τάξης μέσω της μετα-ανάλυσης ερευνητικών άρθρων.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical literacy at university level: the current trends",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810023414",
            "Abstract": "Active and critical citizens, in contemporary information-driven societies, are considered to possess capacities and skills of statistical literacy. There are numerous definitions and descriptions concerning statistical literacy, statistical reasoning and statistical thinking. Thus, all these terms converge to the principle that statistical citizenship develops from school settings and relates mainly to the processes of evaluating, interpreting and communicating data. If these are not acquired on time, then students build up errors and misunderstandings. In the current paper general issues concerning Statistics Education at the University level are addressed and aspects for future research are stressed in terms of technology use, content and pedagogic approaches.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:UebtZRa9Y70C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Social learning theories as tools for learning in an ICT educational system",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/43929560/Social_Learning_Theories_as_tools_for_le20160320-26662-1mm9g2k.pdf",
            "Abstract": "The current study examines the effects of self-evaluation according to the nearest neighbour learning (NNL) method in the viewpoint of an undergraduate ICT subject in an Educational Department. The research questions addressed to students in order to evaluate whether they can identify their errors while working in small self-selected groups. This procedure indicates positive learning outcomes pointing that selfevaluation and NNL can contribute to an upward cycle of better learning with the potential of implementing them at all levels of the educational system.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Risk literacy in early childhood education under a lifelong perspective",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042812020794",
            "Abstract": "Risk entails every action, every level and every perspective of our lives. The ability to make advantageous decisions, to deal with uncertainties, to infer and estimate more or less probable outcomes, to manage risky or riskless situations compose the wider notion of risk literacy and may be inserted from formal preschool education. The current paper aims to enlighten the notion of risk literacy and safety education as a necessity in establishing pupils ready to accept failure, to achieve success, to take initiatives, to become self-competent, to develop probabilistic and statistical thinking, to confront uncertainty and in turn to face the challenges of modern risk society. It is argued that within the formal settings of preschool education, through developmentally appropriate activities, opportunities may be implemented in order to encourage children as future citizens to construct risk literate personalities. It is concluded that risk …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Introducing computers to kindergarten children based on Vygotsky’s theory about socio-cultural learning: The Greek perspective",
            "Publication year": 2001,
            "Publication url": "https://www.learntechlib.org/p/8489/",
            "Abstract": "This study examined the level of knowledge that Greek pre-school children had about computers. How Vygotsky's theo-ry about socio-cultural learning, as a teaching process, could be effectively applied when new knowledge was presented to a classroom environment was investigated. Participants were Greek preschool children and teachers. Data collection in-cluded classroom observations, informal interviews, ques-tionnaire administration, and field notes. Results revealed that following this approach, that teachers used to initiate children with computer technology was a thriving and effec-tive one. The particular study gave the authors the opportuni-ty to more closely search the ways in which children view new technologies, and the ways that teachers used it to devel-op their approach in introducing such new concepts.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "What ICT tools do undergraduate students use?",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359625/",
            "Abstract": "ICT tools are used nowadays in all educational settings. Students are familiar with most of these tools and they use them in their everyday activities. Implementing ICT tools in teaching and learning process, will be a great opportunity for both teachers and students. This paper focuses on which ICT tools students in School of Education mostly use. According to the results of this study teachers can start their courses using the students' most favorable ICT tools.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Η διδακτική της μουσικής με τη χρήση Νέων Τεχνολογιών σε μαθητές πρωτοβάθμιας και δευτεροβάθμιας εκπαίδευσης",
            "Publication year": 2011,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/jret/article/view/8702",
            "Abstract": "Η μελέτη αυτή παρουσιάζει τους τρόπους με τους οποίους οι Νέες Τεχνολογίες χρησιμοποιούνται δημιουργικά από τους μαθητές στη μουσική εκπαίδευση. Έτσι, με τη χρήση των Νέων Τεχνολογιών, οι μαθητές μπορούν να μάθουν πώς να παίζουν ένα μουσικό όργανο ή να ενισχύουν το μουσικό τους παιχνίδι στα πλαίσια μιας τάξης.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The main aspects of the application of educational technologies in the study process",
            "Publication year": 2015,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/jret/article/view/9081",
            "Abstract": "Rapidly changing economic, social and political conditions, the penetration of new technologies also requires a completely different type of the university lecturers who are innovation-friendly. They must have relevant knowledge and combine didactic technologies and information and communication technologies in order that they would be able to give students an opportunity to study in an innovative and effective way. Taking into consideration that the study process is always based on a certain technology and paying attention to the shift of education paradigms, it can be established that, in the modern study process, it is extremely important to realise precisely today's educational objectives and principles which assist in implementing up-to-date educational technologies. The study is aimed at establishing what most important factors of the application of educational technologies in the process of modern studies are. The study is based on a quantitative research methodology the choice of which was determined by the newness of the analyzed problem. The study shows that the objectives of a subject of studies are always discussed with students, the latter also have an opportunity to set their own individual study objectives, they are continuously kept informed why they study concrete knowledge and what it will be needed for in the future. The creation of an environment favourable to studies is also proved by the fact that the opportunity is given to students to combine the content of their studies of a subject with their own personal experience, interests. The study process is dominated by the study process of the active creation and construction of …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Considerations for online English language learning: the use of Facebook in formal and informal settings in higher education",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/chapter/considerations-for-online-english-language-learning/92248",
            "Abstract": "This chapter examines the influence of Facebook (FB) in formal and informal learning in the language classroom. The theoretical framework of Web-based language teaching is first introduced. A selection of studies concerning the use of Social Networking Sites in the teaching of English (ELT) and conclusions drawn from the literature follow suit. The studies have been selected on the grounds of discussing students’ engagement, motivation, collaboration, and communication through the use of SNS and, for the most part, Facebook in ELT. The studies also focus on the attitudes of higher education, foreign language learners towards FB, as well as the potential of FB as an academic teaching medium that may support other Information and Communication Technology (ICT) tools like Learning Management Systems. The review of the studies indicates that Facebook may reinforce communication skills and …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:r0BpntZqJG4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Post Doctoral Researcher and",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.594.928",
            "Abstract": "The contents of this report reflect the views of the author/principal investigator who is responsible for the facts and the accuracy of the data presented herein. The contents of do not necessarily reflect the views or policies of the Louisiana Department of Transportation and Development or the Louisiana Transportation Research Center. This report does not constitute a standard, specification, or regulation.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Is e-Learning offering a new learning model",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=9334843258753469244&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting the possibility of online courses for speech and language therapy and learning",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/476",
            "Abstract": "The use of Information Communication Technologies (ICTs) in education has changed the way we teach and learn at all educational levels. In particular ICTs find new approaches to enhance students’ learning in preschool education.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Are the Greek preschool teachers able to use distance learning technologies?",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1358256/",
            "Abstract": "This study shows the attitude of the Greek preschool teachers towards the new technologies and distance learning technologies, as they become more and more important to the kindergartens. It shows that the teachers of our sample were partly informed and partly familiar with the new technologies. In contrast, those who were involved in distance learning are not only very familiar, hut also they are willing to use the new technologies in their classrooms. Collaboration and communication through the Internet is also boosted by the teachers who are familiar with the new technologies. Our sample consisted of 100 subjects, all of them women between 26-50 years old, graduates of preschool education departments.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Δημιουργία αλληλεπιδραστικών μαθησιακών δραστηριοτήτων με τη χρήση των νέων Τεχνολογιών: Το ολοκληρωμένο εκπαιδευτικό πακέτο «Περιβάλλον-Η προστασία του δάσους»",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/41611604/-____20160126-14159-18imu2v.pdf",
            "Abstract": "ΠΕΡΙΛΗΨΗ: Βασικός στόχος του «ολοκληρωμένου εκπαιδευτικού πακέτου» είναι να ευαισθητοποιηθούν οι μαθητές/τριες για την ανάγκη προστασίας του δάσους όχι μέσα από ένα προκατασκευασμένο σύνολο κανόνων και απαγορεύσεων, αλλά αντίστροφα, οι όποιοι κανόνες και κώδικες συμπεριφοράς τους στο δάσος να προκύψουν ως φυσική συνέπεια των αλληλεπιδράσεων που συμβαίνουν σ’αυτό. Επιδιώκεται συστηματικά οι μαθητές/τριες να μελετούν το δάσος ως ένα σύστημα με τις σχέσεις και τις αλληλεπιδράσεις που επισυμβαίνουν συνεχώς ανάμεσα στους ενδογενείς παράγοντές που το συνδιαμορφώνουν. Επιπρόσθετα μελετούν και τις αλληλεπιδράσεις του δάσους με εξωγενείς παράγοντες και άλλα συστήματα (π. χ. πόλεις) ώστε να γενικευτεί και να κυριαρχήσει η έννοια της αλληλεπίδρασης. Κατ’αυτόν τον τρόπο προσδοκούμε ότι οι μαθητές/τριες να αντιμετωπίσουν τα προβλήματα που προκύπτουν από το σημερινό τρόπο διαχείρισης του δάσους ως αυθεντικά προβλήματα του περιβάλλοντος με το οποίο σχετίζονται και οι ίδιοι. Μια τέτοια μελέτη βοηθάει στην μακρά διαδικασία απόκτησης οικολογικών στάσεων των μελλοντικών πολιτών μιας και το δάσος αποτελεί ένα πλούσιο και αντιπροσωπευτικό δείγμα του περιβάλλοντος ως σύστημα. Ως καταλληλότερο λογισμικό για την προσέγγισή μας (μόνο στις τελευταίες τάξεις του Δημοτικού) αναδείχτηκε ο Δημιουργός Μοντέλων ΙΙ. Με αυτό το λογισμικό μπορούν οι εκπαιδευτικοί και οι μαθητές να δημιουργούν συνεργατικά και αλληλεπιδραστικά περιβάλλοντα μάθησης και, μέσω της μοντελοποίησης να μελετήσουν ποιοτικές και ημιποσοτικές σχέσεις και αλληλεπιδράσεις, τις οποίες με το συμβατικό τρόπο …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Οι προτιμήσεις των φοιτητών σε καινοτόμες μορφές μάθησης στην εξ αποστάσεως εκπαίδευση (Students’ preferences on types of MOOCs)",
            "Publication year": 2020,
            "Publication url": "https://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/2368",
            "Abstract": "Η εκπαίδευση από απόσταση μπορεί να εφαρμοστεί στην τυπική μη τυπική και άτυπη εκπαίδευση. Καθώς τα τεχνολογικά μέσα εξελίσσονται, η εξ αποστάσεως εκπαίδευση με την μορφή των MOOCs αλλάζει τύπους εξελίσσεται ραγδαία στην προσπάθεια της δε να συνεισφέρει στην εκπαιδευτική διαδικασία διευρύνεται με την μορφή των μικρών ιδιωτικών μαθημάτων, μικρών μαθημάτων, συγχρονισμένων μαθημάτων, μικρών ανοικτών μαθημάτων, τα οποία έχουν την δυνατότητα να συνδυάζουν και εν τέλει να συνδέουν τις τρεις παραπάνω αναφερθείσες μορφές μάθησης.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Early childhood teachers’ perceived barriers to ICT integration in teaching: a survey study in Mainland China",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s40692-014-0025-7",
            "Abstract": "This paper looked at the barriers to ICT integration in teaching practices from the perspective of Chinese early childhood teachers in Mainland China. A total of 46 Chinese early childhood teachers in Mainland China participated in this study. They were from three early childhood settings located in three different cities in terms of the administrative division. A self-designed questionnaire was adopted as the research instrument. It was found that a range of first-order barriers, which included lack of hardware (laptops, notebooks, and computers), lack of teaching content and material, as well as lack of pedagogical models were perceived as main barriers by the teachers. However, several second-order barriers, such as lack of teachers’ interest, and lack of teachers’ support were perceived as the least main barriers. Furthermore, the variable “ICT use in daily life” was found play an important role in determining …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Is e-learning based on learning theories? A literature review",
            "Publication year": 2011,
            "Publication url": "http://publications.waset.org/12654/is-e-learning-based-on-learning-theories-a-literature-review",
            "Abstract": "E-learning aims to build knowledge and skills in order to enhance the quality of learning. Research has shown that the majority of the e-learning solutions lack in pedagogical background and present some serious deficiencies regarding teaching strategies and content delivery, time and pace management, interface design and preservation of learners-focus. The aim of this review is to approach the design of e-learning solutions with a pedagogical perspective and to present some good practices of e-learning design grounded on the core principles of Learning Theories (LTs).",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:epqYDVWIO7EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Repel the swarm to the optimum!",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0096300305003425",
            "Abstract": "We improve the particle swarm optimization (PSO) by introducing the concept of the repellor. So far, the PSO algorithm is guided by the optimum of each particle and the optimum found by all the particles. We now add to the algorithm the location of the worst point found so far and location the worst point found by all the particles. These worst points have the property of repelling the particles to the local and the global optima, respectively. This way the PSO algorithm is improved in the sense that the swarm is able to locate the global optimum more rapidly. Empirical results are presented on archaeological data.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Διαθεματική προσέγγιση και διδασκαλία η μέθοδος Project",
            "Publication year": 2004,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17831",
            "Abstract": "Repository of UOI \"Olympias\": Διαθεματική προσέγγιση και διδασκαλία η μέθοδος Project \nSkip navigation Home Browse Communities & Collections Browse Items by: Issue Date \nAuthor Title Subject Item Type Advanced Search Help About DSpace Sign on to: My \nDSpace Receive email updates Edit Profile Saved Searches Favorites Repository of UOI \"Olympias\" \n1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό \nΤμήμα Νηπιαγωγών 5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please \nuse this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17831 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών \nΑγωγής. Παιδαγωγικό Τμήμα Νηπιαγωγών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17831 \nAppears in Collections: Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Show full : . …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Διαθεματικές Προεκτάσεις στη διδασκαλία της Αγγλικής Γλώσσας: Πρακτικές εφαρμογές με τη χρήση της μεθόδου Project και των Νέων Τεχνολογιών",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=9021642797159957122&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Archives museums and libraries dynamic systems for co-operation in distance education through collection and dissemination of qualitative information",
            "Publication year": 2003,
            "Publication url": "http://62.217.125.140/jspui/bitstream/123456789/17930/1/pagge-archives%20museums%20and%20libraries.pdf",
            "Abstract": "The tem education is possible to be regarded as the total of instructive frameworks and actions from family, state, individuals or social oganisations aiming at the hamonious physique of the body and the growth of intellectual dexterities, the moral education and professional preparation of the members of the society, The tem at the same time denotes the institution that aims in the knowledge according the systematic teaching of all educational level students, the intellectual growth, bodily and moralfaculties and dexterities with regard to positively defined subjects through special institutions (schools) and established and accepted methods. It is the frame of theoretical approach of relation of instructive subjects with their equivalent scientific fields [1].-The knowledge is mainly recorded in paper (in manuscript, books, scientific magazines, newspapers) but there are also new magnetic and opțical records. Its …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Considerations for Online English Learning",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=8770964001033866514&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building on Strategic eLearning Initiatives of Hybrid Graduate Education a Case Study Approach: MHEI-ME Erasmus+ Project",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2071-1050/13/14/7675",
            "Abstract": "Online courses are gaining popularity because they provide extensive and varied course material, information, knowledge, and skills, whilst also creating an effective educational online community. This research adopts a case study approach to focus on the teaching method and the manner in which a strategic commitment to eLearning provides scope for the development and implementation of top quality educational online fully accredited programs. Entrepreneurship focuses on developing businesses that add value and create wealth and prosperity in our societies. Therefore, entrepreneurship is a key area of learning for graduate students seeking to set up and operate their own SME organizations. It can serve as a benchmark for the teaching of other graduate subjects that require a sound correlation for the correlation of concepts and theories to the challenging complexities of the real world. The program was developed on the basis of the implementation of a state-of-the-art eLearning platform that allowed for a combination of varied self-learning and collaborative learning elements and activities within a single platform. This enabled students to access the online content material efficiently and effectively. It allows for the development of a program based on the flipped classroom teaching methodology. The underlying concept of the flipped classroom methodology is that effective eLearning should comprise both synchronous and asynchronous learning activities. This combination of self-learning and collaborative learning calls for careful planning by the tutor to ensure that the learning objectives are clearly defined for each activity and that the …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "The use of ICT in preschool music education",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810005045",
            "Abstract": "This study has been carried out in order to evaluate the music perception and creativity of preschoolers by using two different means of ICTs. Children were tested on computer based music activities with a most efficient method for a common educational goal. An interactive music environment was used for children aged four to six years old (N = 28) in order to stimulate their inherent musical skills through interaction with the computer and other additional audiovisual mediums. Specifically, there were two cases:Case I: Use of computer mouse by the preschoolers.Case II: Use of automatic movement recognition technology.The second case appeared to be more effective in preschoolers as they provided better results in concentration and interest. Such results have further implications concerning the use of alternative technological equipment in preschool music education.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Οι ΤΠΕ μπορούν να αναβαθμίσουν τις Δημόσιες Σχέσεις των ΑΕΙ",
            "Publication year": 2017,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/jret/article/view/10477",
            "Abstract": "Το πανεπιστήμιο έχει τρεις βασικούς άξονες προτεραιότητας, την έρευνα, τη διδασκαλία και την κοινωνική προσφορά. Η εικόνα που εκπέμπει το πανεπιστήμιο στην κοινωνία, και ειδικότερα στην τοπική, είναι πολύ σημαντική για την υγιή ανάπτυξη και λειτουργία του. Η διαμόρφωση της εικόνας αυτής, βασίζεται στην ανάδειξη σημαντικών συγκριτικών πλεονεκτημάτων και ποιοτικών χαρακτηριστικών, και είναι έργο που επιτελείται από την υπηρεσία των “Δημοσίων Σχέσεων”.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Διεθνές Συνέδριο για την Ανοικτή & εξ Αποστάσεως Εκπαίδευση",
            "Publication year": 2009,
            "Publication url": "https://pdfs.semanticscholar.org/2c3f/e498f42a7ed20e67974680505d3e585caf19.pdf",
            "Abstract": "The use of Information Communication Technologies (ICTs) in education has changed the way we teach and learn at all educational levels. In particular ICTs find new approaches to enhance students’ learning in preschool education. The realization of the educational features of the web and online distance learning in preschool education is the main issue of this study. The aim is to investigate the possibility of creating computerized application software to be used for online distance education activities for Language Learning Goals and/or for speech and language therapy. The application may be used in formal and informal terms by preschool children.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Η Στατιστική στο Δημοτικό Σχολείο",
            "Publication year": 2002,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17790",
            "Abstract": "Repository of UOI \"Olympias\": Η Στατιστική στο Δημοτικό Σχολείο Skip navigation Home \nBrowse Communities & Collections Browse Items by: Issue Date Author Title Subject Item \nType Advanced Search Help About DSpace Sign on to: My DSpace Receive email updates \nEdit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \n\"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε \nεπιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite or link \nto this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17790 Institution and School/Department \nof submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών Αγωγής. Παιδαγωγικό Τμήμα \nΝηπιαγωγών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17790 Appears in \nCollections: Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Show full item record Files in This : …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of the media in the enhancement of environmental awareness",
            "Publication year": 2013,
            "Publication url": "http://cbc-biotourism.biopolitics.gr/echo/files/25040.pdf#page=66",
            "Abstract": "During the last decades, global warming, climate change, hurricanes, tornados, melting of icebergs, aridity, floods, greenhouse effect, acid rain, extinction of flora varieties and fauna species, constitute recurrent terms in our vocabulary. Air, water, soil and food quality is deteriorating day by day, especially in the developing countries ie China, Malaysia and India,(Aminrad, Zakariya, Hadi & Sakari, 2013; Sharma, 2012).Scientists from all over the world point out that such environmental issues have also serious consequences on human health (Brunekreef & Holgate, 2002; Hill, 2012; Jarup & Åkesson, 2009; Kunzli et al., 2000; Moeller, 1997; Pope et al., 1995; Satarug, Garrett, Sens & Sens, 2010). It is widely recognized that chemical, physical and biological hazards in the environment may lead to serious health problems. Environmental pollution has primary confluence in the rise of many types of cancer and respiratory, cardiovascular and reproductive problems, leading to morbidity or even mortality.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Criteria for the evaluation of websites for the teaching of English as a second language. Web supported English learning in Greece",
            "Publication year": 2012,
            "Publication url": "https://conference.pixel-online.net/conferences/ICT4LL2012/common/download/Paper_pdf/454-IBT98-FP-Dogoriti-ICT2012.pdf",
            "Abstract": "The use of the internet in education is an indispensable tool. It is easily accessible and modified according to the needs of the students. This paper deals with the use of web-enhanced teaching of the English language in Greece. More specifically, the influence of the internet on information issues, the didactics and pedagogic material with regard to the foreign language is examined. Since there is not a great number of language learning Web sites designed for the particular needs of Greek students learning the English language, it is difficult for both teachers and students to choose websites that match their needs and interests. The situation raises a need for a Web evaluation system which can help them find and assess Web resources effectively. The present study is concerned with assessment and evaluation of ESL websites as resources for students. For this purpose, the students work individually to review and evaluate ESL websites. The primary target of the evaluation is to provide information about how the ESL websites will help improve a learner’s proficiency in the target language. The students are prompted to consider what the sites may offer by means of pedagogic possibilities, teaching methods and learning potential as well as technical issues. In their evaluations, the students are encouraged to recognize both technical considerations and concentrate on what the sites offer in terms of pedagogic possibilities, classroom methods as well as learning prospects.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Is e-learning offering a new learning model The case study of a greek university",
            "Publication year": 2015,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17892",
            "Abstract": "Repository of UOI \"Olympias\": Is e-learning offering a new learning model The case study of \na greek university Skip navigation Home Browse Communities & Collections Browse Items \nby: Issue Date Author Title Subject Item Type Advanced Search Help About DSpace Sign \non to: My DSpace Receive email updates Edit Profile Saved Searches Favorites Repository \nof UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών \nΑγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5..Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) \nΕλληνικά English Please use this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17892 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών \nκαι Τεχνολογιών. Τμήμα Βιολογικών Εφαρμογών και Τεχνολογιών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17892 \nAppears in Collections: 1.Άρθρα σε …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SELF REGULATED LEARNING STRATEGIES IN GROUPS OF LEARNERS.",
            "Publication year": 2014,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=13923137&AN=96373053&h=xmzKFVjCKZnhUkvpHJOmL6DqnuWy%2B9sfnK8DnQimV9U%2FqtavsSQ4L4oftgB193SFfYZmYdWYFs%2FPZrtgIavoKQ%3D%3D&crl=c",
            "Abstract": "The technological revolution gives the opportunity to upgrade the quality in education, through new ways of learning. Self-regulated learning is an active and constructive process where self regulated learning proposes learning strategies in monitoring regulations. The aim of this study was to investigate the process and the benefits of the application of self-regulated leaming to groups of leamers. Findings of this study, demonstrated that self regulated learning in groups of students effectively regulated the leaming process of all participants in the study.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Informatics for Preschool Teachers",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=10747180859308705569&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of social networking and learning management systems in English language teaching in higher education",
            "Publication year": 2014,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/CWIS-11-2013-0062/full/html",
            "Abstract": " – The use of web-enhanced teaching of the English as a foreign language in higher education in Greece is addressed in this case study which examines the student's perceptions of online instruction using Moodle as a learning management system (LMS), with and without the use of Facebook (FB) as an adjunctive learning platform. The merging of this collaborative and interactive social platform with a LMS is explored, examining the attitudes of higher education foreign language learners toward Moodle as a LMS, and FB as an adjunctive informal learning environment. The paper aims to discuss these issues.  – Results are drawn from a pre-FB questionnaire after a term using Moodle only, and a post-FB questionnaire following a term using Moodle and FB.  – Results suggest that the use of …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:isC4tDSrTZIC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Η διδακτική της μουσικής με τη χρήση νέων τεχνολογιών σε μαθητές πρωτοβάθμιας και δευτεροβάθμιας εκπαίδευσης",
            "Publication year": 2011,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/bitstream/123456789/5843/1/%CE%97%20%CE%B4%CE%B9%CE%B4%CE%B1%CE%BA%CF%84%CE%B9%CE%BA%CE%AE%20%CF%84%CE%B7%CF%82%20%CE%BC%CE%BF%CF%85%CF%83%CE%B9%CE%BA%CE%AE%CF%82%20%CE%BC%CE%B5%20%CF%84%CE%B7%20%20%CF%87%CF%81%CE%B7%CF%83%CE%B7%20%CE%BD%CE%B5%CF%89%CE%BD%20%CF%84%CE%B5%CF%87%CE%BD%CE%BF%CE%BB%CE%BF%CE%B3%CE%B9%CF%89%CE%BD.pdf",
            "Abstract": "This study shows how ICTs are used in music education in order to promote creativity in music. By using ICTs, students can learn how to play a musical instrument or they enhance music play within a classroom setting. Moreover, ICT in music education can be used efficiently in the school setting.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Risk-taking in preschoolers",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11662961963325403533&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparative study of distance education in Greece and Bulgaria",
            "Publication year": 2007,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.7227/JACE.13.2.7",
            "Abstract": "Distance education, unlike traditional education, makes it possible for students to receive instruction independent of place and time. Course materials can be sent via post or e-mail, and students can be located anywhere and rarely, if ever, need to meet their instructors and/or fellow students face to face. This article is an attempt to explore and compare some aspects of distance education in Greece and Bulgaria.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:M3ejUd6NZC8C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "A model for the evaluation of ESL web links for Greek students",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810009948",
            "Abstract": "The use of the internet in education has been proven effective. This paper deals with the use of the internet in the teaching of English language in Greece. In the field of foreign languages, the Web seems to be the ultimate tool, as its multimedia and hypertext nature has a lot of potential by integrating text, sound and video, easily accessible and modified. More specifically, the influence of the internet on information issues, the didactics and pedagogic material with regard to the foreign language is examined. Since there is not a great number of language learning Web sites designed for the particular needs of Greek students learning the English language and the amount on the Web is enormous, it is difficult for both teachers and students to choose websites that match their needs and interests. The situation raises a need for a Web evaluation system which can help them find and assess Web resources effectively.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Ο ρόλος του δασκάλου στα MOOCs",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/561",
            "Abstract": "Από την παραδοσιακή δια ζώσης εκπαίδευση μέχρι την ανοικτή διαδικτυακή διδασκαλία, ο καθηγητής καλείται να διαδραματίσει ένα ρόλο τόσο σημαντικό όσο και η διαδικασία της μάθησης. Τα εκπαιδευτικά μοντέλα κατά καιρούς έχουν δώσει διαφορετικά χαρακτηριστικά στον διδάσκοντα συγκλίνουν όμως όλα σε μια γενικά κοινή παραδοχή για τις ικανότητες που απαιτούνται ώστε να μπορεί να φέρει σε πέρας επιτυχώς το εκπαιδευτικό του έργο. Τα MOOCs (massive open online courses) χρησιμοποιώντας ως εκπαιδευτικό μοντέλο τις αρχές του κονεκτιβισμού, παίζουν σημαντικό ρόλο στην εξ αποστάσεως εκπαίδευση. Σε πολλές περιπτώσεις η υποβάθμιση του ρόλου του εκπαιδευτικού είναι προφανής επειδή η μαθησιακή διαδικασία συντελείται αυτόνομα και μοιάζει να εξελίσσεται ανεξέλεγκτα από τον διδάσκοντα. Σε ένα τέτοιο ανοικτό μάθημα όπου οι εμπλεκόμενοι είναι πολλοί, επικρατεί ένας προβληματισμός για το ποιος είναι ή και ποιος θα έπρεπε να είναι ο βαθμός εμπλοκής του καθηγητή με τους μαθητές του. Εμφανίζονται βεβαίως και οι βοηθοί (TAs) οι οποίοι είναι ιδιαίτερα σημαντικοί για την διεξαγωγή του μαθήματος. Στόχος της συγκεκριμένης επισκόπησης, είναι να εξετάσει το ρόλο του δασκάλου ως εμπνευστή και διεκπεραιωτή της διαδικασίας της μάθησης, την λειτουργία των MOOCs, καθώς επίσης και τις δυνατότητες αξιοποίησης τους στην τριτοβάθμια εκπαίδευση.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How often do pre-school teachers in Greece use NT and ICT in their classrooms? A study of continuing education needs",
            "Publication year": 2004,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.7227/JACE.10.1.6",
            "Abstract": "During the last five years one of the main goals of Educational Departments in Greece has been to prepare teachers who, amongst other tasks, must be able to apply New Technologies to their everyday teaching and use Information and Communication Technologies to retrieve information about many classroom activities. This study refers to the courses taught on New Technologies and Information and Communication Technologies, at a postgraduate level, in a continuing education programme, at the Department of Pre-school Education at the University of Ioannina, Greece. It also discusses the use of New Technologies by in-service pre-school teachers as well as their expectations of the application of New Technologies to kindergartens. Their suggestions for better training in the use of New Technologies during their undergraduate studies, and the problems of applying them in the classroom, are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:LkGwnXOMwfcC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Is e-learning based on learning theories",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/31873321/v56-13.pdf",
            "Abstract": "E-learning aims to build knowledge and skills in order to enhance the quality of learning. Research has shown that the majority of the e-learning solutions lack in pedagogical background and present some serious deficiencies regarding teaching strategies and content delivery, time and pace management, interface design and preservation of learners’ focus. The aim of this review is to approach the design of e-learning solutions with a pedagogical perspective and to present some good practices of e-learning design grounded on the core principles of Learning Theories (LTs).",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New trends of information and communication technologies in education",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359626/",
            "Abstract": "Information and Communication Technologies (ICT) is a force that has changed many aspects of the way we learn and live. In many countries ICT have a clear impact on the transformation of education. The way these operate today is vastly different from the ways they operated in the past. Students and teachers may gain a lot in the teaching-learning process if they have a clear understanding of the evolution of ICT in the classroom. This poster is a preliminary literature review on the ICT evolution in the teaching process, the last decade.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "THE USE OF ICTS FOR TEACHING ENVIRONMENTAL COURSES IN GREECE AND RUSSIA",
            "Publication year": 2020,
            "Publication url": "https://cyberleninka.ru/article/n/the-use-of-icts-for-teaching-environmental-courses-in-greece-and-russia",
            "Abstract": "This study focuses on a literature review on Information and Computer Technology (ICT) tools used for teaching for environmental studies in primary schools in European countries. The paper includes the analysis of the key experience of implementing ICT tools in environmental studies and the advantages and disadvantages of using ICTs in environmental studies. According to our findings, ICT tools are used for Environmental Education on primary school students in Greece and Russia. The advantage of using ICT tools is that it allows to present text, sound, graphic and video information in a new way; activates the creative learning of students; and promotes the development of environmentally responsible behavior. As a disadvantage of the use of ICT tools in Environmental Education, one can designate the lack of lively dialogic communication between participants in the educational process. In conclusion, it should be noted that in Greece and Russia, teachers often use similar ICTs to teach environmental issues.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:URolC5Kub84C",
            "Publisher": "Global Science Center LP"
        },
        {
            "Title": "Τυπική, Μη τυπική και άτυπη εκπαίδευση στην Ελλάδα",
            "Publication year": 2005,
            "Publication url": "http://equipe.up.pt/RESOURCES/Casestudies/original_languages/Ioannina_GR.doc",
            "Abstract": "Η έννοια της μάθησης σύμφωνα με τον Bigge (1990), έχει άμεση σχέση με τη μόνιμη αλλαγή στη συμπεριφορά του ατόμου, η οποία είναι αποτέλεσμα εμπειρίας και πράξης. Η μάθηση έχει προσωπικό και ατομικό χαρακτήρα. Κάθε άτομο μαθαίνει με το δικό του μοναδικό τρόπο. Οι αλλαγές του ατόμου μέσω της μάθησης συντελούνται στο πεδίο των γνώσεών του, των δεξιοτήτων και των στάσεών του. Βεβαίως, η μάθηση δεν ολοκληρώνεται μόνο μέσα από ένα συγκεκριμένο εκπαιδευτικό σύστημα, αλλά είναι μια συνεχής διεργασία που συντελείται δια βίου και χρησιμοποιεί διάφορους τρόπους και μέσα. Για το λόγο αυτό αναφερόμαστε στη δια-βίου μάθηση, που γίνεται είτε πρόσωπο με πρόσωπο είτε εξ΄ αποστάσεως. Στόχος της δια-βίου μάθησης είναι είτε η αναπαραγωγή γνώσης σε άτομα που ασχολούνται με αυτή, είτε η καλλιέργεια δεξιοτήτων για άτομα που αλλάζουν επάγγελμα είτε η καινούργια εκπαίδευση σε άτομα που ασχολούνται με τεχνολογία και τομείς που εξελίσσονται. Βεβαίως στις μέρες μας τείνει να εφαρμοστεί στη δια-βίου εκπαίδευση και η εξ’αποστάσεως εκπαίδευση, με τη χρήση του e-learning, που αν και προσφέρει γνώσεις, απαιτεί συγκεκριμένες δεξιότητες.Επιπροσθέτως, αυξημένο ενδιαφέρον παρατηρείται στις μέρες μας από ένα μεγάλο αριθμό ερευνητών για την μελέτη και έρευνα της τυπικής μάθησης (formal learning), άτυπης μάθησης (Informal Learning) και μη τυπικής μάθησης (non formal Learning). Σύμφωνα με τον Jarvis (1987),«Η τυπική–επίσημη εκπαίδευση (formal education) έχει γραφειοκρατικό χαρακτήρα, η Mη τυπική εκπαίδευση (non formal education) είναι οργανωμένη και συγκροτημένη διαδικασία η οποία εξελίσσεται σε ένα …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Comparative Study of Two Learning Methods: Collaborative Learning Versus Nearest Neighbor Learning",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/31913778/Toki_Pange_Collaborative_versus_Nearest_Neighbor.pdf",
            "Abstract": "We live in a decade of uprising of technology and communications, where the understanding of the process of learning is a key issue for any instructor, who tries to work out the most appropriate methods in order to use them throughout his/her teaching. In this educational structure, we study closely two learning methods: collaborative learning and nearest neighbor learning. We compare these two learning methods, discuss the advantages and disadvantages of each one and present the results of the study.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Can we teach probabilities to young children using educational material from the Internet",
            "Publication year": 2002,
            "Publication url": "http://www.stat.auckland.ac.nz/~iase/publications/1/10_81_pa.pdf",
            "Abstract": "MATERIALS AND METHODS Before teaching probability to children a pre-test was applied. We asked 35 children aged 4-5 years to tell us their ideas and their understanding about probabilities. We wrote down their answers and we used them as a starting point to our teaching process. After that test, we used the constructivist theory to teach them probabilities, where children played games with probabilities in the classroom, exchanged ideas, worked together on common tasks, and later we played Internet games with probabilities and we asked them to find examples where we use the words “probably”,“probabilities”,“fair game”,“chance”.RESULTS AND ANALYSIS Trying to introduce probabilities to preschoolers we applied constructivism theory. Firstly we tossed 1 coin and we asked the children “has anyone done this game before?”. All children answered “no”. Then we asked them to think about the outcome and then they had to discuss it with their “partner”. At the beginning, the answers of the children correlated to the side of the coin they wanted to come out. Later, they asked:“which side was before?”. When the teacher said to them “head” for example, some of the children said “now will come out tail because this side did not appear last time” and others said “head again because this also happened before”. To promote further concept development, we asked them to toss 2 coins and to think, which is more likely to happen: Both Heads, Both Tails, or 1 of each. Of course the children",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ethical issues concerning self regulated learning and nearest neighbor learning",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7011162/",
            "Abstract": "Learning requires appropriate management of time and resources. Consequently, self-regulated learning (SRL) becomes predominant and apparent. Another type of learning is the nearest neighbour learning (NNL) which is a form of collaborative learning method where ICT is present. Although the ICT usage both in SRL and NNL helps improving collaboration and access to vast amounts of information, it is essential that researchers, learners, and educators, should, critically consider the ethical issues that accompany it. In both methods the phenomenon of plagiarism may be present, so students have to be leaded to have an approach to critical evaluation, plagiarism and information ownership (CLEX, 2009). Ethical safeguards should be incorporated in the assessment of self regulated learning and nearest neighbor learning work, since this work is carried out through collaboration among team members. Also …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "How does noise pollution exposure affect vocal behavior? A systematic review",
            "Publication year": 2021,
            "Publication url": "http://www.aimspress.com/article/doi/10.3934/medsci.2021012?viewType=HTML",
            "Abstract": "Various types of pollution, like atmospheric, water, soil, noise, have been reported as voice risk factors and exposure can result in vocal problems. Particularly, environmental noise causes the Lombard effect, forcing individuals to raise their voice volume. Exposure to noisy environments could provoke vocal folds lesions such as nodules, oedema, cysts, polyps as well as according to WHO (2018) annoyance, sleep disturbance, cognitive impairment in children, and adverse impacts on the cardiovascular and the metabolic system.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SUSTAINABILITY AND ENVIRONMENTAL GAMES",
            "Publication year": 2017,
            "Publication url": "https://elibrary.ru/item.asp?id=35528486",
            "Abstract": "Applying serious games in the teaching process of environmental sustainability, is an up-to-date method. The serious games used for teaching, in order to become sustainable learning tools, have to meet some criteria like Avedon and Sutton-Smith's (1971) and Kirkpatrick's (1994). It was found that serious games are innovative tools for raising environmental sustainability, as they engage students to exchange ideas and help them to actively cooperate in order to experience real life situations. Serious games are innovative tools for raising environmental awareness and consciousness, because they offer fun, engage students in exchanging ideas about sustainability, facilitate active cooperation between students, show real life situations and materialize their dreams for building a sustainable environment.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The necessity of ICT literacy in Undergraduate Educational Departments students, Research",
            "Publication year": 2009,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17932",
            "Abstract": "Repository of UOI \"Olympias\": The necessity of ICT literacy in Undergraduate Educational \nDepartments students, Research Skip navigation Home Browse Communities & Collections \nBrowse Items by: Issue Date Author Title Subject Item Type Advanced Search Help About \nDSpace Sign on to: My DSpace Receive email updates Edit Profile Saved Searches \nFavorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή \nΕπιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε επιστημονικά περιοδικά \n( Ανοικτά) Ελληνικά English Please use this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17932 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών \nκαι Τεχνολογιών. Τμήμα Βιολογικών Εφαρμογών και Τεχνολογιών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17932 \nAppears in Collections'…",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "“Shoes and Squares”: A computer-based probabilistic game for preschoolers",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810005203",
            "Abstract": "Children as early as 5 years old have been found to be able to manipulate basic concepts of probabilities. In the current study, 50 preschoolers participated in a between-subject developmentally appropriate computer task, named “Shoes and Squares” and were tested on whether they can estimate the most probable outcome in conditions of unequal likelihood of events. Participants were asked to make predictions and guess the most likely option in a random game composed by electronic items that represented cards with shoes and/or squares. Preschoolers were personally engaged, they made estimations and seemed to get affected by the structural changes among the sample space. Such findings raise educational implications concerning not only the teaching and constructing of probabilities in preschool education but also the role and use of technological means in the classroom.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Εκπαιδευτικά παιχνίδια με τεχνολογίες πληροφορικής και επικοινωνιών για την ανάπτυξη της περιβαλλοντικής συνείδησης παιδιών",
            "Publication year": 2013,
            "Publication url": "http://62.217.125.140/jspui/bitstream/123456789/5813/1/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%B9%CE%BA%CE%AC%20%CF%80%CE%B1%CE%B9%CF%87%CE%BD%CE%AF%CE%B4%CE%B9%CE%B1%20%CE%BC%CE%B5%20%CF%84%CE%B5%CF%87%CE%BD%CE%BF%CE%BB%CE%BF%CE%B3%CE%AF%CE%B5%CF%82%20%CF%80%CE%BB%CE%B7%CF%81%CE%BF%CF%86%CE%BF%CF%81%CE%B9%CE%BA%CE%AE%CF%82%20%CE%BA%CE%B1%CE%B9%20%CE%B5%CF%80%CE%B9%CE%BA%CE%BF%CE%B9%CE%BD%CF%89%CE%BD%CE%B9%CF%8E%CE%BD%20%CE%B3%CE%B9%CE%B1%20%CF%84%CE%B7%CE%BD%20%CE%B1%CE%BD%CE%AC%CF%80%CF%84%CF%85%CE%BE%CE%B7%20%CF%84%CE%B7%CF%82%20%CF%80%CE%B5%CF%81%CE%B9%CE%B2%CE%B1%CE%BB%CE%BB%CE%BF%CE%BD%CF%84%CE%B9%CE%BA%CE%AE%CF%82%20%CF%83%CF%85%CE%BD%CE%B5%CE%AF%CE%B4%CE%B7%CF%83%CE%B7%CF%82%20%CF%80%CE%B1%CE%B9%CE%B4%CE%B9%CF%8E%CE%BD.pdf",
            "Abstract": "The environmental awareness of students is a critical factor in the educational process. The proper use of ICT can help to conserve natural resources and therefore considered green technologies. The widespread use of ICT in education enables integration of educational games for developing environmental awareness among children. The aim of this paper is to present a selection of educational games that teachers and students can find on the Internet for their awareness and activation on environmental issues.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ο Ηλεκτρονικός υπολογιστής ως εκπαιδευτικό εργαλείο στις στρατηγικές μάθησης και μελέτης",
            "Publication year": 2002,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17777",
            "Abstract": "Repository of UOI \"Olympias\": Ο Ηλεκτρονικός υπολογιστής ως εκπαιδευτικό εργαλείο στις \nστρατηγικές μάθησης και μελέτης Skip navigation Home Browse Communities & Collections \nBrowse Items by: Issue Date Author Title Subject Item Type Advanced Search Help About \nDSpace Sign on to: My DSpace Receive email updates Edit Profile Saved Searches \nFavorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή \nΕπιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5..Άρθρα σε επιστημονικά περιοδικά \n( Ανοικτά) Ελληνικά English Please use this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17777 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών \nΑγωγής. Παιδαγωγικό Τμήμα Νηπιαγωγών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17777 \nAppears in Collections: 1.Άρθρα σε ( Ανοικτά…",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The urge for GREEN IT courses at universities and technical institutes",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359627/",
            "Abstract": "Humans are responsible for the dramatic climate change, the energy crisis, the misuse of useful materials and the pollution of the planet with hazardous materials. The need to consider the well-being of the environment and protect the health, balance, and diversity of human and natural resources is already an essential part of many (under)-graduate courses in various Academic and Technical institutions. However, the contribution of IT to all these problems is not clear to many students and a solid understanding will help the academic community to design and introduce relevant courses both at an undergraduate and a graduate level. A short definition of the problem and some hints for better understanding in tandem with good practices related to online lessons are presented in the current work.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ο σημασιολογικός Ιστός και η Συμβολή του στην Ηλεκτρονική Μάθηση",
            "Publication year": 2012,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/jret/article/view/8680",
            "Abstract": "Ο σημασιολογικός ιστός αποτελεί την επέκταση του σημερινού παγκόσμιου ιστού με τεχνολογίες oι οποίες εμπλουτίζουν τις πληροφορίες, που αναρτώνται στο διαδίκτυο με συμβατική σημασιολογία. Η βασική του αρχή είναι ότι, σε ένα κοινό και διαλειτουργικό πλαίσιο αναπαράστασης των δεδομένων, τα οποία ορίζονται με τρόπο κατανοητό, τόσο από τους ανθρώπους όσο και από τους ηλεκτρονικούς υπολογιστές, η πληροφορία που παρουσιάζεται στο χρήστη αποκτά δομή και νόημα. Η παρούσα εργασία στοχεύει, τόσο στην παρουσίαση και στην ανάδειξη της χρησιμότητας του σημασιολογικού ιστού στο πλαίσιο της ηλεκτρονικής μάθησης μέσω της επισκόπησης της σύγχρονης βιβλιογραφίας, όσο και στην προβολή των απόψεων των φοιτητών του Παιδαγωγικού Τμήματος Νηπιαγωγών του Πανεπιστημίου Ιωαννίνων σχετικά με το σημασιολογικό ιστό.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Instructional design for a\" social\" classroom: Edmodo and Twitter in the foreign language classroom",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=16592636356725855370&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of ICT in preschool education in Greece and China: A comparative study",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042814012981",
            "Abstract": "The use of Information and Communication Technology (ICT) in preschool education is an important research issue, and accordingly a wide range of research results have been published. This paper analyzes and compares the research findings on ICT use in preschool education in the past decade in Greece and China. The main analysis framework of this paper focuses on three aspects: (i) access to and use of ICT in preschool; (ii) ICT and preschoolers; (iii) ICT and preschool teachers. Finally similarities and differences of the ICT usage in preschool settings in the two countries are discussed and concluded.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:NJ774b8OgUMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "E-learning activities for articulation in speech language therapy and learning for preschool children",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810007184",
            "Abstract": "The aim of this study was to investigate the possibility of creating computerized application software to be used for e-learning activities for Greek preschoolers particularly to improve: (a) speech articulation problems and (b) language learning. The pedagogical model of the application was based on social learning theories and especially the nearest neighbour learning method.This study took place in Greece, during 2009 in a self selected group of children. The results of the study have shown that the learning outcomes of the integrated e-learning activities of language articulation in preschoolers were above average comparatively to other methods. Specially, we classified the learning processes according to the children's needs embedding the technological developments and the current needs of our society.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "How often do teachers in greece use NT and ICT in their classrooms? a study of continuing education needs",
            "Publication year": 2004,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17900",
            "Abstract": "Repository of UOI \"Olympias\": How often do teachers in greece use NT and ICT in their \nclassrooms? a study of continuing education needs Skip navigation Home Browse Communities & \nCollections Browse Items by: Issue Date Author Title Subject Item Type Advanced Search Help \nAbout DSpace Sign on to: My DSpace Receive email updates Edit Profile Saved Searches \nFavorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή \nΕπιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε επιστημονικά περιοδικά ( \nΑνοικτά) Ελληνικά English Please use this identifier to cite or link to this item: \nhttps://olympias.lib.uoi.gr/jspui/handle/123456789/17900 Institution and School/Department of \nsubmitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών και Τεχνολογιών. Τμήμα Βιολογικών \nΕφαρμογών και Τεχνολογιών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17900 in : σε ( …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A simulation approach on Cronbach's alpha statistical significance",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475406002059",
            "Abstract": "In this work we propose the use of simulation for the solution of the Cronbach's alpha statistical significance problem. This coefficient measures the reliability of a questionnaire's answers. Many analytical tests have been developed over the years which gave birth to very complicated formulas [2], [4], [6], [7], [8], [9]. A simulation approach to the solution of this problem takes advantage of the computational power in order to give exact results for the distribution of the null hypothesis regarding this coefficient.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:L8Ckcad2t8MC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Is e-Learning offering a new learning model? The case study of a Greek University Open Education",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=11858041275357030255&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Σχέσεις συγκινησιακών παραγόντων, Στρατηγικών αυτό-ρυθμιζόμενης μάθησης, και επίδοσης στη Διδακτική των Μαθηματικών και των Φυσικών Επιστημών",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/32238460/J5._Papantoniou_Plakitsi_et_al_serp_2010.pdf",
            "Abstract": "30 ΔΙΔΑΣΚΑΛΙΑ ΤΩΝ ΦΥΣΙΚΩΝ ΕΠΙΣΤΗΜΩΝ: ΕΡΕΥΝΑ ΚΑΙ ΠΡΑΞΗ ΔΙΠΛΟ ΤΕΥΧΟΣ 32-33 were asked to respond to the Positive and Negative Affect Schedule (PANAS) and the Cognitive Interference Questionnaire (CIQ). They also completed the Learning Strategies Scales of the MSLQ. Examination grades were used as the measure of academic achievement. In both cognitive subjects, negative affect was found to be related positively with state test anxiety, and positive affect was found to influence positively almost all of the self-regulated learning strategies. Negative affect was related positively with only two cognitive strategies, in the didactic of natural sciences course. Elaboration was found to predict academic achievement in the didactic of mathematics course, and time and study environment management was found to be related with academic achievement in the didactic of natural sciences course. Finally, state test anxiety was found to predict academic achievement in the didactic of mathematics course.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distance learning: a myth or a necessity for educators",
            "Publication year": 2011,
            "Publication url": "https://research.utwente.nl/files/63914048/IHE2011.pdf#page=99",
            "Abstract": "The current study investigates the effects of distance learning over the internet in Higher Education in Greece. This study is a pilot study exploring, the perceptions of ‘Formal, informal and Non-formal learning’of a group of undergraduate students in Educational Departments. The results of the study indicated the overall positive perceptions of the participants towards formal distance learning in Higher Education and also a shortage of use of Distance learning techniques at Universities and Technological Educational Institutes, suggesting the potential of implementing distance learning techniques at all levels of Greek educational system.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Πληροφορική για νηπιαγωγούς",
            "Publication year": 2000,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/bitstream/123456789/6541/1/372.133%204%20%CE%A0%CE%91%CE%93.pdf",
            "Abstract": "Τις τελευταίες δεκαετίες οι Ηλεκτρονικοί Υπολογιστές (ΗίΥ) χρησιμοποιού νται παράλληλα σε όλους σχεδόν τους τομείς της καθημερινής μας ζωής και στο χώρο της επιστήμης ως επιστημονικά εργαλεία έρευνας. Σ’αυτούς σοφίζεται βασικά η Πληροφορική, η οποία βρίσκεται σε ραγδαία ανάπτυξη. Δεν υπάρχει σήμερα τομέας της επιστήμης χωρίς έστω και την απλή εφαρμογή της. Η Θέση της μάλιστα άρχισε να γίνεται αναγκαία και στην εκπαίδευση από το 1980 και μετά.Ωστόσο, η Πληροφορική είναι φυσικό συνεχώς να εξελίσσεται με την συνεξέλιξη της γενικότερης τεχνολογίας. Το γεγονός αυτό έχει άμεσο αντίκτυπο στο πώς εφαρμόζεται η Πληροφορική στην εκπαίδευση και πώς διδάσκεται στα σχολεία. Γιατί η Πληροφορική σαν μάθημα θεωρείται αναγκαία όχι μόνο για τους φοιτητές και τους μαθητές των ανωτέρων τάξεων της εκπαίδευσης, αλλά και για τους μαθητές των κατωτέρων βαθμιδών της εκπαίδευσης.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PEDAGOGICAL SCIENCES",
            "Publication year": 2020,
            "Publication url": "http://nor-ijournal.com/wp-content/uploads/2020/09/NJD_43_3.pdf#page=35",
            "Abstract": "This study focuses on a literature review on Information and Computer Technology (ICT) tools used for teaching for environmental studies in primary schools in European countries. The paper includes the analysis of the key experience of implementing ICT tools in environmental studies and the advantages and disadvantages of using ICTs in environmental studies. According to our findings, ICT tools are used for Environmental Education on primary school students in Greece and Russia. The advantage of using ICT tools is that it allows to present text, sound, graphic and video information in a new way; activates the creative learning of students; and promotes the development of environmentally responsible behavior. As a disadvantage of the use of ICT tools in Environmental Education, one can designate the lack of lively dialogic communication between participants in the educational process. In conclusion, it should be noted that in Greece and Russia, teachers often use similar ICTs to teach environmental issues.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting undergraduate students via Webinars",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359592/",
            "Abstract": "Students are placed in the center of the educational process. Their engagement and support is of great interest in higher education. E-learning provides many different tools to support learning, through increased flexibility, portability and temporal independence. A synchronous technological tool that is used to reinforce the interaction and communication among educators and learners in blended learning is webinars. This study aims to test the use of webinars as supportive tool for undergraduate students. Results showed that students were informed about the webinar mainly through social networks. Almost two out of three students believed that there was interaction during the webinar. Students declared that they intent to use webinars as a supportive educational tool both for their studies and their work, but they did not preferred webinars instead of lessons inside the classroom. Thus, webinars should be used as …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Διαθεματική προσέγγιση και διδασκαλία. Η μέθοδος project",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=2927378107726545631&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Απόψεις φοιτητών και εκπαιδευτικών για την ηλεκτρονική μάθηση και τα Webinars",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/599",
            "Abstract": "Η ηλεκτρονική μάθηση (e-learning) χρησιμοποιείται ολοένα και περισσότερο στον τομέα της τριτοβάθμιας εκπαίδευσης. Η έρευνα αυτή έχει σκοπό να μελετήσει τις απόψεις των εν ενεργεία νηπιαγωγών και των φοιτητών ανώτατης εκπαίδευσης σε κλινικά επαγγέλματα, σχετικά με την ηλεκτρονική μάθηση και την παρακολούθηση συνεδρίων/σεμιναρίων από απόσταση μέσω του διαδικτύου (webinars). Σύμφωνα με τα αποτελέσματα της έρευνας και τις απόψεις των φοιτητών φαίνεται ότι η ηλεκτρονική μάθηση και τα webinars ως επιπρόσθετου διδακτικού εργαλείου είναι σημαντικές και μπορούν να αποτελέσουν ένα χρήσιμο εργαλείο στην εκπαίδευση. Οι φοιτητές δείχνουν να κατανοούν τις δυνατότητες της ηλεκτρονικής μάθησης και των webinars και τη συνεισφορά τους τόσο στην ολοκλήρωση των σπουδών τους αλλά και στην μελλοντική επαγγελματική τους εξέλιξη και τη δια βίου μάθηση.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Διαθεματικές προεκτάσεις στη διδασκαλία της Αγγλικής Γλώσσας: πρακτικές εφαρμογές με τη χρήση της μεθόδου Project και των Νέων τεχνολογιών",
            "Publication year": 2005,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17832",
            "Abstract": "Repository of UOI \"Olympias\": Διαθεματικές προεκτάσεις στη διδασκαλία της Αγγλικής Γλώσσας: \nπρακτικές εφαρμογές με τη χρήση της μεθόδου Project και των Νέων τεχνολογιών Skip \nnavigation Home Browse Communities & Collections Browse Items by: Issue Date Author Title \nSubject Item Type Advanced Search Help About DSpace Sign on to: My DSpace Receive email \nupdates Edit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI \n2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών \n5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to \ncite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17832 Institution \nand School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών Αγωγής. \nΠαιδαγωγικό Τμήμα Νηπιαγωγών URI: https://olympias.lib.uoi.gr/jspui/handle//17832 in : '…",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Use of ICTs in the early childhood studies",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=1874425104365728396&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Children and their consideration of risk",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=9824463942573209550&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ΔΙΔΑΣΚΑΛΙΑ ΕΝΝΟΙΩΝ ΠΙΘΑΝΟΤΗΤΩΝ ΚΑΙ ΣΤΑΤΙΣΤΙΚΗΣ ΣΕ ΕΦΗΒΟΥΣ ΜΕ ΝΟΗΤΙΚΗ ΥΣΤΕΡΗΣΗ",
            "Publication year": 2014,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/omep/article/view/17998",
            "Abstract": "Η ανάπτυξη της τεχνολογίας έχει επιφέρει αλλαγές στον τρόπο διδασκαλίας των μαθηματικών σε μαθητές με νοητική υστέρηση (Brown et al., 2011). Η παρούσα μελέτη περίπτωσης αποσκοπεί στη διερεύνηση της δυνατότητας των έφηβων με μέτρια νοητική υστέρηση να κατανοούν την τυχαιότητα και να εντοπίζουν το δειγματικό χώρο ενός τυχαίου πειράματος, με τη χρήση της τεχνολογίας. Οι συμμετέχοντες σε αυτή τη μελέτη ήταν δύο έφηβοι με μέτρια νοητική υστέρηση ηλικίας 15 και 16 ετών. Για το σκοπό της έρευνας αναπτύχθηκε μια ιστορία η οποία παρουσιάστηκε στους συμμετέχοντες κάνοντας χρήση του power point. Σύμφωνα με τα αποτελέσματα της μελέτης, οι έφηβοι με μέτρια νοητική υστέρηση ήταν σε θέση να διακρίνουν το δειγματικό χώρο ενός πειράματος τύχης που απαρτίζονταν από ένα έως και τέσσερα διαφορετικά αντικείμενα ενώ αρχικά δεν ήταν σε θέση να περιγράψουν όλους τους δυνατούς συνδυασμούς τριών και τεσσάρων αντικειμένων ανά δύο. Παρ’όλα αυτά, μπορούν να βελτιώσουν την πιθανολογική σκέψη τους μέσω διδασκαλίας κατάλληλα σχεδιασμένων εκπαιδευτικών δραστηριοτήτων.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teachers’ use of PowerPoint in kindergarten: An empirical investigation in China",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10639-014-9330-z.pdf",
            "Abstract": "Nowadays, with the rapid progress of Information and Communication Technologies (ICTs), the integration of ICTs in education has attracted more and more attention of educators and researchers. However, there are different situations between developed and less-developed nations both in ICT application and in ICT research. PowerPoint is a readily available and most popular tool for teaching in some less-developed countries. Under this particular circumstance, it is not an outdated issue to explore teachers’ use of PowerPoint in teaching. Thus, this paper systematically looked at teachers’ PowerPoint use in the setting of Chinese kindergartens. Specifically, four questions were explored: (i) the status of PowerPoint-related infrastructures in the kindergartens; (ii) teachers’ use of PowerPoint in teaching; (iii) teachers’ design, competences and training related to PowerPoint; (iv) teachers’ perceptions and …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer US"
        },
        {
            "Title": "DISTANCE LEARNING AND INTERNET USE DURING THE COVID-19 PANDEMIC–THE RUSSIAN STUDENT COMMUNITY OPINION",
            "Publication year": 2020,
            "Publication url": "http://www.eden-online.org/wp-content/uploads/2021/01/RW11_SPB_v5.pdf#page=16",
            "Abstract": "The COVID-19 pandemic, which is not slowing down now, has provoked changes in many social areas. University life is also changing. To assess the pandemic impact on the Russian students’ lifestyle and learning, we conducted an anonymous survey with a students’ random sample. Presently the study is ongoing, but the first results, obtained from July to August 2020, show that students began to use the Internet more often during the self-isolation period with different purposes. During this emergency, educational institutions liaised online with students in accessible ways, but some students reported having trouble with distance learning. We asked survey participants to predict further distance learning development and found that students believed that distance learning will be partially or completely preserved once the pandemic is over.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Educational technology",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=7471469275418089916&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adoption of information and communication technologies in higher education institutions",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/45539513/Adoption_of_Information_and_Communicatio20160511-5147-o7uice.pdf",
            "Abstract": "All innovations applied in all education levels of a country originate from higher education system as it is the main research area for knowledge creativity and communication. Thus Information and Communication Technologies significantly affect apart from educational process the full administrative operation. The wide use of ICT contributes to human and economic resources savings. The present work is a case study. Specifically the adoption of ICT from the University of Ioannina is investigated and their performance by examining their influence on the universityΆs services and work flow is evaluated. Particularly the following administration departments/sections of University were examined: Library, Payroll Office, Administrative Personnel Office. The changes in the operation of the Library for the procedure and the required time for book search were evaluated. In the Administrative Personnel Office and the Payroll Office, the type of ICT and the advantages of its use were examined. Also we tried to explore the impact of ICT in teaching and the communication between academic staff and students. Results show that in Library the search procedure for books or papers is simplified as all visitors can access a desktop pc, search for themselves and in a minimum time their search results are available. Concerning the Payroll Office, the use of payroll software decreases the requested work time by 98%. Finally the use of Enterprise Resource Planning (ERP) and Human Resources Management System (HRMS) improve the evaluation procedure. Furthermore employees from all departments emphasized in the large amount of advantages that come from …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Different learning theories applied to diverse learning subjects A pilot study",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810023426",
            "Abstract": "Educators work hard to offer new learning opportunities on subjects they teach, especially with the advancement of new technologies. Depending on the target group of learners, the subject and the circumstances, different learning theories may be applied to different teaching subjects.This study investigates the effects of the different learning theories when applied on various subjects in a computer-based environment. The research question concerns how the different learning theories affect students and their learning outcomes. The results revealed a difference by implying that not only the learning theory and the teaching practices but also the content, the structure and the nature of the course together with the social interactions play an important role on how people learn and develop their skills.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fairness through mathematical problem solving in preschool education",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-15410-7_9",
            "Abstract": "This chapter reports on a study of fairness in young children. Its aim is to examine how preschoolers respond to mathematical problem-solving contexts that imply fairness and the claim of sharing and distributing. The results suggest that by the age of four, children are cognitively and socially capable, at a certain level, to transmit from their own state of mind to that of the others, overcome self-interest and understand, expect and prefer fairness, while distributing justice.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Περίληψη συνεργατική μελέτη και συλλογισμός με τη χρήση του ηλεκτρονικού υπολογιστή ως εκπαιδευτικού εργαλείου",
            "Publication year": 2002,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17760",
            "Abstract": "Repository of UOI \"Olympias\": Περίληψη συνεργατική μελέτη και συλλογισμός με τη χρήση του \nηλεκτρονικού υπολογιστή ως εκπαιδευτικού εργαλείου Skip navigation Home Browse \nCommunities & Collections Browse Items by: Issue Date Author Title Subject Item Type \nAdvanced Search Help About DSpace Sign on to: My DSpace Receive email updates Edit \nProfile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \n\"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε \nεπιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite or link to this \nitem: https://olympias.lib.uoi.gr/jspui/handle/123456789/17760 Institution and School/Department \nof submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών Αγωγής. Παιδαγωγικό Τμήμα \nΝηπιαγωγών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17760 Appears in : Άρθρα : …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The notions of chance and probabilities in preschoolers",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s10643-010-0417-x",
            "Abstract": "Chance, randomness and probability constitute statistical notions that are interrelated and characterize the logicomathematical thinking of children. Traditional theories support that probabilistic thinking evolves after the age of 7. However, recent research has underlined that children, as young as 4, may possess and develop basic notions, through mental mechanisms and/or through intuitive processes. In the current study, preschoolers (N = 200) aged 4–6, participated in two diverse probability tasks related to the likelihood of events and the graphical representation of randomness. The aim of this study was to test whether children, at this young age, have the ability to predict the most probable outcome in a probabilistic game with animal cards and whether they can mark symbols randomly distributed in a 5 × 5 matrix. Preschoolers infered correctly the most likely outcome and showed a minimal …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "ICT use in early childhood education: Storytelling",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Eugenia-Toki/publication/262972582_ICT_USE_IN_EARLY_CHILDHOOD_EDUCATION_STORYTELLING/links/004635397663f8ce61000000/ICT-USE-IN-EARLY-CHILDHOOD-EDUCATION-STORYTELLING.pdf",
            "Abstract": "The aim of this study is to investigate the ICT use by pre-service preschool teachers and pre-service speech and language therapists in developing their digital case of a storytelling. Students were stimulated to use various multimedia editing and authoring tools. The research questions concern the students’ accomplishments on integrating technology in digital storytelling and the effectiveness of that learning environment they created. The results revealed a difference by implying that not only the learning theory and the teaching practices but also the content, the structure and the nature of the course together with the social interactions play an important role on how people learn and develop their skills. The results revealed that students of both departments overall accomplished very good project outcomes in digital storytelling meeting technical and pedagogical criteria. Finally similarities and differences of the students’ approaches in the digital storytelling development are discussed and concluded in the demands of modern information society.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching probabilities and statistics to preschool children",
            "Publication year": 2003,
            "Publication url": "https://www.learntechlib.org/p/17772/",
            "Abstract": "This study considers the teaching of probabilities and statistics to a group of preschool children using traditional classroom activities and Internet games. It was clear from this study that children can show a high level of understanding of probabilities and statistics, and demonstrate high performance in probability games. The use of Internet games in the teaching of probabilities promotes the teaching and learning process to preschoolers.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Δημιουργία αλληλεπιδράστικών μαθησιακών δραστηριοτήτων με τη χρήση των νέων τεχνολογιών το ολοκληρωμένο εκπαιδευτικό πακέτο περιβάλλον η προστασία δάσους",
            "Publication year": 2010,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17834",
            "Abstract": "Repository of UOI \"Olympias\": Δημιουργία αλληλεπιδράστικών μαθησιακών δραστηριοτήτων \nμε τη χρήση των νέων τεχνολογιών το ολοκληρωμένο εκπαιδευτικό πακέτο περιβάλλον η \nπροστασία δάσους Skip navigation Home Browse Communities & Collections Browse Items \nby: Issue Date Author Title Subject Item Type Advanced Search Help About DSpace Sign \non to: My DSpace Receive email updates Edit Profile Saved Searches Favorites Repository \nof UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών \nΑγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) \nΕλληνικά English Please use this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17834 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών \nΑγωγής. Παιδαγωγικό Τμήμα Νηπιαγωγών URI: https://olympias.lib.uoi.gr////'…",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sample space and the structure of probability combinations in preschoolers.",
            "Publication year": 2007,
            "Publication url": "https://math.uni-paderborn.de/fileadmin/mathematik/Didaktik_der_Mathematik/BiehlerRolf/WG5.pdf#page=99",
            "Abstract": "The sample space and the structure of the possible combinations are components that determine a probability task. The aim of this study is to investigate whether preschoolers show any preference to spatially grouped stimuli and to what extent in terms of number of combinations, they can estimate possible outcomes. There were 3 trials with 2 sub-cases each, with alterations in the position and the number of color-paired sectors. Children showed preference to the paired stimuli and made predictions, based on visual comparisons (Way, 2003,) with ease up to 3 combinations.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Τι γνωρίζουν τα νήπια για τους Ηλεκτρονικούς Υπολογιστές",
            "Publication year": 2000,
            "Publication url": "http://ejournals.lib.auth.gr/1105-3968/article/view/3519",
            "Abstract": "Η χρήση του Η/Υ ως εργαλείου διδασκαλίας και μάθησης σε όλες τις βαθμίδες της εκπαίδευσης, είναι αναμφισβήτητη (Ραβάνης 1986, Φιλοκύπρου 1995, Τσολακίδης 1998). Ο Η/Υ όμως δεν έρχεται να αντικαταστήσει ή να καταργήσει το σχολικό βιβλίο και τα άλλα βοηθητικά μέσα διδασκαλίας. Ο Η/Υ, τόσο στην εκπαίδευση όσο και στην τεχνολογική του διάσταση, μπορεί να γίνει ένα πρόσθετο εκπαιδευτικό εργαλείο, που με τη βοήθεια ενός σωστά διαμορφωμένου λογισμικού να μπορεί να συμπληρώσει και να βελτιώσει τον παραδοσιακό τρόπο διδασκαλίας (Αρβανίτης 1986, Δημητρακοπούλου 1998). Με την προϋπόθεση αυτή, ο Η/Υ μπορεί να δώσει μια νέα ώθηση στην όλη διαδικασία της διδασκαλίας και μάθησης.(…)",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Early childhood teachers’ access to and use of ICT in teaching: The case of Mainland China",
            "Publication year": 2015,
            "Publication url": "https://www.learntechlib.org/p/150908/",
            "Abstract": "This paper investigated the current status of Mainland Chinese early childhood teachers’ ICT access and use in their teaching practices. In order to collect the data, a self-designed questionnaire was adopted. A total of 46 teachers participated in the study. It was found that the ICT equipment and resources the teachers could access to were limited, especially the new and the Internet-connected ones. However, under this limited condition, searching educational materials via the computer and the Internet was commonly conducted by the teachers. A large proportion of the teachers also used ICT in their teaching process with a high frequency. In addition, teachers’ educational level and pre-service training on ICT use at university were found play an important role in determining whether the teachers used ICT in their teaching process. The implications for the future practice and research were also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Pragmatics Communication Deficiencies and the Role of Gamification",
            "Publication year": 2018,
            "Publication url": "https://www.europeanpublisher.com/en/article/10.15405/ejsbs.232",
            "Abstract": "The proper use of language for communication in any context is defined as Pragmatics. Pragmatics includes the linguistic adjustments made (what is said, how it is said, body language, appropriateness) in order to accomplish the communication goal. Children and adults may be referred for rehabilitation when pragmatic communication deficits have an impact on social functioning, employment, and family/marital relationships (Turkstra, et al., 2016). The aim of this study is to examine gamification as an alternative to supplement clinical assessment procedures of an individual’s communication deficiencies with a focus on pragmatics perception, which led to the creation of a mobile gamified procedure designed to collect data on pragmatics perception. The gamified procedure was created in Kahoot! and was played by a sample of two hundred and fifty-six (256) university students with non-acquired communicative deficits studying health related courses in Greece. Data on points scored, response accuracy and duration of time spent on of each language feature was recorded. A detailed description on students’ pragmatics abilities and motivation was reported. The results of the study described normative data concerning points scored, response time and accuracy of language features. Statistically significant differences were found between genders in terms of response accuracy and time for some language features. The gamified e-assessment has the clear potential to contribute innovatively to the clinical assessment procedures of pragmatic communicative deficits including the needs of individuals with developmental disorders, psychiatric …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Future Academy"
        },
        {
            "Title": "An integrated model for the correlation integral",
            "Publication year": 2007,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219477507003672",
            "Abstract": "The correlation integral is the main tool for the analysis of the chaotic time series. Its linear part (i.e. the scaling region) gives the attractor's dimension. In this work we propose a model that explains all the possible neighborhood ranges of the correlation integral. Empirical examples are given on artificial data.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:_kc_bZDykSQC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Risk taking and probabilistic thinking in preschoolers",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=7136692943139989671&hl=en&oi=scholarr",
            "Abstract": "Decision making under uncertainty involves the underlying concepts of risk and probabilities. By getting involved in risk taking experiences preschoolers develop stochastic thinking and skills that allow making risky or riskless choices depending on the outcome and related information. In the current study, children (N= 80), at the age of 4-6 participated in the’Cups’ task (Levin et al, 2003) through concrete manipulatives versus pc. Findings allow implications for the design of the probabilistic tasks in relation to the cognitive capacities of young children.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WSMA: in between weighted and simple average",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=518294802873248720&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Preschoolers’ learning disabilities assessment: New perspectives in computerized clinical tools",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Eugenia-Toki/publication/263040178_Preschoolers'_Learning_Disabilities_Assessment_New_Perspectives_in_Computerized_Clinical_Tools/links/00b7d53b2ae796467f000000/Preschoolers-Learning-Disabilities-Assessment-New-Perspectives-in-Computerized-Clinical-Tools.pdf",
            "Abstract": "This study looks into new perspectives in preschoolers’ assessment of being at risk for learning disabilities. Precisely, two innovative assessment approaches are examined in order to reveal new research perspectives. The first tool, a traditional approach, is the “Early Dyslexia Identification Test” and the second tool, a computerized approach, is an Internet based Speech Pathology Diagnostic Expert System named “APLo”. Both evaluate the sectors of phonological awareness, memory, psychomotor development, pre-writing and pre-reading skills in Greek. The findings of the current study formulate three directions:(1) the complementary of speech language and learning disorders as a systemic approach,(2) the diagnosis of suspicious factors and compatibilities of learning disabilities even at the preschool age, and (3) the application of alternative methods of assessment aiming for a multidimentional approach with the combined prospect and potential of web tools in the early diagnosis and intervention in learning disabilities.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Repel the swarn to the optimum",
            "Publication year": 2005,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17865",
            "Abstract": "Repository of UOI \"Olympias\": Repel the swarn to the optimum Skip navigation Home \nBrowse Communities & Collections Browse Items by: Issue Date Author Title Subject Item \nType Advanced Search Help About DSpace Sign on to: My DSpace Receive email updates \nEdit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \n\"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε \nεπιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite or link \nto this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/17865 Institution and School/Department \nof submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών και Τεχνολογιών. Τμήμα \nΒιολογικών Εφαρμογών και Τεχνολογιών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17865 \nAppears in Collections: Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Show full item : …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Κοινωνικά δίκτυα με απευθείας σύνδεση (Online Social Networks) στην εκπαίδευση. Η περίπτωση του Edmodo",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/630",
            "Abstract": "Στην εργασία αυτή παρουσιάζονται οι απόψεις ερευνητών όσον αφορά τη χρήση των εκπαιδευτικών διαδικτυακών εργαλείων ως μέσων υποστήριξης της εκπαιδευτικής διαδικασίας στο πλαίσιο του m-learning και παρουσιάζονται τα βασικά χαρακτηριστικά του edmodo, ενός εκπαιδευτικού κοινωνικού δικτύου με απευθείας σύνδεση (Online Social Network).",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessing and educating preschool teachers on probability concepts in the classroom",
            "Publication year": 2006,
            "Publication url": "https://www.stat.auckland.ac.nz/~iase/publications/17/3H2_PANG.pdf",
            "Abstract": "This study refers to an experiment on teaching probabilities, conducted in Greece at preschools in Athens and Ioannina. The aim of this study was to assess teachers on how they introduced common statistical concepts to children throughout the academic year of 2004-2005. Moreover, this study presents a new didactical model on the way we tried to educate preschool teachers on how to introduce to preschool children probabilistic concepts that are not contained in the official national curriculum. The majority of the teachers agreed that the study was interesting and that their intentions were positive, but they lacked the ability and specification to include those concepts in their everyday class curriculum.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Use of the Socratic Teaching Method in E-Learning 2.0 Settings",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=5156596400539309070&hl=en&oi=scholarr",
            "Abstract": "The aim of this chapter is to outline the use of the Socratic Teaching Method (STM) in e-Learning 2.0 practice. The research included in this chapter is intended as an introductory handout in order to help educators, learners and course designers to identify the advantages and pitfalls of using this teaching method in e-Learning 2.0 applications. More precisely, this chapter gives the writer’s perspective regarding some very interesting issues, such as: a) the range of subjects that could be taught using the STM teaching practice, b) the educators’ additional skills needed in order to apply STM to their online teaching, and c) whether the STM is an adequate learning approach in order to assure learners’ mastery of a subject.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Εκπαιδευτική τεχνολογία",
            "Publication year": 2008,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/bitstream/123456789/6527/1/371.33%20%CE%A0%CE%91%CE%93.pdf",
            "Abstract": "Για το περιεχόμενο του βιβλίου δεν είναι αναγκαίο να ειπωθούν πολλά πράγματα. Είναι γενικότερα πα ραδεκτό πως τόσο η είσοδος των Νέων Τεχνολογιών στην εκπαίδευση όσο και η «μάθηση από απόσταση», παρουσιάζουν σήμερα εξαιρετικό ενδιαφέρον, όχι μό νο γιατί ανανεώνουν την παραδοσιακή διδασκαλία, αλλά και γιατί ανοίγουν απεριόριστες προοπτικές. Μάλιστα, έχουν γίνει στις ημέρες μας αντικείμενο ε ντατικών επιστημονικών ερευνών με αποτέλεσμα και η σχετική βιβλιογραφία να αυξάνεται καθημερινά. Στο βιβλίο αυτό, το πρώτο κεφάλαιο περιγράφει τη σχέση τεχνολογίας και εκπαίδευσης. Γίνεται ανα φορά στην ένταξη των Νέων Τεχνολογιών (NT) στην εκπαιδευτική πρακτική κάθε βαθμίδας χωριστά. Το δεύτερο κεφάλαιο παρουσιάζει τα τεχνολογικά μέσα: οπτικοακουστικά, πολυμέσα, Τεχνολογίες Πλη ροφορίας και Εκπαίδευσης (ΤΠΕ), ενώ το τρίτο κεφάτ λαιο αναφέρεται στις θεωρίες και στρατηγικές μάθη-",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The design of an expert system for the e-assessment and treatment plan of preschoolers’ speech and language disorders",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810023451",
            "Abstract": "Communication skills play a vital Role in life's experiences. Especially when a child enters the formal education setting, the ability to communicate is a significant component in order to learn and interact with peers and adults. The curriculum at school aims to enhance students’ literacy and language skills. Educators work hard to offer opportunities within a fruitful environment for the development of children's spoken and written language abilities. The child's learning process can be affected in the case of a communication disorder. Early diagnosis of a speech and language disorder is very crucial for the success of treatment and the child development. The evaluation and diagnosis of such disorders requires experienced clinicians, who may not be always available for a diagnostic evaluation or sometimes might not be experienced enough.The purpose of the study was to investigate the design of a computer-based …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An online expert system for diagnostic assessment procedures on young children's oral speech and language",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050912008113",
            "Abstract": "Internet has influenced many aspects of modern life, as it gave people the opportunity to access massive amount of information. Information & Communication Technologies (ICT) offer the option to analyze, organize, synthesize and transmit information and therefore contribute and reveal valuable clinical and educational tools.The aim of the present study is to report on the development of an Internet based Speech Pathology Expert System in Greek, named APLo, intended to be used by clinicians and teachers involved in oral language learning and strengthening of four to seven year old children. This system embeds the expert's knowledge on oral language assessment. A hybrid approach that integrates symbolic rules with neural networks is being used to model and represent the knowledge in the system. Particular attention is given to the validation and verification of the system. Potentials, further use and …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:4DMP91E08xMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Computer-based mathematical games for preschool children",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=12828333396267387640&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparative study of two learning methods collaborative learning versus nearest neighbor learning",
            "Publication year": 2015,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17941",
            "Abstract": "Repository of UOI \"Olympias\": A comparative study of two learning methods collaborative learning \nversus nearest neighbor learning Skip navigation Home Browse Communities & Collections Browse \nItems by: Issue Date Author Title Subject Item Type Advanced Search Help About DSpace Sign on to: \nMy DSpace Receive email updates Edit Profile Saved Searches Favorites Repository of UOI \n\"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής \n4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English \nPlease use this identifier to cite or link to this item: \nhttps://olympias.lib.uoi.gr/jspui/handle/123456789/17941 Institution and School/Department of \nsubmitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών και Τεχνολογιών. Τμήμα Βιολογικών \nΕφαρμογών και Τεχνολογιών URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17941 Appears …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Literature survey and children's perception on risk",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/BF02655740.pdf",
            "Abstract": "Risk perception differs between people. There are studies presenting the different risk perception according to their character. The aim of this paper is to make a short literature review on risk and also is trying to present papers which consider the hypothesis: ‘is any correlation between risk perception by children and mathematical thinking?’.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Estimating Malmquist productivity indexes using probabilistic directional distances: An application to the European banking sector",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221717301984",
            "Abstract": "Our paper by adopting the latest advances on the probabilistic characterization of directional distance functions as has been introduced by Daraio and Simar (2014), develops a Malmquist productivity index and presents its main decompositions. Specifically, the proposed productivity index is based on the probabilistic version of directional distance functions which are expressed as transformations of radial distances. We illustrate how these indexes can be computed and how different components can be derived. Specifically, we demonstrate how a probabilistic version of the following categories of change can be obtained: technical, efficiency, pure efficiency, scale efficiency, scale change factor and scale bias of technical change. Finally, we apply the probabilistic productivity indexes alongside with their decompositions to inputs/outputs data from a sample of 644 banks from 28 European countries between the …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:UHK10RUVsp4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The necessity of ICT literacy in Undergraduate Educational Departments students",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/31873324/The_necessity_of_ICT_literacy_in_Undergraduate_Educational_Departments_students.pdf",
            "Abstract": "The aim of this study is to investigate how undergraduate students of the Department of Early Childhood Education understand and avail Information Communication Technology. Emphasis is given on the students’ capabilities to evaluate and integrate educational content, retrieved from the Internet, in educational process. The current research was carried out in 2008 in the University of Ioannina in Greece. The sample consisted of 180 undergraduate students during their final year of their undergraduate studies. In that semester one of the tasks of the undergraduate students was to be trained on using Internet and Information Communication Technologies and then to carry out certain tasks regarding information retrieval from the Internet. Additionally, they attended a test performing similar activities. The results of this study were based on the evaluation of the above. The outcome of the study outlined: a. the students’ deficiencies in Information Communication Technology literacy and b. the necessity for re-evaluation of the education and training of preschool teachers in using the Internet for information retrieval so as to promote more effective methods of Information Communication Technology activities’ and the integration in the learning process.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nearest Neighbor Learning: A learning model and an e-learning experience",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=1990936238330433252&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "What children know about computers",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=8815925892567688331&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Webinars and Social Network in Distance Learning: Students’ Views",
            "Publication year": 2014,
            "Publication url": "http://www.journaljesbs.com/index.php/JESBS/article/view/16881",
            "Abstract": "Aims: The aim of this study is to present students’ views concerning the attendance of conference and/or seminars via Internet (webinars) and also how online social network are used in distance learning.Study Design: Descriptive quantitative research. Especially, a survey using questionnaires and interviews for data collection.Place and Duration of Study: University of Ioannina, one academic year, 2012-2013.Methodology: A questionnaire was firstly addressed to a small self selected group of undergraduate students at the beginning of the academic year (mid–November) as pre-test. Then the questionnaire was revised and the final version of the questionnaire was addressed to all undergraduate 210 students attending the 3rd year of their undergraduate studies. This questionnaire was delivered at the beginning of spring term. Interviews were taken in spring semester (mid–April) for evaluation of the answers in the questionnaire. Moreover, a revised questionnaire for a postgraduate group students (20 self selected students) from the School of Education was given in mid spring semester.Results: 18.29% of undergraduates use webinars. 84.28% of them believe that attending seminars via Internet (webinars) may contribute to the enrichment of the educational process and facilitates distance learning. 56.89% of undergraduates prefer to attend conferences and/or seminars with physical presence, since interaction amongst participants is greater. 89.56% of undergraduate and 93.47% of postgraduate students use social network for communication and information on learning material and on other educational issues.Conclusions: Both …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of online presence and further training through the websites of the Departments of Higher Education",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=4407563820464570543&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:5awf1xo2G04C",
            "Publisher": "Pedio Athens"
        },
        {
            "Title": "Μάθηση από απόσταση με σύγχρονα μέσα και δια βίου μάθηση, προτιμήσεις εκπαιδευτικών",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/587",
            "Abstract": "Η χρήση των Τεχνολογιών Πληροφορικής και Υπολογιστών (ΤΠΕ) στην εκπαιδευτική διαδικασία έχει τονιστεί/αναδειχθεί από πολλές έρευνες σε παγκόσμιο επίπεδο. Μέσω αυτών παρουσιάζονται οι ευκαιρίες που προσφέρουν για την υποστήριξη της μάθησης με έναν ευέλικτο τρόπο. Παράλληλα επηρεάζουν τις διαδικασίες παροχής Δια Βίου Μάθησης (ΔΒΜ). Σκοπός της παρούσας έρευνας είναι η παρουσίαση των απόψεων εκπαιδευτικών προσχολικής εκπαίδευσης, όσον αφορά τη μάθηση από απόσταση με χρήση Νέων Τεχνολογιών ως τμήμα της ΔΒΜ. Τα αποτελέσματα της έρευνας έδειξαν ότι παρά την εξοικείωση τους με τις ΤΠΕ, προτιμούν τη Πρόσωπο με Πρόσωπο Δια Βίου Μάθηση έναντι της χρήσης μόνο με ΤΠΕ.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Internet services and their teaching exploitation by Preschool Teachers",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=14884145787223963139&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An adaptive way for improving noise reduction using local geometric projection",
            "Publication year": 2004,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1622354",
            "Abstract": "We propose an adaptive way to improve noise reduction by local geometric projection. From the neighborhood of each candidate point in phase space, we identify the best subspace that the point will be orthogonally projected to. The signal subspace is formed by the most significant eigendirections of the neighborhood, while the less significant ones define the noise subspace. We provide a simple criterion to separate the most significant eigendirections from the less significant ones. This criterion is based on the maximum logarithmic difference between the neighborhood eigendirection lengths, and the assumption that there is at least one eigendirection that corresponds to the noise subspace. In this way, we take into account the special characteristics of each neighborhood and introduce a more successful noise reduction technique. Results are presented for a chaotic time series of the Hénon map and Ikeda map …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:7PzlFSSx8tAC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Teachers’ evaluation of preschool educational software: the case of probabilistic thinking",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810022986",
            "Abstract": "Nowadays, children interact in formal and informal settings with technology from their very early age. As a result, a wide range of software has emerged with diverse purposes, usages, and applications. One such category is the software that is designed to assess children's prior knowledge and skills concerning a particular subject area. In this study, software testing children's abilities to make estimations and judgments based on probabilities was evaluated by preschool teachers. This pilot study took place in Greece, during 2009-2010, in a self selected group of in-service teachers (N = 45). After personal interaction with the software, educators filled in a questionnaire with their opinions. Further analysis was made in order to discriminate the criteria of great importance that comprise software as developmentally appropriate. The results revealed that not only the design but also the content, the process and the …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Studying physics through MOOC. The barriers of Openness.",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Rozita-Tsoni/publication/275649142_Studying_physics_through_MOOC_The_barriers_of_Openness/links/554243440cf234bdb21999b9/Studying-physics-through-MOOC-The-barriers-of-Openness",
            "Abstract": "MOOCs (Massive Open Online Courses) are available online, offering learning opportunities to a great number of participants. Although the main characteristic of these courses is openness there are some limitations in the implementation that decrease the number of participants throughout the course and increase the number of dropouts. Internet access can find thousands of courses in almost every field of interest. Lack of time and poor guidance from the teaching assistants are other aspects of the problem. The recommended background is, in some cases, misleading and the estimated workload in most cases is larger than expected. The participant must have skills of self regulated learning and has to be committed to complete the course successfully. Physics is a popular subject so some of the best universities provide online classes. The level can vary from beginners to advance. There are courses suitable for high school students and others that require more advanced prior knowledge. In this case study, we enrolled in various physics related courses, in MOOC in order to examine the factors that increase failure as mentioned above. The results of this study revealed that courses should be aiming in more specific target groups and participants should be given the option to adjust the course to their learning needs.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Can we teach statistics to undergraduate students using the World Wide Web",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=11132999881421777606&hl=en&oi=scholarr",
            "Abstract": "This study is examining the use of technology to replicate the traditional way of teaching statistics to an undergraduate group of students in the Department of Education. The statistical course covered descriptive statistics at an undergraduate level and the www was used for the teaching purposes. The group of students in this study was not homogeneous on their knowledge of technology use.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Serious Games and Motivation",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_25",
            "Abstract": "Serious games are gaining a lot of interest in education because they are effective learning tools that engage and motivate students. However, serious games are not ad-hoc motivational but they must follow specific elements to assure motivation. There are several types of motivation that reinforce the effectiveness of serious games and engage students to the task. When these types are combined they provide high learning outcomes. The preliminary study examines how primary school teachers apprehend serious games and how their concepts are related with intrinsic motivation. The findings of the current study provide clear evidence that teachers believe that serious games intrinsically motivate students to learn by developing significant learning skills.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Υπηρεσίες του Internet και η διδακτική αξιοποίησή τους από εκπαιδευτικούς προσχολικής ηλικία",
            "Publication year": 2006,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/17742",
            "Abstract": "Repository of UOI \"Olympias\": Υπηρεσίες του Internet και η διδακτική αξιοποίησή τους από \nεκπαιδευτικούς προσχολικής ηλικία Skip navigation Home Browse Communities & Collections \nBrowse Items by: Issue Date Author Title Subject Item Type Advanced Search Help About DSpace \nSign on to: My DSpace Receive email updates Edit Profile Saved Searches Favorites Repository of \nUOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής \n4.Παιδαγωγικό Τμήμα Νηπιαγωγών 5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English \nPlease use this identifier to cite or link to this item: \nhttps://olympias.lib.uoi.gr/jspui/handle/123456789/17742 Institution and School/Department of \nsubmitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών Αγωγής. Παιδαγωγικό Τμήμα Νηπιαγωγών \nURI: https://olympias.lib.uoi.gr/jspui/handle/123456789/17742 Appears in Collections: Άρθρα σε ( …",
            "Abstract entirety": 0,
            "Author pub id": "FMxD7AMAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ψηφιακό παιχνίδι στην Προσχολική Ηλικία",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/679",
            "Abstract": "Το ψηφιακό παιχνίδι αποτελεί ένα σύγχρονο εργαλείο που μπορεί να αποτελέσει ένα νέο μέσο μάθησης στην εκπαιδευτική πρακτική, εφόσον αξιοποιηθεί ορθά. Μέσα σε οργανωμένο πλαίσιο μάθησης, με εκπαιδευτικούς στόχους, αναπτυξιακά κατάλληλο σχεδιασμό και αξιολόγηση, το ψηφιακό παιχνίδι δίνει στο παιχνίδι και τη μάθηση μια νέα διάσταση. Στην παρούσα εργασία παρουσιάζονται συνοπτικά βασικά σημεία ένταξης και ενσωμάτωσης των Νέων Τεχνολογιών και του ψηφιακού παιχνιδιού ειδικότερα, στην τάξη του Νηπιαγωγείου. Αναδεικνύονται γενικά χαρακτηριστικά του ψηφιακού παιχνιδιού για μικρά παιδιά με έμφαση στην παιδαγωγική αξιοποίησή του, με στόχο την προαγωγή γνώσεων, στάσεων και αντιλήψεων.",
            "Abstract entirety": 1,
            "Author pub id": "FMxD7AMAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        }
    ]
}]