[{
    "name": "Σταύρος Περαντώνης",
    "romanize name": "Stavros Perantonis",
    "School-Department": "Ινστιτούτο Πληροφορικής και Τηλεπικοινωνιών",
    "University": "demokritos",
    "Rank": "Διευθυντής Ερευνών",
    "Apella_id": 17487,
    "Scholar name": "Stavros Perantonis",
    "Scholar id": "y3fDadgAAAAJ",
    "Affiliation": "National Center for Scientific Research \"Demokritos\"",
    "Citedby": 6120,
    "Interests": [
        "pattern recognition",
        "computational intelligence",
        "multimedia processing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=y3fDadgAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Fast implementation of morphological operations using binary image block decomposition",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219467804001361",
            "Abstract": "Morphological transformations are commonly used to perform a variety of image processing tasks. However, morphological operations are time-consuming procedures since they involve ordering and min/max computation of numbers resulting from image interaction with structuring elements. This paper presents a new method that can be used to speed up basic morphological operations for binary images. To achieve this, the binary images are first decomposed in a set of non-overlapping rectangular blocks of foreground pixels that have predefined maximum dimensions. Then off-line dilation and erosion of all rectangular blocks are arbitrary obtained and stored into suitable look-up array tables. By using the look up tables, the results of the morphological operations to the rectangular blocks are directly obtained. Thus, first all image blocks are replaced by their look-up array tables. Then the morphological …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:EUQCXRtRnyEC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Semantics extraction from images",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20795-2_3",
            "Abstract": "An overview of the state-of-the-art on semantics extraction from images is presented. In this survey, we present the relevant approaches in terms of content representation as well as in terms of knowledge representation. Knowledge can be represented in either implicit or explicit fashion while the image is represented in different levels, namely, low-level, intermediate and semantic level. For each combination of knowledge and image representation, a detailed discussion is addressed that leads to fruitful conclusions for the impact of each approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:9pM33mqn1YgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Improved document image binarization by using a combination of multiple binarization techniques and adapted edge information",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4761534/",
            "Abstract": "This paper presents a new adaptive approach for document image binarization. The proposed method is mainly based on the combination of several state- of-the-art binarization methodologies as well as on the efficient incorporation of the edge information of the gray scale source image. An enhancement step based on mathematical morphology operations is also involved in order to produce a high quality result while preserving stroke information. The proposed method demonstrated superior performance against six (6) well-known techniques on numerous degraded handwritten and machine- printed documents. The performance evaluation is based on visual criteria as well as on an objective evaluation methodology.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:mlAyqtXpCwEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A maritime data analytics platform for policy recommendation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388046/",
            "Abstract": "The Aegean Sea is characterized by an extremely high marine safety risk, mainly due to the significant increase of the traffic of tankers from and to the Black Sea that pass through narrow straits formed by the 1600 Greek islands. Reducing the risk of a ship accident is therefore vital to all socio-economic and environmental sectors. This paper presents a maritime data analytics platform for policy recommendation. The online tool focuses on extracting aggregated vessel risks using spatiotemporal analysis of multilayer information: vessel trajectories, vessel data, meteorological data, bathymetric/ hydrographic data as well as information regarding environmentally important areas (e.g. protected high-risk areas, etc.). The web interface enables user-friendly spatiotemporal queries at the front-end, while a series of data mining functionalities extracts aggregated statistics regarding: (a) marine risks and accident …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:kh2fBNsKQNwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Goal-oriented rectification of camera-based document images",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5585760/",
            "Abstract": "Document digitization with either flatbed scanners or camera-based systems results in document images which often suffer from warping and perspective distortions that deteriorate the performance of current OCR approaches. In this paper, we present a goal-oriented rectification methodology to compensate for undesirable document image distortions aiming to improve the OCR result. Our approach relies upon a coarse-to-fine strategy. First, a coarse rectification is accomplished with the aid of a computationally low cost transformation which addresses the projection of a curved surface to a 2-D rectangular area. The projection of the curved surface on the plane is guided only by the textual content's appearance in the document image while incorporating a transformation which does not depend on specific model primitives or camera setup parameters. Second, pose normalization is applied on the word level aiming …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:_5tno0g5mFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A holistic methodology for keyword search in historical typewritten documents",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_52",
            "Abstract": "In this paper, we propose a novel holistic methodology for keyword search in historical typewritten documents combining synthetic data and user’s feedback. The holistic approach treats the word as a single entity and entails the recognition of the whole word rather than of individual characters. Our aim is to search for keywords typed by the user in a large collection of digitized typewritten historical documents. The proposed method is based on: (i) creation of synthetic image words; (ii) word segmentation using dynamic parameters; (iii) efficient hybrid feature extraction for each image word and (iv) a retrieval procedure that is optimized by user’s feedback. Experimental results prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Sentiment Analysis from Sound Spectrograms via Soft BoVW and Temporal Structure Modelling.",
            "Publication year": 2020,
            "Publication url": "https://www.scitepress.org/Papers/2020/91745/91745.pdf",
            "Abstract": "Monitoring and analysis of human sentiments is currently one of the hottest research topics in the field of human-computer interaction, having many applications. However, in order to become practical in daily life, sentiment recognition techniques should analyze data collected in an unobtrusive way. For this reason, analyzing audio signals of human speech (as opposed to say biometrics) is considered key to potential emotion recognition systems. In this work, we expand upon previous efforts to analyze speech signals using computer vision techniques on their spectrograms. In particular, we utilize ORB descriptors on keypoints distributed on a regular grid over the spectrogram to obtain an intermediate representation. Firstly, a technique similar to Bag-of-Visual-Words (BoVW) is used, where a visual vocabulary is created by clustering keypoint descriptors, but instead a soft candidacy score is used to construct the histogram descriptors of the signal. Furthermore, a technique which takes into account the temporal structure of the spectrograms is examined, allowing for effective model regularization. Both of these techniques are evaluated in several popular emotion recognition datasets, with results indicating an improvement over the simple BoVW method.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multimodal e-learning environment for orthopedics: design and implementation challenges",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6689047/",
            "Abstract": "We present a Web-based multimedia e-learning platform used to train orthopedic doctors and medical engineers interested in human motion analysis. The platform has evolved from a previous e-learning environment used for e-learning related to breast pathology. We summarize the technological developments that allow for more flexibility and better user experience related to our previous work. We also report on the incorporation of best practices that lead to these desirable results. The architecture of the platform is described, along with its main modules, namely the LMS, the tool used for authoring the multimedia content and the training interactive multimedia environment. The e-learning environment, which is ubiquitously accessible via the web and platform independent, allows for the efficient coupling of medical and engineering theory with real clinical case studies and the multimedia content (images,videos …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:cWzG1nlazyYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SHREC'08 Entry: 2D/3D Hybrid",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4547990/",
            "Abstract": "In this paper, we present an overview of the 3D object retrieval method that we employed in our participation to the generic models track of SHREC 2008 organized by the AIM@SHAPE network of excellence. The proposed methodology is detailed in [2]. Our method is based on a hybrid scheme where 2D features as well as 3D features are extracted from a 3D model which has been previously normalized for rotation using two alternative alignment techniques. The alignment methods that are used are CPCA and NPCA. The 2D features are Fourier coefficients extracted from a set of depth buffers and the 3D features are spherical harmonic coefficients extracted from a spherical function-based representation of a 3D model.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "LSISOM—A Latent Semantic Indexing Approach to Self-Organizing Maps of Document Collections",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:NEPL.0000023449.95030.8f",
            "Abstract": "The Self Organizing Map (SOM) algorithm has been utilized, with much success, in a variety of applications for the automatic organization of full-text document collections. A great advantage of the SOM method is that document collections can be ordered in such a way so that documents with similar content are positioned at nearby locations of the 2-dimensional SOM lattice. The resulting ordered map thus presents a general view of the document collection which helps the exploration of information contained in the whole document space. The most notable example of such an application is the WEBSOM method where the document collection is ordered onto a map by utilizing word category histograms for representing the documents data vectors. In this paper, we introduce the LSISOM method which resembles WEBSOM in the sense that the document maps are generated from word category histograms …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:4DMP91E08xMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A novel Web image processing algorithm for text area identification that helps commercial OCR engines to improve their Web image recognition efficiency",
            "Publication year": 2003,
            "Publication url": "https://138.253.184.233/research/other/wda2003/Papers/Section_IV/Paper_14.pdf",
            "Abstract": "In this paper, a novel Web image processing algorithm is presented for text area identification. Statistics show that a significant part of Web text information is encoded in Web images. Since Web images have special characteristics that sometimes distinguish them from other types of images, commercial OCR products often fail to recognize Web images due to their special key characteristics. This paper proposes a novel Web image processing algorithm that aims to locate text areas and prepare them for OCR procedure with best results. According to this algorithm, first the Web color image is converted to gray scale in order to record the transitions of brightness that are perceived by the human eye. Then, an edge extraction technique facilitates the extraction of all objects as well as of all inverted objects. A conditional dilation technique applied with several iterations helps to choose text and inverted text objects among all objects. Experimental results, obtained from a large corpus of Web images, demonstrate the improvement in recognition accuracy after applying the proposed text area identification algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dopamine modification of climbing activity in a neural accumulator model of the antisaccade task",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10019850610/",
            "Abstract": "CiNii 論文 - Dopamine modification of climbing activity in a neural accumulator model of the \nantisaccade task CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文\nあり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 \n参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について Dopamine \nmodification of climbing activity in a neural accumulator model of the antisaccade task \nKAHRAMANOGLOU I. 被引用文献: 1件 著者 KAHRAMANOGLOU I. 収録刊行物 1st Annual \nconference of computational cognitive neuroscience, 2005 1st Annual conference of \ncomputational cognitive neuroscience, 2005, 2005 被引用文献: 1件中 1-1件を 表示 1 A \nneural model of decision-making by the superior colicullus in an antisaccade task \nCUTSURIDIS Vassilis , SMYRNIS Nikolaos , , : (/…",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deep learned features for image retrieval",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201044",
            "Abstract": "A novel approach for feature learning using deep learning is presented. More specifically, a Convolutional Neural Network that is trained using feature correspondences learns to map a given image patch to a descriptor. Therefore, descriptors are directly learned from examples instead of being hand-crafted. The proposed approach is evaluated in a challenging image retrieval dataset.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:SpbeaW3--B0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A dynamical model for the analysis and acceleration of learning in feedforward networks",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0893608001000521",
            "Abstract": "A dynamical system model is derived for feedforward neural networks with one layer of hidden nodes. The model is valid in the vicinity of flat minima of the cost function that rise due to the formation of clusters of redundant hidden nodes with nearly identical outputs. The derivation is carried out for networks with an arbitrary number of hidden and output nodes and is, therefore, a generalization of previous work valid for networks with only two hidden nodes and one output node. The Jacobian matrix of the system is obtained, whose eigenvalues characterize the evolution of learning. Flat minima correspond to critical points of the phase plane trajectories and the bifurcation of the eigenvalues signifies their abandonment. Following the derivation of the dynamical model, we show that identification of the hidden nodes clusters using unsupervised learning techniques enables the application of a constrained application …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Use of Sentinel-1 data for maritime domain awareness: Preliminary results",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388021/",
            "Abstract": "In this work the utility of Synthetic Aperture Radar (SAR) data acquired from the SAR instrument on-board the recently launched ESA's Sentinel-1 to Maritime Domain Awareness (MDA) is studied. The limitations of the currently used Automatic Identification System (AIS) for ships is presented. The use of space based SAR sensors for MDA is discussed and the recently available ESA's Sentinel1 satellite is considered in more detail. An automatic methodology for ship detection from Sentinel-1 is presented and applied in the environmentally important sea straits between Kythera and Elafonisos islands, Southern Greece. Preliminary results show that Sentinel1 has a significant role to play in MDA.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:Dip1O2bNi0gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Greek Handwritten character recognition",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.81.7075&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present a database and methods for off-line isolated Greek handwritten character recognition. The Computational Intelligence Laboratory (CIL) Database consists of 35,000 isolated and labelled Greek handwritten characters. This database was tested with an existing structural approach for Greek handwritten characters as well as with a novel approach based on a hybrid feature extraction scheme. According to this approach, two types of features are combined in a hybrid fashion. The first one divides the character image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, the area that is formed from the projections of the upper and lower as well as of the left and right character profiles is calculated. For the classification step, Support Vectors Machines (SVM) and Euclidean Minimum Distance Classifier (EMDC) are used.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Web-based E-training Platform for biomedical engineering education",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6969889/",
            "Abstract": "This paper presents the results of the Leonardo da Vinci project (Transfer of Innovation), named “A Web-based E-Training Platform for Extended Human Motion Investigation in Orthopaedics”. The project addresses to medical and engineering professionals, proposing formation of specialists that will systematically apply the principles of medical and bioengineering sciences in finding solutions that will lead in improving health conditions. The main outcome of the project was a Virtual Training & Communication Centre ORTHO-eMAN for innovative education - on-line educational and training material accessed via a standard web browser, which provides an integrated on-line learning environment. Interactivity allows trainees to test their knowledge and provides immediate feedback using images and cases that they might encounter in clinical practice.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:dBIO0h50nwkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unsupervised watershed-driven region-based image retrieval",
            "Publication year": 2006,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-vis_20050061",
            "Abstract": "A novel unsupervised strategy for content-based image retrieval is presented. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the earth mover's distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts meaningful regions automatically. In this framework, the proposed robust feature extraction and the many-to-many region matching along with the novel region weighting for enhancing feature discrimination play a major role. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:FPJr55Dyh1AC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Hybrid Method and System for Content-based 3D Model Search",
            "Publication year": 2009,
            "Publication url": "https://patents.google.com/patent/US20090157649A1/en",
            "Abstract": "The present disclosure concerns a hybrid content-based 3D model search and retrieval method for queries in generic 3D model datasets. The hybrid nature of the method is two-fold. First, a combination of 2D and 3D features is used as the shape descriptor of a 3D model and second, two alternative alignment techniques, CPCA and NPCA, are employed for rotation normalization. The 2D features are Fourier coefficients extracted from three pairs of depth buffers which are computed for each Cartesian plane capturing the model's thickness along each axis. The 3D features are spherical harmonic coefficients extracted from a spherical function based representation that captures the model's surface as well as volume information.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emotion Recognition from Speech: A Survey.",
            "Publication year": 2019,
            "Publication url": "https://www.scitepress.org/Papers/2019/84950/84950.pdf",
            "Abstract": "Emotion recognition from speech signals is an important field in its own right as well as a mainstay of many multimodal sentiment analysis systems. The latter may as well include a broad spectrum of modalities which are strongly associated with consciously or subconsciously communicating human emotional state such as visual cues, gestures, body postures, gait, or facial expressions. Typically, emotion discovery from speech signals not only requires considerably less computational complexity than other modalities, but also at the same time in the overwhelming majority of studies the inclusion of speech modality increases the accuracy of the overall emotion estimation process. The principal algorithmic cornerstones of emotion estimation from speech signals are Hidden Markov Models, time series modeling, cepstrum processing, and deep learning methodologies, the latter two being prime examples of higher order data processing. Additionally, the most known datasets which serve as emotion recognition benchmarks are described.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SHREC'08 Entry: Hybrid IIT-NCSR-Demokritos",
            "Publication year": 2008,
            "Publication url": "https://hal.inria.fr/hal-00759007/",
            "Abstract": "In this paper, we present an overview of the 3D object retrieval method that we employed in our participation to the Generic Models track of SHREC 2008 organized by the AIM@ SHAPE network of excellence. The proposed methodology is detailed in [2]. Our method is based on a hybrid scheme where 2D features as well as 3D features are extracted from a 3D model which has been previously normalized for rotation using two alternative alignment techniques. The alignment methods that are used are CPCA and NPCA. The 2D features are Fourier coefficients extracted from a set of depth buffers and the 3D features are spherical harmonic coefficients extracted from a spherical function-based representation of a 3D model.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic unsupervised parameter selection for character segmentation",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1815330.1815383",
            "Abstract": "A major difficulty for designing a document image segmentation methodology is the proper value selection for all involved parameters. This is usually done after experimentations or after involving a training supervised phase which is a tedious process since the corresponding segmentation ground truth has to be created. In this paper, we propose a novel automatic unsupervised parameter selection methodology that can be applied to the character segmentation problem. It is based on clustering of the entities obtained as a result of the segmentation for different values of the parameters involved in the segmentation method. The clustering is performed using features extracted from the segmented entities based on zones and from the area that is formed from the projections of the upper/lower and left/right profiles. Optimization of an appropriate intra-class distance measure yields the optimal parameter vector. The …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Text detection in indoor/outdoor scene images",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/38302259/cbdar2005.pdf",
            "Abstract": "In this paper, we propose a novel methodology for text detection in indoor/outdoor scene images. The proposed methodology is based on an efficient binarization and enhancement technique followed by a suitable connected component analysis procedure. Image binarization successfully process indoor/outdoor scene images having shadows, non-uniform illumination, low contrast and large signal-depended noise. Connected component analysis is used to define the final binary images that mainly consist of text regions. The proposed methodology leads in increased success rates at commercial OCR engines. Experimental results based on the public database of the ICDAR2003 Robust Reading Competition prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Innovative feature selection used in multispectral imagery classification for water quality monitoring",
            "Publication year": 2004,
            "Publication url": "https://www.isprs.org/proceedings/xxxv/congress/comm7/papers/254.pdf",
            "Abstract": "This paper concerns the evaluation of a feature selection and classification techniques for land cover classification and potential monitoring of temporal changes. For the purposes of our study, an ASTER satellite image was used, acquired on 5 October, 2001, with 14 spectral bands resampled at the spatial resolution of 15 m. The study area concerns the geographic area of the water basin of Lake Vegoritis, that is located in the northern part of Greece. A variety of industrial and agricultural activities take place in the Vegoritis lake basin, which result to constant lowering of the lake water table and the change of land use, and subsequently, lead to degrading of the lake environment.Besides the intensity level of the original bands, several features were created including spectral indices (eg NDVI), band ratios and products among selected bands, and Haralick texture features together with their second order combinations. The total of the features was used as input to a novel feature selection process, the Greedy Non-Redundant (GreeNRed) feature selection algorithm. This algorithm is based on information theory, and greedily selects features with no redundant information. The algorithm succeeded in keeping the complexity at low levels by restraining evaluations in one-dimensional feature spaces, whereas non-redundancy is achieved by a boosting-like sample weighting.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A learning framework for neural networks using constrained optimization methods",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1019240304484",
            "Abstract": "Conventional supervised learning in neural networks is carried out by performing unconstrained minimization of a suitably defined cost function. This approach has certain drawbacks, which can be overcome by incorporating additional knowledge in the training formalism. In this paper, two types of such additional knowledge are examined: Network specific knowledge (associated with the neural network irrespectively of the problem whose solution is sought) or problem specific knowledge (which helps to solve a specific learning task). A constrained optimization framework is introduced for incorporating these types of knowledge into the learning formalism. We present three examples of improvement in the learning behaviour of neural networks using additional knowledge in the context of our constrained optimization framework. The two network specific examples are designed to improve convergence and …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Hybrid off-line OCR for isolated handwritten Greek characters",
            "Publication year": 2007,
            "Publication url": "https://users.iit.demokritos.gr/~bgat/SPPRA_HOCR.pdf",
            "Abstract": "In this paper, we present an off-line OCR methodology for isolated handwritten Greek characters mainly based on a robust hybrid feature extraction scheme. First, image pre-processing is performed in order to normalize the character images as well as to correct character slant. At the next step, two types of features are combined in a hybrid fashion. The first one divides the character image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, the area that is formed from the projections of the upper and lower as well as of the left and right character profiles is calculated. For the classification step Support Vectors Machines (SVM) are used. The performance of the proposed methodology is demonstrated after testing with the CIL database (handwritten Greek character database), which was created from 100 different writers.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A two-step dewarping of camera document images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669963/",
            "Abstract": "Dewarping of camera document images has attracted a lot of interest over the last few years since warping not only reduces the document readability but also affects the accuracy of an OCR application. In this paper, a two-step approach for efficient dewarping of camera document images is presented. At a first step, a coarse dewarping is accomplished with the help of a transformation model which maps the projection of a curved surface to a 2D rectangular area. The projection of the curved surface is delimited by the two curved lines which fit the top and bottom text lines along with the two straight lines which fit to the left and right text boundaries. At a second step, fine dewarping is achieved based on words detection. All words are pose normalized guided by the lower and upper word baselines. Experimental results on several camera document images demonstrate the robustness and effectiveness of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:edDO8Oi4QzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantics extraction from multimedia data: an ontology-based machine learning approach",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-1452-1_12",
            "Abstract": "It is often the case that related pieces of information lie in adjacent but different types of data sources. Besides extracting such information from each particular type of source, an important issue raised is how to put together all the pieces of information extracted by each source, or, more generally, what is the optimal way to collectively extract information, considering all media sources together. This chapter presents a machine learning method for extracting complex semantics stemming from multimedia sources. The method is based on transforming the inference problem into a graph expansion problem, expressing graph expansion operators as a combination of elementary ones and optimally seeking elementary graph operators. The latter issue is then reduced to learn a set of soft classifiers, based on features each one corresponding to a unique graph path. The advantages of the method are …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Unobtrusive low-cost physiological monitoring using visual information",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/unobtrusive-low-cost-physiological-monitoring-using-visual-information/129282",
            "Abstract": "This chapter describes efficient visual analysis methods towards the unobtrusive monitoring of elderly people using common low-cost hardware. In particular, two real-time approaches are demonstrated for (a) Pupil Size Estimation and (b) Pulse Rate Estimation. In both cases, a main concern in the development has been to keep low the overall complexity, so that the hosting hardware that executes the proposed methods is left with free resources, in order to be able to also execute other processes in the context of a health monitoring framework. In addition, all experiments have been carried out using typical, low-cost visual sensors, ie simple webcams. Finally, the respective benchmarks needed to evaluate the two methodologies are described in this chapter.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:5qfkUJPXOUwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Text area identification in web images",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_10",
            "Abstract": "With the explosive growth of the World Wide Web, millions of documents are published and accessed on-line. Statistics show that a significant part of Web text information is encoded in Web images. Since Web images have special characteristics that sometimes distinguish them from other types of images, commercial OCR products often fail to recognize Web images due to their special characteristics. This paper proposes a novel Web image processing algorithm that aims to locate text areas and prepare them for OCR procedure with better results. Our methodology for text area identification has been fully integrated with an OCR engine and with an Information Extraction system. We present quantitative results for the performance of the OCR engine as well as qualitative results concerning its effects to the Information Extraction system. Experimental results obtained from a large corpus of Web images …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Parametric Analysis of Ionic and Synaptic Current Conductances in a Neural Accumulator Model with Variable Climbing Activity",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=8770585423344443209&hl=en&oi=scholarr",
            "Abstract": "Accumulator models are used to explain cognitive mechanisms of reaction timing [1]. In accumulator models, upon the onset of an external stimulus an internal signal grows linearly with time until it reaches and exceeds a preset threshold level [2]. Reaction time is defined as the time between the onset of the external stimulus ‘till the crossing of the threshold level. Some neural models have addressed the question of what produces the linearity of the climbing activity [3], whereas others were concerned with the functional role of the climbing activity of cortical neurons [4]. However, no one has ever attempted to answer the question of what are the biophysical mechanisms underlying the generation of slowly variable climbing, temporal integrator-like activity.Herein, detailed parametric analysis of the maximal conductances of all ionic and synaptic currents in two cortical networks of pyramidal neurons and inhibitory …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Protrusion-oriented 3D mesh segmentation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-009-0383-8",
            "Abstract": "In this paper, we present a segmentation algorithm which partitions a mesh based on the premise that a 3D object consists of a core body and its constituent protrusible parts. Our approach is based on prominent feature extraction and core approximation and segments the mesh into perceptually meaningful components. Based upon the aforementioned premise, we present a methodology to compute the prominent features of the mesh, to approximate the core of the mesh and finally to trace the partitioning boundaries which will be further refined using a minimum cut algorithm. Although the proposed methodology is aligned with a general framework introduced by Lin et al. (IEEE Trans. Multimedia 9(1):46–57, 2007), new approaches have been introduced for the implementation of distinct stages of the framework leading to improved efficiency and robustness. The evaluation of the proposed algorithm is …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:DJbcl8HfkQkC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Representation and Analysis of Multimedia Content: The BOEMIE Proposal",
            "Publication year": 2006,
            "Publication url": "http://lrec-conf.org/proceedings/lrec2006/workshops/W07/piperidis.pdf#page=36",
            "Abstract": "We propose an approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multimedia content, and uses the extracted information to evolve the ontologies. We present the basic components of the proposed approach, describe an application scenario we currently examine, and discuss the open research issues focusing on knowledge representation and extraction techniques that will enable the development of scalable and precise knowledge acquisition technology.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hierarchical classification of handwritten characters based on novel structural features",
            "Publication year": 2008,
            "Publication url": "https://users.iit.demokritos.gr/~bgat/cr1117.pdf",
            "Abstract": "In this paper, we present a methodology for off-line handwritten character/digit recognition. The proposed methodology relies on a new feature extraction technique based on recursive subdivisions of the image as well as on calculation of the centre of masses of each sub-image. Feature extraction is followed by a hierarchical classification scheme based on the level of granularity of the feature extraction method. Pairs of classes with high values in the confusion matrix are merged at a certain level and higher level granularity features are employed for distinguishing them. A handwritten character database as well as a handwritten digit database is used in order to demonstrate the efficiency of the proposed technique.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Human action recognition with deep learning techniques",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3389189.3397652",
            "Abstract": "We aim to provide an approach for human action recognition, based on combination of transfer knowledge from pre-trained deep network architectures and knowledge from another modality using the same deep network without pre-trained weights. Upon fine tuning networks that have been trained within a similar context, we evaluate our approach on a dataset that is formed by medical conditions and demonstrate the potential of our approach in challenging cross-subject and cross-setup real-like scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting social media information toward a context-aware recommendation system",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s13278-017-0459-9",
            "Abstract": "The rise of the social networks during the last few years has provided a vast amount of knowledge in several domains. Among them, route planning and point-of-interest recommendation have significantly benefited. Seen from the side of a tourist, they consist two challenging and time-consuming tasks since they may rely on many parameters and are limited by several constraints, such as time and budget available, user preferences, etc. In this paper we present Xenia, a context-aware system that works toward solving the aforementioned problems. More specifically, it aims to automatically construct travel routes, i.e., ordered visits to various places-of-interest. The user (tourist) indicates an initial and an ending point and her/his available time budget and the system proposes travel routes that maximize her/his travel experience, while adhering to the aforementioned limitations. This particular route planning …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:GtLg2Ama23sC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "Improved Jacobian Eigen-analysis scheme for accelerating learning in feedforward neural networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s12559-014-9263-2.pdf",
            "Abstract": "An important problem in the learning process when training feedforward artificial neural networks is the occurrence of temporary minima which considerably slows down learning convergence. In a series of previous works, we analyzed this problem by deriving a dynamical system model which is valid in the vicinity of temporary minima caused by redundancy of nodes in the hidden layer. We also demonstrated how to incorporate the characteristics of the dynamical model into a constrained optimization algorithm that allows prompt abandonment of temporary minima and acceleration of learning. In this work, we revisit the constrained optimization framework in order to develop a closed-form solution for the evolution of critical dynamical system model parameters during learning in the vicinity of temporary minima. We show that this formalism is equivalent to matrix perturbation theory which was discussed in a …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:umqufdRvDiIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Hand shape and 3D pose estimation using depth data from a single cluttered frame",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33179-4_15",
            "Abstract": "This paper describes a method that, given an input image of a person signing a gesture in a cluttered scene, locates the gesturing arm, automatically detects and segments the hand and finally creates a ranked list of possible shape class, 3D pose orientation and full hand configuration parameters. The clutter-tolerant hand segmentation algorithm is based on depth data from a single image captured with a commercially available depth sensor, namely the Kinect  TM . Shape and 3D pose estimation is formulated as an image database retrieval method where given a segmented hand the best matches are extracted from a large database of synthetically generated hand images. Contrary to previous approaches this clutter-tolerant method is all-together: user-independent, automatically detects and segments the hand from a single image (no multi-view or motion cues employed) and …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:DUooU5lO8OsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Integration of Intelligent Techniques for Environmental Data Processing",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=SXx8r3RgE04C&oi=fnd&pg=PA301&dq=info:_nzUbKSyqD8J:scholar.google.com&ots=trifTc_IOP&sig=9rgqOXIGEcnElD1WZXs-209qYGc",
            "Abstract": "In this paper, some aspects of the usefulness of intelligent techniques in environmental data processing are discussed. The capabilities of neural networks in improving memory requirements for storage of environmental data and the increase in processing speed are analyzed. Finally, a software package for processing multi-source (geophysical, geochemical, satellite, etc.) data using various neural, fuzzy, multimodular, pattern-recognition and image processing algorithms is presented.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Detection of clothes change fusing color, texture, edge and depth information",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-25915-4_20",
            "Abstract": "Changing clothes is a basic activity of daily living (ADL) which may be used as a measurement of the functional status of e.g. an elderly person, or a person with certain disabilities. In this paper we propose a methodology for the detection of when a human has changed clothes. Our non-contact unobtrusive monitoring system is built upon the Microsoft Kinect depth camera. It uses the OpenNI SDK to detect a human skeleton and extract the upper and lower clothes’ visual features. Color, texture and edge descriptors are then extracted and fused. We evaluate our system on a publicly available set of real recordings for several users and under various illumination conditions. Our results show that our system is able to successfully detect when a user changes clothes, thus to assess the quality of the corresponding ADL.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:q3CdL3IzO_QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Advances in Artificial Intelligence: Theories, Models, and Applications: 6th Hellenic Conference on AI, SETN 2010, Athens, Greece, May 4-7, 2010. Proceedings",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zcW9PMKKfScC&oi=fnd&pg=PR3&dq=info:_Np39wZ8kAsJ:scholar.google.com&ots=oZgKvn5nqm&sig=ljLuTfFe-pj0WDv7sElTFqFXHWY",
            "Abstract": "Arti? cial intelligence (AI) is a dynamic? eld that is constantly expanding into new application areas, discovering new research challenges, and facilitating the development of innovative products. Today's AI tools might not pass the Turing test, but they are invaluable aids in organizing and sorting the ever-increasing volume, complexity, andheterogeneityofknowledgeavailabletousinourrapidly changing technological, economic, cultural, and social environment. This volumeaimsatbringing to the readerallthe latest developmentsin this exciting and challenging? eld, and contains papers selected for presentation at the 6th Hellenic Conference on Arti? cial Intelligence (SETN 2010), the o? cial meeting of the Hellenic Society for Arti? cial Intelligence (EETN). SETN 2010 was organized by the Hellenic Society of Arti? cial Intelligence and the Institute of Informatics and Telecommunications, NCSR'Demokritos' and took place in Athens during May 4-7. Previousconferences were held at the University of Piraeus (1996), at the Aristotle University of Thessaloniki (2002), attheUniversityoftheAegean (Samos, 2004, andSyros, 2008), andjointlyatthe Foundation for Research and Technology-Hellas (FORTH) and the University of Crete (2006). SETN conferences play an important role in disseminating innovative and high-qualityscienti? c results by AI researchers, attractingnot only EETNm-bers but also scientists advancing and applying AI in many and diverse domains and from various Greek and international institutes. However, the most imp-tant aspect of SETN conferences is that they provide the context in which AI researchers meet and discuss their work, as …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Efficient 3D shape matching and retrieval using a concrete radialized spherical projection representation",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320307000106",
            "Abstract": "We present a 3D shape retrieval methodology based on the theory of spherical harmonics. Using properties of spherical harmonics, scaling and axial flipping invariance is achieved. Rotation normalization is performed by employing the continuous principal component analysis along with a novel approach which applies PCA on the face normals of the model. The 3D model is decomposed into a set of spherical functions which represents not only the intersections of the corresponding surface with rays emanating from the origin but also points in the direction of each ray which are closer to the origin than the furthest intersection point. The superior performance of the proposed methodology is demonstrated through a comparison against state-of-the-art approaches on standard databases.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Hybrid off-line cursive handwriting word recognition",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1699375/",
            "Abstract": "In this paper, we present an off-line cursive word handwriting recognition methodology. This is based on an additive fusion resulted after a novel combination of two different modes of word image normalization and robust hybrid feature extraction. We employ two types of features in a hybrid fashion. The first one, divides the word image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, we calculate the area that is formed from the projections of the upper and lower profile of the word. The performance of the proposed methodology is demonstrated after testing with the reference IAM cursive handwriting database",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:4fGpz3EwCPoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A method for combining complementary techniques for document image segmentation",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003132030800441X",
            "Abstract": "Image segmentation is a major task of handwritten document image processing. Many of the proposed techniques for image segmentation are complementary in the sense that each of them using a different approach can solve different difficult problems such as overlapping, touching components, influence of author or font style etc. In this paper, a combination method of different segmentation techniques is presented. Our goal is to exploit the segmentation results of complementary techniques and specific features of the initial image so as to generate improved segmentation results. Experimental results on line segmentation methods for handwritten documents demonstrate the effectiveness of the proposed combination method.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Multiple-Input Describing Functions and Nonlinear System Design Multiple-Input Describing Functions and Nonlinear System Design, 1968",
            "Publication year": 2001,
            "Publication url": "https://ci.nii.ac.jp/naid/10007448129/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no title> GELB A. \n被引用文献: 2件 著者 GELB A. 収録刊行物 Multiple-Input Describing Functions and Nonlinear \nSystem Design Multiple-Input Describing Functions and Nonlinear System Design, 1968 \nMcGraw-Hill 被引用文献: 2件中 1-2件を 表示 1 Dynamics of multilayer networks in the vicinity \nof temporary minima AMPAZIS Nikolaos , PERANTONIS SJ , TAYLOR JG Neural networks : \nthe official journal of the International Neural Network Society 12(1), 43-58, 1999-01-01 参考\n文献25件 被引用文献3件 2 NQG/H_∞/LTR Control for a Hard Nonlinear Servo System Han Ik …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A segmentation-free approach for keyword search in historical typewritten documents",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1575509/",
            "Abstract": "In this paper, we propose a novel segmentation-free approach for keyword search in historical typewritten documents combining image preprocessing, synthetic data creation, word spotting and user feedback technologies. Our aim is to search for keywords typed by the user in a large collection of digitized typewritten historical documents. The proposed method is based on: (i) image preprocessing for image binarization and enhancement, noisy border and frame removal, orientation and skew correction; (ii) creation of synthetic image words from keywords typed by the user; (Hi) word segmentation using dynamic parameters; (iv) efficient feature extraction for each image word and (v) a retrieval procedure that is optimized by user's feedback. Experimental results prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient binarization of historical and degraded document images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669993/",
            "Abstract": "This paper presents a new adaptive approach for the binarization and enhancement of historical and degraded documents. The proposed method is based on (i) efficient pre-processing; (ii) the combination of the results of several state-of-the-art binarization methodologies; (iii) the incorporation of edge information and (iv) the application of efficient image post-processing based on mathematical morphology for the enhancement of the final result. The proposed method demonstrated superior performance against six well-known techniques on numerous historical handwritten and machine-printed documents mainly from the Library of Congress of the United States archive. The performance evaluation was based on a consistent and concrete methodology.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Athens urban soundscape (athus): a dataset for urban soundscape quality recognition",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-05710-7_28",
            "Abstract": "Soundscape can be regarded as the auditory landscape, conceived individually or at collaborative level. This paper presents ATHUS (ATHens Urban Soundscape), a dataset of audio recordings of ambient urban sounds, which has been annotated in terms of the corresponding perceived soundscape quality. To build our dataset, several users have recorded sounds using a simple smartphone application, which they also used to annotate the recordings, in terms of the perceived quality of the soundscape (i.e. level of “pleasantness”), in a range of 1 (unbearable) to 5 (optimal). The dataset has been made publicly available (in                      http://users.iit.demokritos.gr/~tyianak/soundscape                                        ) as an audio feature representation form, so that it can directly be used in a supervised machine learning pipeline without need for feature extraction. In addition, this paper presents and publicly …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:rmuvC79q63oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On the use of spatial relations between objects for image classification",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-74161-1_38",
            "Abstract": "Image classification is addressed in this paper by utilizing spatial relation of detected objects in a rule-based fashion. Instances of particular object classes are detected combining bottom-up (learn-able models based on simple features) and top-down information(object models consisting of primitive geometric shapes such as lines). The rule-based system acts as a model for the spatial configuration of objects, also providing a human interpretable justification of image classification. Experimental results in the athletic domain show that despite inefficiencies in object detection, spatial relations allow for efficient discrimination between visually similar images classes.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:UxriW0iASnsC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Linking article parts for the creation of newspaper digital library.",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.478.9293&rep=rep1&type=pdf",
            "Abstract": "An important issue pertaining to the retro-conversion of newspapers, ie the conversion of newspaper issues into digital resources, is the identification and appropriate digital representation of an article. To complete this task, a number of steps have to be followed, from segmentation of the newspaper image to optical character recognition and linking of different items belonging to the same article. In this paper, an evaluation of different information retrieval techniques is presented that aim at linking textual parts of an article that can be found on different pages of a newspaper issue. Three document matching techniques are evaluated, namely title-to-title, title-to-text and text-to-text matching. In addition, the effect on the matching accuracy of using a stemmer and of employing appropriate conflict resolution techniques is studied for each of the above approaches. Experimental results involving a number of issues of a Greek newspaper show that the best technique, namely text-to-text matching augmented with a stemmer and conflict resolution, can reach a high linking accuracy rate of 96%.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hierarchical feature fusion for visual tracking",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4379578/",
            "Abstract": "A new method for object tracking in video sequences is presented. This method exploits the benefits of particle filters to tackle the multimodal distributions emerging from cluttered scenes. The tracked object is described by several models of different complexity, which are probabilistically linked together. The parameter update for each model takes place hierarchically so that the simpler models, which are updated first, can guide the search in the parameter space of the more complex models to relevant regions. This strategy improves the target representation because of the multiple models and reduces the overall complexity. The likelihood for each object model is calculated using one or more visual cues thus increasing the robustness of the proposed algorithm. Our method is evaluated by fusing on salient points and contour models and we demonstrate its effectiveness.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Panorama: A 3d shape descriptor based on panoramic views for unsupervised 3d object retrieval",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11263-009-0281-6",
            "Abstract": "We present a novel 3D shape descriptor that uses a set of panoramic views of a 3D object which describe the position and orientation of the object’s surface in 3D space. We obtain a panoramic view of a 3D object by projecting it to the lateral surface of a cylinder parallel to one of its three principal axes and centered at the centroid of the object. The object is projected to three perpendicular cylinders, each one aligned with one of its principal axes in order to capture the global shape of the object. For each projection we compute the corresponding 2D Discrete Fourier Transform as well as 2D Discrete Wavelet Transform. We further increase the retrieval performance by employing a local (unsupervised) relevance feedback technique that shifts the descriptor of an object closer to its cluster centroid in feature space. The effectiveness of the proposed 3D object retrieval methodology is demonstrated via an …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:-FonjvnnhkoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Feature deforming for improved similarity-based learning",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_22",
            "Abstract": "The performance of similarity-based classifiers, such as K-nn, depends highly on the input space representation, both regarding feature relevence and feature interdependence. Feature weighting is a known technique aiming at improving performance by adjusting the importance of each feature at the classification decision. In this paper, we propose a non-linear feature transform for continuous features, which we call feade. The transform is applied prior to classification providing a new set of features, each one resulting by deforming in a local base the original feature according to a generalised mutual information metric for different regions of the feature value range. The algorithm is particularly efficient because it requires linear complexity in respect to the dimensions and the sample and does not need other classifier pre-training. Evaluation on real datasets shows an improvement in the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient skew detection of printed document images based on novel combination of enhanced profiles",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10032-014-0228-5.pdf",
            "Abstract": "Document skew is often introduced during the capturing process of the document image processing pipeline and may seriously affect the performance of subsequent stages of segmentation and recognition. Skew detection is often accomplished with the use of horizontal projections, while recently, a new approach that is based on vertical projections has been introduced. In this paper, we use the technique of minimum bounding box area in order to combine a horizontal with a new reinforced vertical projection profile method. We are motivated by the fact that the horizontal and the novel vertical projection profiles are found to be complementary to each other. We claim that the proposed approach has more accurate performance compared with other state-of-the-art skew detection algorithms; it deals with all the drawbacks of the projection profile methods; it is more noise and warp resistant and gives accurate …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:IRz6iEL74y4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Modeling the effects of dopamine on the antisaccade reaction times (aSRT) of schizophrenia patients",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87559-8_30",
            "Abstract": "In the antisaccade task, subjects are instructed to look in the opposite direction of a visually presented stimulus. Controls can perform this task successfully with very few errors, whereas schizophrenia patients make more errors and their responses are slower and more variable. It has been proposed the fundamental cognitive dysfunction in schizophrenia involves prefrontal dopaminergic hypoactivity. We examine via computer simulations the effects of dopamine on the variability of aSRTs in a neural cortico-collicular accumulator model with stochastic climbing activity. We report the simulated aSRTs for the hypo-DA level have higher standard deviation and mean values than in the normal and hyper DA level. The simulated higher mean and standard deviation for the hypo-DA group resemble the performance differences in the antisaccade task observed in patients with schizophrenia and are in accordance …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:4vMrXwiscB8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "3D articulated object retrieval using a graph-based representation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-010-0523-1",
            "Abstract": "In this paper, a retrieval methodology for 3D articulated objects is presented that relies upon a graph-based object representation. The methodology is composed of a mesh segmentation stage which creates the Attributed Relation Graph (ARG) of the object along with a graph matching algorithm which matches two ARGs. The graph matching algorithm is based on the Earth Movers Distance (EMD) similarity measure calculated with a new ground distance assignment. The superior performance of the proposed retrieval methodology against state-of-the-art approaches is shown by extensive experimentation that comprise the application of various geometric descriptors representing the components of the 3D objects that become the node attributes of the ARGs as well as alternative mesh segmentation approaches for the extraction of the object parts. The performance evaluation is addressed in both …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Non-Redundant Feature Selection of Multi-Band Remotely Sensed Images for Land Cover Classification",
            "Publication year": 2003,
            "Publication url": "https://users.iit.demokritos.gr/~exarou/PAPERS/petridgreenred.pdf",
            "Abstract": "This article presents a novel algorithm for feature selection applied to the land cover classification based on multi-band remotely sensed images. The algorithm is based on information theory, greedily select features with no redundant information, avoiding however evaluations in the joint space of features. Experimental comparison with texture features extracted from 14 bands shows the efficiency of the algorithm with respect to plain greedy feature selection",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building block extraction and classification by means of aerial images fused with super-resolution reconstructed elevation data",
            "Publication year": 2017,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Journal-of-Applied-Remote-Sensing/volume-11/issue-4/045004/Building-block-extraction-and-classification-by-means-of-aerial-images/10.1117/1.JRS.11.045004.short",
            "Abstract": "The detailed three-dimensional modeling of buildings utilizing elevation data, such as those provided by light detection and ranging (LiDAR) airborne scanners, is increasingly demanded today. There are certain application requirements and available datasets to which any research effort has to be adapted. Our dataset includes aerial orthophotos, with a spatial resolution 20 cm, and a digital surface model generated from LiDAR, with a spatial resolution 1 m and an elevation resolution 20 cm, from an area of Athens, Greece. The aerial images are fused with LiDAR, and we classify these data with a multilayer feedforward neural network for building block extraction. The innovation of our approach lies in the preprocessing step in which the original LiDAR data are super-resolution (SR) reconstructed by means of a stochastic regularized technique before their fusion with the aerial images takes place. The Lorentzian …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:0KyAp5RtaNEC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "自适应模糊文件图像的二值化",
            "Publication year": 2006,
            "Publication url": "http://www.cqvip.com/qk/95216x/200601/22352170.html",
            "Abstract": " 本文提出了一种新的自适应二值化方法,使模糊文件得到增强.这种方法不需要调整任何参数,它通过使用者及其对阴影,非均匀图像,低反差,大量的信号噪声,污点和变形等涉及的模糊情况,采用以下几个不同的步骤:低通Wiener滤波器的预处理,前景区域,背景表面的大致估算,背景表面与原始组合图像样本的组合计算以及最后的预处理过程,以改善文件的质量并保持笔划的连接.实验证明,本文的方法针对许多模糊图像具有优良的特性.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient segmentation-free approach to assist old Greek handwritten manuscript OCR",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-005-0013-7",
            "Abstract": "Recognition of old Greek manuscripts is essential for quick and efficient content exploitation of the valuable old Greek historical collections. In this paper, we focus on the problem of recognizing early Christian Greek manuscripts written in lower case letters. Based on the existence of closed cavity regions in the majority of characters and character ligatures in these scripts, we propose a novel, segmentation-free, fast and efficient technique that assists the recognition procedure by tracing and recognizing the most frequently appearing characters or character ligatures. First, we detect closed cavities that exist in the character body. Then, the protrusions in the outer contour outline of the connected components that contain the character closed cavities are used for the classification of the area around closed cavities to a specific character or a character ligature. The proposed method gives highly accurate results …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:0N-VGjzr574C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Locating text in historical collection manuscripts",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_50",
            "Abstract": "It is common that documents belonging to historical collections are poorly preserved and are prone to degradation processes. The aim of this work is to leverage state-of-the-art techniques in digital image binarization and text identification for digitized documents allowing further content exploitation in an efficient way. A novel methodology is proposed that leads to preservation of meaningful textual information in low quality historical documents. The method has been developed in the framework of the Hellenic GSRT- funded R&D project, D-SCRIBE, which aims at developing an integrated system for digitization and processing of old Hellenic manuscripts. After testing of the proposed method on numerous low quality historical manuscripts, it has turned out that our methodology performs better compared to current state-of- the-art adaptive thresholding techniques.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Watershed-driven region-based image retrieval",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-4020-3443-1_19",
            "Abstract": "This paper presents a strategy for content-based image retrieval. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the Earth mover’s distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts automatically meaningful regions. In this framework, the proposed robust feature extraction plays a major role along with a novel region weighting for enhancing feature discrimination. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Artificial Intelligence: Theories, Models and Applications",
            "Publication year": 2010,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2010LNCS.6040.....K/abstract",
            "Abstract": "Artificial Intelligence: Theories, Models and Applications - NASA/ADS Now on home page ads icon \nads Enable full ADS view NASA/ADS Artificial Intelligence: Theories, Models and Applications \nKonstantopoulos, Stasinos ; Perantonis, Stavros ; Karkaletsis, Vangelis ; Spyropoulos, \nConstantine D. ; Vouros, George Abstract Publication: Lecture Notes in Computer Science Pub \nDate: 2010 DOI: 10.1007/978-3-642-12842-4 Bibcode: 2010LNCS......K Keywords: Computer \nScience; Artificial Intelligence (incl. Robotics); Information Systems Applications (incl.Internet); \nInformation Storage and Retrieval; Database Management; Computation by Abstract Devices; \nComputer Communication Networks full text sources Publisher | © The SAO/NASA \nAstrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian \nAstrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA @(…",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "H-DocPro: a document image processing platform for historical documents",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2595188.2595203",
            "Abstract": "In this paper, we introduce the H-DocPro platform which is a publicly available document image processing platform for historical documents. H-DocPro is a result of our recent and ongoing research on historical document image processing and has been developed in order to monitor the successive application of several new or state-of-the-art document image processing methods. It is an open architecture software platform that permits several document image processing modules and methods (eg binarization, image enhancement, page split) to be utilized in an easy to define processing workflow. We provide detailed information on how to use H-DocPro, the available modules and methods as well as the way one can add his own components exploiting the open architecture form of the platform. Representative examples and experimental results using large sets of historical document images demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dimensionality Reduction and Attention Mechanisms for Extracting Affective State from Sound Spectrograms",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-66125-0_3",
            "Abstract": "Emotion recognition (ER) has drawn the interest of many researchers in the field of human-computer interaction, being central in such applications as assisted living and personalized content suggestion. When considering the implementation of ER capable systems, if they are to be widely adopted in daily life, one must take into account that methods for emotion recognition should work on data collected in an unobtrusive way. Out of the possible data modalities for affective state analysis, which include video and biometrics, speech is considered the least intrusive and for this reason has drawn the focus of many research efforts. In this chapter, we discuss methods for analyzing the non-linguistic component of vocalized speech for the purposes of ER. In particular, we propose a method for producing lower dimensional representations of sound spectrograms which respect their temporal structure. Moreover …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Supporting tele-health and AI-based clinical decision making with sensor data fusion and semantic interpretation: The USEFIL case study",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/42895486/Supporting_Tele-Health_and_AI-based_Clin20160221-15392-1x84kws.pdf#page=32",
            "Abstract": "We propose a three-layered architecture for clinical evidencebased Decision Support Systems. Our architecture allows for off-the-shelf low-cost sensors to be deployed in tele-health environments; counterbalancing low confidence in the sensor data by fusing data from multiple sensors. The relevant data fusion and interpretation layer also forms the interface between sensor data and explicit rules encoding medical knowledge. This achieves a complete separation of the non-medical and medical knowledge, an important step for system adoption.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Long-term marine traffic monitoring for environmental safety in the Aegean Sea",
            "Publication year": 2015,
            "Publication url": "https://core.ac.uk/download/pdf/186799953.pdf",
            "Abstract": "The Aegean Sea is characterized by an extremely high marine safety risk, mainly due to the significant increase of the traffic of tankers from and to the Black Sea that pass through narrow straits formed by the 1600 Greek islands. Reducing the risk of a ship accident is therefore vital to all socio-economic and environmental sectors. This paper presents an online long-term marine traffic monitoring work-flow that focuses on extracting aggregated vessel risks using spatiotemporal analysis of multilayer information: vessel trajectories, vessel data, meteorological data, bathymetric/hydrographic data as well as information regarding environmentally important areas (eg protected high-risk areas, etc.). A web interface that enables user-friendly spatiotemporal queries is implemented at the frontend, while a series of data mining functionalities extracts aggregated statistics regarding:(a) marine risks and accident probabilities for particular areas (b) trajectories clustering information (c) general marine statistics (cargo types, etc.) and (d) correlation between spatial environmental importance and marine traffic risk. Towards this end, a set of data clustering and probabilistic graphical modelling techniques has been adopted.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:HtS1dXgVpQUC",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Detecting text in video frames",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.76.3740&rep=rep1&type=pdf",
            "Abstract": "In this paper we propose an edge-based algorithm for artificial text detection in video frames. First, an edge map is created using the Canny edge detector. Then, morphological filtering is used, based on geometrical constraints, in order to connect the vertical edges and discard false alarms. A connected component analysis is performed to the filtered edge map in order to determine a bounding box for every candidate text area. Finally, horizontal and vertical projections are calculated on the edge map of every box and a threshold is applied, refining the result and splitting text areas in text lines. The whole algorithm is applied in multiresolution fashion to ensure text detection with size variability. Experimental results prove that the method is highly effective and efficient for artificial text detection.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Relevance feedback in content-based 3D object retrieval a comparative study",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.3722/cadaps.2008.753-763",
            "Abstract": "In this paper, we present a comparative study that concerns relevance feedback (RF) algorithms in the context of content-based 3D object retrieval. In this study, we employ RF algorithms which range from query modification and multiple queries to one-class support vector machines (SVM). Furthermore, we employ pseudo relevance feedback (PRF) and show that it can considerably improve the performance of content-based retrieval. Our comparative study is based upon extensive experiments that take into account datasets containing generic as well as CAD models.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "e-Medi: A Web-based e-Training Platform for Breast Imaging.",
            "Publication year": 2007,
            "Publication url": "https://www.scitepress.org/Papers/2007/12810/12810.pdf",
            "Abstract": "This paper concerns a Web-based e-Training platform that is dedicated to multimodal breast imaging. The assets of this platform are summarised in the following:(i) the efficient representation of the curriculum flow that will permit efficient training;(ii) efficient tagging of multimodal content appropriate for the completion of realistic cases and (iii) ubiquitous accessibility and platform independence via a web-based approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:gsN89kCJA0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D2. 8 Semantics extraction from non-visual content tools-final version",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=9855671171686426769&hl=en&oi=scholarr",
            "Abstract": "This document describes in brief the implementation and current evaluation results for the Tool for Semantics Extraction from Non-Visual Content (final version). This tool is part of the overall Toolkit for Semantics Extraction from Multimedia Content (final version) which is described in detail in Deliverable 2.9, where a more detailed description of the individual tools comprising the Toolkit can be found. The Tool for Semantics Extraction from Non-Visual Content is in turn comprised of two modules, namely the Module for Semantics Extraction from Audio Events and Speech Analysis and the Module for Semantics Extraction from Text. These are described forthwith.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D mesh segmentation methodologies for CAD applications",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/16864360.2007.10738515",
            "Abstract": "3D mesh segmentation is a fundamental process for Digital Shape Reconstruction in a variety of applications including Reverse Engineering, Medical Imaging, etc. It is used to provide a high level representation of the raw 3D data which is required for CAD, CAM and CAE. In this paper, we present an exhaustive overview of 3D mesh segmentation methodologies examining their suitability for CAD models. In particular, a classification of the various methods is given based on their corresponding underlying fundamental methodology concept as well as on the distinct criteria and features used in the segmentation process.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Towards text recognition in natural scene images",
            "Publication year": 2005,
            "Publication url": "https://users.iit.demokritos.gr/~bgat/icta2005.pdf",
            "Abstract": "In this paper, we propose a novel methodology for text detection in natural scene images. The proposed methodology is based on an efficient binarization and enhancement technique followed by a suitable connected component analysis procedure. Image binarization successfully processes natural scene images having shadows, non-uniform illumination, low contrast and large signaldependent noise. Connected component analysis is used to define the final binary images that mainly consist of text regions. The proposed methodology results in increased success rates for commercial OCR engines. Experimental results based on a public database of natural scene images prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Handwritten character recognition through two-stage foreground sub-sampling",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320310000968",
            "Abstract": "In this paper, we present a methodology for off-line handwritten character recognition. The proposed methodology relies on a new feature extraction technique based on recursive subdivisions of the character image so that the resulting sub-images at each iteration have balanced (approximately equal) numbers of foreground pixels, as far as this is possible. Feature extraction is followed by a two-stage classification scheme based on the level of granularity of the feature extraction method. Classes with high values in the confusion matrix are merged at a certain level and for each group of merged classes, granularity features from the level that best distinguishes them are employed. Two handwritten character databases (CEDAR and CIL) as well as two handwritten digit databases (MNIST and CEDAR) were used in order to demonstrate the effectiveness of the proposed technique. The recognition result achieved, in …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:M7yex6snE4oC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Levenberg-Marquardt algorithm with adaptive momentum for the efficient training of feedforward networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/857825/",
            "Abstract": "We present a highly efficient second order algorithm for the training of feedforward neural networks. The algorithm is based on iterations of the form employed in the Levenberg-Marquardt (LM) method for nonlinear least squares problems with the inclusion of an additional adaptive momentum term arising from the formulation of the training task as a constrained optimization problem. Its implementation requires minimal additional computations compared to a standard LM iteration which are compensated, however, from its excellent convergence properties. Simulations of large scale classical neural network benchmarks are presented which reveal the power of the method to obtain solutions in difficult problems whereas other standard second order techniques (including LM) fail to converge.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Training feedforward neural networks with the dogleg method and BFGS Hessian updates",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/857827/",
            "Abstract": "We introduce an advanced optimization algorithm for training feedforward neural networks. The algorithm combines the Broyden-Fletcher-Goldfarb-Shanno (BFGS) Hessian update formula with a special case of trust region techniques, called the Dogleg method, as an alternative technique to line search methods. Simulations regarding classification and function approximation problems are presented which reveal a clear improvement both in convergence and success rates over standard BFGS implementations.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recognizing the quality of urban sound recordings using hand-crafted and deep audio features",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3316782.3322739",
            "Abstract": "Soundscape can be regarded as the auditory landscape, conceived individually or at collaborative level. This paper presents a method for automatic recognition of the soundscape quality of urban recordings. Towards this end, the ATHens Urban Soundscape has been used, which is a dataset of audio recordings of ambient urban sounds, annotated in terms of the corresponding perceived soundscape quality. In order to automatically recognize the soundscape quality, both hand-crafted and deep features have been adopted. Experimental results have demonstrated that the performance of the final classifier that combines hand-crafted and deep context-aware audio features is boosted by almost 2%.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Clothes change detection using the Kinect sensor",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7514485/",
            "Abstract": "This paper describes a methodology for detecting when a human has changed clothes. Changing clothes is a basic activity of daily living which makes the methodology valuable for tracking the functional status of elderly people, in the context of a non-contract unobtrusive monitoring system. Our approach uses Kinect and the OpenNI SDK, along with a workflow of basic image analysis steps. Evaluation has been conducted on a set of real recordings under various illumination conditions, which is publicly available along with the source code of the proposed system at http://users.iit.demokritos.gr/ tyianak/ClothesCode.html.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:9c2xU6iGI7YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "for Improved Similarity-Based Learning",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=1495545014073795804&hl=en&oi=scholarr",
            "Abstract": "The K-NN classifier is one of the earliest classifiers used for pattern recognition tasks. Its popularity stems from its conceptual simplicity and from the fact that it does not require elaborate training, since it stores training instances and performs evaluations only on queries (lazy learning). However, its performance and efficiency depend highly on the feature input space and on the number of training instances. A large number of variations of K-NN have been proposed to solve these problems. In this paper, we focus on the feature input space representation and propose an algorithm that aims at suitably transforming input features to improve classification performance. The algorithm is novel in that it integrates local relevance information on the features, by means of a deforming transform. The algorithm is thus decoupled from K-NN and can be viewed as au seful preprocesing of features and used with other classifiers as well.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:yFnVuubrUp4C",
            "Publisher": "Springer"
        },
        {
            "Title": "A segmentation-free recognition technique to assist old Greek handwritten manuscript OCR",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-28640-0_7",
            "Abstract": "Recognition of old Greek manuscripts is essential for quick and efficient content exploitation of the valuable old Greek historical collections. In this paper, we focus on the problem of recognizing early Christian Greek manuscripts written in lower case letters. Based on the existence of hole regions in the majority of characters and character ligatures in these scripts, we propose a novel, segmentation-free, fast and efficient technique that assists the recognition procedure by tracing and recognizing the most frequently appearing characters or character ligatures. First, we detect hole regions that exist in the character body. Then, the protrusions in the outer contour outline of the connected components that contain the character hole regions are used for the classification of the area around holes to a specific character or a character ligature. The proposed method gives highly accurate results and offers great …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Allen's hourglass: Probabilistic treatment of interval relations",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5601881/",
            "Abstract": "The paper is motivated by the need to handle robustly the uncertainty of temporal intervals, e.g. as it occurs in automated event detection in video streams. The paper introduces a two-dimensional mapping of Allen's relations, based on orthogonal characteristics of interval relations, namely relative position and relative size. The hourglass-shaped mapping also represents limit cases that correspond to durationless intervals. Based on this mapping, we define two sets of primitive interval relations in terms of the relative positioning and relative size of intervals. These primitives are then used to derive a probabilistic set of Allen's relations. A number of example cases are presented to illustrate how the proposed approach can improve the robustness of interval relations.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:HbR8gkJAVGIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "2.6 Semantics Extraction from Fused Multimedia Content",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=2521061431075490675&hl=en&oi=scholarr",
            "Abstract": "A known proverb says that a picture is worth a thousand words, concisely stating that information contained in images may be as rich as information contained in large texts. However, the proverb doesn't say how much are worth a picture and say five words together. It seems that the obvious answer``one thousand and five''is wrong, as a picture together with its caption often convey more information than simply adding the information found in the picture and the caption separately. The same remark applies to many types of multimedia documents, where a message is expressed jointly by more than one types of media, such as text, audio, still and moving image. The aim of this report is to discuss the ways and methods by which the Semantics Extraction from Multimedia Data task has been addressed in BOEMIE. Due to the information structure and multimedia data combination variety, defining this task in a precise …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bag of spatio-visual words for context inference in scene classification",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003132031200341X",
            "Abstract": "In the “bag of visual words (BoVW)” representation each image is represented by an unordered set of visual words. In this paper, a novel approach to encode ordered spatial configurations of visual words in order to add context in the representation is presented. The proposed method introduces a bag of spatio-visual words representation (BoSVW) obtained by clustering of visual words' correlogram ensembles. Specifically, the spherical K-means clustering algorithm is employed accounting for the large dimensionality and the sparsity of the proposed spatio-visual descriptors. Experimental results on four standard datasets show that the proposed method significantly improves a state-of-the-art BoVW model and compares favorably to existing context-based scene classification approaches.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Fusing active orientation models and mid-term audio features for automatic depression estimation",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2910674.2935856",
            "Abstract": "In this paper, we predict a human's depression level in the BDI-II scale, using facial and voice features. Active orientation models (AOM) and several voice features were extracted from the video and audio modalities. Long-term and mid-term features were computed and a fusion is performed in the feature space. Videos from the Depression Recognition Sub-Challenge of the 2014 Audio-Visual Emotion Challenge and Workshop (AVEC 2014) were used and support vector regression models were trained to predict the depression level. We demonstrated that the fusion of AOMs with audio features leads to better performance compared to individual modalities. The obtained regression results indicate the robustness of the proposed technique, under different settings, as well as an RMSE improvement compared to the AVEC 2014 video baseline.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:8d8msizDQcsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "NEURAL NETWORK TECHNIQUES FOR SO2",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=1OCsBgAAQBAJ&oi=fnd&pg=PA305&dq=info:ej4-9NW_8jYJ:scholar.google.com&ots=vcnvvEtymc&sig=eLZaelsjpkhVF1NxaSWyQZMhJJo",
            "Abstract": "Air quality has become a major issue during the last decades for a great number of cities and a matter of concern for both citizens and scientists. The quality of life has deteriorated in urban regions due to high pollution levels and a large number of people suffer from pollution effects on health. The prediction of air pollution episodes is very useful in that it enables the local authorities to give a warning against high pollutant concentrations or to take limitation measures on the emission sources. In the past, efforts for pollution level forecasting have been reported using mathematical models (simulating the physical process) or statistical methods (Zannetti, 1990). The mathematical model operation requires high computational capacity, meteorological data and emission inventory. The required meteorological data are very difficult to collect and process, while the creation of an emission inventory is not an easy task. A statistical approach has the advantage that no knowledge of the mechanism of pollution dispersion is needed. Most statistical forecasting work dealing with urban airpollution utilizes traditional well known techniques such as linear regression models, time-series analysis etc.(Zannetti, 1990; Finzi and Tebaldi, 1982; Inoue et al., 1986). However, conventional statistical techniques suffer from several drawbacks. The statistical distribution of the pollution data is not a priori known and therefore parametric regression techniques that assume a given distribution, such as multivariate Gaussian, may not work optimally. Linear regression techniques in general are not capable of capturing the inherently non-linear nature of the problem, while non …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Knowledge acquisition from multimedia content using an evolution framework",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_65",
            "Abstract": "We propose an approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multiple modalities, and feeds back the extracted information, aiming to evolve knowledge representation. This paper presents the basic components of the proposed approach and discusses the open research issues focusing on the fused information extraction that will enable the development of scalable and precise knowledge acquisition technology.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Two highly efficient second-order algorithms for training feedforward networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1031939/",
            "Abstract": "We present two highly efficient second-order algorithms for the training of multilayer feedforward neural networks. The algorithms are based on iterations of the form employed in the Levenberg-Marquardt (LM) method for nonlinear least squares problems with the inclusion of an additional adaptive momentum term arising from the formulation of the training task as a constrained optimization problem. Their implementation requires minimal additional computations compared to a standard LM iteration. Simulations of large scale classical neural-network benchmarks are presented which reveal the power of the two methods to obtain solutions in difficult problems, whereas other standard second-order techniques (including LM) fail to converge.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recognition of urban sound events using deep context-aware feature extractors and handcrafted features",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-19909-8_16",
            "Abstract": "This paper proposes a method for recognizing audio events in urban environments that combines handcrafted audio features with a deep learning architectural scheme (Convolutional Neural Networks, CNNs), which has been trained to distinguish between different audio context classes. The core idea is to use the CNNs as a method to extract context-aware deep audio features that can offer supplementary feature representations to any soundscape analysis classification task. Towards this end, the CNN is trained on a database of audio samples which are annotated in terms of their respective “scene” (e.g. train, street, park), and then it is combined with handcrafted audio features in an early fusion approach, in order to recognize the audio event of an unknown audio recording. Detailed experimentation proves that the proposed context-aware deep learning scheme, when combined with the typical …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:foquWX3nUaYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "emedi: Web-based e-training for multimodal breast imaging",
            "Publication year": 2007,
            "Publication url": "https://users.iit.demokritos.gr/~ipratika/publications/journals/IJBMS08.pdf",
            "Abstract": "In this paper, a Web-based e-Training platform that is dedicated to multimodal breast imaging is presented. The assets of this platform are summarised in (i) the efficient representation of the curriculum flow that will permit efficient training;(ii) efficient tagging of multimodal content appropriate for the completion of realistic cases and (iii) ubiquitous accessibility and platform independence via a web-based approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive degraded document image binarization",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320305003821",
            "Abstract": "This paper presents a new adaptive approach for the binarization and enhancement of degraded documents. The proposed method does not require any parameter tuning by the user and can deal with degradations which occur due to shadows, non-uniform illumination, low contrast, large signal-dependent noise, smear and strain. We follow several distinct steps: a pre-processing procedure using a low-pass Wiener filter, a rough estimation of foreground regions, a background surface calculation by interpolating neighboring background intensities, a thresholding by combining the calculated background surface with the original image while incorporating image up-sampling and finally a post-processing step in order to improve the quality of text regions and preserve stroke connectivity. After extensive experiments, our method demonstrated superior performance against four (4) well-known techniques on …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "IIT/NCSR\" Demokritos\" at TRECVID 2006: Shot Boundary Detection.",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.189.1739&rep=rep1&type=pdf",
            "Abstract": "In this notebook paper, we summarize our results in the framework of TRECVID 2006 competition. In particular, we have produced results for the Shot Boundary detection task for which we will describe the submitted runs and analyze their performance. The applied methodology relies on spatial segmentation and a similarity measure based on Earth Mover’s Distance that produces signatures for a given spatio-temporal support. We have used alternative signatures for abrupt cuts and gradual transitions.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Object-driven content-based image retrieval",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.77.8238&rep=rep1&type=pdf",
            "Abstract": "This paper presents a novel unsupervised strategy for content-based image retrieval. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the Earth mover's distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts meaningful regions automatically. In this framework, the proposed robust feature extraction and the many-to-many region matching along with the novel region weighting for enhancing feature discrimination play a major role. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:08ZZubdj9fEC",
            "Publisher": "12th International Workshop on Systems, Signals and Image Processing (IWSSIP, pp. 189-193, Chalkida, Greece."
        },
        {
            "Title": "Advances in Artificial Intelligence: Theories, Models, and Applications",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=2099830084731752555&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer-Verlag Berlin Heidelberg"
        },
        {
            "Title": "3D Object Retrieval using an Efﬁcient and Compact Hybrid Shape Descriptor",
            "Publication year": 2008,
            "Publication url": "https://hal.inria.fr/hal-00758995/",
            "Abstract": "We present a novel 3D object retrieval method that relies upon a hybrid descriptor which is composed of 2D features based on depth buffers and 3D features based on spherical harmonics. To compensate for rotation, two alignment methods, namely CPCA and NPCA, are used while compactness is supported via scalar feature quantization to a set of values that is further compressed using Huffman coding. The superior performance of the proposed retrieval methodology is demonstrated through an extensive comparison against state-of-the-art methods on standard datasets",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of multiple, linear-projection based visualization techniques in rbf-based classification of high dimensional data",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/861279/",
            "Abstract": "The paper presents a method for the 3D visualization of the structure of radial basis function networks using traditional and novel methods of dimensionality reduction. This method allows the visualization of basis function characteristics (centers and widths) along with second level weights. To facilitate the interpretation of a wide variety of high dimensional problems, several forms of projections into 20 or 30 spaces can be used interactively. The traditional methods of principal component analysis and Fisher's linear discriminant are used as well as a novel linear projection method.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A biophysical model of decision making in an antisaccade task through variable climbing activity",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11550822_33",
            "Abstract": "We present a biophysical model of saccade initiation based on competitive integration of planned and reactive cortical saccade decision signals in the intermediate layer of the superior colliculus. In the model, the variable slopes of the climbing activities of the input cortical decision signals are produced from variability in the conductances of Na + , K + , Ca2 +  activated K + , NMDA and GABA currents. These cortical decision signals are integrated in the activities of buildup neurons in the intermediate layer of the superior colliculus, whose activities grow nonlinearly towards a preset criterion level. When the level is crossed, a movement is initiated. The resultant model reproduces the unimodal distributions of saccade reaction times (SRTs) for correct antisaccades and erroneous prosaccades as well as the variability of SRTs (ranging from 80ms to 600ms) and the overall 25% of erroneous …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Audio-visual fusion for detecting violent scenes in videos",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_13",
            "Abstract": "In this paper we present our research towards the detection of violent scenes in movies, employing fusion methodologies, based on learning. Towards this goal, a multi-step approach is followed: initially, automated auditory and visual processing and analysis is performed in order to estimate probabilistic measures regarding particular audio and visual related classes. At a second stage, a meta-classification architecture is adopted, which combines the audio and visual information, in order to classify mid-term video segments as “violent” or “non-violent”. The proposed scheme has been evaluated on a real dataset from 10 films.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:WZBGuue-350C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automatic page analysis for the creation of a digital library from newspaper archives",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1007/PL00021477",
            "Abstract": "Digital preservation of newspaper archives aims both at the salvation of endangered material (paper) and at the creation of digital library services that will allow full utilization of the archives by all interested parties. In this paper, we address a series of issues pertaining to the retro-conversion of newspapers, i.e., the conversion of newspaper pages into digital resources. An integrated approach is presented that provides solutions to problems related to newspaper page image enhancement, segmentation of pages into various items (titles, text, images etc), article identification and reconstruction, and, finally, recognition of the textual components. Emphasis is placed on the most difficult intermediate stages of page segmentation and article identification and reconstruction. Detailed experimental results, obtained from a large testbed of old newspaper issues, are presented which clearly demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Accelerating multi-objective ship routing using a novel grid structure and a simple heuristic",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7387978/",
            "Abstract": "In this paper, we present a grid structure used as a base layer for a multi-objective algorithm used to solve the bi-criteria time constrained shortest path problem in ship routing. We also accelerate this algorithm by following two completely different approaches. First, we split the initial grid structure into multiple partitions with uniform weather conditions, in order to reduce the complexity of routing through them. Second, we transform the initially used label setting multi-objective algorithm into a multi-objective A* algorithm and give an efficient heuristic function for doing so. Our experiments show that there is a significant speedup of the algorithm, especially in the second case, where the run time is reduced substantially.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Keyword matching in historical machine-printed documents using synthetic data, word portions and dynamic time warping",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4670004/",
            "Abstract": "In this paper we propose a novel and efficient technique for finding keywords typed by the user in digitised machine-printed historical documents using the dynamic time warping (DTW) algorithm. The method uses word portions located at the beginning and end of each segmented word of the processed documents and try to estimate the position of the first and last characters in order to reduce the list of candidate words. Since DTW can become computational intensive in large datasets the proposed method manages to significantly prune the list of candidate words thus, speeding up the entire process. Word length is also used as a means of further reducing the data to be processed. Results are improved in terms of time and efficiency compared to those produced if no pruning is done to the list of candidate words.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:XoXfffV-tXoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unsupervised region-based image retrieval",
            "Publication year": 2004,
            "Publication url": "https://researchportal.vub.be/en/publications/unsupervised-region-based-image-retrieval",
            "Abstract": "A novel unsupervised strategy for content-based image retrieval is presented. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the earth mover's distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts meaningful regions automatically. In this framework, the proposed robust feature extraction and the many-to-many region matching along with the novel region weighting for enhancing feature discrimination play a major role. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:bKqednn6t2AC",
            "Publisher": "Institute of Electrical Engineers"
        },
        {
            "Title": "Lignite mine monitoring and mapping using freely-available radar and optical satellite imagery",
            "Publication year": 2019,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMME.2019.104445",
            "Abstract": "A methodology for monitoring and mapping lignite mining areas using Sentinel-1 and Sentinel-2 ESA Copernicus satellite systems is presented. A stochastic regularised super-resolution reconstruction (SRSR) for the enhancement of the Sentinel-2 optical data is developed, and a land monitoring/change analysis based on the enhanced Sentinel-2 images is performed. Additionally, the ground motion is monitored using the Sentinel-1 radar data via the Rheticus service. The proposed methodology is tested on the Amyntaio lignite mine in Ptolemais basin, Greece, for Sentinel images obtained from 2014 to 2018. The Amyntaio area has been of particular interest, as a landslide event occurred on June 10th, 2017, causing major operational disruption and a severe economic loss to the Public Power Plant Cooperation of Greece SA. The methodology proves to be useful for facilitating mapping and monitoring mining …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Keyword-guided word spotting in historical printed documents using synthetic data and user feedback",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10032-007-0042-4",
            "Abstract": "In this paper, we propose a novel technique for word spotting in historical printed documents combining synthetic data and user feedback. Our aim is to search for keywords typed by the user in a large collection of digitized printed historical documents. The proposed method consists of the following stages: (1) creation of synthetic image words; (2) word segmentation using dynamic parameters; (3) efficient feature extraction for each word image and (4) a retrieval procedure that is optimized by user feedback. Experimental results prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Digitisation Processing and Recognition of Old Greek Manuscipts (the D-SCRIBE Project)",
            "Publication year": 2004,
            "Publication url": "http://sci-gems.math.bas.bg/jspui/handle/10525/871",
            "Abstract": "After many years of scholar study, manuscript collections continue to be an important source of novel  information for scholars, concerning both the history of  earlier times as well as the development of cultural  documentation over the centuries. D-SCRIBE project aims to support and facilitate current and future efforts in  manuscript digitization and processing. It strives toward the creation of a comprehensive software product, which  can assist the content holders in turning an archive of manuscripts into a digital collection using automated  methods. In this paper, we focus on the problem of recognizing early Christian Greek manuscripts. We propose a  novel digital image binarization scheme for low quality historical documents allowing further content exploitation in  an efficient way. Based on the existence of closed cavity regions in the majority of characters and character  ligatures in these scripts, we propose a novel, segmentation-free, fast and efficient technique that assists the  recognition procedure by tracing and recognizing the most frequently appearing characters or character ligatures.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Institute of Information Theories and Applications FOI ITHEA"
        },
        {
            "Title": "Aminess: a platform for environmentally safe shipping",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2674396.2674464",
            "Abstract": "Reducing the possibility of ship accidents in the Aegean Sea is important to all economic, environmental, and cultural sectors of Greece. Despite the increased traffic and the related obvious risk, there are currently no national-level monitoring policies in Greece. To this end, we develop the AMINESS platform that will integrate information from multiple sources (eg real-time vessel movements, weather data, traffic patterns, information on type and cargo of vessels, environmental data etc.) as well as historical maritime data. This platform offers a web portal accessible by ship owners, policy makers and the scientific community, which can be used to (a) suggest vessel and environmentally optimal safe route planning, considering both the risk as well as the cost (in fuel and time) of the alternative routes,(b) deliver real-time alerts for ships (eg danger of collision or capsizing, suspicious/illegal behaviour of vessels), and (c …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "K-Nets: Clustering through nearest neighbors networks",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320318303984",
            "Abstract": "Importance of clustering is signified by its applications in many scientific fields and the uninterrupted presence of related algorithmic methods in the literature for more than half a century. The majority of these methods have complex operation and most of the times aim on a specific application field. Here we present K-Networks (K-Nets), a deterministic algorithm based on a network structure whose nodes represent data points and can intrinsically work within a single or multi-layer architecture. The number of interconnections of each node with the rest of the network indicates the clusteringresolution degree and can be the same or different in every layer. K-Nets automatically detects symmetric structures in data that can be utilized to recover clusters of different size, shape, or partitions composed of a specific number of clusters. We provide evidence that K-Nets performance compares favorably with other well …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:_axFR9aDTf0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A neural network model of Parkinson's disease bradykinesia",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0893608005002479",
            "Abstract": "Parkinson's disease (PD) is caused by dopamine (DA) depletion consequent to cell degeneration in the substantia nigra pars compacta (SNc) and the ventral tegmental area (VTA). Although computational analyses of PD have focused on DA depletion in DA-recipient parts of the basal ganglia, there is also extensive DAergic innervation of the frontal and parietal cortex as well as the spinal cord. To understand PD bradykinesia, a comprehensive network model is needed to study how patterns of DA depletion at key cellular sites in the basal ganglia, cortex and spinal cord contribute to disordered neuronal and spinal cord activity and other PD symptoms. We extend a basal ganglia-cortico-spinal circuit for control of voluntary arm movements by incorporating DAergic innervation of cells in the cortical and spinal components of the circuit. The resultant model simulates successfully several of the main reported effects of …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:hCrLmN-GePgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A web-based e-learning platform for orthopedics",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6576508/",
            "Abstract": "The project named “A Web-based E-Training Platform for Extended Human Motion Investigation in Orthopedics” addresses equally medical and biomedical engineering needs, proposing formation of specialists that will apply the principles of medical and biomedical engineering sciences in order to improve the patients' condition. The paper presents this Leonardo da Vinci project (ToI), its aims and the e-learning platform that offers to orthopedic doctors and engineers interested in the medical field, a common learning tool, with interdisciplinary approaches, trying to close the gap between engineering and medicine, by creating a new e-learning environment for human motion analysis.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:IUKN3-7HHlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SemVeillance System: Tracking and behavior recognition under occlusions",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=10962775972621625598&hl=en&oi=scholarr",
            "Abstract": "This demo presents our approach in understanding the behavior of humans moving on a plane using multiple cameras. This approach is appropriate for monitoring people in public places, assistive environments or smart rooms for the purpose of issuing alerts in cases of abnormal behavior. We perform camera registration based on homography estimation and we extract position on 2D projection map. We use the output of a classifiers to model and extract abnormal behavior from both the target trajectory and the target short term activity (ie, walking, running, abrupt motion etc). The proposed approach has been verified experimentally in an indoor environment. The experiments have been performed both with a single and multiple moving targets, which may occlude each other. Tracking under occlusions are handled by clustering and using of multiple cameras. Experiments on video sequences of crowded scenes …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A biophysical neural accumulator model of decision making in an antisaccade task",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231206002566",
            "Abstract": "A biophysical cortico-colicular model of saccade initiation based on competitive integration of planned and reactive cortical saccade decision signals in the intermediate layer of the superior colliculus is introduced. The variable slopes of the climbing activities of the input cortical decision signals are produced from variability in the ionic and synaptic conductances of cortical neurons. The model reproduces the unimodal distributions of saccade reaction times for correct antisaccades and erroneous prosaccades as well as the variability of saccade reaction times and the overall error probabilities in a large sample of 2006 young men performing an antisaccade task.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A multi-class method for detecting audio events in news broadcasts",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_50",
            "Abstract": "We propose a method for audio event detection in video streams from news. Apart from detecting speech, which is obviously the major class in such content, the proposed method detects five non-speech audio classes. The major difficulty of the particular task lies in the fact that most of the non-speech audio events are actually background sounds, with speech as the primary sound. We have adopted a set of 21 statistics computed on a mid-term basis over 7 audio features. A variation of the One Vs All classification architecture has been adopted and each binary classification problem is modeled using a separate probabilistic Support Vector Machine. Experiments have shown that the proposed method can achieve high precision rates for most of the audio events of interest.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:HIFyuExEbWQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multimodal and ontology-based fusion approaches of audio and visual processing for violence detection in movies",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417411007469",
            "Abstract": "In this paper we present our research results towards the detection of violent scenes in movies, employing advanced fusion methodologies, based on learning, knowledge representation and reasoning. Towards this goal, a multi-step approach is followed: initially, automated audio and visual analysis is performed to extract audio and visual cues. Then, two different fusion approaches are deployed: (i) a multimodal one that provides binary decisions on the existence of violence or not, employing machine learning techniques, (ii) an ontological and reasoning one, that combines the audio-visual cues with violence and multimedia ontologies. The latter reasons out not only the existence of violence or not in a video scene, but also the type of violence (fight, screams, gunshots). Both approaches are experimentally tested, validated and compared for the binary decision problem of violence detection. Finally, results for the …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:86PQX7AUzd4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "D2. 1 methodology for semantics extraction from multimedia content",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/30675177/10.1.1.84.9929.pdf",
            "Abstract": "(for dissemination) This document outlines the “Methodology for Semantics Extraction from Multimedia Content” that will be followed in the framework of the BOEMIE project. The basic aim is to describe the architecture and methods that will be used in each particular modality (text, image, video-audio) for extracting semantics from multimedia content using an ontology-driven framework. Furthermore it aims at answering the key research questions that need to be addressed in order for ontology-driven semantics extraction from multimedia content to be possible. These key issues are:(a) how ontology guides the extraction process, and (b) how the multimedia information extraction provides the means for ontology population and enrichment.This document may not be copied, reproduced, or modified in whole or in part for any purpose, without written permission from the BOEMIE consortium. In addition to such written permission to copy, reproduce, or modify this document in whole or part, an acknowledgement of the authors of the document and all applicable portions of the copyright notice must be clearly referenced.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:2VqYfGB8ITEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Delineation of lineaments from satellite data based on efficient neural network and pattern recognition techniques",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.75.6859&rep=rep1&type=pdf",
            "Abstract": "An automated lineament detection method based on a modified Hough transform is presented. The method first performs an efficient data clustering using Kohonen’s self-organizing maps then binarizes the classification result and finally applies the modified Hough transform in order to identify lineaments. The capabilities of the method are described using Landsat TM satellite data from the Vermion area in Greece. The results of the automated analysis show major geological faults in the selected area.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:hC7cP41nSMkC",
            "Publisher": "Citeseer"
        },
        {
            "Title": "Supervised principal component analysis using a smooth classifier paradigm",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/906028/",
            "Abstract": "A new dimensionality reduction method is proposed which is used to extract salient features for pattern classification problems. The method is used jointly with a classifier of smooth response. It performs a PCA-like operation to a set of vectors defined using directional derivatives of the classifier's response in the original feature space of the training patterns. The method is implemented using a smooth variation of the K-nearest neighbour classifier. The efficiency of the method is evaluated in three benchmark classification tasks. Efficient dimensionality reduction is observed without adverse effects on classification ability.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An adaptive binarization technique for low quality historical documents",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-28640-0_10",
            "Abstract": "Historical document collections are a valuable resource for human history. This paper proposes a novel digital image binarization scheme for low quality historical documents allowing further content exploitation in an efficient way. The proposed scheme consists of five distinct steps: a pre-processing procedure using a low-pass Wiener filter, a rough estimation of foreground regions using Niblack’s approach, a background surface calculation by interpolating neighboring background intensities, a thresholding by combining the calculated background surface with the original image and finally a post-processing step in order to improve the quality of text regions and preserve stroke connectivity. The proposed methodology works with great success even in cases of historical manuscripts with poor quality, shadows, nonuniform illumination, low contrast, large signal- dependent noise, smear and strain. After …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "ScriptNet: Competition P1",
            "Publication year": 2016,
            "Publication url": "https://readcoop.eu/wp-content/uploads/2017/12/READ_3.8_update.pdf",
            "Abstract": "This deliverable reports on the research competitions organised by the READ consortium, as well as the status of the ScriptNet competitions platform at the end of the second year of the READ project.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An old Greek handwritten OCR system",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1575511/",
            "Abstract": "Recognition of handwritten manuscripts is essential for efficient content exploitation of the valuable old Greek historical collections. In this paper, we focus on the problem of recognizing old Greek handwritten manuscripts and propose a novel recognition technique that can be applied to a large number of important historical manuscript collections which are written in lower case letters and originate from St. Catherine's Mount Sinai Monastery. Based on an open and closed cavity character representation, we propose a novel, segmentation-free, fast and efficient technique for the detection and recognition of characters and character ligatures. First, we detect open and closed cavities that exist in the skeletonized character body. Then, the recognition of a specific character or character ligature is based on the protrusible segments that appear in the topological description of the character skeletons. Experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Visual sentiment analysis for brand monitoring enhancement",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7306023/",
            "Abstract": "Brand monitoring and reputation management are vital tasks in all modern business intelligence frameworks. However, recent related technologies rely mostly on the textual aspect of online content, in order to extract the underlying sentiment with respect to particular brands. In this work, we demonstrate the sentiment analysis method in the context of a brand monitoring framework, breaking the text-only barrier in the field. Towards this end, a wide range of visual features is extracted, some of which focus on the underlying semiotics and aesthetics of the images. In addition, we employ textual information embedded in the images under study, by adopting text mining techniques that focus on extracting sentiment. We evaluate the classification task for the particular binary task (negative vs positive sentiment) and propose a fusion approach that combines the two different modalities. Finally, the evaluation procedure has …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:PoWvk5oyLR8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A complete optical character recognition methodology for historical documents",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4670002/",
            "Abstract": "In this paper a complete OCR methodology for recognizing historical documents, either printed or handwritten without any knowledge of the font, is presented. This methodology consists of three steps: The first two steps refer to creating a database for training using a set of documents, while the third one refers to recognition of new document images. First, a pre-processing step that includes image binarization and enhancement takes place. At a second step a top-down segmentation approach is used in order to detect text lines, words and characters. A clustering scheme is then adopted in order to group characters of similar shape. This is a semi-automatic procedure since the user is able to interact at any time in order to correct possible errors of clustering and assign an ASCII label. After this step, a database is created in order to be used for recognition. Finally, in the third step, for every new document image the …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:XvxMoLDsR5gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic table detection in document images",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11551188_67",
            "Abstract": "In this paper, we propose a novel technique for automatic table detection in document images. Lines and tables are among the most frequent graphic, non-textual entities in documents and their detection is directly related to the OCR performance as well as to the document layout description. We propose a workflow for table detection that comprises three distinct steps: (i) image pre-processing; (ii) horizontal and vertical line detection and (iii) table detection. The efficiency of the proposed method is demonstrated by using a performance evaluation scheme which considers a great variety of documents such as forms, newspapers/magazines, scientific journals, tickets/bank cheques, certificates and handwritten documents.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient perceptron learning using constrained steepest descent",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0893608000000162",
            "Abstract": "An algorithm is proposed for training the single-layered perceptron. The algorithm follows successive steepest descent directions with respect to the perceptron cost function, taking care not to increase the number of misclassified patterns. The problem of finding these directions is stated as a quadratic programming task, to which a fast and effective solution is proposed. The resulting algorithm has no free parameters and therefore no heuristics are involved in its application. It is proved that the algorithm always converges in a finite number of steps. For linearly separable problems, it always finds a hyperplane that completely separates patterns belonging to different categories. Termination of the algorithm without separating all given patterns means that the presented set of patterns is indeed linearly inseparable. Thus the algorithm provides a natural criterion for linear separability. Compared to other state of the art …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:maZDTaKrznsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Comparison of optimized mathematical methods in the improvement of raster data and map display resolution of Sentinel-2 images",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451729/",
            "Abstract": "High-Resolution (HR) satellite images are a prerequisite in many applications such as astronomy, remote sensing, geoscience and geographical information systems, not only for providing better visualization but also for extracting extra information details. In the present work a comparative study of different single image resolution enhancement techniques is carried out on Sentinel-2 images of bands B2, B3, B4 and B8. The authors describe the stochastic regularized super-resolution (SR) reconstruction technique and compare with others. The techniques under comparison are stochastic regularized SR reconstruction (SRSR), spatial-wavelet SR reconstruction (SWSR) and the conventional interpolation techniques nearest neighbor (NN), bilinear (BL), bicubic (BC) and spline (SP). These techniques are tested against each other in terms of Root Mean Square Error (RMSE), Xydeas and Petrovich (XP), and …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:FAceZFleit8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detecting abnormal human behaviour using multiple cameras",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016516840900084X",
            "Abstract": "In this paper a bottom-up approach for human behaviour understanding is presented, using a multi-camera system. The proposed methodology, given a training set of normal data only, classifies behaviour as normal or abnormal, using two different criteria of human behaviour abnormality (short-term behaviour and trajectory of a person). Within this system an one-class support vector machine decides short-term behaviour abnormality, while we propose a methodology that lets a continuous Hidden Markov Model function as an one-class classifier for trajectories. Furthermore, an approximation algorithm, referring to the Forward Backward procedure of the continuous Hidden Markov Model, is proposed to overcome numerical stability problems in the calculation of probability of emission for very long observations. It is also shown that multiple cameras through homography estimation provide more precise position of …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:e_rmSamDkqQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Human behavior classification using multiple views",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_12",
            "Abstract": "We present our current results in understanding the behavior of humans moving an a plane using multiple cameras. We exploit the merits of camera registration based on homography estimation to extract position on a 2D map. We use the output of HMM and SVM classifiers to model and extract human behaviour from both the target trajectory and the target short term activity (i.e., walking, running, abrupt motion etc). The proposed approach is verified experimentally in an indoor environment. The current results with a single moving agent are presented.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:0izLItjtcgwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Realtime depression estimation using mid-term audio features.",
            "Publication year": 2014,
            "Publication url": "http://ceur-ws.org/Vol-1213/AIAMNETMED2014.pdf#page=48",
            "Abstract": "This paper presents a method towards estimating a clinical depression-specific score, namely the Beck Depression Inventory (BDI) score, based on analysis of mid-term audio features. A combination of support vector machines and semi-supervised learning has been applied to map the mid-term features to the BDI score. The method has been evaluated on the AVEC 2013 depression dataset. The overall system has been implemented in Python achieving a 20xrealtime computational complexity on an average computer.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A neural model of decision-making by the superior colicullus in an antisaccade task",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0893608007000287",
            "Abstract": "In the antisaccade paradigm subjects are instructed to perform eye movements in the opposite direction from the location of a visually appearing stimulus while they are fixating on a central stimulus. A recent study investigated saccade reaction times (SRTs) and percentages of erroneous prosaccades (towards the peripheral stimulus) of 2006 young men performing visually guided antisaccades. A unimodal distribution of SRTs (ranging from 80 to 600 ms) as well as an overall 25% of erroneous prosaccade responses was reported in that large sample. In this article, we present a neural model of saccade initiation based on competitive integration of planned and reactive saccade decision signals in the intermediate layer of the superior colliculus. In the model the decision processes grow nonlinearly towards a preset criterion level and when they cross it, a movement is initiated. The resultant model reproduced the …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:8k81kl-MbHgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A system for processing and recognition of old Greek manuscripts(the D-SCRIBE project).",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.63.8228&rep=rep1&type=pdf",
            "Abstract": "After many years of scholar study, manuscript collections continue to be an important source of novel information for scholars, concerning both the history of earlier times as well as the development of cultural documentation over the centuries. In this paper we present research efforts leading to the creation of a comprehensive software product, which can assist the content holders in turning an archive of manuscripts into a digital collection using automated methods. The system aims at supporting and facilitating current and future efforts in Early Christian Greek manuscript digitization and processing. A number of modules have been developed for the study and processing of the digital collections and are integrated under a common software environment. These modules include a document management system particularly adapted for manuscripts, a module for automatic processing and transliteration of manuscripts incorporating OCR techniques and a self study tool for the use of paleographers. In this paper, we focus on the description of the aforementioned modules that comprise the final system for processing and recognition of old Greek Manuscripts.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient constrained learning algorithm for stable 2D IIR filter factorization",
            "Publication year": 2013,
            "Publication url": "https://www.hindawi.com/archive/2013/292567/cta/",
            "Abstract": "A constrained neural network optimization algorithm is presented for factorizing simultaneously the numerator and denominator polynomials of the transfer functions of 2-D IIR filters. The method minimizes a cost function based on the frequency response of the filters, along with simultaneous satisfaction of appropriate constraints, so that factorization is facilitated and the stability of the resulting filter is respected.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:YohjEiUPhakC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "A hierarchical feature fusion framework for adaptive visual tracking",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885611000503",
            "Abstract": "A Hierarchical Model Fusion (HMF) framework for object tracking in video sequences is presented. The Bayesian tracking equations are extended to account for multiple object models. With these equations as a basis a particle filter algorithm is developed to efficiently cope with the multi-modal distributions emerging from cluttered scenes. The update of each object model takes place hierarchically so that the lower dimensional object models, which are updated first, guide the search in the parameter space of the subsequent object models to relevant regions thus reducing the computational complexity. A method for object model adaptation is also developed. We apply the proposed framework by fusing salient points, blobs, and edges as features and verify experimentally its effectiveness in challenging conditions.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "User-driven recognition of audio events in news videos",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5706867/",
            "Abstract": "We propose a method for user-driven recognition of events in audio streams, aiming to assist journalists towards easily annotate unedited audiovisual content. Nonlocal information provided by the user, as for example that the sound of applause exists within the video, is used for adapting the audio event classifiers so as to detect the exact position of these events in the video. Towards this end, each audio class is modeled using a Support Vector Machine (SVM) and the final automatic decision is taken on a mid-term audio basis, using an alternative of the One Vs All architecture. A weighting function is generated based on the user input and it is applied on the soft-output decision of the respective SVMs, thus adapting the final decision to the user's provided knowledge. To evaluate our method, we have used a large dataset of real news videos, provided by the German international broadcaster (DW - Deutsche Welle …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:i2xiXl-TujoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient off-line cursive handwriting word recognition",
            "Publication year": 2006,
            "Publication url": "https://hal.inria.fr/inria-00104302/",
            "Abstract": "In this paper, we present an off-line cursive word handwriting recognition methodology. This is based on a novel combination of two different modes of word image normalization and robust hybrid feature extraction. Word image normalization is performed by using as a reference point the geometric center of the word image as well as by placing the baseline of the word in the center of a rectangular box. Additionally, image pre-processing is performed in order to correct word skew, word slant as well as to normalize the stroke thickness. At a next step, two types of features are combined in a hybrid fashion. The first one, divides the word image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, we calculate the area that is formed from the projections of the upper and lower profile of the word. The performance of the proposed methodology is demonstrated after testing with the reference IAM cursive handwriting database.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:IWHjjKOFINEC",
            "Publisher": "Suvisoft"
        },
        {
            "Title": "CIL3D: A content-based 3D model search engine",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1413634.1413737",
            "Abstract": "We present a prototype 3D model search engine called CIL3D (Computational Intelligence Laboratory 3D). CIL3D provides query-by-content 3D model search, by employing a state-of-the-art method [1] for the description of a 3D model, attaining top performance. The search engine is publicly accessible through the internet at: http://emedi3. emedi. iit. demokritos. gr/cil3d/.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the relation between discriminant analysis and mutual information for supervised linear feature extraction",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320303004138",
            "Abstract": "This paper provides a unifying view of three discriminant linear feature extraction methods: linear discriminant analysis, heteroscedastic discriminant analysis and maximization of mutual information. We propose a model-independent reformulation of the criteria related to these three methods that stresses their similarities and elucidates their differences. Based on assumptions for the probability distribution of the classification data, we obtain sufficient conditions under which two or more of the above criteria coincide. It is shown that these conditions also suffice for Bayes optimality of the criteria. Our approach results in an information-theoretic derivation of linear discriminant analysis and heteroscedastic discriminant analysis. Finally, regarding linear discriminant analysis, we discuss its relation to multidimensional independent component analysis and derive suboptimality bounds based on information theory.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:ufrVoPGSRksC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A constrained learning framework for feedforward neural networks",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/44486661/A_Learning_Framework_for_Neural_Networks20160406-4619-oi4r4d.pdf",
            "Abstract": "Conventional supervised learning in neural networks is carried out by performing unconstrained minimization of a suitably defined cost function. This approach has certain drawbacks, which can be overcome by incorporating additional knowledge in the training formalism. In this paper, two types of such additional knowledge are examined: Network specific knowledge (associated with the neural network irrespectively of the problem whose solution is sought) or problem specific knowledge (which helps to solve a specific learning task). A constrained optimization framework is introduced for incorporating these types of knowledge into the learning formalism. We present three examples of improvement in the learning behaviour of neural networks using additional knowledge in the context of our constrained optimization framework. The two network specific examples are designed to improve convergence and learning speed in the broad class of feedforward networks, while the third problem specific example is related to the efficient factorization of 2-D polynomials using suitably constructed sigma-pi networks.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic and Neural Learning of Named-Entity Recognition and Classification Systems in Two Languages",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-010-0324-7_14",
            "Abstract": "This work compares two alternative approaches to the problem of acquiring named-entity recognition and classification systems from training corpora, in two different languages. The process of named-entity recognition and classification is an important subtask in most language engineering applications, in particular information extraction, where different types of named entity are associated with specific roles in events. The manual construction of rules for the recognition of named entities is a tedious and time-consuming task. For this reason, effective methods to acquire such systems automatically from data are very desirable. In this paper we compare two popular learning methods on this task: a decision-tree induction method and a multi-layered feed-forward neural network. Particular emphasis is paid on the selection of the appropriate data representation for each method and the extraction of training …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "A concrete radialized spherical projection descriptor for 3D shape retrieval",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/42138593/A_Concrete_Radialized_Spherical_Projecti20160205-30232-v43nzv.pdf",
            "Abstract": "In this paper, we present a 3D shape retrieval methodology that relies upon a shape representation based on the theory of spherical harmonics. To alleviate the problem of rotation invariance, we invoke in a parallel fashion, the Continuous Principal Component Analysis along with a novel approach which applies PCA on the mesh normals. After translating to the model’s center of mass, the 3D model is decomposed into a set of spherical functions with increasing radius, which represent the intersections of the model’s surface with rays emanating from the origin and parts closer to the origin than the furthest intersection point at each ray. Properties of spherical harmonics are used to achieve scaling invariance and axial flipping invariance.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic and neural learning for named-entity recognition",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.98.9669&rep=rep1&type=pdf",
            "Abstract": "Named-entity recognition involves the identification and classification of named entities in text. This is an important subtask in most language engineering applications, in particular information extraction, where different types of named entity are associated with specific roles in events. The manual construction of rules for the recognition of named entities is a tedious and time-consuming task. For this reason, we present in this paper two approaches to learning named-entity recognition rules from text. The first approach is a decision-tree induction method and the second a multi-layered feed-forward neural network. Particular emphasis is paid on the selection of the appropriate feature set for each method and the extraction of training examples from unstructured textual data. We compare the performance of the two methods on a large corpus of English text and present the results.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "BOEMIE: Bootstrapping ontology evolution with multimedia information extraction",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1576045/",
            "Abstract": "The BOEMIE project proposes a bootstrapping approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multiple modalities, and feeds back the extracted information, aiming to automate the ontology evolution process.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IET"
        },
        {
            "Title": "Automatic soundscape quality estimation using audio analysis",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2769493.2769501",
            "Abstract": "The huge growth of population size along with all the accompanying impacts, like traffic flow, commercial and industrial activities have led to a respective increase of noise pollution in the urban environments. In most cases, noise pollution in big cities is characterized by low-frequency and continuous background sounds. This ever-growing environmental problem engages health risks and major complaints of annoyance on behalf of millions of citizens. Therefore, sustainable urban planning needs to seriously take into consideration the task of mitigating environmental noise. In addition, the quality of the acoustic environment plays an important role in urban as well as in rural and natural spaces, since it has been proven to affect biodiversity. In this paper, we demonstrate how efficiently assessing soundscape quality can be applied to real recordings from various sites. The evaluation of the qualitative attributes of the …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decision support tool employing Bayesian risk framework for environmentally safe shipping",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-61801-2_5",
            "Abstract": "Due to the significant increase of tanker traffic from and to the Black Sea that pass through narrow straits formed by the 1600 Greek islands, the Aegean Sea is characterized by an extremely high marine environmental risk. Therefore it is vital to all socio-economic and environmental sectors to reduce the risk of a ship accident in that area. In this chapter a web tool for environmentally safe shipping is presented. The proposed tool focuses on extracting aggregated statistics using spatial analysis of multilayer information: vessel trajectories, vessel data as well as information regarding environmentally important areas. The decision support system includes preprocessing, clustering of trajectories (based on their spatial similarity) and risk assessment employing probabilistic models (Bayesian network). Applications of the web tool are presented in areas such as marine traffic monitoring in environmentally protected …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:OTTXONDVkokC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An old greek handwritten OCR system based on an efficient segmentation-free approach",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10032-006-0031-z.pdf",
            "Abstract": "Recognition of Old Greek Early Christian manuscripts is essential for efficient content exploitation of the valuable Old Greek Early Christian historical collections. In this paper, we focus on the problem of recognizing Old Greek manuscripts and propose a novel recognition technique that has been tested in a large number of important historical manuscript collections which are written in lowercase letters and originate from St. Catherine’s Mount Sinai Monastery. Based on an open and closed cavity character representation, we propose a novel, segmentation-free, fast and efficient technique for the detection and recognition of characters and character ligatures. First, we detect open and closed cavities that exist in the skeletonized character body. Then, the classification of a specific character or character ligature is based on the protrusible segments that appear in the topological description of the character …",
            "Abstract entirety": 0,
            "Author pub id": "y3fDadgAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Retrieval of 3D Articulated Objects Using a Graph-based Representation.",
            "Publication year": 2009,
            "Publication url": "http://diglib.eg.org/xmlui/bitstream/handle/10.2312/3DOR.3DOR09.029-036/029-036.pdf?sequence=1&isAllowed=y",
            "Abstract": "Most of the approaches which address the problem of 3D object retrieval, use global descriptors of the objects which fail to consistently compensate for the intra-class variability of articulated objects. In this paper, a retrieval methodology is presented which is based upon a graph-based object representation. This is composed of a meaningful new mesh segmentation along with a graph matching between the graph of the query object and each of the graphs that correspond to the objects of the 3D object database. The graph matching algorithm is based on the Earth Mover’s Distance (EMD) similarity measure which is calculated using a new ground distance assignment. The superior performance of the proposed methodology is shown after an extensive experimentation comprising alternative descriptors for the constituent components of the 3D object as well as comparison with state of the art retrieval algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "y3fDadgAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Unknown"
        }
    ]
}]