[{
    "name": "Στυλιανός  Τζωρτζάκης",
    "romanize name": "Stylianos  Tzortzakis",
    "School-Department": "Επιστήμης και Τεχνολογίας Υλικών",
    "University": "uoc",
    "Rank": "Καθηγητής",
    "Apella_id": 9644,
    "Scholar name": "Stelios Tzortzakis",
    "Scholar id": "nMJ0DjAAAAAJ",
    "Affiliation": "Professor, Texas A&M University at Qatar, FORTH & University of Crete, Greece",
    "Citedby": 8398,
    "Interests": [
        "Nonlinear Optics",
        "Femtosecond Filamentation",
        "THz",
        "Photonic Lattices"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=nMJ0DjAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Nonlinear birefringence due to non-resonant, higher-order Kerr effect in isotropic media",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-7-6387",
            "Abstract": "The recent interpretation of experiments on the nonlinear non-resonant birefringence induced in a weak probe beam by a high intensity pump beam in air and its constituents has stimulated interest in the non-resonant birefringence due to higher-order Kerr nonlinearities. Here a simple formalism is invoked to determine the non-resonant birefringence for higher-order Kerr coefficients. Some general relations between nonlinear coefficients with arbitrary frequency inputs are also derived for isotropic media. It is shown that the previous linear extrapolations for higher-order birefringence (based on literature values of n_2 and n_4) are not strictly valid, although the errors introduced in the values of the reported higher- order Kerr coefficients are a few percent.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:4TOpqqG69KYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Off-resonance and non-resonant dispersion of Kerr nonlinearity for symmetric molecules",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-23-22486",
            "Abstract": "The exact formula is derived from the “sum over states” (SOS) quantum mechanical model for the frequency dispersion of the nonlinear refractive index coefficient n_2 for centrosymmetric molecules in the off-resonance and non-resonant regimes. This expression is characterized by interference between terms from two-photon transitions from the ground state to the even-symmetry excited states and one-photon transitions between the ground state and odd-symmetry excited states. When contributions from the two-photon terms exceed those from the one-photon terms, the non-resonant intensity-dependent refractive index n_2>0, and vice versa. Examples of the frequency dispersion for the three-level SOS model are given. Comparison is made with other existing theories.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Advanced Multiphoton Polymerization using Tunable Shaped Laser Wavepackets",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=FiO-2018-FM4B.4",
            "Abstract": "Tunable abruptly autofocusing ring Airy beams enable advanced multiscale photo-polymerization. Scaling down to the paraxial regime, these beams can approach the wavelength limit while presenting a strong enhancement of their focal intensity.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:yB1At4FlUx8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Sculptured ultrashort laser wave packets for advanced materials engineering",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2017-CM_3_1",
            "Abstract": "The nonlinear propagation of ultrashort laser pulses in the form of solitons, filaments and light bullets is an exciting research field [1]. Beyond the basic studies on the complex physical phenomena involved, the field is driven significantly by its numerous applications, like for example in materials engineering, remote spectroscopy, lightning control.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Detection of harmful residues in honey using terahertz time-domain spectroscopy",
            "Publication year": 2013,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1366/13-07111",
            "Abstract": "Terahertz time-domain spectroscopy (THz–TDS) has been applied for the detection and discrimination of harmful chemical residues in honey. Three antibiotics (sulfapyridine, sulfathiazole, and tetracycline) and two acaricides (coumaphos and amitraz) were characterized in the THz frequency regime between 0.5 THz and 6.0 THz. All chemical substances present distinct absorption peaks. THz transmission measurements of honey mixtures with antibiotics have been performed, revealing that antibiotic residues are traceable in highly absorptive food products, such as honey, at concentrations down to 1% weight percentage, thanks to their THz fingerprints. Moreover, multiple antibiotics were identified in their mixture with honey, pointing out the potential of the technique to be used in the near future as a fast, real-time technique for detecting and discriminating multi-residues strictly related to food safety issues.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Free space broadband intense THz sources and applications",
            "Publication year": 2020,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11390/113900I/Free-space-broadband-intense-THz-sources-and-applications/10.1117/12.2558454.short",
            "Abstract": "Extreme nonlinear interactions of THz electromagnetic fields with matter are the next frontier in nonlinear optics. However, reaching this frontier in free space is limited by the existing lack of appropriate powerful THz sources. Here we demonstrate both theoretically and experimentally the realization of a novel THz source with high peak power performance based on two-color filamentation of femtosecond mid-infrared laser pulses at 3.9 μm. Our theory predicts that under this scheme sub-cycle THz pulses with multi-millijoule energies and record conversion efficiencies can be produced. Besides, we elucidate the origin of this high efficiency, which is made up of several factors, including a novel mechanism where the harmonics produced by the mid-infrared pulses strongly contribute to the field symmetry breaking and enhance the THz generation. In our experiments we verify the theoretical predictions by …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "PROFILING OF AEROSOL OPTICAL PROPERTIES OVER ATHENS AND THESSALONIKI, GREECE, DURING SPECIAL EVENTS USING GROUND BASED ELASTIC BACKSCATTER–RAMAN LIDAR SYSTEMS (2000-2003)",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Vassilis_Amiridis/publication/234396812_Profiling_of_Aerosol_Optical_Properties_Over_Athens_and_Thessaloniki_Greece_during_Special_Events_Using_Ground_Based_Elastic_Backscatter_-_Raman_LIDAR_Systems_2000-2003/links/0912f51278b791734a000000/Profiling-of-Aerosol-Optical-Properties-Over-Athens-and-Thessaloniki-Greece-during-Special-Events-Using-Ground-Based-Elastic-Backscatter-Raman-LIDAR-Systems-2000-2003.pdf",
            "Abstract": "We present vertical profiles of the aerosol optical properties over Athens and Thessaloniki (Greece) obtained by two ground-based elastic backscatter–Raman lidar systems. Most of these profiles were obtained during special events in the frame of the EARLINET project (2000-2003) and were related to Saharan dust outbreaks, photochemical air pollution events, forest fires and volcanic eruptions (Etna volcano).",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Laser‐driven strong‐field terahertz sources",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adom.201900681",
            "Abstract": "A review on the recent development of intense laser‐driven terahertz (THz) sources is provided here. The technologies discussed include various types of sources based on optical rectification (OR), spintronic emitters, and laser‐filament‐induced plasma. The emphasis is on OR using pump pulses with tilted intensity front. Illustrative examples of newly emerging applications are briefly discussed, in particular strong‐field THz control of materials and acceleration and manipulation of charged particles.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Том. 11168. Advanced Manufacturing Technologies for Micro-and Nanosystems in Security and Defence II.-Сер. Advanced Manufacturing Technologies for Micro-and Nanosystems in Security and Defence II",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=11519270462934313416&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Femtosecond infrared filaments in air: a source of coherent THz radiation",
            "Publication year": 2003,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2003-QWB4",
            "Abstract": "We observe coherent THz emission from a 1-m plasma string produced by an IR fs laser pulse in atmosphere. The THz pulse is detected perpendicular to the laser propagation axis using heterodyne detection.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:blknAaTinKkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Femtosecond laser pulse control of collapsing bubble jets and bubble ejection streams",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6327032/",
            "Abstract": "We study cavitation dynamics when focusing high angle Bessel beams in water. We observe remarkable bubble dynamics with jets directed along the laser axis, bubble break-up and ejection of a high-speed stream of nano-bubbles.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mastering micro-filamentation for semiconductor–metal ultrafast laser welding",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9541622/",
            "Abstract": "Ultrafast laser welding is a proven technique which enables to bond a wide variety of materials together. This technique relies on laser energy deposition at the interface between two materials. While, to date, ultrafast laser welding has been demonstrated in numerous material configurations such as glass–glass, glass–semiconductor, glass–metal, polymer–polymer, and ceramic–ceramic, it has no equivalent for the semiconductor-metal configuration so far, which would be particularly interesting for applications in microelectronics.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:hCrLmN-GePgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time-evolution of the plasma channel at the trail of a self-guided IR femtosecond laser pulse in air",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401800007343",
            "Abstract": "The density and decay kinetics of a plasma channel created in air by a self-guided intense ultra-short laser pulse is determined by a new electric cross-conductivity method and by diffraction interferometry. A fast decay is measured, due to the dominant intrinsic recombination process at high plasma density.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:O3NaXMp0MMsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Kerr-induced spontaneous Bessel beam formation in the regime of strong two-photon absorption",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OE-16-11-8213",
            "Abstract": "We study the effect of Two-Photon Absorption (TPA) nonlinear losses on Gaussian pulses, with power that exceeds the critical power for self-focusing, propagating in bulk kerr media. Experiments performed in fused silica and silicon highlight a spontaneous reshaping of the input pulse into a pulsed Bessel beam. A filament is formed in which sub-diffractive propagation is sustained by the Bessel-nature of the pulse.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:roLk4NBRz8UC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Taming ultrafast laser filaments for optimized semiconductor–metal welding",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/lpor.202000433",
            "Abstract": "Ultrafast laser welding is a fast, clean, and contactless technique for joining a broad range of materials. Nevertheless, this technique cannot be applied for bonding semiconductors and metals. By investigating the nonlinear propagation of picosecond laser pulses in silicon, it is elucidated how the evolution of filaments during propagation prevents the energy deposition at the semiconductor–metal interface. While the restrictions imposed by nonlinear propagation effects in semiconductors usually inhibit countless applications, the possibility to perform semiconductor–metal ultrafast laser welding is demonstrated. This technique relies on the determination and the precompensation of the nonlinear focal shift for relocating filaments and thus optimizing the energy deposition at the interface between the materials. The resulting welds show remarkable shear joining strengths (up to 2.2 MPa) compatible with applications …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:i2xiXl-TujoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Terahertz pulse emission optimization from tailored femtosecond laser pulse filamentation in air",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-34-14-2165",
            "Abstract": "We study the generation of intense terahertz pulses produced by two-color laser pulse filamentation in air. We tailor the filamentation process and the produced plasma strings and study how the generated terahertz field is modified. An important terahertz pulse shortening is found for plasma strings with uniform electron density.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Fano resonances in THz metamaterials composed of continuous metallic wires and split ring resonators",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-22-22-26572",
            "Abstract": "We demonstrate theoretically and experimentally that Fano resonances can be obtained in terahertz metamaterials that are composed of periodic continuous metallic wires dressed with periodic split ring resonators. An asymmetric Fano lineshape has been found in a narrow frequency range of the transmission curve. By using a transmission line combined with lumped element model, we are able to not only fit the transmission spectra of Fano resonance which is attributed to the coupling and interference between the transmission continuum of continuous metallic wires and the bright resonant mode of split ring resonators, but also reveal the capacitance change of the split ring resonators induced frequency shift of the Fano resonance. Therefore, the proposed theoretical model shows more capabilities than conventional coupled oscillator model in the design of Fano structures. The effective parameters of group …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Eutectic terahertz metamaterials",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6665742/",
            "Abstract": "We present unique phenomena of enhanced transmission of terahertz (THz) waves through a self-organized eutectic metamaterial 1 . Our experimental results in combination with theoretical calculations show that the experimentally observed enhanced transmission is associated with sub-wavelength waveguiding within the dielectric rods lattice embedded in an epsilon-near zero polaritonic host.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic response of metamaterials in the terahertz regime: Blueshift tunability and broadband phase modulation",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3292208",
            "Abstract": "Terahertz time-domain spectroscopy is used to probe the electromagnetic properties of metamaterials, which are dynamically photoexcited, using synchronized femtosecond near-infrared laser pulses. Blueshift tunability of the electric dipole metamaterial’s resonance, as well as a broadband phase tunability reaching ∼π/4, are demonstrated. Numerical simulations show the observations are due to changes in the complex index of the photoexcited semiconductor substrate.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Intense dynamic bullets in a periodic lattice",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-11-10057",
            "Abstract": "Femtosecond filamentation inside a periodic lattice in air is numerically shown to form intense dynamic bullets. The long propagation distance of the bullet structure is primarily attributed to the effect of the lattice that regulates the competition between linear and nonlinear spatiotemporal effects in the region of normal dispersion.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:_kc_bZDykSQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Femtosecond laser-guided electric discharge in air",
            "Publication year": 2001,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.64.057401",
            "Abstract": "The filament due to the self-guided propagation of an infrared femtosecond laser pulse in atmospheric-pressure air is used to trigger and guide an electric discharge. The long low density plasma channel due to the filament is first heated by the Joule effect during an initial transient plasma stage. The heated channel of recombined gas then hydrodynamically expands radially. The onset of a discharge starts when the density depression on axis reaches the threshold discharge value. This model is supported by detailed experimental and numerical analysis.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:RYcK_YlVTxYC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Experimental Observation of Ultrafast THz Absorption Modulation in a Graphene-Based Metasurface",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2019-cc_4_3",
            "Abstract": "Graphene, a two-dimensional material made of carbon atoms arranged in a honeycomb lattice, has attracted enormous attention since its experimental realization in 2004 [1] due to its unique mechanical, thermal, electrical and optical properties. Particularly in the THz spectrum, graphene predominantly exhibits a Drude-like response due to its easily generated and controlled free carriers and therefore is considered a suitable platform for dynamically tunable metasurface components [2]. Such an example, are the so called thin film absorbers that are structures capable of absorbing all power of incident electromagnetic waves. They are used as non-reflective covering layers for shielding against electromagnetic radiation and minimization of backscattering from electromagnetic large structures. Within the concept of metasurfaces, thin film absorbers, are usually implemented by placing a lossy material on the top of a …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:EYYDruWGBe4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Analysis of the X-ray and time-resolved XUV emission of laser produced Xe and Kr plasmas",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574181807000055",
            "Abstract": "A frequency-doubled laser beam of the Nd:glass kilojoule nanosecond LULI2000 facility (1.5 ns duration, 200–400 J energy, 0.53 μm wavelength) was focused on a Xe or Kr gas jet. The plasma was simultaneously diagnosed with X-ray (in the wavelength range of 6–8 Å for Kr and of 12–15 Å for Xe) and time-resolved XUV (20–200 Å) emission spectroscopy. Electron density and temperature as well as the ionization charge were measured by time-resolved Thomson scattering of the heating laser pulse. The spectra are compared with the calculations performed with the NLTE collisional-radiative code AVERROES/TRANSPEC. Best fits of the X-ray and XUV spectra obtained are presented. The measured charge distribution and dynamics is analyzed using the simultaneous Thomson scattering diagnostic.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Picosecond time-resolved x-ray absorption spectroscopy of ultrafast aluminum plasmas",
            "Publication year": 2005,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.94.025004",
            "Abstract": "We have used point-projection K-shell absorption spectroscopy to infer the ionization and recombination dynamics of transient aluminum plasmas. Two femtosecond beams of the 100 TW laser at the LULI facility were used to produce an aluminum plasma on a thin aluminum foil (83 or 50 nm), and a picosecond x-ray backlighter source. The short-pulse backlighter probed the aluminum plasma at different times by adjusting the delay between the two femtosecond driving beams. Absorption x-ray spectra at early times are characteristic of a dense and rather homogeneous plasma. Collisional-radiative atomic physics coupled with hydrodynamic simulations reproduce fairly well the measured average ionization as a function of time.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:vV6vV6tmYwMC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Nonlinear plasma-assisted collapse of ring-Airy wave packets",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.93.033808",
            "Abstract": "We numerically demonstrate that femtosecond ring-Airy wave packets are able to overcome the reference intensity clamping of 4× 10 13 W/cm 2 for filaments generated with Gaussian beams at low numerical apertures and form an intense sharp intensity peak on axis. Numerical simulations, with unidirectional propagation models for the pulse envelope and the carrier resolved electric field, reveal that the driving mechanism for this unexpected intensity increase is due to the self-generated plasma. The plasma formation, in conjunction with the circular geometry of the beam, force the wave packet into a multistage collapse process which takes place faster than the saturating mechanisms can compensate. We report here a nonstandard mechanism that increases the intensity of a collapsing wave packet, due to the joint contributions of the cubic phase of the Airy beam and the formation of a partially reflecting plasma.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:wbdj-CoPYUoC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Faithful communication Hamiltonian in photonic lattices",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-37-21-4504",
            "Abstract": "Faithful communication is a necessary precondition for large scale all-optical networking and quantum information processing. Related theoretical investigations in different areas of physics have led to various proposals in which finite discrete lattices are used as channels for short-distance communication tasks. Here, in the framework of femtosecond-laser-written waveguide arrays, we present the first experimental realization of such a channel with judiciously engineered couplings.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Enhancing THz radiation from two-color laser-induced air-plasma by using abruptly autofocusing beams",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=FiO-2016-JTh2A.98",
            "Abstract": "By using abruptly autofocusing beams, as opposed to the conventional Gaussian beams, to generate plasma in the ambient air, an enhancement of the terahertz radiation from the plasma in the low frequency region is observed.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:5awf1xo2G04C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Extremely bright THz radiation from two-color filamentation of mid-infrared laser pulses",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_AT-2018-JTu2A.113",
            "Abstract": "We show numerically that two-color filamentation of mid-infrared 3.9 µm laser pulses allows one to generate THz pulses of multi-millijoule energies and extreme conversion efficiencies, with electric and magnetic fields of GV/cm and kT level, exceeding by far any available quasi-DC field source today.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Eutectic epsilon-near-zero metamaterial terahertz waveguides",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-38-7-1140",
            "Abstract": "We present and analyze the unique phenomena of enhanced THz transmission through a subwavelength LiF dielectric rod lattice embedded in an epsilon-near-zero KCl host. Our experimental results in combination with theoretical calculations show that subwavelength waveguiding of terahertz radiation is achieved within an alkali–halide eutectic metamaterial as result of the coupling of Mie-resonance modes arising in the dielectric lattice.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Few-cycle laser-pulse collapse in Kerr media: The role of group-velocity dispersion and -wave formation",
            "Publication year": 2008,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.78.033826",
            "Abstract": "We study ultrashort laser-pulse propagation and filamentation dynamics in dispersive Kerr media. We identify the regime for which the filamentation threshold (P th) is considerably higher than the critical power (P cr) for monochromatic beam collapse in pure Kerr media. In particular, we compare the threshold for the formation of filaments with that for the formation of X-waves. At powers P cr< P< P th, self-focusing is arrested by group-velocity dispersion, and no filaments or X-waves are formed. At P⩾ P th, we observe X-wave formation and a weak filamentation regime. At P⪢ P th, we observe both X-waves and fully formed filaments.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Self-guided propagation of fs UV laser pulses and efficient harmonic generation in low pressure Argon",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=iqec-2004-ITuK2",
            "Abstract": "An important enhancement in harmonics production has been observed during the self-guided propagation of femtosecond ultraviolet laser pulses (248nm, 450fs) in Argon, attributed to quasi-phase locking in the filamented pulse.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Femtosecond laser induced plasma diffraction gratings in air as photonic devices for high intensity laser applications",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3157908",
            "Abstract": "The creation of volume plasma density gratings in air by temporally overlapped high-intensity IR femtosecond laser pulses is demonstrated experimentally. Through the diffraction of various probe beams the plasma grating properties are recovered including its thickness and refractive index modulation, as well as its decay dynamics. The diffraction properties of these plasma photonic devices suggest that they can be used in applications involving high intensity lasers, such as filamentation, where no physical objects can be placed in the path of the laser beams.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:ufrVoPGSRksC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Three-dimensional writing inside silicon using a 2-µm picosecond fiber laser",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02323573/",
            "Abstract": "Based on the development of a µJ-class Thulium-doped fiber laser operating in the picosecond regime at 1970-nm wavelength, we introduce a solution for three-dimensional (3D) laser writing technologies inside silicon (Si). We reveal that the nonlinear effects preventing from bulk modification in Si with femtosecond pulses persist in the picosecond regime. However, these are strongly reduced which makes possible to derive conditions for a demonstration of data inscription and reading deep into a Si wafer.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards light-matter interaction at extreme intensities using high-angle Bessel beams",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_si-2012-CM3K.4",
            "Abstract": "High-angle Bessel beams significantly reduce nonlinear pulse distortion yet enhance ionisation and plasma generation. Digital holographic reconstruction of Bessel beams in water show clamping at increased intensities and excess plasma heating in the pulse wake.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Tunable intense Airy beams and tailored femtosecond laser filaments",
            "Publication year": 2010,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.81.061807",
            "Abstract": "Optical aberrations are usually considered a drawback in optical systems. Here we show that through them a net cubic phase modulation can be imprinted on the wave front of a light beam, which after spatial Fourier transformation creates Airy beams. Experiments and supporting simulations demonstrate that appropriately adjusted cylindrical lenses can produce both one-and two-dimensional tunable Airy beams. The use of simple optical elements makes the approach attractive and convenient for generating intense femtosecond Airy beams and filaments. Moreover, we show that the Airy tunability is an excellent means of obtaining tailored filaments in both size and intensity.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:_FxGoFyzp5QC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Materials processing using abruptly autofocusing beams",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6833226/",
            "Abstract": "Radially symmetric Airy optical beams exhibit a focus area that is strongly non-symmetric and abrupt. We use this unique feature to precisely deliver energy in the bulk of fused silica without affecting the preceding material.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Observation of extremely efficient terahertz generation from mid-infrared two-color laser filaments",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41467-019-14206-x",
            "Abstract": "Extreme nonlinear interactions of THz electromagnetic fields with matter are the next frontier in nonlinear optics. However, reaching this frontier in free space is limited by the existing lack of appropriate powerful THz sources. Here, we experimentally demonstrate that two-color filamentation of femtosecond mid-infrared laser pulses at 3.9 μm allows one to generate ultrashort sub-cycle THz pulses with sub-milijoule energy and THz conversion efficiency of 2.36%, resulting in THz field amplitudes above 100 MV cm− 1. Our numerical simulations predict that the observed THz yield can be significantly upscaled by further optimizing the experimental setup. Finally, in order to demonstrate the strength of our THz source, we show that the generated THz pulses are powerful enough to induce nonlinear cross-phase modulation in electro-optic crystals. Our work paves the way toward free space extreme nonlinear THz optics …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:MLfJN-KU85MC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Strong power upscaling of THz sources based on laser filamentation in transparent media",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2017-PD_2_8",
            "Abstract": "Intense, ultra-broadband terahertz (THz) pulses can drive major advances in ultrafast dynamics, nonlinear THz optics, and bio-material imaging [1, 2]. Single and two-color filamentation of ultrashort laser pulses in gases have been extensively used for the generation of such pulses [3, 4]. However, filament formation in gases is hindered by the need of high laser pulse energies, motivating the exploration of alternate generation mechanisms [5]. On the other hand, filamentation can be achieved more easily in alternative target materials such as transparent solids and liquids [6, 7]. Though, THz emission through either single or two-color filamentation in such materials, has not been investigated yet. Here we demonstrate, for the first time, strong THz emission through single and two-color filamentation in liquids and in fused silica (SiO 2) respectively and a significant THz field enhancement when using high repetition …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Experimental demonstration of ultrafast THz modulation in a graphene-based thin film absorber through negative photoinduced conductivity",
            "Publication year": 2019,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/acsphotonics.8b01595",
            "Abstract": "We present an experimental demonstration and interpretation of an ultrafast optically tunable, graphene-based thin film absorption modulator for operation in the THz regime. The graphene-based component consists of a uniform CVD-grown graphene sheet stacked on an SU-8 dielectric substrate that is grounded by a metallic ground plate. The structure shows enhanced absorption originating from constructive interference of the impinging and reflected waves at the absorbing graphene sheet. The modulation of this absorption, which is demonstrated via a THz time-domain spectroscopy setup, is achieved by applying an optical pump signal, which modifies the conductivity of the graphene sheet. We report an ultrafast (on the order of few ps) absorption modulation on the order of 40% upon photoexcitation. Our results provide evidence that the optical pump excitation results in the degradation of the graphene THz …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:vDijr-p_gm4C",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Nonlinear propagation of subpicosecond ultraviolet laser pulses in air",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-25-17-1270",
            "Abstract": "We report filamentation of subpicosecond UV laser pulses with only millijoule energy in atmosphere. The results are in good agreement with a numerical simulation using a quasi-three-dimensional propagation code.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:lSLTfruPkqcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "The Role of Gas Dynamics on Laser Filamentation THz Sources Operating at High Repetition Rates",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2021-cc_p_10",
            "Abstract": "We report on the impact of laser pulse repetition rate on two-color filamentation based terahertz sources. A 50 decrease on the terahertz energy is observed when the repetition rate increases from 0.6 to 6 kHz.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Extreme events in complex linear and nonlinear photonic media",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077916000175",
            "Abstract": "Ocean rogue waves (RW) are huge solitary waves that have for long triggered the interest of scientists. The RWs emerge in a complex environment and it is still under investigation if they are due to linear or nonlinear processes. Recent works have demonstrated that RWs appear in various other physical systems such as microwaves, nonlinear crystals, cold atoms, etc. In this work we investigate optical wave propagation in strongly scattering random lattices embedded in the bulk of transparent glasses. In the linear regime we observe the appearance of extreme waves, RW-type, that depend solely on the scattering properties of the medium. Interestingly, the addition of nonlinearity does not modify the RW statistics, while as the nonlinearities are increased multiple-filamentation and intensity clamping destroy the RW statistics. Numerical simulations agree nicely with the experimental findings and altogether prove that …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Evanescent-wave cavity ring-down ellipsometry",
            "Publication year": 2011,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/jz200515d",
            "Abstract": "We introduce the new technique of evanescent-wave cavity ring-down ellipsometry (EW-CRDE), used for the measurement of ellipsometric angles of samples at a solid–gas or solid–liquid interface, and achieve phase-shift measurements with precision of ∼0.01°. We demonstrate the technique by measuring the time-dependent refractive index of methanol–water mixtures and thin films at the liquid/fused-silica interface, showing that the monitoring of monolayers on microsecond time scales using EW-CRDE should be achievable.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Semiconductor-metal ultrafast laser welding with relocated filaments",
            "Publication year": 2021,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11676/1167610/Semiconductor-metal-ultrafast-laser-welding-with-relocated-filaments/10.1117/12.2579220.short",
            "Abstract": "Ultrafast laser welding is a fast, clean, and contactless technique for joining a broad range of materials. Nevertheless, this technique cannot be applied for bonding semiconductors and metals. By investigating the nonlinear propagation of picosecond laser pulses in silicon, it is elucidated how the evolution of filaments during propagation prevents the energy deposition at the semiconductor–metal interface. While the restrictions imposed by nonlinear propagation effects in semiconductors usually inhibit countless applications, the possibility to perform semiconductor–metal ultrafast laser welding is demonstrated. This technique relies on the determination and the precompensation of the nonlinear focal shift for relocating filaments and thus optimizing the energy deposition at the interface between the materials. The resulting welds show remarkable shear joining strengths (up to 2.2 MPa) compatible with applications …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:Dip1O2bNi0gC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Filamentation in air with twin femtosecond laser pulses",
            "Publication year": 2003,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2003-QMF6",
            "Abstract": "We study filamentation in air using a sequence of two intense IR femtosecond laser pulses with variable delay. Increased filament length and pulse shortening is observed, in agreement with simulations.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Wavefront shaping for opaque cylindrical lenses",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1601.08156",
            "Abstract": "Wavefront shaping has revolutionized the concepts of optical imaging and focusing. Contrary to what was believed, strong scattering in the optical paths can be exploited in favor of light focusing through turbid media and ultimately improve optical imaging and light manipulation capabilities. The use of light shapers and appropriately engineered scattering structures, i.e. opaque lenses enables the production of nano-scale confined foci and of extended fields of view. Exploiting this concept we fabricate configurable scattering structures by direct femtosecond laser writing. The properly shaped light trespassing the customized structure, a photonic lattice of parallel rods, forms a light-sheet at user defined positions. We demonstrate that our technique enables light-sheets with sub-micron resolution and extended depth of focus, a significant advantage when compared to the existing free space systems. Moreover, our approach permits to focus light of different wavelengths onto the same defined position without moving any optical element and correcting for chromatic aberrations. Furthermore, we demonstrate how an opaque cylindrical lens can be created using a biological structure, hence unveiling the potential advantages for optical microscopic and mesoscopic imaging.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ultrafast electron and material dynamics following femtosecond filamentation induced excitation of transparent solids",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-013-8114-4",
            "Abstract": "We examine the spatiotemporal dynamics of filamentation and subsequent material changes in two transparent media, fused silica and poly(methyl methacrylate) (PMMA), using inline holographic microscopy. We are able to dynamically observe the nonlinear propagation of femtosecond laser pulses and the consequent evolution of the electronic excitatio n and trapping inside the bulk of both materials. In the case of fused silica we reveal the physical conditions for the formation of nanogratings, measuring excited electron densities well below the critical density while for PMMA we show that excited electrons with densities exceeding 1018 cm−3, exhibit complex trapping dynamics in a 200 fs time scale. The clear demonstration of ultrafast sub-ps photochemical processes that take place during the irradiation of PMMA with femtosecond pulses will have a strong impact on the laser microprocessing of …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Passive radiative cooling impact on commercial crystalline silicon-based photovoltaics",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1912.12154",
            "Abstract": "The radiative cooling of objects during daytime under direct sunlight has recently been shown to be significantly enhanced by utilizing nanophotonic coatings. Multilayer thin film stacks, 2D photonic crystals, etc. as coating structures improved the thermal emission rate of a device in the infrared atmospheric transparency window reducing considerably devices' temperature. Due to the increased heating in photovoltaic (PV) devices, that has significant adverse consequences on both their efficiency and life-time, and inspired by the recent advances in daytime radiative cooling, we developed a coupled thermal-electrical modeling to examine the physical mechanisms on how a radiative cooler affects the overall efficiency of commercial photovoltaic modules. Employing this modeling, which takes into account all the major processes affected by the temperature variation in a PV device, we evaluated the relative impact of the main radiative cooling approaches proposed so far on the PV efficiency, and we established required conditions for optimized radiative cooling. Moreover, we identified the validity regimes of the currently existing PV-cooling models which treat the PV coolers as simple thermal emitters. Finally, we assessed some realistic photonic coolers from the literature, compatible with photovoltaics, to implement the radiative cooling requirements, and demonstrated their associated impact on the temperature reduction and PV efficiency. Providing the physical mechanisms and requirements for cooling radiatively solar cells, our study provides guidelines for utilizing suitable photonic structures as radiative coolers, enhancing the efficiency and …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:tuHXwOkdijsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhanced harmonic conversion efficiency in the self-guided propagation of femtosecond ultraviolet laser pulses in argon",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-004-1683-3",
            "Abstract": "Harmonic generation during the self-guided propagation of femtosecond ultraviolet (UV) laser pulses (248-nm, 450-fs) in argon is investigated. The third (82.7-nm) and fifth (49.6-nm) harmonics are generated in the UV filament. The energy-conversion efficiencies for the harmonics are found to be at least two orders of magnitude higher than those reported in the literature for similar gas pressures. The enhancement is attributed to the quasi-phase matching of the harmonics due to the self-guiding of the driving pulse. ",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Ultraviolet laser filaments for remote laser-induced breakdown spectroscopy (LIBS) analysis: applications in cultural heritage monitoring",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-31-8-1139",
            "Abstract": "We report experiments with subpicosecond UV laser filaments for the remote analysis of samples related to objects of cultural heritage. The classic laser-induced breakdown spectroscopy (LIBS) technique finds new avenues through femtosecond filamentation, and dynamic remote LIBS becomes possible. Advantages such as self-regulated laser intensity deposition on the target suggest that there is significant potential for using UV femtosecond filaments for the remote analysis of sculpture and large monuments.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Tailoring femtosecond laser pulse filamentation using plasma photonic lattices",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4813310",
            "Abstract": "We demonstrate experimentally that by using transient plasma photonic lattices, the attributes of intense femtosecond laser filaments, such as peak intensity and length, can be dynamically controlled. The extended plasma lattice structure is generated using two co-propagating non-diffracting intense Bessel beams in water. The use of such transient lattice structures to control the competition between linear and nonlinear effects involved in filamentation opens the way for extensive control of the filamentation process.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:isC4tDSrTZIC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Nonlinear light-matter interaction with femtosecond high-angle Bessel beams",
            "Publication year": 2012,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.85.033829",
            "Abstract": "We show that high-angle Bessel beams may significantly reduce nonlinear pulse distortions due, for example, to nonlinear Kerr effects (self-phase-modulation and self-focusing) yet enhance ionization and plasma generation. Holographic reconstruction of Bessel beams in water show intensity clamping at increased intensities and evidence of nontrivial plasma dynamics as the input energy is increased. The solvated electron density increases significantly and the cavitation-induced bubbles are ejected from the focal region indicating a significant excess plasma heating in the Bessel-pulse wake.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Impact of Polarization on Mid-IR Air Filaments",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_qels-2018-FM1Q.2",
            "Abstract": "We report results of experimental investigation on polarization evolution and losses in linearly and circularly polarized mid-IR filaments in air under different focusing conditions.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:fEOibwPWpKIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Femtosecond and picosecond ultraviolet laser filaments in air: experiments and simulations",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401801014432",
            "Abstract": "We report a study of the long-range self-guided propagation of intense femtosecond and picosecond UV laser pulses in air. Measurements of the laser beam profile along the propagation axis together with the ionization rate, the pulse temporal profile and power spectrum provide a comprehensive image of the UV filamentation process and its characteristics. Self-guiding is shown to subsist in both fs and ps cases, with a robust filament propagating over several meters in air. Stable filamentation is accompanied by an important restructuring of the pulse temporal profile. Complementary numerical simulations, using a three-dimension propagation code, are compared to the experimental results. The simulations reproduce most experimental observations, allowing for a better understanding of the phenomena involved in this unique propagation mode.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:35N4QoGY0k4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Long range horizontal propagation of femtosecond self-channelled laser pulses in air",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=IQEC-2004-ITuK1",
            "Abstract": "Using a multiterawatt femtosecond laser, we have studied long distance (~ 2 km) filamentation in air as a function of initial pulse chirp. Ionized channels are observed over several hundred meters.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Long spatio-temporally stationary filaments in air using short pulse UV laser Bessel beams",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-17-7-5052",
            "Abstract": "The formation of long stationary filaments resulting in uniform high density plasma strings in air using short pulse UV laser Bessel beams is shown. The length and the electron density of the plasma strings can be easily tuned by adjusting the conical Bessel wavefront angle. It is shown that in this regime the length of the plasma string can be extended over meter-long scales without any compromise in the string uniformity or any temporal evolution of the filamented laser pulse.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:0EnyYjriUFMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Diffraction properties of Floquet topological states in photonic lattices",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=eqec-2017-JSIV_2_2",
            "Abstract": "Manipulating the flow of light with unusual diffraction features has been enabled, during the last decades, by considering optical transport in structured photonic media. The analogy between solid-states physics and the light propagation in specifically engineered arrayed structures generally leads to gapped dispersion relations. More recently, photonics borrowed concepts from topological insulators (TIs) which possess topologically nontrivial gapped bandstructure [1]. For finite systems, the number of topologically protected states, localized at the interface, can be predicted by simply comparing the topological invariants associated to the bandstructures of each system. It was also proposed that topological states may arise, when a system is subjected to a non-adiabatic time-periodic potential. This concept of Floquet topological insulators, first developed in the context of irradiated semimetals and semi-conductors [2 …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:W5xh706n7nkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Spontaneous emergence of pulses with constant carrier-envelope phase in femtosecond filamentation.",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=oe-16-15-11103",
            "Abstract": "We study the possibility to obtain high-intensity pulses that maintain a constant Carrier Envelope Phase (CEP) during propagation in dispersive media, i.e. pulses such that the carrier-wave offset with respect to the main intensity peak remains fixed. Our numerical experiments strongly suggest that pulse splitting and X-wave formation within femtosecond laser pulse filamentation leads to the formation of \"constant-CEP\" within well-defined regions inside the filament.We study the creation of \"constant- CEP\" pulses in both gasseous and condensed media showing that this is a generic feature of filaments.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:Se3iqnhoufwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Observation of abruptly autofocusing waves",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-36-10-1842",
            "Abstract": "We report on the experimental observation of abruptly autofocusing waves. This interesting family of wave packets has been realized by using a radially symmetric Airy intensity distribution. As demonstrated in our experiments, these waves can exhibit unusual features, such as the ability to autofocus by following a parabolic trajectory toward their focus.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:qjMakFHDy7sC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Tailored light sheets through opaque cylindrical lenses",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=optica-3-11-1237",
            "Abstract": "Strong scattering in the optical paths can be proactively exploited for determining light propagation and focusing through turbid media and ultimately improve optical imaging and light manipulation capabilities. The use of light shapers together with strongly scattering structures enables the production of foci confined in the nanoscale or on the other hand may provide significantly enhanced fields of view. Exploiting this concept, we introduce ad hoc engineered scattering structures, by direct femtosecond laser writing in the bulk of glasses, presenting isotropy in one dimension, and together with precisely phase-shaped illuminating light we produce submicrometer thin light sheets at user-defined positions. Our approach permits us to focus light of different wavelengths onto the same defined position without moving any optical element and correcting for chromatic aberrations. Furthermore, we demonstrate that natural …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:WqliGbK-hY8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Femtosecond laser-induced damage and filamentary propagation in fused silica",
            "Publication year": 2002,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.89.186601",
            "Abstract": "Bulk damage induced by fs IR laser pulses in silica is investigated both experimentally and numerically. In a strong focusing geometry, a first damage zone is followed by a narrow track with submicron width, indicating a filamentary propagation. The shape and size of the damage tracks are shown to correspond to the zone where the electron density created by optical field ionization and avalanche is close to 10 20 c m− 3. The relative role of avalanche and photoionization is studied. The plasma density produced in the wake of the pulse is shown to saturate around 2–4× 10 20 c m− 3.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:hMod-77fHWUC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "An intense tunable femtosecond gas-plasma THz source: Application in spectroscopic studies of polycyclic aromatic hydrocarbons",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022286011004637",
            "Abstract": "We present a review on the emission of intense THz pulses from 2-color femtosecond laser filaments in gases. Through the tailoring of the filamentation process tuning of the emitted THz pulses is possible and is described in details. Using these THz pulses as a spectroscopic tool, the absorption spectra of small polycyclic aromatic hydrocarbons and their halogenated compounds are studied. Distinct resonance features for all the examined compounds have been observed, demonstrating the potential of the approach for rapidly discriminating the molecular structure of large organic molecules, in their crystalline form.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:dhFuZR0502QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Passive radiative cooling and other photonic approaches for the temperature control of photovoltaics: a comparative study for crystalline silicon-based architectures",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-28-13-18548",
            "Abstract": "The radiative cooling of objects during daytime under direct sunlight has recently been shown to be significantly enhanced by utilizing nanophotonic coatings. Multilayer thin film stacks, 2D photonic crystals, etc. as coating structures improved the thermal emission rate of a device in the infrared atmospheric transparency window reducing considerably devices’ temperature. Due to the increased heating in photovoltaic (PV) devices–that has significant adverse consequences on both their efficiency and life-time–and inspired by the recent advances in daytime radiative cooling, we developed a coupled thermal-electrical modeling to examine the physical mechanisms on how a radiative cooler affects the overall efficiency of commercial photovoltaic modules and how the radiative cooling impact is compared with the impact of other photonic strategies for reducing heat generation within PVs, such as ultraviolet and sub …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:M7yex6snE4oC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Extreme THz fields from two-color filamentation of midinfrared laser pulses",
            "Publication year": 2018,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.97.063842",
            "Abstract": "Nonlinear THz photonics is probably the last frontier of nonlinear optics. The strength of both the electric and the magnetic fields of these ultrashort low-frequency light bunches opens the way to exciting science and applications. Progress in the field though is slow because of the deficiency in suitable sources. Here we show that two-color filamentation of midinfrared 3.9 μ m laser pulses allows one to generate single-cycle THz pulses with multimillijoule energies and record conversion efficiencies. Moreover, the focused THz peak electric and magnetic fields reach values of GV/cm and kT, respectively, exceeding by far any available quasi-dc field source today. These fields enable extreme field science, including into other, relativistic phenomena. In addition, we elucidate the origin of this high efficiency, which is made up of several factors, including a mechanism where the harmonics produced by the midinfrared …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:dQ2og3OwTAUC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Controlling high-power autofocusing waves with periodic lattices",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-39-16-4958",
            "Abstract": "We show numerically that by using radial symmetric lattices, the focal spot characteristics and filament peak intensity of high-power autofocusing waves can be controlled. The lattice induced diffraction is able to isolate the main on-axis peak and control the focus position. In addition, at higher power the lattice can control and stabilize the peak intensity of the filament over an extended distance.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Competing Nonlinear Delocalization of Light for Laser Inscription Inside Silicon with a 2-µm Picosecond Laser",
            "Publication year": 2019,
            "Publication url": "https://journals.aps.org/prapplied/abstract/10.1103/PhysRevApplied.12.024009",
            "Abstract": "The metrology of laser-induced damage usually finds a single transition from 0% to 100% damage probability when progressively increasing the laser energy in experiments. We observe that picosecond pulses at 2-µm wavelength focused inside silicon provide a response that strongly deviates from this. Supported by nonlinear propagation simulations and energy flow analyses, we reveal an increased light delocalization for near critical power conditions. This leads to a nonmonotonic evolution of the peak delivered fluence as a function of the incoming pulse of the energy, a situation more complex than the clamping of the intensity until now observed in ultrafast regimes. Compared to femtosecond lasers, our measurements show that picosecond sources lead to reduced thresholds for three-dimensional (3D) writing inside silicon that is highly desirable. However, strong interplays between nonlinear effects persist …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:4MWp96NkSFoC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Long connected plasma channels in air produced by ultrashort UV laser pulses",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2000-QWL2",
            "Abstract": "Several studies have shown recently that ultrashort infrared laser pulses propagating through atmosphere may create long plasma filaments. 1− 3 This effect may have important applications in laser-controlled discharges 4 long-range deposition of high laser intensities, new LIDAR monitoring,'etc.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Wireless optical telecommunications using non trivial beams",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6833162/",
            "Abstract": "We demonstrate using experiments and simulations that the use of accelerating optical beams such as Airy and ring-Airy beams, considerably benefits wireless optical telecommunications both in respect of range and robustness to atmospheric turbulence.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Combined nano and micro structuring for enhanced radiative cooling and efficiency of photovoltaic cells",
            "Publication year": 2021,
            "Publication url": "https://www.nature.com/articles/s41598-021-91061-1",
            "Abstract": "Outdoor devices comprising materials with mid-IR emissions at the atmospheric window (8–13 μm) achieve passive heat dissipation to outer space (~− 270 C), besides the atmosphere, being suitable for cooling applications. Recent studies have shown that the micro-scale photonic patterning of such materials further enhances their spectral emissivity. This approach is crucial, especially for daytime operation, where solar radiation often increases the device heat load. However, micro-scale patterning is often sub-optimal for other wavelengths besides 8–13 μm, limiting the devices’ efficiency. Here, we show that the superposition of properly designed in-plane nano-and micro-scaled periodic patterns results in enhanced device performance in the case of solar cell applications. We apply this idea in scalable, few-micron-thick, and simple single-material (glass) radiative coolers on top of simple-planar Si substrates …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:foquWX3nUaYC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Filamentation-induced third-harmonic generation in air via plasma-enhanced third-order susceptibility",
            "Publication year": 2010,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.81.033817",
            "Abstract": "We study, both experimentally and theoretically, the underlying physics of third-harmonic generation in air by a filamented infrared femtosecond laser pulse propagating through a thin plasma channel. It is shown that the recently observed more than two-order-of-magnitude increase of the efficiency of third-harmonic generation occurs due to the plasma-enhanced third-order susceptibility. An estimate of the effective value of this susceptibility is given.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:eQOLeE2rZwMC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Study of THz emission from ring-airy beam induced plasma",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7327523/",
            "Abstract": "We experimentally investigated the THz emission from two-color ring-Airy beam induced plasma in the ambient air. The results show that this exotic autofocusing beam tends to form an elongated weak filamentation with a main peak at the front and a `tail' with certain oscillations following, which leads to a higher THz yield and a slightly narrower THz spectrum than the emission from a Gaussian beam plasma under the same circumstances.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultrafast THz Self-action Graphene Based Modulators",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_QELS-2021-FTu2J.4",
            "Abstract": "We demonstrate an ultrafast self-induced terahertz absorption modulator operating at 2.3 THz. A modulation of 50 dB is observed in the absorption when the THz field strength increases from 145 to 654 kV/cm.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:0N-VGjzr574C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Sub-picosecond ultraviolet laser filamentation-induced bulk modifications in fused silica",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-005-3271-8",
            "Abstract": "We present experiments with sub-picosecond ultraviolet laser pulses (248 nm, 450 fs) tightly focused in the bulk of fused-silica samples. The high laser intensities attained generate plasma through multi-photon absorption and electron avalanche processes in the bulk of the material. Depending on the initial experimental conditions three distinct types of structural changes in the material are observed, from small changes of the refractive index to birefringence, and even cracks and voids. We also observe the creation of micro-channels, up to 115 μm in length, inside the material due to self-guiding and filamentation of the laser pulses in the transparent material. The selective change of the refractive index is a promising method for the fabrication of photonic structures such as waveguides and three-dimensional integrated optical devices. ",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Highly efficient broadband terahertz generation from ultrashort laser filamentation in liquids",
            "Publication year": 2017,
            "Publication url": "https://www.nature.com/articles/s41467-017-01382-x",
            "Abstract": "Generation and application of energetic, broadband terahertz pulses (bandwidth~ 0.1–50 THz) is an active and contemporary area of research. The main thrust is toward the development of efficient sources with minimum complexities—a true table-top setup. In this work, we demonstrate the generation of terahertz radiation via ultrashort pulse induced filamentation in liquids—a counterintuitive observation due to their large absorption coefficient in the terahertz regime. The generated terahertz energy is more than an order of magnitude higher than that obtained from the two-color filamentation of air (the most standard table-top technique). Such high terahertz energies would generate electric fields of the order of MV cm-1, which opens the doors for various nonlinear terahertz spectroscopic applications. The counterintuitive phenomenon has been explained via the solution of nonlinear pulse propagation equation in …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:uLbwQdceFCQC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Ultrashort laser pulse filamentation with Airy and Bessel beams",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8770/87701E/Ultrashort-laser-pulse-filamentation-with-Airy-and-Bessel-beams/10.1117/12.2014198.short",
            "Abstract": "We investigate the nonlinear propagation of intense Bessel and Airy beams forming filaments in transparent media. We identify two propagation regimes separated by the relative importance of multiphoton absorption and self-focusing of the main Bessel or Airy lobe, due to the Kerr effect. We show that intense Bessel or Airy beams are reshaped into stationary nonlinear beams whose propagation is sustained by a continuous energy flux to the main lobe from its neighbors. The stationary propagation regime is obtained for Bessel cone angles exceeding a certain threshold; by focusing a Gaussian beam of sufficient power with an axicon. With respect to linear Bessel beams, stationary nonlinear Bessel beams exhibit ring compression and attenuation of contrast. For small cone angles, the nonlinear Bessel beams become unstable leading to an unsteady propagation regime. We demonstrate similar physics for intense …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:j3f4tGmQtD8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Optically switchable and tunable terahertz metamaterials through photoconductivity",
            "Publication year": 2012,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2040-8978/14/11/114008/meta",
            "Abstract": "We present both theoretical and experimental cases for realizing optically switchable and tunable split-ring resonator (SRR) metamaterials operating in the THz regime. This is achieved by suitably placing photoconducting semiconductors in the various SRR designs. Exciting the semiconductor by an optical pump beam, the realization of single-and multi-band switching, blue-shift and red-shift tunability, and broad-band phase modulation are demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:4DMP91E08xMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Highly Efficient THz Generation by Mid-IR Pulses",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ASSL-2019-AM4A.7",
            "Abstract": "We report on THz generation driven by 3.9 µm pulses, via either optical rectification in organic crystals or in two-color plasma filaments. Outstanding THz conversion efficiency of more than 2% and bandwidth exceeding 15 THz are achieved.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:SpbeaW3--B0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optical characteristics of desert dust over the East Mediterranean during summer: a case study",
            "Publication year": 2006,
            "Publication url": "https://angeo.copernicus.org/articles/24/807/2006/",
            "Abstract": " High aerosol optical depth (AOD) values, larger than 0.6, are systematically observed in the Ultraviolet (UV) region both by sunphotometers and lidar systems over Greece during summertime. To study in more detail the characteristics and the origin of these high AOD values, a campaign took place in Greece in the frame of the PHOENICS (Particles of Human Origin Extinguishing Natural solar radiation In Climate Systems) and EARLINET (European Aerosol Lidar Network) projects during August–September of 2003, which included simultaneous sunphotometric and lidar measurements at three sites covering the north-south axis of Greece: Thessaloniki, Athens and Finokalia, Crete. Several events with high AOD values have been observed over the measuring sites during the campaign period, many of them corresponding to Saharan dust. In this paper we focused on the event of 30 and 31 August 2003, when a dust layer in the height range of 2000-5000 m, progressively affected all three stations. This layer showed a complex behavior concerning its spatial evolution and allowed us to study the changes in the optical properties of the desert dust particles along their transport due to aging and mixing with other types of aerosol. The extinction-to-backscatter ratio determined on the 30 August 2003 at Thessaloniki was approximately 50 sr, characteristic for rather spherical mineral particles, and the measured color index of 0.4 was within the typical range of values for desert dust. Mixing of the desert dust with other sources of aerosols resulted the next day in overall smaller and less absorbing population of particles with a lidar ratio of 20 sr. Mixing of …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:KxtntwgDAa4C",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Propagation of twin laser pulses in air and concatenation of plasma strings produced by femtosecond infrared filaments",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401803017978",
            "Abstract": "Two consecutive ultrashort laser pulses separated by 100 fs and polarized in orthogonal directions are shown to form a long femtosecond filament that connects both filaments created independently by each pulse from the interplay between photoionization and self-focusing. Measurements of the electron density generated by photoionization of air show that this connection is obtained for a very specific time delay between the pulses. A strong shortening of one of the pulses is associated to this connection of plasma channels. This phenomenon is modeled via numerical simulations of the propagation and interaction of the pulses.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:70eg2SAEIzsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Abruptly autofocusing beams enable advanced multiscale photo-polymerization",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=optica-3-5-525",
            "Abstract": "Tunable-ring Airy beams are experimentally generated and employed for the fabrication of large three-dimensional structures with high resolution using multi-photon polymerization. We demonstrate that these beams can be adjusted to abruptly autofocus over an extended range of working distances while keeping their voxel shape and dimensions almost invariant. This striking property together with the real-time electronically controlled focus tuning makes these beams ideal candidates for long-range multi-photon polymerization. Moreover, the well-controlled remote localized deposition of energy can also impact many other fields of linear and nonlinear optics, like filamentation and remote high-power terahertz generation.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:HE397vMXCloC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Linear X-wave generation by means of cross-phase modulation in Kerr media",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-33-24-3028",
            "Abstract": "We exploit cross-phase modulation by a strong driving pulse onto a weaker probe pulse at a different wavelength to induce the formation of an X wave possessing the typical nondispersive and nondiffractive propagation properties.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Filamentation of femtosecond laser pulses in nonlinear transparent media",
            "Publication year": 2001,
            "Publication url": "https://hal.archives-ouvertes.fr/tel-01188205/",
            "Abstract": "Propagation of electromagnetic pulses is of fundamental importance in pure and applied science, and the recent development of sources of intense ultra-short laser pulses has added many interesting twists to this long standing problem. The broad spectral bandwidths, high peak powers, and (3+1)-dimensional nature of these fields give rise to complex linear and nonlinear effects that have posed significant challenges to researchers. In the last years an important effort has been devoted to the study of the propagation of powerful laser beams in atmosphere as well as in other transparent media, i.e. glasses. A particular interest has focused on femtosecond laser systems, able to deliver very high peak powers with a modest energy output. Due to the high power the nonlinear response of the medium plays a key role in the propagation. A very unusual and spectacular propagation of light has been observed recently. Intense ultrashort laser pulses launched in air self-organize into filaments, which persist over very long distances.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "In‐Volume Laser Direct Writing of Silicon—Challenges and Opportunities",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/lpor.202100140",
            "Abstract": "Laser direct writing is a widely employed technique for 3D, contactless, and fast functionalization of dielectrics. Its success mainly originates from the utilization of ultrashort laser pulses, offering an incomparable degree of control on the produced material modifications. However, challenges remain for devising an equivalent technique in crystalline silicon which is the backbone material of the semiconductor industry. The physical mechanisms inhibiting sufficient energy deposition inside silicon with femtosecond laser pulses are reviewed in this article as well as the strategies established so far for bypassing these limitations. These solutions consisting of employing longer pulses (in the picosecond and nanosecond regime), femtosecond‐pulse trains, and surface‐seeded bulk modifications have allowed addressing numerous applications.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Femtosecond laser induced plasma diffraction gratings in air",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO-2009-CMU2",
            "Abstract": "The creation of a volume plasma density grating in air by two intersecting high-intensity IR femtosecond laser pulses is demonstrated experimentally. The detailed characterization of the grating is conducted based on its diffraction properties.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:IWHjjKOFINEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "THz generation by two-color femtosecond filaments with complex polarization states: four-wave mixing versus photocurrent contributions",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0741-3335/59/1/014025/meta",
            "Abstract": "Two-color filamenation in gases is known to produce intense and broadband THz radiation. There are two physical mechanisms responsible for the THz generation in this scheme: four-wave mixing and emission from the induced plasma currents. The case when the main and second harmonic are linearly polarized is well studied including the impact from each of the above mechanisms. However, for the cases when the two-color fields have complex polarization states the role of the four-wave mixing and plasma mechanisms in the formation of the THz polarization is still under-explored. Here we use both the four-wave mixing and photocurrent models in order to consider the THz generation by two-color fields with arbitrary polarizations. We show that under specific polarizations of the two-color field components it is possible to determine which of the mechanisms is responsible for the THz polarization formation.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Development of cavity ring-down ellipsometry with spectral and submicrosecond time resolution",
            "Publication year": 2011,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8105/81050L/Development-of-cavity-ring-down-ellipsometry-with-spectral-and-submicrosecond/10.1117/12.903053.short",
            "Abstract": "Cavity-enhanced ellipsometry, using nanosecond pulsed lasers and without moving parts, is demonstrated to have submicrosecond time resolution. The ellipsometric phase angles are measured from the Fourier transform of the cavity ring-down experimental signals, with a sensitivity 0.01 degrees. The technique is applied to highly reflective surfaces, including total internal reflection, where the samples are placed within the evanescent wave. The technique can be generalized to broadband sources, such as from supercontinuum generation, allowing spectral resolution of thin films and monolayer samples.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:hC7cP41nSMkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Optically implemented broadband blueshift switch in the terahertz regime",
            "Publication year": 2011,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.106.037403",
            "Abstract": "We experimentally demonstrate, for the first time, an optically implemented blueshift tunable metamaterial in the terahertz (THz) regime. The design implies two potential resonance states, and the photoconductive semiconductor (silicon) settled in the critical region plays the role of intermediary for switching the resonator from mode 1 to mode 2. The observed tuning range of the fabricated device is as high as 26%(from 0.76 THz to 0.96 THz) through optical control to silicon. The realization of broadband blueshift tunable metamaterial offers opportunities for achieving switchable metamaterials with simultaneous redshift and blueshift tunability and cascade tunable devices. Our experimental approach is compatible with semiconductor technologies and can be used for other applications in the THz regime.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:2osOgNQ5qMEC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Crossing the threshold of ultrafast laser writing in bulk silicon",
            "Publication year": 2017,
            "Publication url": "https://www.nature.com/articles/s41467-017-00907-8",
            "Abstract": "An important challenge in the field of three-dimensional ultrafast laser processing is to achieve permanent modifications in the bulk of silicon and narrow-gap materials. Recent attempts by increasing the energy of infrared ultrashort pulses have simply failed. Here, we establish that it is because focusing with a maximum numerical aperture of about 1.5 with conventional schemes does not allow overcoming strong nonlinear and plasma effects in the pre-focal region. We circumvent this limitation by exploiting solid-immersion focusing, in analogy to techniques applied in advanced microscopy and lithography. By creating the conditions for an interaction with an extreme numerical aperture near 3 in a perfect spherical sample, repeatable femtosecond optical breakdown and controllable refractive index modifications are achieved inside silicon. This opens the door to the direct writing of three-dimensional monolithic …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:JQOojiI6XY0C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Terahertz Generation from Curved Two-Color Filaments Induced by 2D Airy Wave Packets",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_QELS-2021-FTu2J.2",
            "Abstract": "We report on THz generation from curved filaments produced by 2D Airy wave packets. Due to the curvature of the plasma channel, non-concentric THz beams with different polarizations are generated.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optimal wavelength for two-color filamentation-induced terahertz sources",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-26-24-31150",
            "Abstract": "We theoretically study the generation of terahertz (THz) radiation by two-color filamentation of ultrashort laser pulses with different wavelengths. We consider wavelengths in the range from 0.6 to 10.6 μm, thus covering the whole range of existing and future powerful laser sources in the near, mid and far-infrared. We show how different parameters of two-color filaments and generated THz pulses depend on the laser wavelength. We demonstrate that there is an optimal laser wavelength for two-color filamentation that provides the highest THz conversion efficiency and results in generation of extremely intense single cycle THz fields.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A Waveguide Made of Hot Air",
            "Publication year": 2014,
            "Publication url": "https://physics.aps.org/articles/v7/21?referer=rss",
            "Abstract": "Figure 1:(Top left) An optical fiber consists of a high-refractive index core (red) surrounded by a “cladding”(light blue) with lower index of refraction. The fiber can pipe light because the gradient in the refractive index causes total internal reflection of the light.(Top right) If the core of the guide has a lower refractive index as in the plasma wake of an intense filament of light, an optical beam injected in the pipe will leak instead of being efficiently guided.(Bottom) To create a transient waveguide in air, Milchberg and his colleagues generated a quadruplet of femtosecond pulses that generated expanding hot air in their wakes. The superposition of these hot air waves in the center of the quadruplet (red) has a higher refractive index than the surrounding air and can create a waveguiding effect for subsequent pulses of light for up to several milliseconds.(Top left) An optical fiber consists of a high-refractive index core (red) surrounded by a “cladding”(light blue) with lower index of refraction. The fiber can pipe light because the gradient in the refractive index causes total internal reflection... Show more",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:WbkHhVStYXYC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Coherent subterahertz radiation from femtosecond infrared filaments in air",
            "Publication year": 2002,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OL-27-21-1944",
            "Abstract": "We report on what is believed to be the first observation of coherent subterahertz (sub-THz) emission from a 1-m string in the atmosphere. The sub-THz pulse emitted by the filamentary structure from an intense IR femtosecond laser pulse is detected perpendicularly to the laser propagation axis by use of two heterodyne detectors at 94±1 and 118±1 GHz. We describe the characteristics of this emission and show evidence of constructive interference between two separate strings.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Long-scale multiphoton polymerization voxel growth investigation using engineered Bessel beams",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ome-9-7-2838",
            "Abstract": "We report on the action of exposure time and peak Intensity on the growth of long-scale focal volumes in multiphoton polymerization. Using modified engineered Bessel beams, we explore the effects that rise during the voxel growth, while we present a counterintuitive action of the expected expansion of the polymerized volumes that is revealed for a specific range of peak Intensities. We show that there is a regime where the higher exposure time (number of pulses) creates shorter polymerized strings in comparison to a lower number of pulses, and we determine the polymerization thresholds.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "3D holographic light shaping for advanced multiphoton polymerization",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-45-1-85",
            "Abstract": "A three-dimensional (3D) holographic focal volume engineering method is proposed and employed for advanced multiphoton polymerization. A large number of foci are closely positioned in space according to a designed geometry, avoiding undesired interference effects by phase engineering. Through all-optical micro-displacements in space, the discrete foci bundle leads to the realization of complete 3D arbitrary structures. The microstructures are fabricated by direct laser writing without additional optical or mechanical motion support. We report a 20-times faster fabrication time in comparison to point-by-point laser polymerization techniques.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Strong terahertz emission enhancement via femtosecond laser filament concatenation in air",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-35-14-2424",
            "Abstract": "We investigate the emission of terahertz (THz) radiation from two laser filaments in air. An increase by 1 order of magnitude of the overall THz power is found when the two filaments are coherently linked on-axis, leading to a single longer concatenated filament. The observed enhancement is found to be the same for the cases of single-color and two-color filamentation approaches.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Nonlinear THz Field Applications in Free Space",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8873709/",
            "Abstract": "We demonstrate that intense free space THz fields can nonlinearly induce excitonic photoluminescence in room temperature semiconductors as well as cross-phase modulation in an electro-optic crystal.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sub-picosecond UV laser pulse filamentation in atmosphere",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/910315/",
            "Abstract": "Summary form only. Several studies have shown recently that ultrashort infrared laser pulses propagating through atmosphere may create long plasma filaments. This effect may have important applications in laser-controlled discharges, long-range deposition of high laser intensities, and new LIDAR monitoring. Here we present an investigation of the nonlinear propagation of sub-picosecond UV laser pulses in air. We show, for the first time, that filamentation is possible with UV laser pulses as well.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "X absorption spectra in femtosecond plasmas",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=16874461832014827844&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:zLWjf1WUPmwC",
            "Publisher": "EDP SCIENCES SA"
        },
        {
            "Title": "Experimental demonstration of Rogue waves in disordered Luneburg-type photonic networks",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2013-JSIII_P_3",
            "Abstract": "A rogue wave, also called freak wave, is a spontaneous phenomenon observed in ocean surface waves. Freak waves are typically defined as waves with a height (trough to crest) that exceed the average wave altitude by a factor of two or more [1]. Although their extreme nature, the first freak wave ever recorder, occurred in 1995 allowing the confirmation of their existence [2]. Similar, extreme, phenomena were soon estimated that could take place in other areas, such as photonics. In this region a freak wave would be an Electromagnetic wave (signal) that would be significantly fiercer than the rest of the signals measured, contiguous to the oceanic phenomenon. Today in the community two main different approaches exist to explain such phenomena, supporting either the linear or the nonlinear wave dynamics interpretations.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:08ZZubdj9fEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Linear and nonlinear exotic light wave packets physics and applications",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=LS-2015-LM3I.4",
            "Abstract": "Exotic linear and nonlinear wave packets propagating in isotropic and periodically modulated media present exciting propagation properties, like the support of robust intense light bullets and the remote deposition of very high laser intensities.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Monitoring adsorption and sedimentation using evanescent-wave cavity ringdown ellipsometry",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ao-52-5-1086",
            "Abstract": "We monitor the adsorption of Rhodamine 800, and the sedimentation of a polytetrafluoroethylene (PTFE) suspension at the surface of a fused-silica prism, by measuring both the absorption and s-p phase shift Δ of a 740 nm probe laser beam, using evanescent-wave cavity ringdown ellipsometry (EW-CRDE). The two systems demonstrate the complementary strengths of EW-CRDE, as the progress of adsorption of the Rhodamine 800 dye can only be observed sensitively via the measurement of absorption, whereas the progress of sedimentation of PTFE can only be observed sensitively via the measurement of Δ. We show that EW-CRDE provides a sensitive method for the measurement of Δ and demonstrates precision in Δ of about 10^−4  deg⁡.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Nonlinear imaging and THz diagnostic tools in the service of Cultural Heritage",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-011-6691-7",
            "Abstract": "We present the use of novel nonlinear imaging, terahertz time-domain spectroscopy and imaging as powerful diagnostic tools for studies of works of art. It is shown that nonlinear imaging offers precise in-depth information, while terahertz imaging can reveal hidden objects and uncover information on highly absorbing organic compounds whose visualization is difficult in other parts of the spectrum.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Influence of negative leader propagation on the triggering and guiding of high voltage discharges by laser filaments",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-005-2061-5",
            "Abstract": "The triggering and guiding of negative discharges using filaments induced by a femtosecond-terawatt laser pulse have been studied in sphere-plane gaps up to 4.5 meters. Fast-frame camera pictures allow the evaluation of the influence of the negative leader propagation on the triggering and guiding process. We show that the plasma channel can either trigger a space-leader discharge or act as a guiding path for the negative leader head. For the latter case the results suggest a linear dependence of the guided lengths up to 2.4 m, while the formation of a space-leader reduces this guided length by up to 50%. This effect is explained by the limited plasma lifetime of the filament that is measured to be about 1 μs. ",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Concatenation of plasma filaments created in air by femtosecond infrared laser pulses",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-003-1147-1",
            "Abstract": "We report the first observation of the attachment of two single plasma filaments created collinearly in the atmosphere by IR femtosecond laser pulses. The linked filamentary structure is electrically conductive and emits sub-THz radiation over its entire length. Concatenation is achieved only for a specific time ordering between the two initial laser pulses. The pulse producing the filament closer to the laser source must be retarded with respect to the other pulse. This special time ordering is attributed to the acceleration of light in a self-guided pulse.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Material dynamics from laser pulse filamentation to permanent structural modifications in fused silica",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4571418/",
            "Abstract": "Using pump-probe imaging techniques we monitor the formation of plasma strings, the subsequent emergence of transient electronic defects, and their transformation to permanent refractive index modifications in fused silica following sub-picosecond ultraviolet laser pulse filamentation.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direct phonon excitation in semiconductors by ultrashort intense THz radiation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5225658/",
            "Abstract": "Ultrashort intense THz radiation generated through laser filamentation in air is employed to directly excite the lattice of AlGaAs semi-insulating crystals. Incoherent as well as coherent phonons are shown to be excited in this way.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced terahertz wave emission from air-plasma tailored by abruptly autofocusing laser beams",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=optica-3-6-605",
            "Abstract": "Developing coherent intense broadband light sources is undoubtedly one of the key elements in pushing the frontiers of optical sciences, especially those of nonlinear terahertz (THz) optics. Plasma-based THz emitters excel in many aspects thanks to their broad radiation bandwidth, high output pulse energy and immunity to high power damage. Various excitation wavelengths and gases have been explored in the search for a stronger THz wave emission from laser-induced plasmas, whereas few attempts have been made with artificially modulated exotic wavepackets. Here we demonstrate that abruptly autofocusing-beam-induced air-plasma can give a 5.3-times enhanced THz wave pulse energy compared to normal Gaussian-beam-induced plasma under the same conditions. We believe this work will inspire a new direction for controlling THz radiation from laser-induced plasma using tools such as spatial light …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Femtosecond filamentation induced micro-and nano-restructuring in the bulk of dielectrics and polymers",
            "Publication year": 2011,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7925/79250O/Femtosecond-filamentation-induced-micro--and-nano-restructuring-in-the/10.1117/12.878760.short",
            "Abstract": "Femtosecond laser filaments leave plasma strings at their trail as they propagate through any transparent medium including glasses and polymers. This initial plasma string and the energy deposited from the electrons to the lattice play a fundamental role in the creation of permanent structural modifications in these media.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:r0BpntZqJG4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Robust authentication through stochastic femtosecond laser filament induced scattering surfaces",
            "Publication year": 2016,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4952716",
            "Abstract": "We demonstrate a reliable authentication method by femtosecond laser filament induced scattering surfaces. The stochastic nonlinear laser fabrication nature results in unique authentication robust properties. This work provides a simple and viable solution for practical applications in product authentication, while also opens the way for incorporating such elements in transparent media and coupling those in integrated optical circuits.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:WA5NYHcadZ8C",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Powerful terahertz waves from long-wavelength infrared laser filaments",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41377-020-00423-3",
            "Abstract": "Strong terahertz (THz) electric and magnetic transients open up new horizons in science and applications. We review the most promising way of achieving sub-cycle THz pulses with extreme field strengths. During the nonlinear propagation of two-color mid-infrared and far-infrared ultrashort laser pulses, long, and thick plasma strings are produced, where strong photocurrents result in intense THz transients. The corresponding THz electric and magnetic field strengths can potentially reach the gigavolt per centimeter and kilotesla levels, respectively. The intensities of these THz fields enable extreme nonlinear optics and relativistic physics. We offer a comprehensive review, starting from the microscopic physical processes of light-matter interactions with mid-infrared and far-infrared ultrashort laser pulses, the theoretical and numerical advances in the nonlinear propagation of these laser fields, and the most important …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:-FonjvnnhkoC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Self-guided propagation of ultrashort IR laser pulses in fused silica",
            "Publication year": 2001,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2001-QFC5",
            "Abstract": "Intense ultrashort IR laser pulses propagating through atmosphere undergo important changes in their spatial and spectral characteristics. They self-organize in the form of narrow filaments with high peak intensity, which persist over exceptional long distances. 1-3 This spectacular effect is explained in terms of a dynamic competition between self-focusing and multi-photon ionization.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Stationary nonlinear Airy beams",
            "Publication year": 2011,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.84.021807",
            "Abstract": "We demonstrate the existence of an additional class of stationary accelerating Airy wave forms that exist in the presence of third-order (Kerr) nonlinearity and nonlinear losses. Numerical simulations and experiments, in agreement with the analytical model, highlight how these stationary solutions sustain the nonlinear evolution of Airy beams. The generic nature of the Airy solution allows extension of these results to other settings, and a variety of applications are suggested.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:W7OEmFMy1HYC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Observation of Ultrafast THz Self-actions in Graphene Based Modulators",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2021-cc_6_3",
            "Abstract": "We demonstrate an ultrafast self-induced terahertz absorption modulator operating at 2.3 THz. A modulation of 50 dB is observed in the absorption when the THz field strength increases from 145 to 654 kVcm.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:rmuvC79q63oC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Non-diffracting states in one-dimensional Floquet photonic topological insulators",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1209/0295-5075/119/14003/meta",
            "Abstract": "One-dimensional laser-written modulated photonic lattices are known to be particularly suitable for diffraction management purposes. Here, we address the connection between discrete non-diffracting states and topological properties in such devices through the experimental observation and identification of three classes of non-diffracting states. The first one corresponds to topologically protected edge states, recently predicted in Floquet topological insulators, while the second and the third are both bulk modes. One of them testifies a topological transition, although presenting topological features different from those of the edge states, while the other one results from specific band structure engineering.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Coherent control of THz pulses polarization from femtosecond laser filaments in gases",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-18-18-18894",
            "Abstract": "We demonstrate the possibility to rotate the polarization of linearly polarized THz pulses via the accurate control of the 2-color filament surrounding gas pressure. We also show ways to produce elliptically and circularly polarized THz pulses.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:UebtZRa9Y70C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Passive radiative cooling for the temperature and efficiency control of photovoltaics",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_AT-2021-ATh4E.5",
            "Abstract": "We present a radiative cooling approach for photovoltaic cells’ temperature and efficiency evaluation. We derive the maximum temperature-drop requirements and apply the approach in a nano-micro-grating remarkably enhancing both thermal radiation emission and solar absorption.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Demonstration of Ultrafast THz Absorption Modulation in a Graphene-Based Thin Absorber",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8874587/",
            "Abstract": "We present the experimental and theoretical study of an ultrafast, optically tunable graphene-based thin film absorption modulator for operation in the THz regime. An ultrafast near-IR pulse induces the generation of hot carriers in the graphene sheet, consequently, reducing its conductivity with a decay time of 2.79 ps. As a result, a modulation of 40% in the THz absorption at 2.17 THz is observed in the structure.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Long-range filamentary propagation of subpicosecond ultraviolet laser pulses in fused silica",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OL-31-6-796",
            "Abstract": "We report on what is to our knowledge the first observation of subpicosecond ultraviolet laser pulse filamentation in transparent solid materials. Robust filaments were created in fused silica and observed over distances that exceed 3 cm in length. Intensities as high as 10^13 W/cm^2 were found to be transported in the filamented beam without material damage in the bulk of the fused-silica sample.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:WF5omc3nYNoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Cavitation dynamics and directional microbubble ejection induced by intense femtosecond laser pulses in liquids",
            "Publication year": 2012,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.86.036304",
            "Abstract": "We study cavitation dynamics when focusing ring-shaped femtosecond laser beams in water. This focusing geometry reduces detrimental nonlinear beam distortions and enhances energy deposition within the medium, localized at the focal spot. We observe remarkable postcollapse dynamics of elongated cavitation bubbles with high-speed ejection of microbubbles out of the laser focal region. Bubbles are ejected along the laser axis in both directions (away and towards the laser). The initial shape of the cavitation bubble is also seen to either enhance or completely suppress jet formation during collapse. In the absence of jetting, microbubble ejection occurs orthogonal to the laser propagation axis.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:aqlVkmm33-oC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Infrared femtosecond light filaments in air: simulations and experiments",
            "Publication year": 2002,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-19-5-1117",
            "Abstract": "Experiments in which several-meter-long infrared ultrashort laser pulses are guided in air are compared with numerical simulations. During a first self-focusing stage that is affected by modulational instability, the beam is shown to break up into two channels of light that finally coalesce into a narrow filament that is able to propagate over several Rayleigh lengths. The filament propagation is associated with the generation of an electron plasma, whose density is greater than 10^16 cm^−3. Electron generation persists well beyond the focal region. The simulations restore the global dynamics of the pulse, including the main stages of Kerr focusing, light guiding driven by ionization, and the ultimate diffraction of the beam.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Spectres d'absorption X dans les plasmas femtosecondes",
            "Publication year": 2005,
            "Publication url": "https://jp4.journaldephysique.org/articles/jp4/abs/2005/05/jp4127019/jp4127019.html",
            "Abstract": "Nous avons mesuré le spectre d'absorption en couche K de plasmas d'aluminium à haute densité. Deux faisceaux de la chaîne laser femtoseconde 100 TW du LULI (de durée 300 fs) ont été utilisés pour produire le plasma absorbant sur une feuille mince d'Al (830 Å ou 500 Å), et la source de radiographie sur du samarium massif. Les spectres X étaient résolus spatialement dans une direction perpendiculaire à la direction de la dispersion spectrale. Les spectres ont été mesurés pour différents retards entre la source de radiographie et le plasma d'Al. Des simulations des spectres et de l'ionisation en fonction du temps et de l'intensité, obtenues au moyen de codes hydrodynamiques et de structure atomique, montrent un bon accord avec les résultats expérimentaux.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "EDP sciences"
        },
        {
            "Title": "Break-up, coalescence and self-guiding of femtosecond laser pulses in air",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=nlo-2000-WD3",
            "Abstract": "Femtosecond laser pulses propagating in air are investigated. For input powers as high as 25 times the self-focusing threshold, the pulses are shown to break up into two spots, which coalesce into a self-guided beam.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Understanding and controlling on-axis and off-axis THz emission patterns from 2-color femtosecond laser filaments",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2013-CC_P_14",
            "Abstract": "Gas-plasma strings from 2-color femtosecond laser filaments constitute one of the most convenient and promising sources of pulsed terahertz (THz) radiation. It is one of the approaches that allow one to achieve at the same time ultrabroadband THz spectra and very high amplitudes of THz electric fields. Such sources present major advantages for applications of sensing, spectroscopy, imaging, and nonlinear optics. In view of the numerous applications an understanding of the spatial distribution of the terahertz radiation, from this source, is crucial. One of the first works towards this direction [1], revealed a highly directional THz radiation while a more recent publication [2] proposes a donut-shape spatial pattern. The most recent results reported by Kim et. al.[3], propose an off-axis phase matched emission from the filament due to interference effect between the different point sources across the filament, resulting thus …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Ring-Airy beams at the wavelength limit",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-43-5-1063",
            "Abstract": "We demonstrate that paraxial ring-Airy beams can approach the wavelength limit, while observing a counterintuitive, strong enhancement of their focal peak intensity. Using numerical simulations, we show that this behavior is a result of the coherent constructive action of paraxial and nonparaxial energy flow. A simple theoretical model enables us to predict the parameter range over which this is possible.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:evX43VCCuoAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Polarization characteristics of superoscillatory beams",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=iqec-2013-IG_P_14",
            "Abstract": "Recent theoretical and experimental studies have introduced the counterintuitive concept of superoscillations in the context of optics, with direct implications in superresolution [1], subwavelength focusing and imaging [2, 3] without evanescent waves. One can create superoscillatory diffractionless beams by superimposing already known stationary solutions of Helmholtz equation [4], and therefore transfer subwavelength information into the far field. It is noteworthy to mention that this is not interference but a superposition effect, where the intensity of the subwavelength regions is invariant with respect to the propagation distance. The scope of this paper is to understand how one can control and change the polarization of the subwavelength regions with respect to the surrounding high intensity lobes.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:tOudhMTPpwUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Controlling laser filamentation induced strong THz fields",
            "Publication year": 2014,
            "Publication url": "https://www.ps-taiwan.org/cjp/download.php?type=paper&vol=52&num=1-II&page=490",
            "Abstract": "During the past decade, thanks to the tremendous technological development in photonics and materials science, terahertz (THz) radiation became routinely accessible, opening new frontiers in several research fields, including chemistry [1], biology [2], medicine [3] and materials science [4]. The continuously increasing interest for terahertz waves and their applications is fostered by their non-invasive nature (1 THz= 4.43 meV photon energy) and their ability to penetrate through many materials [5], which are usually opaque in the infrared and visible. Additionally, several physical and chemical processes, not accessible before, are closely related to the low frequency dynamic modes such as crystalline lattice or inter-molecular vibrational modes, hydrogen bonding stretches, large-scale motions of an entire macromolecule, which are lying in this low-frequency range. Up to date, numerous techniques have been tested and developed as THz sources and many of them, such as photoconductive antennas and optical rectification, are widely employed in various laboratories around the world. Using techniques like electro-optic (eo)[6] or photoconductive sampling [7], it is possible to coherently detect in the time domain the generated THz pulses, giving a direct access to the amplitude and more importantly the phase of the electric field. Yet, there is still a stumbling block for many applications in the THz regime due to the relatively low THz peak power that most of the existing techniques exhibit, with energies per pulse barely reaching the nano-Joule regime, while their further development is hindered by the lack of natural occurring materials exhibiting …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:K3LRdlH-MEoC",
            "Publisher": "台灣物理學會"
        },
        {
            "Title": "Influence of air humidity on 248-nm ultraviolet laser pulse filamentation",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-44-9-2165",
            "Abstract": "At first glance, the amount of water molecules naturally contained in humid air is negligibly small to affect filamentation of ultrashort laser pulses. However, here we show, both experimentally and numerically, that for ultraviolet laser pulses with 248 nm wavelength this is not true. We demonstrate that with increase of air humidity the plasma channels generated by the ultraviolet laser pulses in air become longer and wider, while the corresponding electron density in humid air can be up to one order of magnitude higher compared to dry air.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:uWiczbcajpAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Retrieving broadband ultrashort THz wave packets through lossy channels",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1511.00872",
            "Abstract": "Most transmission and detection channels fail to faithfully support broadband wave packets because of physical limitations, like chromatic dispersion and absorption. We explore the case of lossy detection of ultrashort THz pulses using the widespread electro-optic detection scheme. We demonstrate that one can fully recover the original THz pulse shape, duration and amplitude, using a simple experimental procedure and a reconstruction algorithm which encodes the physical properties of the detection system.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Calorimetric detection of THz radiation from femtosecond filaments in air",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-003-1347-8",
            "Abstract": "Calorimetric measurements of the THz radiation from plasma filaments created in air by intense IR fs laser pulses were performed. The decay kinetics of the THz radiation from this extended plasma source is shown to be different from that of a localized air plasma source produced by the same laser. ",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Ultrashort laser pulse filamentation from spontaneous X Wave formation in air",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-16-3-1565",
            "Abstract": "The description of ultrashort laser pulse filamentation in condensed media as a spontaneous formation of X waves is shown to apply also to filaments generated in air. Within this framework, a simple explanation is brought for several features of the filament such as the subdiffractive propagation and the energy flux from the weakly localized tails of the X-waves to the intense core.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Spatiotemporal Airy light bullets in the linear and nonlinear regimes",
            "Publication year": 2010,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.105.253901",
            "Abstract": "We demonstrate the realization of intense Airy-Airy-Airy (Airy 3) light bullets by combining a spatial Airy beam with an Airy pulse in time. The Airy 3 light bullets belong to a family of linear spatiotemporal wave packets that do not require any specific tuning of the material optical properties for their formation and withstand both diffraction and dispersion during their propagation. We show that the Airy 3 light bullets are robust up to the high intensity regime, since they are capable of healing the nonlinearly induced distortions of their spatiotemporal profile.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:u-x6o8ySG0sC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "In-line holography for the 3D reconstruction of laser pulse filamentation in transparent media",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2008-JWA78",
            "Abstract": "In-line holographic microscopy is used to retrieve the 3D distribution of the refractive index perturbation, resulting from the nonlinear propagation of 35fs IR pulses in transparent media, including the Kerr effect and plasma strings.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:mB3voiENLucC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Gas dynamics effect on laser filamentation THz sources at high repetition rates",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_SI-2021-JTh3A.30",
            "Abstract": "We report on the impact of laser pulse repetition rate on two-color filamentation based terahertz sources. A 50% decrease on the terahertz energy is observed when the repetition rate increases from 0.6 to 6 kHz.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:XoXfffV-tXoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Accessing extreme spatiotemporal localization of high-power laser radiation through transformation optics and scalar wave equations",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.117.043902",
            "Abstract": "Although tightly focused intense ultrashort laser pulses are used in many applications from nano-processing to warm dense matter physics, their nonparaxial propagation implies the use of numerical simulations with vectorial wave equations or exact Maxwell solvers that have serious limitations and thus have hindered progress in this important field up to now. Here we present an elegant and robust solution that allows one to map the problem on one that can be addressed by simple scalar wave equations. The solution is based on a transformation optics approach and its validity is demonstrated in both the linear and the nonlinear regime. Our solution allows accessing challenging problems of extreme spatiotemporal localization of high power laser radiation that remain almost unexplored theoretically until now.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:dTyEYWd-f8wC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Highly efficient broadband THz generation from Mid-IR Laser-Driven Plasma",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8874035/",
            "Abstract": "Nonlinear (NL) interactions of strong THz electric and magnetic fields with matter are the next frontier in nonlinear optics. NL THz spectroscopy requires ultrashort/broadband THz pulses with high electric field strengths. Here, we report on THz generation from two-color laser filaments, driven by intense midIR pulses centered at 3.9 μm. We demonstrate generation of THz pulses with a spectral bandwidth of > 15 THz, extraordinary conversion efficiency of 2.34% and remarkably high energy of 0.185 mJ.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Emission of Terahertz Waves from Curved Two-Color Filaments Produced by 2D Airy Wave Packets",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9542270/",
            "Abstract": "Two-color laser filamentation constitute one of the most convenient and efficient sources of pulsed ultra-broadband terahertz (THz) radiation. In this approach, a Gaussian ultrashort laser pulse together with its second harmonic are focused into a gas medium, forming a filament, which emits THz radiation with extremely high THz electric and magnetic fields [1] . A major advantage of two-color filamentation is that one can tune the emitted THz radiation in terms of energy, spectrum, polarization and THz beam divergence by properly tailoring the filament itself [2] , [3] . One way to achieve this tailoring is with the use of robust exotic-wavepackets from the family of accelerating beams such as the ring-Airy and the 2D Airy beams. Two-color plasma channels induced by pre-engineered abruptly autofocusing ring-Airy beams have already been proposed in order to enhance the THz yield by 5.3 times compared to a …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:_axFR9aDTf0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Invariant superoscillatory electromagnetic fields in 3D-space",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2040-8978/19/1/014003/meta",
            "Abstract": "We derive exact solutions of Maxwell's equations based on superoscillatory superpositions of vectorial Bessel beams. These novel beams are diffraction-free and can support subwavelength features in their transverse electromagnetic fields, without the presence of any evanescent waves. These features can be propagated into the far field. Approximate solutions in closed form are also derived based on asymptotic expansions of Bessel functions for simple prescribed subwavelength patterns. The superoscillatory characteristics of both electric, magnetic field components (transverse and longitudinal), and the Poynting vector, as well as, the effect of nonparaxiality are systematically investigated.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Long range propagation of terawatt laser pulses in the Earth's atmosphere",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2000-QWL1",
            "Abstract": "When intense TW-fs-laser pulses propagate through the atmosphere, nonlinear effects like self-phase modulation (SPM), self-focusing (SF) or degenerated four-wave mixing (DFWM) cause an immense change of the temporal and spatial profile.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Impact of gas dynamics on laser filamentation THz sources at high repetition rates",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-45-24-6835",
            "Abstract": "We experimentally demonstrate that the terahertz (THz) emission from two-color laser filaments in gases is strongly affected by the pulse repetition rate of the driving laser. We show that at repetition rates above 100 Hz, propagation of every next laser pulse in the pulse train is altered by gas density depressions produced by the preceding laser pulses. As a result, plasma channels at higher repetition rates become shorter, leading to less efficient THz generation. In particular, we observe a 50% decrease in the emitted THz energy when the repetition rate increases from 6 Hz to 6 kHz.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:e_rmSamDkqQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Projet Teramobile: propagation des impulsions terawatt dans l'air et application à la détection par lidar des pollutions atmosphériques",
            "Publication year": 2001,
            "Publication url": "http://teramobile.org/publications/femto2000.pdf",
            "Abstract": "La propagation des impulsions laser ultra-courtes dans l’air devient hautement nonlinéaire lorsque leur puissance crête dépasse une dizaine de gigawatt. Les études dans ce domaine se sont développées rapidement aussi bien au niveau expérimental qu'au niveau théorique. Elles sont stimulées par la «démocratisation» des sources femtosecondes amplifiées, qui délivrent des impulsions jusqu’à plusieurs centaines de mJ dans une durée typique de 100 fs. Le transport et la focalisation de ces impulsions ont un intérêt essentiel pour toutes les applications autour d’une source ultra-brève et ultra-intense.Sur le trajet d’un faisceau d’impulsions femtosecondes intenses, l’auto-focalisation due à l’effet Kerr et l’effet du plasma crée par une impulsion conduisent à des filaments de lumière d'un diamètre d’environ 100 µm et se propageant sur plusieurs dizaines de mètres dans l'air. 1 La formation des filaments fournit de longues distances d’interaction aux processus nonlinéaires de conversion de fréquence, notamment celui de l’automodulation de phase. La génération de continuum est particulièrement efficace dans ces filaments. Le «supercontinuum» généré par des filaments a été mesuré entre l’UV et le proche infrarouge jusqu’à 0, 9 µmdans un gaz rare. 2 L'objectif du projet Teramobile est l'utilisation d'impulsions ultra-intenses et de filaments de lumière blanche pour la caractérisation de l'atmosphère, et notamment pour la détection des",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:P5F9QuxV20EC",
            "Publisher": "PUSE-MRCT-CNRS"
        },
        {
            "Title": "Dynamical tailoring of intense femtosecond gas-plasma THz sources",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8770/87701D/Dynamical-tailoring-of-intense-femtosecond-gas-plasma-THz-sources/10.1117/12.2018526.short",
            "Abstract": "We review recent advances on the emission of tailored intense THz pulses from 2-color femtosecond laser filaments in gases. Extended tunability of the THz pulses is achieved via filamentation molding and the use of cleverly engineered metamaterials.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:JV2RwH3_ST0C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Phase memory preserving harmonics from abruptly autofocusing beams",
            "Publication year": 2017,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.119.223901",
            "Abstract": "We demonstrate both theoretically and experimentally that the harmonics from abruptly autofocusing ring-Airy beams present a surprising property: They preserve the phase distribution of the fundamental beam. Consequently, this “phase memory” imparts to the harmonics the abrupt autofocusing behavior, while, under certain conditions, their foci coincide in space with the one of the fundamental. Experiments agree well with our theoretical estimates and detailed numerical calculations. Our findings open the way for the use of such beams and their harmonics in strong field science.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:7T2F9Uy0os0C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Physical mechanisms of fused silica restructuring and densification after femtosecond laser excitation",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ome-1-4-625",
            "Abstract": "We study experimentally the physics of the generation of permanent material                 restructuring, for the case of fused silica after excitation with intense                 femtosecond pulses and filaments, in the bulk of the medium. Using a powerful time                 and spectrally resolved holographic technique we monitor the temporal material                 evolution from the initial electronic excitation through its successive relaxation                 stages and up to the final permanent amorphous lattice state. A complete physical                 model is formulated from the experimental data.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:5nxA0vEk-isC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Research, reviews & patents",
            "Publication year": 2005,
            "Publication url": "https://core.ac.uk/download/pdf/82326705.pdf",
            "Abstract": "In Zn: Fe: LiNbO3 crystal, Zn ions substitute for [NbLi] 4+ and form [ZiLi]+. Compared with Fe: LiNbO3 crystal, the decrease of the concentration of [NbLi] 4+ in Zn: Fe: LiNbO3 crystal improves the ability of optical damage resistance and shortens the response time. Furthermore, the reduction treatment on the Zn: Fe: LiNbO3 changes the concentrations of Fe2+, Fe3+ and [NbLi] 4+ and improves its photorefractive properties.The absorption spectra, the response time and the ability of optical damage resistance of as-grown and reduced Zn: Fe: LiNbO3 crystals, respectively was studied. The self-erasing phenomenon during two-wave coupling process was observed in the reduced Zn: Fe: LiNbO3 crystals and explained by the mechanism of hole–electron competition. Optics Communications 247,(1-3) 233-237 (March 2005)",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transformation of ring-Airy beams during efficient harmonic generation",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-44-12-2974",
            "Abstract": "We theoretically study the evolution of ring-Airy beams during harmonic generation with the focus on the regime of pump energy depletion. We demonstrate that in this regime, ring-Airy beams still preserve their abrupt autofocusing properties, while transforming to a multiple ring-Airy structure. A similar transformation is observed on the beam of the generated harmonic. We suggest a simple analytical model that explains and predicts with precision our numerical findings.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:URolC5Kub84C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Observation of strong THz fields from mid-infrared two-color laser filaments",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_qels-2018-FF1E.2",
            "Abstract": "We demonstrate, strong THz emission from two-color mid-infrared (3.9 μm) femtosecond laser filaments. The conversion efficiency approaches the percent level, at least one order of magnitude higher than the previously reported for plasma-based THz sources.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Observation and optical tailoring of photonic lattice filaments",
            "Publication year": 2012,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.109.113905",
            "Abstract": "We demonstrate, for the first time, that photonic lattices support a new type of laser filaments, called lattice filaments (LF). The LF attributes (length, width, and intensity) can be tailored by both varying the photonic lattice properties and also dynamically through the interaction between filaments. This opens the way for extensive all-optical control of the nonlinear propagation of intense ultrafast wave packets. Our approach is generic and applicable to all transparent media, with potential strong impact on various photonic applications.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:mVmsd5A6BfQC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Tailoring the filamentation of intense femtosecond laser pulses with periodic lattices",
            "Publication year": 2010,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.82.061803",
            "Abstract": "We show numerically that by using periodic lattices the filamentation of intense femtosecond laser pulses, otherwise a result of competing nonlinear effects, can be well controlled with respect to its properties. The diffraction induced by the lattice provides a regularizing mechanism to the nonlinear self-action effects involved in filamentation. We demonstrate a new propagation regime of intense lattice solitons bridging the field of spatial solitons with that of femtosecond laser filamentation. The effective filamentation control is expected to have an important impact on numerous applications.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:8k81kl-MbHgC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Time-and space-resolved X-ray absorption spectroscopy of aluminum irradiated by a subpicosecond high-power laser",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022407305001809",
            "Abstract": "The ionization and recombination dynamics of transient aluminum plasmas was measured using point projection K-shell absorption spectroscopy. An aluminum plasma was produced with a subpicosecond beam of the 100-TW laser at the LULI facility and probed at different times with a picosecond X-ray backlighter created with a synchronized subpicosecond laser beam. Fourier-Domain-Interferometry (FDI) was used to measure the electron temperature at the peak of the heating laser pulse. Absorption X-ray spectra at early times are characteristic of a dense and rather homogeneous plasma, with limited longitudinal gradients as shown by hydrodynamic simulations. The shift of the Al K-edge was measured in the cold dense plasma located at the edge of the heated plasma. From the 1s–2p absorption spectra, the average ionization was measured as a function of time and was also modeled with a collisional …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "How to connect femtosecond laser filaments in air [4829-231]",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=15651097685748905467&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:abG-DnoFyZgC",
            "Publisher": "International Society for Optical Engineering; 1999"
        },
        {
            "Title": "Eutectic epsilon-near-zero metamaterial terahertz waveguides",
            "Publication year": 2013,
            "Publication url": "https://digital.csic.es/handle/10261/117572",
            "Abstract": "We present and analyze the unique phenomena of enhanced THz transmission through a subwavelength LiF dielectric rod lattice embedded in an epsilon-near-zero KCl host. Our experimental results in combination with theoretical calculations show that subwavelength waveguiding of terahertz radiation is achieved within an alkali-halide eutectic metamaterial as result of the coupling of Mie-resonance modes arising in the dielectric lattice. © 2013 Optical Society of America.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:epqYDVWIO7EC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Linear and non-linear photonic rogue waves in complex transparent media",
            "Publication year": 2014,
            "Publication url": "https://nur.nu.edu.kz/handle/123456789/705",
            "Abstract": "Ocean rogue waves (RW) -huge solitary waves- have for long triggered the interest of scientists. RWs emerge in a complex environment and it is still unclear if their appearance is due to linear or nonlinear processes. Recent works have demonstrated that RWs appear in various other physical systems such as microwaves, nonlinear crystals, cold atoms, etc.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Nazarbayev University"
        },
        {
            "Title": "Terahertz time domain spectroscopy for the analysis of cultural heritage related materials",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-008-2933-6",
            "Abstract": "A powerful broadband femtosecond laser-driven terahertz source was built and used to analyze cultural heritage and art-related materials in the terahertz region of the electromagnetic spectrum. The high signal-to-noise ratio available in our system revealed details in the absorption spectra which are inaccessible with traditional FTIR spectrometers. Clear spectral signatures were recorded from organic binding media thus demonstrating the potential of the approach for applications in the monitoring and analysis of cultural heritage materials. ",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Reconstruction of ultra-broadband THz electric field distorted by electooptic sampling",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2015-CC_P_8",
            "Abstract": "Nowadays intense broadband THz radiation attracts a lot of attention in imaging and spectroscopic applications [1-2]. Nonlinear propagation of ultrashort THz pulses is another intriguing topic [3]. One of the approaches that allow one to achieve at the same time ultra-broadband THz spectra and very high amplitudes of THz electric fields is two-color filamentation which provides THz pulses with energy up to 7μJ and spectrum ranging from almost zero up to approximately 100 THz [4]. Spectral characterization of broadband THz radiation is not an easy task. One of the most common methods of THz detection is electro-optic sampling [5] with a lack in the detection bandwidth though, which is considerably narrower than the entire spectrum of THz pulses emitted during two-color filamentation.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Breakup and Fusion of Self-Guided Femtosecond Light Pulses in Air",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=14473099621039786909&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterization and optimization of infrared emission from light filaments observed in a fs-TW laser beam propagating in the atmosphere",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/908183/",
            "Abstract": "Summary form only given. We present our results on the characterization and the optimization of the infrared component of the continuum efficiency is studied as a function of several laser parameters, such as pulse energy, duration, emission frequency chirp. For LIDAR application purposes, different beam transmission emitted from light filaments. Infrared configurations are studied. The fundamental beam can be sent in the atmosphere either collimated in a parallel beam or slightly focused. White light can be also re-collimated. Infrared intensities at remote distances are optimized.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultraviolet radiation impact on the efficiency of commercial crystalline silicon-based photovoltaics: A theoretical thermal-electrical study in realistic device architectures",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=osac-3-6-1436",
            "Abstract": "Ultraviolet (UV) radiation has been identified as one of the most critical factors for the degradation of photovoltaics (PVs). Besides that, the UV spectral regime (∼0.28-0.4 µm) is less efficient for silicon-based PVs owing to the excess of the energy of the incident UV photons relative to the semiconductor’s bandgap; thus, a large part of the UV photon energy is transformed into heat, increasing the PV temperature and decreasing its efficiency. Therefore, it is crucial to investigate in detail and evaluate the UV radiation impact on the temperature and efficiency of realistic photovoltaic modules. Here we perform this investigation for crystalline silicon-based photovoltaics that operate outdoors. The investigation is performed by employing a thermal-electrical modeling approach, which takes into account all the major intrinsic processes affected by the temperature variation in the photovoltaic devices. We show that effectively …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:LI9QrySNdTsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Cavity ring-down spectroscopy for the isotope ratio measurement of methane in ambient air with DFB diode laser near 1.65 μm",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2017-CH_P_39",
            "Abstract": "The near infrared continuous-wave cavity ring-down spectroscopy (CW-CRDS) technique is used to determine the isotope ratio of atmospheric methane. A narrow linewidth distributed feedback (DFB) diode laser was used to achieve high sensitivity detection with a high finesse cavity [1]. By changing temperature and current of the DFB diode laser, the output wavelength was tuned across the absorption line peaks of 12 CH 4 and 13 CH 4 around 6046.954 cm− 1 and 6049.121 cm− 1, respectively. The isotope ratio of atmospheric CH 4 (-45.7±1.4)‰ was obtained. We achieved CH 4 absorption spectra with peak signal-to-noise ratios as high as 470: 1. The current system has a detection limit of 8.4× 10− 11 cm− 1. For performing concentration measurements the sample gas was admitted to vacuum chamber. To detect a trace gas concentration, it is necessary to increase light and gas interaction time as much as …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:_Ybze24A_UAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Erratum: “Robust authentication through stochastic femtosecond laser filament           induced scattering surfaces” [Appl. Phys. Lett. 108, 211107           (2016)]",
            "Publication year": 2016,
            "Publication url": "https://aip.scitation.org/doi/pdf/10.1063/1.4959265",
            "Abstract": "In Ref. 1 1. H. Zhang and S. Tzortzakis,“Robust authentication through stochastic femtosecond laser filament induced scattering surfaces,” Appl. Phys. Lett. 108, 211107 (2016). https://doi. org/10.1063/1.4952716, there were errors in the list of authors and acknowledgements. The correct information is shown here.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:eq2jaN3J8jMC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Demonstration of spontaneously generated conical waves during ultrashort laser pulse filamentation in air",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4572934/",
            "Abstract": "Measurements and simulations show that X-waves are spontaneously generated during filamentation in air. This explains the sub-diffractive propagation of filaments beyond the end of the plasma channel generated by multiphoton ionization.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultrafast modulation in a THz graphene-based flat absorber through negative photoconductivity",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1908.06696",
            "Abstract": "We present the experimental and theoretical study of an ultrafast graphene based thin film absorption modulator for operation in the THz regime. The flat modulator is composed of a graphene sheet placed on a dielectric layer backed by a metallic back reflector. A near IR pulse induces the generation of hot carriers in the graphene sheet reducing effectively its conductivity. The system provides a platform with ultrafast modulation capability for flat optics and graphene based metasurfaces applications.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tight focusing of electromagnetic fields by large-aperture mirrors",
            "Publication year": 2019,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.100.033316",
            "Abstract": "We derive nonparaxial input conditions for simulations of tightly focused electromagnetic fields by means of unidirectional nonparaxial vectorial propagation equations. The derivation is based on the geometrical optics transfer of the incident electric field from significantly curved reflecting surfaces such as parabolic and conical mirrors to the input plane, with consideration of the finite thickness of the focusing element and large convergence angles, making the propagation vectorial and nonparaxial. We have benchmarked numerical solutions of propagation equations initiated with the nonparaxial input conditions against the solutions of Maxwell equations obtained by vectorial diffraction integrals. Both transverse and longitudinal components of the electric field obtained by these methods are in excellent agreement.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:vbGhcppDl1QC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Spectral bandwidth scaling laws and reconstruction of THz wave packets generated from two-color laser plasma filaments",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.93.033844",
            "Abstract": "We find the spectral bandwidth scaling laws of the THz wave packets, produced from two-color laser filaments, as a function of the input laser-pulse duration and demonstrate how one can fully recover the original broadband THz wave packets even using narrow-band detection techniques such as the widespread electro-optic sampling.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:5ugPr518TE4C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Long-range self-channeling of infrared laser pulses in air: a new propagation regime without ionization",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-004-1557-8",
            "Abstract": "We report long-range self-channeling in air of multiterawatt femtosecond laser pulses with large negative initial chirps. The peak intensity in the light channels is at least one order of magnitude lower than required for multiphoton ionization of air molecules. A detailed comparison is made between experiments and realistic 3+1-dimensional numerical simulations. It reveals that the mechanism limiting the growth of intensity by filamentation is connected with broken revolution symmetry in the transverse diffraction plane. ",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Filamentation d'impulsions laser femtoseconde dans des milieux nonlineaires transparents",
            "Publication year": 2001,
            "Publication url": "https://core.ac.uk/download/pdf/52897262.pdf",
            "Abstract": "Propagation of electromagnetic pulses is of fundamental importance in pure and applied science, and the recent development of sources of intense ultra-short laser pulses has added many interesting twists to this long standing problem. The broad spectral bandwidths, high peak powers, and (3+ 1)-dimensional nature of these fields give rise to complex linear and nonlinear effects that have posed significant challenges to researchers.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Femtosecond Broadband Frequency Switch of Terahertz Three-Dimensional Meta-Atoms",
            "Publication year": 2021,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/acsphotonics.0c01802",
            "Abstract": "We present the experimental demonstration of a subpicosecond all-optical THz switch based on three-dimensional (3D) terahertz meta-atoms. Combining a special design of 3D meta-devices and the ultrafast dynamics of low temperature grown gallium arsenide, we can modulate the reflectance of the THz microcavities within 2.2 ps. The device enables a 280 GHz switch in resonance frequency within less than 200 fs. The switch back to the original resonance takes 800 fs. Experimental results show that the speed values are strongly convoluted by the THz probing field and, thus, the real switching times are even shorter, in the few 100 fs range.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:xtoqd-5pKcoC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Sub-picosecond broadband frequency modulation of terahertz three-dimensional meta-atoms",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2021-cc_6_4",
            "Abstract": "Ultra-fast modulation of 3D THz LC resonators is presented with a 280 GHz frequency shift obtained in 200fs. The overall modulation cycle of the device takes 2 ps, yet convoluted by the probing technique.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:86PQX7AUzd4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Nonlinear propagation and filamentation of intense Airy beams in transparent media",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8434/84340S/Nonlinear-propagation-and-filamentation-of-intense-Airy-beams-in-transparent/10.1117/12.922476.short",
            "Abstract": "We investigate the nonlinear propagation of intense Airy beams forming filaments in transparent media. We demonstrate the existence of stationary nonlinear Airy beams in a planar geometry. These beams preserve the intensity profile and the transverse acceleration of the Airy peak. We show that stationary propagation is sustained by a continuous energy flux to the main Airy lobe from its neighbors. For powers in the main Airy lobe exceeding a certain threshold, this stationary propagation regime becomes unstable. We extend our results to the 2-dimensional case: Airy beams with high powers in the main lobe reshape into a multifilamentary pattern induced by Kerr and multiphoton nonlinearities. The nucleation of new filaments and their interaction, affects the acceleration of the main Airy lobes. Experiments performed in water corroborate the existence of these two regimes.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:qUcmZB5y_30C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Generation of intense terahertz radiation by two-color filamentation of laser pulses with different wavelengths",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1808.05804",
            "Abstract": "We theoretically study the generation of terahertz (THz) radiation by two-color filamentation of ultrashort laser pulses with different wavelengths. We consider wavelengths in the range from 0.6 to 10.6 m, thus covering the whole range of existing and future powerful laser sources in the near, mid and far-infrared. We show how different parameters of two-color filaments and generated THz pulses depend on the laser wavelength. We demonstrate that there is an optimal laser wavelength for two-color filamentation that provides the highest THz conversion efficiency and results in generation of extremely intense single cycle THz fields.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-guided propagation of ultrashort IR laser pulses in fused silica",
            "Publication year": 2001,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.87.213902",
            "Abstract": "We report self-guided propagation of ultrashort IR laser pulses in fused silica over several Rayleigh lengths. Self-guiding is accompanied by pulse splitting and time compression. Numerical simulations involving pulse self-focusing, temporal dispersion, and multiphoton ionization are found to be in good agreement with the experimental results. They show that a quasidynamic equilibrium between multiphoton ionization and self-focusing drives the filamentation process, while temporal dispersion plays a negligible role.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:BqipwSGYUEgC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Linear and nonlinear light dynamics in photonic lattices",
            "Publication year": 2013,
            "Publication url": "https://www.iesc-proceedings.org/articles/matecconf/abs/2013/06/matecconf_pulm2013_01007/matecconf_pulm2013_01007.html",
            "Abstract": "Photonic lattices, arrays of evanescently coupled waveguides written by femtosecond laser, are often used to control the flow of light. Two cases are here considered experimentally. i) In the linear regime, a faithful transfer is achieved when the photonic structure is judiciously designed. ii) In the nonlinear regime, we show that photonic lattices support a new type of laser filaments, called lattice filaments, with controllable attributes.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:XiSMed-E-HIC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Light propagation in photonic lattices fabricated by direct laser writing",
            "Publication year": 2013,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01320236/",
            "Abstract": "Archive ouverte HAL - Light propagation in photonic lattices fabricated by direct laser writing \nAccéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD \nHAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation \nEpisciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil \nDépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de \npublication Par structure de recherche Les portails de l'archive Recherche Documentation \nhal-01320236, version 1 Poster Light propagation in photonic lattices fabricated by direct laser \nwriting Matthieu Bellec 1 Stelios Tzortzakis 2 Détails 1 LPMC - Laboratoire de physique de \nla matière condensée 2 Institute of Electronic Structure and Laser Type de document : Poster \nDomaine : Physique [physics] / Physique [physics] / Optique [physics.optics] Liste des Voir …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Direct acoustic phonon excitation by intense and ultrashort terahertz pulses",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3529466",
            "Abstract": "We report on the direct and resonant excitation of acoustic phonons in an AlGaAs intrinsic semiconductor using intense coherent and single cycle terahertz pulses created by two-color femtosecond laser pulse filamentation in air. While the electrons are left unperturbed, we follow the lattice dynamics with time-delayed optical photons tuned to the interband transition.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "X and time-resolved XUV emission of laser produced Xe and Kr plasmas",
            "Publication year": 2006,
            "Publication url": "https://jp4.journaldephysique.org/articles/jp4/abs/2006/02/jp4133192/jp4133192.html",
            "Abstract": "X and XUV spectra of Xe and Kr were measured in a gas jet irradiated by a 400 J energy, 1.5 ns duration laser pulse. Simultaneously, the plasma was diagnosed by electronic and ionic Thomson scattering. The XUV spectra were time-resolved with a differentially pumped streak camera. Experimental spectra are compared with simulations performed with a NLTE atomic physics model.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:dfsIfKJdRG4C",
            "Publisher": "EDP sciences"
        },
        {
            "Title": "Measuring easily electron plasma densities in gases produced by ultrashort lasers and filaments",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-18-16866",
            "Abstract": "We present an easy way to calibrate the simple plasma conductivity (PCo) technique for measuring electron plasma densities in gases. We show that calibration can be achieved using a single absolute plasma density measurement through an independent analytical technique, in our case the in-line holographic microscopy (i-HOM). We show the validity and power of the method by comparing the calibrated PCo with results from i-HOM over an extended range of experimental parameters.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:Zph67rFs4hoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "ИССЛЕДОВАНИЕ ЗАВИСИМОСТИ СПЕКТРАЛЬНЫХ ХАРАКТЕРИСТИК И ОПТИЧЕСКИХ СВОЙСТВ ДИЭЛЕКТРИЧЕСКИХ КОМПОЗИТНЫХ СТРУКТУР ОТ ВНУТРЕННЕЙ ПЕРИОДИЧЕСКОЙ СТРУКТУРЫ ДЛЯ ТЕРАГЕРЦОВОГО ДИАПАЗОНА ЧАСТОТ",
            "Publication year": 2015,
            "Publication url": "https://elibrary.ru/item.asp?id=25816638",
            "Abstract": "ИССЛЕДОВАНИЕ ЗАВИСИМОСТИ СПЕКТРАЛЬНЫХ ХАРАКТЕРИСТИК И \nОПТИЧЕСКИХ СВОЙСТВ ДИЭЛЕКТРИЧЕСКИХ КОМПОЗИТНЫХ СТРУКТУР ОТ \nВНУТРЕННЕЙ ПЕРИОДИЧЕСКОЙ СТРУКТУРЫ ДЛЯ ТЕРАГЕРЦОВОГО ДИАПАЗОНА \nЧАСТОТ ПОИСК НАВИГАТОР СЕССИЯ КОНТАКТЫ ИНФОРМАЦИЯ О ПУБЛИКАЦИИ \nИССЛЕДОВАНИЕ ЗАВИСИМОСТИ СПЕКТРАЛЬНЫХ ХАРАКТЕРИСТИК И \nОПТИЧЕСКИХ СВОЙСТВ ДИЭЛЕКТРИЧЕСКИХ КОМПОЗИТНЫХ СТРУКТУР ОТ \nВНУТРЕННЕЙ ПЕРИОДИЧЕСКОЙ СТРУКТУРЫ ДЛЯ ТЕРАГЕРЦОВОГО ДИАПАЗОНА \nЧАСТОТ ГОМОН ДА1 , ГУРВИЦ ЕА1 , АНДРОНАКИ СА1 , ГУСЕВ СИ1 , DASKALAKI C. , \nTZORTZAKIS S. , ХОДЗИЦКИЙ МК1 1 Университет ИТМО, кафедра Фотоники и \nОптоинформатики, г. Санкт-Петербург 2 Institute of Electronic Structure and Laser, \nFoundation for Research and Technology Hellas, Heraklion, Greece : …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "In-line holography for the characterization of ultrafast laser filamentation in transparent media",
            "Publication year": 2008,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2968190",
            "Abstract": "A powerful experimental method, based on holographic microscopy, is used to retrieve the spatiotemporal distribution of small (<10−3) refractive index perturbations induced by ultrafast laser pulses in transparent media. A numerical iterative wavefront propagation approach is used to accurately reconstruct both the phase and the amplitude of the perturbed probe beam wavefront, while Abel inversion recovers the exact three dimensional distribution of the perturbation. For demonstration, a laser filament induced plasma string in air is fully characterized.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:YsMSGLbcyi4C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Self-Guided Propagation of Ultrashort IR Laser Pulses in Fused Silica",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=1017924234344930958&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "State transfer hamiltonians in photonic lattices",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39937-4_7",
            "Abstract": "Faithful communication is a necessary precondition for large scale all-optical networking and quantum information processing. Related theoretical investigations in different areas of physics have led to various proposals in which finite discrete lattices are used as channels for short-distance communication tasks. Here, in the framework of femtosecond-laser-written waveguide arrays, we present the first experimental realization of such a channel with judiciously engineered couplings. Various sources of imperfections and defects are identified, which are associated with the engineering procedure and affect the communication.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Graphene THz Metasurfaces with Photoinduced Modulation",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8840541/",
            "Abstract": "We discuss the unique possibilities of graphene-based THz metasurfaces and we present the experimental and theoretical study of an ultrafast graphene-based thin film absorption modulator for operation in the THz regime. The stimulus is a near-IR pulse that generates hot carriers in the graphene metasurface reducing its conductivity.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:tYavs44e6CUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A platform for ultrafast control in THz graphene-based metasurfaces",
            "Publication year": 2020,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11390/113900B/A-platform-for-ultrafast-control-in-THz-graphene-based-metasurfaces/10.1117/12.2559377.short",
            "Abstract": "We discuss the unique possibilities stemming from exploiting the exotic properties of artificial metasurfaces designed for operation in the THz regime. We mainly focus on graphene based metasurfaces acting as modulators for the THz regime. Graphene exhibits unique optical properties particularly in the THz spectrum, where it predominantly exhibits a Drude-like response. Here we present that ultrafast modulation response in a graphene thin film absorber which can be assessed with use of a broadband THz time-domain-spectroscopic system (THz-TDS) in an IR pump-THz probe configuration. The simple scheme of the absorber can be used as a platform for ultrafast flat optics and metasurfaces.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:k8Z6L05lTy4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Ultrafast Laser Welding: Taming Ultrafast Laser Filaments for Optimized Semiconductor–Metal Welding (Laser Photonics Rev. 15 (2)/2021)",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/lpor.202170014",
            "Abstract": "In article number 2000433, Maxime Chambonneau, Qingfeng Li, Stefan Nolte, and co-workers demonstrate semiconductor–metal ultrafast laser welding—an additive manufacturing technique limited to other material families so far. This achievement is made possible by the determination and the precompensation of the nonlinear focal shift in the filamentation regime. This work offers new insights for the fabrication of microelectronic devices.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigation of the spatial profile of stimulated Raman scattering beams in D 2 and H 2 gases using a pulsed Nd: YAG laser at 266 nm",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-004-1508-4",
            "Abstract": "The stimulated Raman scattering (SRS) beam spatial mode structure is studied in H2 and D2 gases, in a 60 cm-long high-pressure Raman cell, using a pulsed Nd:YAG laser at 266 nm. The conversion efficiencies of the first and second Stokes in H2, D2 and H2/D2 mixtures have been measured precisely in the 1–14 atm range. The SRS beam profiles were recorded for different gas pressures in the high-pressure Raman cell and interesting behaviour is revealed. Homogeneous SRS spatial profiles were obtained only for pressures higher than 7 atm. For lower pressures the profiles are either in the form of a ring or of a more complicated shape. The results are explained in terms of nonlinear self-focusing processes during the pump beam propagation in the Raman cell. Also, from our measurements, a more precise value of the nonlinear index of refraction for the H2 and D2 at 266 nm is proposed. ",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Structured adaptive focusing through scattering media",
            "Publication year": 2016,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9717/971719/Structured-adaptive-focusing-through-scattering-media/10.1117/12.2211594.full?sessionGUID=9d902bc9-993c-ed26-8bea-d49a28531ab0&webSyncID=e9e6ec7a-49da-b6a0-cbad-059329ad883c&sessionGUID=9d902bc9-993c-ed26-8bea-d49a28531ab0",
            "Abstract": "The combined use of a wavefront modulator and a scattering medium forms an \"opaque lens\" which forces the light to focus tightly. The adaptive focus has the same shape as the correlation function of the original speckle pattern and it can be generated at defined positions with resolution up to hundreds of nanometers. We have demonstrated that manipulating the speckle pattern spatial components can structure the shape of the focus. Exploiting selectively spatial-frequencies from the speckle components we realized opaque lenses able to produce sub-correlation foci and Bessel beams.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:t6usbXjVLHcC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Exceeding the bulk modification threshold of silicon with hyper-focused infrared femtosecond laser pulses",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2017-CM_8_1",
            "Abstract": "Ultra-short breakdown in the bulk of transparent materials has been intensively investigated in the last years, especially in dielectrics [1]. Whereas three-dimensional (3D) femtosecond laser micromachining in dielectrics is highly advanced, it remains extremely challenging in narrow bandgap materials such as silicon (Si). Recent numerical and experimental investigations show that only an underdense microplasma can be generated inside the bulk of crystalline Si by two-photon absorption [2]. The energy deposition inside the material is drastically limited by significant losses in the prefocal region and strong plasma effects. We provide in this study an experimental evidence of this optical limitation by 3D-imaging of the beam propagation with 60-fs, 1300-nm pulses focused 1 mm under the Si-surface. Even for high Numerical Aperture (NA)(up to 0.65), we observe a strict clamping of the delivered energy far below …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:NJ774b8OgUMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Janus waves",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-41-20-4656",
            "Abstract": "We show the existence of a family of waves that share a common interesting property affecting the way these waves propagate and focus. The waves are a superposition of twin waves, which are conjugate to each other under inversion of the propagation direction. In analogy to holography, these twin “real” and “virtual” waves are related, respectively, to the converging and diverging parts of the beam and can be clearly visualized in real space at two distinct foci under the action of a focusing lens. Analytic formulas for the intensity distribution after focusing are derived, while numerical and experimental demonstrations are given for some of the most interesting members of this family, the accelerating Airy and ring-Airy beams.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Self-guiding of IR femtosecond laser pulses in air: experiments versus simulations",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2000-QWL5",
            "Abstract": "There is presently a considerable interest in understanding the propagation of intense femtosecond laser pulses through the atmosphere. Self-guided infra-red (IR) laser beams with high peak power forming an intense filament over long distances have been reported by several groups. 1− 3",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:_xSYboBqXhAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Two-color mid-infrared laser filaments produce terahertz pulses with extreme efficiency",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2019-cc_8_1",
            "Abstract": "Despite the rapid development of terahertz (THz) science during the last two decades, the majority of available THz sources remains rather weak, limiting the interactions of THz radiation with matter mostly in the realm of linear optics. Development of powerful THz sources will open the way to many exciting applications spanning from switching and controlling of magnetic domains to THz-enhanced attosecond pulse generation [1, 2].",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Passive radiative cooler for solar cells’ temperature and efficiency control",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=EQEC-2021-eh_6_6",
            "Abstract": "We present a radiative cooling approach for photovoltaic cells temperature and efficiency evaluation. We derive the maximum temperature-drop requirements and apply the approach in a nano-micro-grating remarkably enhancing both thermal radiation emission and solar absorption.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Breakup and fusion of self-guided femtosecond light pulses in air",
            "Publication year": 2001,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.86.5470",
            "Abstract": "We report experiments showing the breakup and the merging of filaments formed by the modulational instability of femtosecond optical pulses in air. For input powers as high as 25 times the self-focusing threshold, the beams are shown to split into two spots, which coalesce into a self-guided beam. This effect occurs in an optically Kerr regime and plays an important role in the guiding process. Numerical simulations and theoretical estimates both support the comparison with the experimental data.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:GnPB-g6toBAC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Nonequilibrium electron dynamics in noble metals",
            "Publication year": 2000,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.61.16956",
            "Abstract": "Electron-electron and electron-lattice interactions in noble metals are discussed in the light of two-color femtosecond pump-probe measurements in silver films. The internal thermalization of a nonequilibrium electron distribution created by intraband absorption of a pump pulse is followed by probing the induced optical property changes in the vicinity of the frequency threshold for the d band to Fermi surface transitions. This is shown to take place with a characteristic time constant of 350 fs, significantly shorter than previously reported in gold. This difference is ascribed to a weaker screening of the electron-electron interaction by the d-band electrons in silver than in gold. These results are in quantitative agreement with numerical simulations of the electron relaxation dynamics using a reduced static screening of the electron-electron Coulomb interaction, and including bound electron screening. Electron-lattice …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:NMxIlDl6LWMC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Taming light with photonic lattices written by femtosecond laser",
            "Publication year": 2013,
            "Publication url": "https://www.iesc-proceedings.org/articles/matecconf/abs/2013/06/matecconf_pulm2013_01005/matecconf_pulm2013_01005.html",
            "Abstract": "Photonic lattices, arrays of evanescently coupled waveguides written by femtosecond laser, are often used to control the flow of light. Two cases are here considered experimentally. i) In the linear regime, a faithful transfer is achieved when the photonic structure is judiciously designed. ii) In the nonlinear regime, we show that photonic lattices support a new type of laser filaments, called lattice filaments, with controllable attributes.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:u9iWguZQMMsC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Plasma strings from ultraviolet laser filaments drive permanent structural modifications in fused silica",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-32-14-2055",
            "Abstract": "Long self-trapped femtosecond ultraviolet filaments created in the bulk of pure fused silica are used to induce permanent structural changes in the medium. We monitor the laser pulse propagation as a filamentary structure and the plasma string left at its trail. We investigate and demonstrate the link of the filament-induced plasma to the permanent structural changes left in the medium. Specific electron density thresholds are found for the induced modifications.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Linear and nonlinear waves in surface and wedge index potentials",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-37-11-1874",
            "Abstract": "We study optical beams that are supported at the surface of a medium with a linear index potential and by a piecewise linear wedge-type potential. In the linear limit the modes are described by Airy functions. In the nonlinear regime we find families of solutions that bifurcate from the linear modes and study their stability for both self-focusing and self-defocusing Kerr nonlinearity. The total power of such nonlinear waves is finite without the need for apodization.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Precise Holographic Measurements Reveal High Electron Densities in Mid-Infrared Laser Filaments in Air",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8426530/",
            "Abstract": "We report on precise experimental measurements of the electron plasma density in plasma strings generated in air by 3μm laser filaments using holography. We discuss the origin and impact of the high electron densities observed.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Physics of the conical broadband terahertz emission from two-color laser-induced plasma filaments",
            "Publication year": 2014,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.89.033838",
            "Abstract": "We propose a comprehensive physical model explaining the conical character of broadband terahertz generation from femtosecond two-color laser-induced air plasma filaments. We show, that, in contrast to other models, emission is always conical, resulting from phase matching of the radiation produced inside the filament combined with a partial back reflection of the generated terahertz field from the filament itself due to the frequency-dependent critical plasma density. The obtained conical angle varies from 2∘ to 10∘, depending on the plasma density distribution and filament length. Unlike previously proposed models, our model shows good agreement with our experiments as well as a wide range of experimental findings from the literature.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:738O_yMBCRsC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Efficient third-harmonic generation through tailored IR femtosecond laser pulse filamentation in air",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-17-5-3190",
            "Abstract": "The process of third-harmonic generation during the filamentation of intense IR femtosecond laser pulses in air is investigated experimentally. It is shown that the introduction of a thin plasma string created by another femtosecond pulse, perpendicularly to the filament’s path, dramatically reshapes the third-harmonic beam into a Bessel-like far-field distribution, while at the same time significantly enhances, up to 250 times, its conversion efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Range of plasma filaments created in air by a multi-terawatt femtosecond laser",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401804011812",
            "Abstract": "The propagation of a multi-terawatt femtosecond laser pulse in air is studied as a function of initial chirp. The chirp conditions for optimising air ionisation at long distance are presented. Ionisation channels are observed over a distance reaching 400 m.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:J_g5lzvAfSwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Four-dimensional visualization of single and multiple laser filaments using in-line holographic microscopy",
            "Publication year": 2011,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.84.053809",
            "Abstract": "It is shown, both through simulations and experiments, that the in-line holographic microscopy technique can be used to retrieve very small refractive-index perturbations caused during the filamentation of ultrashort laser pulses. This technique provides the possibility of having spatially and temporally (four dimensions) resolved measurements of refractive-index changes, down to 10− 4, from objects with diameters as small as 10 μm. Moreover, we demonstrate the power of the technique in discriminating multiple filaments in a precise quantitative way.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Sharply autofocused ring-Airy beams transforming into non-linear intense light bullets",
            "Publication year": 2013,
            "Publication url": "https://www.nature.com/articles/ncomms3622",
            "Abstract": "Controlling the propagation of intense optical wavepackets in transparent media is not a trivial task. During propagation, low-and high-order non-linear effects, including the Kerr effect, multiphoton absorption and ionization, lead to an uncontrolled complex reshaping of the optical wavepacket that involves pulse splitting, refocusing cycles in space and significant variations of the focus. Here we demonstrate both numerically and experimentally that intense, abruptly autofocusing beams in the form of accelerating ring-Airy beams are able to reshape into non-linear intense light-bullet wavepackets propagating over extended distances, while their positioning in space is extremely well defined. These unique wavepackets can offer significant advantages in numerous fields such as the generation of high harmonics and attosecond physics or the precise micro-engineering of materials.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Infrared extension of the supercontinuum generated by femtosecond terawatt laser pulses propagating in the atmosphere",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-25-18-1397",
            "Abstract": "We investigated the spectral behavior of a white-light continuum generated in air by 2-TW femtosecond laser pulses at 800 nm. The spectrum extends at least from 300 nm to 4.5 µm. From 1 to 1.6 µm the continuum’s intensity increases strongly with the laser energy and depends on the initial chirp.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Nonlinear propagation dynamics of finite-energy Airy beams",
            "Publication year": 2012,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.86.013842",
            "Abstract": "The nonlinear dynamics of intense truncated Airy beams in Kerr ionizing media are investigated from numerical simulations and experiments. We show numerically that a competition between the linear and nonlinear effects takes place and may be modified by tuning the width of the main lobe of the Airy beam and the size of the truncating diaphragm. Our analysis shows that the acceleration of the Airy peak, an inherent feature of linear Airy beam propagation, is preserved only for powers in the main Airy lobe below a certain threshold. Nonlinear propagation of intense Airy beams with low power in the main lobe is sustained by a continuous energy flux from its neighbors, similarly to the mechanism sustaining nonlinear Bessel beam propagation. Airy beams with higher powers in the main lobe are reshaped into a multifilamentary pattern induced by Kerr and multiphoton nonlinearities. The nucleation of new …",
            "Abstract entirety": 0,
            "Author pub id": "nMJ0DjAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Light filaments generated by terawatt-laser pulses-conductivity, spectral content and LIDAR measurements",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=assl-2000-WA3",
            "Abstract": "TW-fs-laser pulses are used for a novel height-resolved LIDAR detection technique. This remote sensing technique should allow a multi-component analysis of atmospheric compounds in the visible and near-infrared. Results of the spectral content and conductivity of light-filaments generated by high-intensity lasers and height-resolved LIDAR-measurements in the visible are presented.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:f2IySw72cVMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Structural modifications in fused silica induced by ultraviolet fs laser filaments",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169433207003066",
            "Abstract": "It is shown that the tight focusing of short ultraviolet laser pulses (248 nm, 450 fs) in the bulk of high bandgap transparent solids (fused silica) can result in structural modifications in the material. These can vary from small changes of the refractive index to birefringence, cracks and voids. This restructuring of the medium is due to the high laser intensities attained, and the plasma that is generated through multi-photon processes. The restructuring comes in the form of a string, which is the result of the nonlinear propagation of the laser beam in the medium as a self-trapped filament. We resume the conditions for the generation of the different types of modifications and comment on the temporal evolution and the role of the plasma strings at the trail of the light filaments.",
            "Abstract entirety": 1,
            "Author pub id": "nMJ0DjAAAAAJ:kNdYIx-mwKoC",
            "Publisher": "North-Holland"
        }
    ]
}]