[{
    "name": "Στυλιανός Ξυνόγαλος",
    "romanize name": "Stylianos Xynogalos",
    "School-Department": "Εφαρμοσμένης Πληροφορικής",
    "University": "uom",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 23170,
    "Scholar name": "Stelios Xinogalos",
    "Scholar id": "TquBXjAAAAAJ",
    "Affiliation": "Dept. of Applied Informatics, University of Macedonia",
    "Citedby": 1479,
    "Interests": [
        "Programming Environments",
        "Programming Techniques",
        "Serious Games",
        "Computer Science Education"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=TquBXjAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "An interactive learning environment for teaching the imperative and object-oriented programming techniques in various learning contexts",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16318-0_66",
            "Abstract": "The acquisition of problem-solving and programming skills in the era of knowledge society seems to be particularly important. Due to the intrinsic difficulty of acquiring such skills various educational tools have been developed. Unfortunately, most of these tools are not utilized. In this paper we present the programming microworlds Karel and objectKarel that support the procedural-imperative and Object-Oriented Programming (OOP) techniques and can be used for supporting the teaching and learning of programming in various learning contexts and audiences. The paper focuses on presenting the pedagogical features that are common to both environments and mainly on presenting the potential uses of these environments.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Educational games for teaching computer programming",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-6501-0_7",
            "Abstract": "Teaching and learning computer programming presents teachers and students respectively with many challenges, especially when taught with the “traditional” approach. Several alternative teaching approaches were proposed the previous years, but they seem not to fulfil successfully the needs of the twenty-first century students. Students nowadays are raised in a digital world and they learn and react differently. Students start to use computers before they first attend formal education, while computer games have become a part of their everyday life. A growing number of teachers/researchers propose the incorporation of educational games (or serious games) in the teaching of computer programming with the aim of reinforcing instinctive motivation through challenging students, piquing their curiosity and providing them with a sense of control and imagination. This paper aims to review the functionalities that …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Programming serious games as a master course: Feasible or not?",
            "Publication year": 2018,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1046878117747014",
            "Abstract": "Background. Higher education on simulation & gaming has a long history with several master degrees offered by Universities worldwide. Currently, the popularity of Serious Games (SGs) has resulted in an increased interest on relevant master degrees. Despite the large number of master degrees on games in general, the literature on designing and evaluating relevant courses in higher education is rather limited.Aim. This article aims at contributing on the field of SGs higher education by reporting on the design and evaluation of a graduate course on ‘SGs Programming’. The course aims at providing students a holistic overview of SGs design, development and evaluation in a single course offered at a master degree that is not dedicated to simulation & gaming. The main goal of the pilot study presented was to investigate whether the proposed course can fulfill its objectives, as well as to draw conclusions on the …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:isC4tDSrTZIC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "An introduction to object-oriented programming with a didactic microworld: objectKarel",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131504001447",
            "Abstract": "The objects-first strategy to teaching programming has prevailed over the imperative-first and functional-first strategies during the last decade. However, the objects-first strategy has created added difficulties to both the teaching and learning of programming. In an attempt to confront these difficulties and support the objects-first strategy we developed a novel programming environment, objectKarel, which uses the language Karel++. The design of objectKarel was based on the results of the extended research that has been carried out about novice programmers. What differentiates it from analogous environments is the fact that it combines features that have been used solely in them: incorporated e-lessons and hands-on activities; an easy to use structure editor for developing/editing programs; program animation; explanatory visualization; highly informative and friendly error messages; recordability. In this paper, we …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Teaching fundamental notions of object oriented programming with objectKarel",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=12824949848728032922&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "WSEAS"
        },
        {
            "Title": "An empirical study on factors related to distributed pair programming",
            "Publication year": 2019,
            "Publication url": "https://www.learntechlib.org/p/208576/",
            "Abstract": "This paper reports students’ perceptions and experiences attending an object-oriented programming course in which they developed software using the Distributed Pair Programming (DPP) technique. Pair programming (PP) is typically performed on one computer, involving two programmers working collaboratively on the same code or algorithm. DPP on the other hand is performed remotely allowing programmers to collaborate from separate locations. PP started in the software industry as a powerful way to train programmers and to improve software quality. Research has shown that PP (and DPP) is also a successful approach to teach programming in academic programming courses. The main focus of PP and DPP research was PP’s effectiveness with respect to student performance and code quality, the investigation of best team formation strategies and studies of students’ attitudes. There are still limited …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:M05iB0D1s5AC",
            "Publisher": "International Association of Online Engineering"
        },
        {
            "Title": "Mobile app development in HTML5",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4912562",
            "Abstract": "Mobile apps have been around for only a few years, but have gained immense consumer attention. Developers creating native apps are faced with the daunting task of maintaining different sources for each target platform, while web and hybrid apps are faced with a series of technical and non technical issues. Native apps function smoothly in a standard way that the user is already familiar with and provide the richest user experience having full and direct access to the onboard hardware and software. On the other hand web apps offer cross-platform compatibility, saving development time, effort and money for developers. Moreover, HTML5 is expected to enhance user experience offered by web apps, which is one of their major shortcomings. The aim of this paper is to investigate various aspects of HTML5 in mobile app development.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:hC7cP41nSMkC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Using Greenfoot as a Tool for Serious Games Programming Education and Development",
            "Publication year": 2021,
            "Publication url": "https://pdfs.semanticscholar.org/1a62/a93cc858136d742301979e6e369d05ea32f3.pdf",
            "Abstract": "Greenfoot is an educational programming environment that aims to motivate students in learning object-oriented programming (OOP) through the development of simple games and simulations. Several studies have presented positive results regarding the usage of Greenfoot as a tool for introducing novices to OOP. In this article, we propose using Greenfoot as a tool for introducing novices to (serious) games programming, as well as a tool for implementing serious games (SGs). As a proof of concept, the design and implementation of an SG for learning OOP utilizing Greenfoot and a survey on the perceptions of graduates that had been introduced to SGs programming with Greenfoot in the context of a relevant Master course are presented. The results show that Greenfoot, although not developed for this purpose, can be utilized both as a tool for introducing novices to (serious) games programming and as a tool for developing SGs.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PyDiophantus maze game: Play it to learn mathematics or implement it to learn game programming in Python",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-019-10087-1",
            "Abstract": "Serious games or educational games have attracted the interest of instructors and researchers for several years. In the field of education, serious games are being used for motivating students, attracting their interest in cognitively demanding fields and making the teaching and learning process more fun. Moreover, learning through implementing games has been proposed as an effective alternative to the traditional instructor-centered approach to teaching programming. Towards this direction the study presented in this article aims to investigate whether it is feasible to learn programming concepts, as well as game programming concepts, through implementing a game in Python. More specifically, the study presented has the following goals: firstly, to review and comparatively analyze existing game engines and libraries that can be used by novice programmers for implementing simple games in Python; secondly, to …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A review on location based services for mobile games",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003770",
            "Abstract": "As mobile users take their devices with them everywhere, adding location-awareness and incorporating geographic data into the applications is an important way to keep users connected to the surrounding world and people nearby, enhancing the overall contextual experience. Through the use of sensors like GPS, accelerometer, gyroscope and more on a mobile device, the addition of rich location and motion capabilities, automated location tracking, geofencing and activity recognition is feasible.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studying novice programmers’ attitudes in developing and implementing algorithms using an educational programming environment’",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16381647517421904886&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparison of two object-oriented programming environments for novices",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/44125000/A_comparison_of_two_object-oriented_prog20160326-14843-1loj7u6.pdf",
            "Abstract": "Teaching Object Oriented Programming (OOP) to novices is quite problematic. In order to overcome the difficulties various teaching approaches have been proposed. In this paper, we present our findings regarding two teaching approaches based on two different environments:(i) teaching with the Educational Programming Environment of BlueJ;(ii) teaching with the Programming Microworld of objectKarel. The presented results are based on students’ answers to a questionnaire that was given to students at the last lesson of the two studies, and refer exclusively to the comprehension of the most basic concepts of OOP: objects and classes. The analysis of the results shows that the combined use of the two environments seems to constitute a better didactic strategy from just using one of the two environments.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview and comparative analysis of game engines for desktop and mobile devices",
            "Publication year": 2017,
            "Publication url": "https://ruomo.lib.uom.gr/handle/7000/180",
            "Abstract": "Game engines are tools  that expedite the highly demanding process of developing games. Nowadays, the great interest of people from various fields on  serious games has  made  even  more  demanding  the  usage  of  game  engines,  since  people  with limited  coding skills  are  also  involved in developing serious games.  Literature in the field has studied game engines focusing on specific needs, such as 3D mobile game engines  or open source 3D game engines. The motivation  of this article  and at the same  time  the  advancement  brought  by  it  in  the  field,  lies  in  the  extension  of  an existing  framework  for  the  comparative  analysis  of  several  game  engines  that export games at least on Android and iOS mobile devices and cover a wide range of different user profiles and needs.  In order to validate the results of this comparative analysis  a  shooter  game  was  developed  for  Android  devices  based  on  official tutorials of the two game engines that came out to be more powerful, namely Unity and Unreal Engine 4.  In conclusion, there is not a single game engine t hat is better for  every  purpose  and  the  extensive  overview  provided  can  help  users  choose  the  most suitable game engine for their needs.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparative analysis of cross-platform development approaches for mobile applications",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2490257.2490292",
            "Abstract": "Nowadays, native mobile applications (mobile apps) are targeted at specific mobile platforms. This phenomenon imposes severe constraints, such as the use of different development environments, technologies, and APIs (Application Programming Interfaces) for each mobile platform, leading inevitably to a waste of development time and effort, and an increased maintenance cost.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating key Structural Elements in Location-Based Mobile Serious Games",
            "Publication year": 2019,
            "Publication url": "https://search.proquest.com/openview/8fdaba0f99b1cd8c72c592d9f2a2c2d1/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "Nowadays, the mobile industry is one of the most lucrative sectors with smartphone and tablet gaming growing year over year. In recent years, several commercial GPS-enabled AR location-aware mobile games have been presented that try to combine real world locations with in-game activities, such as Ingress or Geocaching. However, besides the obvious use of mobile games for entertainment purposes, games can disclose new opportunities for pedagogical activities when properly designed. Serious games use the motivational aspect of games for purposes other than entertainment. More specifically, location-based games have been used effectively in a number of domains. Location-based mobile serious games presented in the literature emphasize the interaction of players with the physical environment in a number of thematic domains such as promoting cultural heritage, place-based language learning in …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Object-oriented design and programming: an investigation of novices’ conceptions on objects and classes",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2700519",
            "Abstract": "The Object-Oriented Programming (OOP) technique is nowadays the most popular programming technique among tertiary education institutions. However, learning OOP is a cognitively demanding task for undergraduate students. Several difficulties and misconceptions have been recorded in the literature for both OOP concepts and languages, mainly Java. This article focuses on reviewing and advancing research on the most fundamental OOP concepts, namely, the concepts of “object” and “class” and their role during program execution. The results of a long-term investigation on the subject are presented, focusing on a study exploring undergraduate students’ conceptions on “objects” and “classes.” The study advances related research on categories of conceptions on “objects” and “classes” by providing quantitative results, in addition to qualitative results, regarding the frequency of the recorded conceptions …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:HDshCWvjkbEC",
            "Publisher": "ACM"
        },
        {
            "Title": "Towards optimizing server performance in an educational MMORPG for teaching computer programming",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4825494",
            "Abstract": "Web-based games have become significantly popular during the last few years. This is due to the gradual increase of internet speed, which has led to the ongoing multiplayer games development and more importantly the emergence of the Massive Multiplayer Online Role Playing Games (MMORPG) field. In parallel, similar technologies called educational games have started to be developed in order to be put into practice in various educational contexts, resulting in the field of Game Based Learning. However, these technologies require significant amounts of resources, such as bandwidth, RAM and CPU capacity etc. These amounts may be even larger in an educational MMORPG game that supports computer programming education, due to the usual inclusion of a compiler and the constant client/server data transmissions that occur during program coding, possibly leading to technical issues that could cause …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:M3ejUd6NZC8C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A proposal for teaching Object-Oriented Programming to undergraduate students",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJTCS.2009.026298",
            "Abstract": "Various teaching approaches have been proposed for teaching Object-Oriented Programming (OOP) to novices. In this paper we present the results of studying students' conceptual grasp of OOP concepts in two distinct teachings based on the educational programming environments BlueJ and objectKarel. Also, students' replies regarding the effectiveness of objectKarel as a medium of introducing novices to OOP and preparing them for a transition to a conventional OOP language are presented. The main contribution of this paper relates to a new proposal for teaching OOP to undergraduate students, which is based on the combined use of objectKarel and BlueJ.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:roLk4NBRz8UC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Recent advances delivered by HTML 5 in mobile cloud computing applications",
            "Publication year": 2012,
            "Publication url": "https://ruomo.lib.uom.gr/handle/7000/269",
            "Abstract": "With the explosive growth of the mobile applications and emerging of Cloud Computing (CC) concept, Mobile Cloud Computing (MCC) has been introduced to be a potential technology for mobile services. MCC refers to an infrastructure where both the data storage and the data processing happen outside of the mobile device. One of the technologies that will advance MCC is the latest version of the Web's markup language, HTML 5. In this paper, we present a survey of new HTML 5 features with a focus on the enhancement of the current MCC limitations. Specifically, we present the most important features of HTML 5 organized in different categories and their contribution in the deployment of MCC applications. Finally, the results of the research carried out on evaluating HTML 5 in terms of a wide range of applications and specifications are reviewed.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:SeFeTyx0c_EC",
            "Publisher": "ACM"
        },
        {
            "Title": "Using serious games for promoting blended learning for people with intellectual disabilities and autism: Literature vs reality",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_55",
            "Abstract": "Educating people with intellectual disabilities (ID) or autism spectrum disorder (ASD) is a non-trivial process and differs from the learning methods of typically developed people. Recently, serious games (SGs) have been used to enhance the learning process of these groups and address different skills. On the other hand, blended learning (BL) is applied to formal and informal educational contexts and combines face-to-face and online learning. In this study, we examine if SGs can provide the necessary means for applying BL, especially for people with ID or ASD that could be benefited by personalized learning opportunities. In addition, we examine 43 existing SGs for people with ID or ASD, as well as the perceptions of 93 special education professionals (SEP) and teachers (SET) working in schools and institutions for people with ID or ASD regarding the role of technology and SGs in their education. We …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Educational technology: a didactic microworld for an introduction to object-oriented programming",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=2430376601345941883&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Two-Year Evaluation of Distributed Pair Programming Assignments by Undergraduate Students",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qYkiEAAAQBAJ&oi=fnd&pg=PA35&dq=info:OlTTPiPPC0kJ:scholar.google.com&ots=CeTdn10jui&sig=WvalU2FrIqLyZHdZKGBx-KR3yFk",
            "Abstract": "Pair Programming (PP), as an element of Extreme Programming, has a long history in the software industry. The many benefits of PP are also considered important in the teaching of programming. Collaboration, sharing of knowledge and skills, as well as easier error detection and correction, are some of the factors that assist pairs of students in implementing programs. More recently, specially designed educational programming environments have given rise to Distributed Pair Programming (DPP), where pairs of students apply PP remotely anywhere and at anytime. A number of plugins for Eclipse IDE were built to support DPP in Computer Science Education. Although they cover the basic requirements of DPP, they could not address drawbacks of PP, such as unequal contributions from each member of the student pair.Most of the research findings concern PP and a few studies investigated DPP. Studies in the field of DPP aimed to evaluate the effectiveness of DPP in student performance, DPP versus solo programming or DPP versus co-located PP (Duque and Bravo 2008; Hanks 2008) and other studies tested productivity and code quality between DPP and PP and concluded that virtual and co-located teams can produce comparable software. Researches on pair formation and pair compatibility in DPP are few.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "jAVANT-GARDE: A cross-platform serious game for an introduction to programming with Java",
            "Publication year": 2018,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1046878118789976",
            "Abstract": "Background. Programming is widely known to be a cognitively demanding field. Learning programming can be a strenuous task without the proper guidance and methodology. Students often face difficulties in understanding even the most basic and fundamental concepts of programming, leading to their confusion and disappointment. Serious games for programming have the potential to alleviate students’ difficulties with programming.Aim. This article introduces a new serious game named jAVANT-GARDE which aims to educate the player on the basic concepts of programming and object-oriented programming through Java. By design, the game is suitable for everyone, even for players with no previous knowledge of programming. This article aims to present important information regarding the design, implementation and pilot evaluation of jAVANT-GARDE.Method. The game was evaluated by 42 high school …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:J_g5lzvAfSwC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Difficulties with Collection Classes in Java-The Case of the ArrayList Collection",
            "Publication year": 2010,
            "Publication url": "https://www.scitepress.org/Papers/2010/27962/",
            "Abstract": "This paper describes research on teaching Object-Oriented Programming (OOP) concepts to undergraduate students. The research focuses on the difficulties of using collections for grouping objects, which is a very common task in object-oriented applications. This research was motivated by the observation that ArrayList collections are a source of various difficulties, combined with the fact that these difficulties have not been investigated before in the literature. The data analyzed come from an undergraduate course on “Object-Oriented Design and Programming”, which uses Java and the educational IDE BlueJ. The research carried out used both a qualitative and a quantitative research method. In this paper we present an analysis of the difficulties regarding ArrayLists that aims at providing a useful resource for those teaching OOP.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:NhqRSupF_l8C",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "Studying the effects of computer serious games on people with intellectual disabilities or autism spectrum disorder: A systematic literature review",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jcal.12311",
            "Abstract": "This study examines the available literature on the effects of serious games on people with intellectual disabilities or autism spectrum disorder. The studies were categorized based on the limitations in skills that these people address. Fifty‐four studies were selected, from different data sources. These studies address limitations in intellectual functioning and adaptive behaviour. The results showed that the majority of studies on the effects of serious games for people with intellectual disabilities or autism spectrum disorder had a positive impact. Also, most studies for people with autism aim to improve social and communicational skills, whereas conceptual and cognitive skills were mainly observed in studies for people with intellectual disabilities. Although this study covers serious games in all platforms or delivery systems, the overwhelming majority of the presented studies include computer serious games. Computer …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CMX: Implementing an MMORPG for learning programming",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=IedEBQAAQBAJ&oi=fnd&pg=PA346&dq=info:ZkdSul4q_zgJ:scholar.google.com&ots=bGXl_S0lY0&sig=ignYtYvT5y1VjzRnDgo9Ago6sAI",
            "Abstract": "The initial stage of the learning programming process is an arduous task. Novice students have to simultaneously learn the syntax of a programming language, understand the algorithmic logic that each program is based on as well as comprehend the basic concepts of the programming principles. The problems students are faced with become even greater when teachers employ complex environments with minimum graphical facilities instead of user‐friendly educational programming environments. At the same time, constant technological developments indicate that the global market will continue to require highly skilled computer programmers; thus, the usage of advanced educational environments to properly train future professionals is essential. This is one of the reasons why a new type of technology called Serious Games has started raising great interest in educational settings. Using serious games in education combines increased motivation of students with the incorporation of course materials within the games’ tasks. The aim of this paper is to apply an educational Massive Multiplayer Online Role Playing Game (MMORPG) named CMX in university settings and evaluate its efficiency in successfully teaching programming elements while entertaining and engaging students in an interesting environment. The game is applied in two groups of students already familiar with basic computer programming concepts and it has been populated with units of learning regarding arrays in the C programming language. Both groups engage in and interact with the game’s environment, Senseis, tasks and other players and we record their behaviours …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Programming techniques and environments in a technology management department",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371316.2371342",
            "Abstract": "Teaching and learning programming is widely known to be quite problematic. Designing and deploying programming courses is also quite complex. Several choices have to made, such as selecting the first programming technique and language, the sequence of programming techniques presented to students, the programming environments and the teaching approaches utilized. In this paper, the rationale of the sequence of programming techniques and languages taught at a Technology Management Department, as well as the decisions that have been made for a smoother transition from the imperative to the object-oriented programming technique in terms of the environments and the teaching approaches used are presented. Furthermore, students' replies in a questionnaire regarding their difficulties with this sequence of programming techniques and learning programming in general are analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Η διδασκαλία του αντικειμενοστραφούς προγραμματισμού με τον μικρόκοσμο objectKarel: εμπειρίες, προβληματισμοί και προτάσεις",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:GnPB-g6toBAC",
            "Publisher": "Θέματα στην Εκπαίδευση"
        },
        {
            "Title": "Cells of War: A Serious Game for Familiarizing Players With the Immune System",
            "Publication year": 2018,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1046878118803418",
            "Abstract": "Background. Health constitutes a major field in serious games because of the wide range of applications and the significant contribution to humans and society. The spectrum of games for health meets the needs for education, training, treatment, rehabilitation, research, well-being, prevention, motivation and others.Aim.Cells of War is a serious card game, aiming to familiarize the players with the complex functionalities of the immune system, inform on diseases coming from viruses, bacteria, parasites or fungi and explain how some daily habits may affect health.Method. This article analyzes all the design steps followed in order to integrate the learning content into the game mechanics and game-play. The offline card game was developed in the game engine Unity, making it possible to build executables for Windows, Linux and Mac OS X and distribute them to the users for the first pilot evaluation. The results of the …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:lSLTfruPkqcC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Studying students’ difficulties in an OOP course based on BlueJ",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Maya-Satratzemi/publication/27383898_Studing_Students%27_Difficulties_in_an_OOP_Course_based_on_BlueJ/links/5a13f32ba6fdcc717b56ae72/Studing-Students-Difficulties-in-an-OOP-Course-based-on-BlueJ.pdf",
            "Abstract": "This paper attempts to study students’ difficulties when they are introduced to OOP with the teaching proposal of Kölling & Barnes, that is teaching OOP with the help of BlueJ and the lessons proposed in their book\" Objects First with Java: A practical introduction using BlueJ\". The extensive presentation of difficulties aims at assisting teachers in designing and implementing didactic situations for a more effective use of the BlueJ environment and the proposed lessons.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the frequency and change proneness of dynamic feature pattern instances in PHP applications",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167642318304106",
            "Abstract": "Although numerous technologies are available for developing web applications, PHP holds the lions' share of web content today. PHP offers several features that enable developers to easily produce dynamically extendible code, forming an entire ecosystem of standard as well as more ‘exotic’ opportunities that can be exploited. One reason that drives developers to rely on the dynamic features of a scripting language is to enable effortless functionality extensions. The aim of this work is twofold: initially, we (a) provide an overview of all possible dynamically extendible code patterns (i.e., either through method invocation, or object instantiation) and (b) investigate their frequency by mining the code base of ten milestone PHP projects to identify the subset of patterns that developers actually use. Next, in order to investigate whether the expected flexibility of these patterns stands in practice, we examine if code chunks …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:35N4QoGY0k4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Monitoring an OOP course through assignments in a distributed pair programming system",
            "Publication year": 2016,
            "Publication url": "https://ruomo.lib.uom.gr/handle/7000/461",
            "Abstract": "Distributed Pair Programming (DPP) is widely known to promote collaboration and knowledge sharing among novice programmers, while it engages them in carrying out programming assignments. Moreover, DPP is a means of experiencing agile software development techniques that are considered important in the software market. In this paper, we share some experiences on using the DPP system of SCEPPSys for carrying out assignments in an undergraduate Object Oriented Programming (OOP) course. Specifically, we focus on the information recorded during problem solving and the statistics reported by the system and how this information can be utilized for monitoring both the course regarding the fulfillment of its goals and the programming habits and progress of students. Some proposals are made towards extending the possibilities of SCEPPSys for generating automatically more sophisticated reports that would support instructors in more successfully  monitoring a course and students. The ultimate goal of such an enhanced monitoring is to improve students’ software quality.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Flowchart-based Programming Environments for Simplifying Programming and Software Engineering Processes",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6530276/",
            "Abstract": "Programming environments based on an iconic, flowchart-based notation have been widely used in the context of introducing novices to programming. These tools were initially heavily based on the technology of structure editing, with the aim of alleviating the burden of focusing on the syntactic details of programming languages and giving the chance to focus on acquiring problem solving skills. The technology of program animation was also utilized, in order to allow for a better comprehension of programming structures and flow of control. Furthermore, the ability of generating syntactically correct source code from the flowchart was integrated into these tools. Recently, several advanced features were added in flowchart-based programming environments, such as support for collaborative activities and distributed pair programming and usage in mobile devices. In this paper, a thorough review of programming …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing Software Quality in Students’ Programs",
            "Publication year": 2013,
            "Publication url": "http://ceur-ws.org/Vol-1053/sqamia2013paper2.pdf",
            "Abstract": "This paper focuses on enhancing software quality in students’ programs. To this end, related work is reviewed and proposals for applying pedagogical software metrics in programming courses are presented. Specifically, we present the main advantages and disadvantages of using pedagogical software metrics, as well as some proposals for utilizing features already built in contemporary programming environments for familiarizing students with various software quality issues. Initial experiences on usage of software metrics in teaching programming courses and concluding remarks are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching java with BlueJ: a two-year experience",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/1269900.1268914",
            "Abstract": "In this paper we present our two-year experience on teaching Java with BlueJ on the context of a compulsory course at a Department of Technology Management. The course was taught for the first time in 2005-06 and was heavily based on the features of the programming environment BlueJ and on books/papers related to BlueJ [1]. In the context of the course 11 two-hour lectures and 11 two-hour labs were given.The 2nd time of teaching the course in 2006-07 some changes were made in order to face difficulties that were attributed to the underlying teaching approach and might not be characterized as intrinsic to OOP. The most important changes were:(i) the features of BlueJ were used more carefully, while the main method was taught much earlier in the course (4th lesson), so as to avoid specific difficulties related to object instantiation and the dynamic aspects of OOP;(ii) students started by making small …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "ACM"
        },
        {
            "Title": "Office Madness: Design and Pilot Evaluation of a Serious Game for Learning the C++ Programming Language",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-63464-3_36",
            "Abstract": "In this paper, a new serious game (SG) called Office Madness, is presented. The game is about learning basic and advanced concepts of the programming language C++. Its design was carried out using the EFM design model, while its pilot evaluation was carried out using the MEEGA evaluation model. The main goal of the game is to introduce users to the C++ programming language in a fun and serious way. In contrast with most of the existing programming SGs that are based on puzzles, this game uses an office metaphor and the player undertakes the role of a candidate programmer. The game uses techniques and mechanisms that ultimately aim to stimulate the learner’s sense of seriousness and responsibility when learning C++ and not just to entertain him/her during training.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Εκπαιδευτική Τεχνολογία: Ένας Διδακτικός Μικρόκοσμος για την Εισαγωγή στον Αντικειμενοστραφή Προγραμματισμό",
            "Publication year": 2002,
            "Publication url": "https://dspace.lib.uom.gr/handle/2159/15668",
            "Abstract": "Παρακινούμενοι από την έρευνα σχετικά με τις δυσκολίες που αντιμετωπίζουν οι αρχάριοι προγραμματιστές κατά την εκμάθηση του προγραμματισμού, το μικρό αριθμό εργασιών που διερευνούν, τις δυσκολίες του αντικειμενοστρεφούς προγραμματισμού, καθώς επίσης και τις προσπάθειες των ερευνητών για την ανάπτυξη εκπαιδευτικών εργαλείων που μπορούν να βοηθήσουν τους σπουδαστές, αναπτύξαμε ένα εκπαιδευτικά περιβάλλον για την διδασκαλία του αντικειμενοστρεφούς προγραμματισμού. Το περιβάλλον βασίζεται στην προσέγγιση των μικρόκοσμων προγραμματισμού και ενσωματώνει τα αποτελέσματα της έρευνας για την εκμάθησή του. Η βασική του διαφορά σε σχέση με τα υπάρχοντα περιβάλλοντα έγκειται στο γεγονός ότι συνδυάζει τις εξής μορφές της Εκπαιδευτικής Τεχνολογίας: ενσωματώνει μια σειρά μαθημάτων, έναν εκδότη δομής, τη δυνατότητα της δυναμικής προσομοίωσης εκτέλεσης των προγραμμάτων, της επεξηγηματικής οπτικοποίησης και της καταγραφής των ενεργειών των σπουδαστών. Το προγραμματιστικό περιβάλλον δοκιμάσθηκε και αξιολογήθηκε σε φοιτητές του Τμήματος Εφαρμοσμένης Πληροφορικής του Πανεπιστημίου Μακεδονίας. Από την εμπειρική μελέτη προέκυψε ότι το προγραμματιστικό περιβάλλον παρέχει ουσιαστική βοήθεια στο διδάσκοντα και το σπουδαστή κατά τη διδασκαλία και εκμάθηση του αντικειμενοστρεφούς προγραμματισμού αντίστοιχα.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Different Aspects of Delivering Programming Courses: Multinational Experiences",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801081.2801085",
            "Abstract": "In this paper, different aspects and experiences from object-oriented programming courses that are taught in three institutions from three different European countries are presented and compared. The emphasis is given on courses' syllabus, organization and methodology of teaching and ways and methods of evaluation of students' knowledge and programming skills. Aspects of technology enhanced learning and accompanying tools and services within these courses are briefly presented and summarized. In the last part of the paper the similarities and differences in delivering the programming courses in these three institutions are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A pilot study on the effectiveness and acceptance of an educational game for teaching programming concepts to primary school students",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-018-9702-x",
            "Abstract": "Educational games are increasingly used in informal and formal educational settings for promoting active learning and gaining students’ interest in cognitively demanding subjects, such as programming. However, empirical studies that investigate the true impact of educational games on teaching and learning programming, especially to small aged students, are limited. This article presents the results of a pilot study that utilized the educational game Run Marco for teaching basic programming concepts to primary school students. Students’ performance was studied through specially designed worksheets, while their acceptance of the intervention was evaluated through a questionnaire that was based on the principles of the Technology Acceptance Model (TAM). The results of the pilot study showed that the educational game supported students in comprehending basic programming concepts, while the …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Factors affecting students’ performance in distributed pair programming",
            "Publication year": 2019,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0735633117749432",
            "Abstract": "Pair Programming has been shown to increase productivity and code quality not only in professional software development but also in the context of programming education. The provision of broadband Internet access gave rise to Distributed Pair Programming (DPP) enabling two programmers to collaborate remotely. To gain insight into the benefits of DPP, we performed an empirical study on an object-oriented programming course where 62 students carried out assignments through a DPP platform. The goal of the study is to investigate, in the context of DPP, whether prior programming skills (assessed at the level of student, his or her partner and pair) and pair compatibility are related to student performance. To further examine the effect of DPP on learning outcomes, we have studied whether a pair’s performance on DPP assignments is related to the students’ grade. The findings indicate that the student’s actual …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:M3NEmzRMIkIC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "The quest for excellence in designing a multi-paradigm programming environment for novices",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJTCS.2009.026295",
            "Abstract": "In this paper we present the programming environments Karel and objectKarel that support the procedural and Object-Oriented Programming (OOP) paradigms. Karel and objectKarel share the same GUI and functionalities, and thus they constitute a multi-paradigm environment. The design of the environment was based on the extended research carried out the last decades regarding the teaching of programming to novices and is the main focus of the paper. The potential uses of the environments for teaching programming concepts and techniques to various audiences and different learning contexts, as well as experiences of using them so far, are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:UebtZRa9Y70C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Towards a serious games design framework for people with intellectual disability or autism spectrum disorder",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-020-10124-4",
            "Abstract": "Designing serious games (SGs) for people with intellectual disability (ID) and autism spectrum disorder (ASD), requires proper planning and decision making. In this article, a proposal of a serious games design framework (GDF) that aims to assist designers and special education teachers and professionals develop successful SGs for people with ID and people with ASD, is presented. In order to create this GDF, an extraction of SGs design guidelines from existing SGs for people with ID and ASD and a comparative analysis with common GDF that are used for designing SGs in general was conducted. The proposed design guidelines and the conclusions of the comparative analysis of existing general purpose GDFs were used as a tool to design a computer-based SG that aims to improve independent living skills of people with ID and people with ASD. Based on this previous work the proposed GDF that is …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "An environment for teaching object-oriented programming: ObjectKarel",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1215114/",
            "Abstract": "We propose a new integrated programming environment, objectKarel, for teaching the object-oriented programming paradigm. Its main features are: a series of e-lessons, a special kind of structure editor, runtime error detection, program animation and recordability of students' actions. Finally, we describe the results of a pilot use of objectKarel to teach object-oriented programming to undergraduate students.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Examining student performance and attitudes on distributed pair programming",
            "Publication year": 2018,
            "Publication url": "https://www.hindawi.com/journals/sp/2018/6523538/",
            "Abstract": "Pair programming (PP) has become popular in the research and software industry as well as being studied for a number of years in computer science courses with positive findings on student performance and attitudes. Advantages of PP reported in the literature are satisfaction, design quality, code productivity, team building, and communication. More recently, distributed pair programming (DPP), which enables two programmers to work remotely, has also attracted the interest of researchers and instructors. The difference between DPP and PP is that the former allows geographically distributed teams to collaborate and share program code. Such collaboration is, thus, only feasible if an underlying infrastructure supports all necessary interactions. The integrated development environments (IDEs) for DPP should cover the basic requirements for remote software development as well as address common PP problems, such as unequal contributions from each member of a pair, feedback during DPP sessions, and communication problems. This paper presents the findings of a study on student performance and attitudes towards DPP in an object-oriented programming (OOP) course. The factors examined were student performance, in terms of assignment grade, exam grade and implementation time in relation to students’ programming experience, and confidence, as well as student attitudes towards DPP, i.e., the feelgood factor, working alone or with a partner, and the perception of their partner’s technical competence. The results suggest that a students’ performance is associated with their programming experience and confidence in programming …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Evaluating the effects of scripted distributed pair programming on student performance and participation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7089313/",
            "Abstract": "The results presented in this paper contribute to research on two different areas of teaching methods: distributed pair programming (DPP) and computer-supported collaborative learning (CSCL). An evaluation study of a DPP system that supports collaboration scripts was conducted over one semester of a computer science course. Seventy-four students participated in the study and used the DPP model to solve programming assignments in pairs, rather than individually. Students were divided into two cohorts in order to examine how best to distribute programming tasks to students, to maximize learning outcomes. The results suggest that while the use of DPP improves pass rates and gets positive feedback from students, the use of collaboration scripts yields equal task contributions from each of the student pair. For a small number of students, overall performance was improved by the adaptive assignment of …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Microworlds, games, animations, mobile apps, puzzle editors and more: What is important for an introductory programming environment?",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10639-015-9433-1.pdf",
            "Abstract": "Teaching and learning programming constitutes a challenge. Although several teaching approaches and programming tools have been proposed, it seems that they have limited impact on classroom practice. This article investigates students’ perceptions on five educational programming environments that are widely used and the features that any introductory programming environment should have. The environments investigated are: BlueJ; objectKarel; Scratch; Alice; and MIT App inventor. These environments were studied and used by experienced undergraduate students of Informatics in the context of a fourth year course. The main features of the environments and the way of presenting them to students, as well as the assignments in the context of the course are presented, in order to help the reader realize what experience was gained by the students that evaluated the environments. Based on a …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Studying the effects of teaching programming to lower secondary school students with a serious game: a case study with Python and CodeCombat",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-021-10596-y",
            "Abstract": "Serious games, or else educational games, for programming are considered to have a positive impact on learning programming. Specifically, serious games are considered to motivate students and engage them in playing and learning programming. However, more research is required in order to study their effects in learning programming, as well as their added value in comparison with typical teaching approaches. In this study the effects of teaching programming to lower secondary school students with the serious game CodeCombat and the typical teaching approach are compared. Specifically, fifty-nine students formed an experimental group that was taught programming with CodeCombat and a control group that was taught programming through lecturing and problem solving in Python with a typical programming environment. The study aimed to investigate whether a game like CodeCombat that is based on …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An overview of location-based game authoring tools for education",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_21",
            "Abstract": "Nowadays, computer literacy is common at a very early age. As mobile devices and new social communication trends are increasingly integrating in the modern digital lifestyle new opportunities arise for harnessing this potential for innovative serious purposes. Location-based games that layer educational activities with game play can help players gain a new perspective through active engagement. In this paper, a range of key issues for implementing location based games for educational purposes using the two most commonly used open source authoring tools ARIS and TaleBlazer are presented. Although the reviewed authoring tools vary in functionality, they share a fairly common conceptual model and in both cases the software architecture is comprised of the same components. Both platforms provide the required game mechanics to create sophisticated gameplay interactions and game logic …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Guidelines for Designing and Teaching an Effective Object 丁 Oriented Design and Programming Course",
            "Publication year": 2009,
            "Publication url": "https://openresearchlibrary.org/ext/api/media/fe7ed736-9646-47e5-ab4e-4a366606d129/assets/external_content.pdf",
            "Abstract": "Teaching Object Oriented Programming (OOP) to novices is without doubt one of the most challenging topics in Computer Science Education. Extended research has been carried out, which focuses on: ƒ proposing and/or evaluating teaching approaches (Bennedsen & Caspersen, 2004; Brusilovsky et al., 1997; Chang et al., 2001; Nevison & Wells, 2003; Proulx et al., 2002), such as objects firstµ, model firstµ, and using coding patterns, ƒ devising educational programming environments and tools (Allen et al., 2002; Buck & Stucki, 2000; Cooper et al., 2000; K| lling et al., 2003; Sanders & Dorn, 2003; Xinogalos et al., 2006a), and ƒ studying students· understanding and misconceptions of object oriented programming (Carter. & Fowler, 1998; Fleury, 2000; Fleury, 2001; Holland et al., 1997; Ragonis & Ben Ari, 2005a; Truong & Bancroft, 2004; Xinogalos et al., 2006b). In most cases this research has been carried out with the form of a pilot/empirical study or an experiment in the context of an OOP course. There is little evidence of evaluating an OOP course as a whole: teaching approach (es) used; sequence of concepts presented and organization of lessons; programming environment (s) and educational tools used; students· difficulties and misconceptions recorded and didactical situations/activities for dealing with them. Consequently, the problem for those struggling to design an effective OOP course for their students remains.In this chapter we present the long term evaluation and refinement of an OO Design and Programming course, which was initially exclusively based on the well known environment of BlueJ, the book Objects First with Java: A …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studying students' attitudes on using examples of game source code for learning programming",
            "Publication year": 2014,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=171589",
            "Abstract": "Games for learning are currently used in several disciplines for motivating students and enhancing their learning experience. This new approach of technology-enhanced learning has attracted researchers’ and instructors’ attention in the area of programming that is one of the most cognitively demanding fields in Computer Science. Several educational, or else serious, games for learning programming have been developed and the first results of their evaluation as a means of learning are quite positive. In this paper, we propose using arcade games as a means for learning programming. Based on this approach students first play a simple game, such as Snake or Tetris, study its code and then extend it. In a pilot study carried out in the context of an undergraduate programming course, students studied the source code of the well-known game Snake and extended it with new functionalities. The analysis of students …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Vilnius University Institute of Data Science and Digital Technologies"
        },
        {
            "Title": "THE CHALLENGES OF TEACHING WEB PROGRAMMING",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/39609/39609.pdf",
            "Abstract": "The main concern of this paper is the exploration of current challenges, teaching techniques, course design methods and topics covered when attempting to teach a web programming course in technology-oriented higher education departments. The authors attempted a literature review of the subject in order to identify, compare and analyse the existing experience upon which one can establish solid guidelines towards a manageable, efficient and comprehensible course model. In the paper, the presentation of the value of teaching web programming is followed by an extensive listing of the underlying challenges. Consequently, the various teaching approaches are presented comparatively and comments are made as regards the topics covered and the tools used. The study and analysis of this gathered experience naturally leads to certain outcomes. An extensive list of questions is summed in a list view and this list aims to help educators of the field to prepare the respective structure, content, methodology and tools of a web programming course that will serve their needs in a productive way. The authors’ intention is to build upon this knowledge towards a web-based comprehensible web programming environment that will aid the process of teaching this challenging subject.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using hands-on activities for motivating students with OOP concepts before they are asked to implement them",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/50769993/Using_Hands-on_Activities_for_Motivating20161207-14681-xib46v.pdf",
            "Abstract": "Teaching Object Oriented Programming (OOP) to novices is problematic. One of the most important instructional problems that are related to OOP is the fact that the object-oriented technique for the development of programs is difficult for students, since it is more abstract than the technique for structured programming and more exacting in the processes of analysis and design. Furthermore, students are not–usually-motivated through the use of concepts before they are asked to consider their implementation. What is needed, in order to alleviate the problem, is to design hands-on activities for motivating students with OOP concepts before they are asked to use these concepts for implementing programs. In this paper we make some suggestions for designing hands-on activities. These suggestions are based on our experience from using the hands-on activities of the didactic microworld objectKarel [1].",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:_kc_bZDykSQC",
            "Publisher": "ACM"
        },
        {
            "Title": "Teaching OOP with BlueJ: A case study",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1652599/",
            "Abstract": "In this paper we present our findings on teaching OOP with BlueJ in the context of a one-semester programming course. We organize our findings, i.e., the difficulties, the errors, and the misconceptions that students encounter, in two categories: (a) difficulties attributed to the special characteristics of OOP, and, (b) difficulties that may be attributed to the features of the programming environment",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Current trends in on-line games for teaching programming concepts to primary school students",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_5",
            "Abstract": "In this paper current trends in online educational games for teaching programming concepts, or else computational thinking, to primary school students are analyzed. Specifically, several online games such as CodeMonkey, Getcoding, Kodable, Lightbot, Program Your Robot, Rapid Router and Run Marco are briefly presented. This is followed by a comparative analysis of important features both regarding the game mechanics and their educational aspects. Specifically, the following features are analyzed: the genre and the scenario of the game, game mechanics used for entertainment purposes, programming concepts/constructs supported, the support provided by the editor for implementing programs, testing and debugging facilities. Moreover, enhanced features, such as the support for creating on-line classrooms, monitoring students’ progress and capabilities of creating new levels in the game are …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards the constructive incorporation of serious games within object oriented programming",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=L5B9MJjHXQYC&oi=fnd&pg=PA301&dq=info:BFK7DiH26N0J:scholar.google.com&ots=mJxiciu7lD&sig=hhiHqIPm4E_jl_6X-Oh3yZ5hHIc",
            "Abstract": "Object oriented programming (OOP) is a complex domain in the education field and requires proper technological underpinning for the facilitation of the process. However, the vast variety of available programming environments makes the selection of the most efficient technology that will cover students’ needs and will lead to the teachers’ desired learning outcomes a significant challenge. These technologies, such as Educational Programming Environments and Programming Microworlds, are often applied on OOP courses in order to underpin the process and help students develop internal incentives, thus foster the feeling of challenge, curiosity, active control and imagination. However, students of the 21st century are growing up in a fully digital world and therefore learn and react accordingly. Alongside the growth of the Internet, high speed access and virtual communities have contributed to a new trend development called online gaming. Therefore, computer games can be considered an appropriate means to deliver knowledge to students of most courses and increase their motivation to learn. A term that is often used when referring to computer games incorporated in the learning experience is “serious games”, and they can involve one or multiple players. Serious games have a higher learning value when they are used in courses that consider critical thinking, group work and decision making as essential to be developed. Therefore, it is the paper’s initial intent to examine representative examples of commonly used technologies in OOP education and to derive their most prominent features that support students’ successful learning …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PY-RATE ADVENTURES: A 2D Platform Serious Game for Learning the Basic Concepts of Programming With Python",
            "Publication year": 2019,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1046878119872797",
            "Abstract": "Background. Learning programming is a cognitively demanding field of study accompanied with various difficulties. Although there is a high demand in the market for programmers, software analysts and engineers, a high dropout rate is recorded in relevant fields of study. Serious games are a promising means of engaging students in learning programming by giving them more incentives and making the process of learning programming concepts and languages more entertaining.Aim. This article introduces a new serious game called PY-RATE ADVENTURES, which aims to assist young students in their introduction to the basic programming concepts using Python. The game does not have any prerequisites and is suitable for players with no previous knowledge of programming. This article aims to present important information regarding the analysis, design and pilot evaluation of PY-RATE ADVENTURES …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:HoB7MX3m0LUC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Recent advances delivered by HTML 5 in mobile cloud computing applications: a survey",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371316.2371355",
            "Abstract": "With the explosive growth of the mobile applications and emerging of Cloud Computing (CC) concept, Mobile Cloud Computing (MCC) has been introduced to be a potential technology for mobile services. MCC refers to an infrastructure where both the data storage and the data processing happen outside of the mobile device. One of the technologies that will advance MCC is the latest version of the Web's markup language, HTML 5. In this paper, we present a survey of new HTML 5 features with a focus on the enhancement of the current MCC limitations. Specifically, we present the most important features of HTML 5 organized in different categories and their contribution in the deployment of MCC applications. Finally, the results of the research carried out on evaluating HTML 5 in terms of a wide range of applications and specifications are reviewed.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Objects-First Approach to Teaching Object Orientation based on objectKarel",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/44125002/An_Objects-First_Approach_to_Teaching_Ob20160326-21011-12u8x3i.pdf",
            "Abstract": "In the last decade the departments of Information Technology have adopted the Object Oriented Programming (OOP) paradigm for introductory programming courses. In this paper we present the problems encountered when OOP is taught to novices and how the microworld objectKarel that we developed helps in dealing with these problems. The main part of the paper has been devoted to providing a description of a proposal for teaching the fundamental notions of OOP with the help of objectKarel and some preliminary results from its evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Αρχές σχεδίασης ολοκληρωμένων περιβαλλόντων προγραμματισμού για αρχάριους",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=6734565797436121421&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design guidelines for serious games targeted to people with autism",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-13-8260-4_43",
            "Abstract": " Serious games (SG) have been successfully included in special education to enhance existing teaching methods. In particular, researchers have developed serious games to enhance the acquisition and improvement of social, emotional, practical, and cognitive skills for young children, students, and adults with autism spectrum disorder (ASD). In order to develop successful serious games, it is important to thoroughly plan the design process. Therefore, design decisions and principles need to be determined to fit the requirements of the game solution. In this paper, design guidelines and principles are extracted from existing serious games for people with ASD. These design guidelines and principles are also analyzed in the context of common SG design frameworks. The outcome of the analysis can be used both for informing existing SG design frameworks and as a foundation of a new design framework …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "A Proposal for an Educational Game Platform for Teaching Programming to Primary School Students",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-73988-1_38",
            "Abstract": "Programming is considered by many a core skill of the 21st century. Learning the fundamentals of coding or programming encourages children to acquire new skills, such as problem solving, logical thinking, critical thinking, and Computational Thinking (CT), and moreover to be active creators of tomorrow. There are various platforms for learning coding and programming, and in particular game-based ones, which, through the gamification process, focus on increasing learners’ motivation and engagement. Most existing games are nowadays distributed through web platforms or mobile applications. Most suffer from major drawbacks, which make them difficult to use in a classroom environment, and there lack of an administrative platform does not allow the educator to assign tasks to students when at home. This paper proposes the design of an educational platform for teaching programming to primary school …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Blending an Android development course with software engineering concepts",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-015-9423-3",
            "Abstract": "The tremendous popularity of mobile computing and Android in particular has attracted millions of developers who see opportunities for building their own start-ups. As a consequence Computer Science students express an increasing interest into the related technology of Java development for Android applications. Android projects are complex by nature and relatively large software products while their development calls for the application of established software engineering practices and tools. However, most software engineering courses focus on ‘conventional’ software development for desktop or web applications. In this paper we report on the design, implementation and assessment of a novel short course aiming at bridging the gap between software engineering and Android development. The goal is to demonstrate the need for applying software engineering principles on Android development as …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:mB3voiENLucC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Towards a new massive multiplayer online role playing game for introductory programming",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2490257.2490284",
            "Abstract": "Successful computer programming education is facing significant problems even nowadays for both students and teachers. To this end, the specificities of those difficulties and the corresponding causes continue to be an ongoing topic of research. According to relevant case studies, these relate to the complex concepts of computer programming as well as the lack of motivation by students to achieve the given goals. On the other hand, the emerging field of Games Based Learning is gradually delivering games that are applied in a series of educational contexts. In this paper, we aim to initially investigate the educational games developed for and used in the computer programming domain and review to which level they address the aforementioned difficulties. Related work includes a number of games that have been developed towards this goal. However, even though they seem promising examples, they lack …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A review of educational games for teaching programming to primary school students",
            "Publication year": 2020,
            "Publication url": "https://www.igi-global.com/chapter/a-review-of-educational-games-for-teaching-programming-to-primary-school-students/257111",
            "Abstract": "In recent years, several educational games for learning programming have been developed with promising results. The main purpose of this chapter is to present 22 educational games or platforms that aim to cultivate computational thinking through teaching computer programming concepts to primary school students. A short description of each game followed by a comparative analysis of both their game mechanics and their educational aspects is presented. Additionally, less typical functionalities such as online classrooms, the support for learning analytics, and the creation of new levels are analyzed. This chapter could be useful for game designers and IT teachers who would like to use a game-based approach in the teaching process.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:a0OBvERweLwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Studying Students’ Conceptual Grasp of OOP Concepts in Two Interactive Programming Environments",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87783-7_73",
            "Abstract": "Teaching Object Oriented Programming (OOP) to novices is widely known to be quite problematic. Students might be able to write a piece of code in an OOP language, usually Java, but their conceptual grasp of object-oriented concepts seems to be limited. This leads to poor implementation of object-oriented concepts and inability to take advantage of the strengths of OOP. Various teaching approaches and specially designed programming environments have been proposed for supporting the teaching and learning of OOP. In this paper, we present our findings regarding students’ conceptual grasp of OOP concepts in two distinct educational programming environments: BlueJ and objectKarel. Their special feature in comparison with similar environments is that they are highly interactive.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Designing effective serious games for people with intellectual disabilities",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8363467/",
            "Abstract": "Educating people with intellectual disabilities (ID) is a challenging process. Educators and researchers promote new methods in order to enhance the learning process and succeed in improving specific skills that people with intellectual disabilities have limitations. Serious games (SG) used in special education are considered as a successful tool for benefiting learning. In order to develop effective serious games, however, it is important to plan the design process properly. Therefore, design guidelines and principles should be thoroughly examined and accordingly selected. This paper aims to: (a) study existing serious games design frameworks; (b) extract design guidelines and principles from existing serious games for people with intellectual disabilities; (c) analyze the guidelines and principles, based on the elements of the design frameworks, which will then be used as the basis for a design framework …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "objectKarel: a didactic microworld for teaching object-oriented programming",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/961511.961590",
            "Abstract": "In recent years, extensive research has been conducted on the difficulties encountered by novices when being taught programming. These studies have shown that an important factor of these difficulties is the teaching methodology used, which is based on: a) a general purpose programming language that is too big and too idiosyncratic, b) a professional programming environment for the chosen programming language that does not support students neither in understanding the semantics of the control structures and the flow of control nor in the process of debugging their programs, and c) a set of problems from the area of number and symbol processing that are far from the students' everyday experiences and are not attractive to them. This ascertainment has lead many to develop new programming environments as well as alternative approaches to teaching programming. The most important approaches are …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating the Perceived Player Experience and Short-term Learning of the Text-based Java Programming Serious Game “Rise of the Java Emperor”",
            "Publication year": 2021,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=936710",
            "Abstract": "There has been an active movement towards fun learning, using games in education. This article introduces the text-based serious game “Rise of the Java Emperor” that aims to support students in learning basic object-oriented programming concepts using Java. Information concerning the analysis, the design and the pilot evaluation of the game is presented. Thirty-three undergraduate and postgraduate students of an Applied Informatics Department voluntarily played and answered a questionnaire based on the MEEGA+ model, in order to investigate the perceived player experience and short-term learning as well as the acceptance of a text-based programming game by students. The results of the evaluation show that text based games can be both fun and instructional for the field of computer programming. An important issue that requires further research is how this or other programming games can be …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:abG-DnoFyZgC",
            "Publisher": "Vilnius University Institute of Data Science and Digital Technologies"
        },
        {
            "Title": "The hands-on activities of the programming microworld objectKarel",
            "Publication year": 2005,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed pair programming using collaboration scripts: An educational system and initial results",
            "Publication year": 2015,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=342805",
            "Abstract": "Since pair programming appeared in the literature as an effective method of teaching computer programming, many systems were developed to cover the application of pair programming over distance. Today's systems serve personal, professional and educational purposes allowing distributed teams to work together on the same programming project. The current research focuses in distributed pair programming systems which are suitable for supporting students in learning computer programming. Systematic review of publicly available systems revealed that there is an absence of effective collaboration support for the students. The main drawbacks of pair programming, such as uneven workload distribution and infrequent role switches, cannot be addressed with available systems. While building an enhanced version of a distributed pair programming system, successful instructional strategies in similar …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Vilnius University Institute of Data Science and Digital Technologies"
        },
        {
            "Title": "Designing Educational Games for Computer Programming: A Holistic Framework.",
            "Publication year": 2014,
            "Publication url": "https://eric.ed.gov/?id=EJ1035677",
            "Abstract": "Computer science is continuously evolving during the past decades. This has also brought forth new knowledge that should be incorporated and new learning strategies must be adopted for the successful teaching of all sub-domains. For example, computer programming is a vital knowledge area within computer science with constantly changing curriculum and its teaching remains a difficult endeavour. On the other hand, students start from a very early age to interact with computers through games and other entertaining multimedia software. Therefore, they seem to be keen on environments with impressive special effects and graphical interfaces where they interact with the environment’s elements. In response, teachers are trying to connect computer programming learning with computer operations that students are familiar with, which does not include textual editors for programming lines of code with no other interaction. Educational games used in computer programming courses are considered to benefit learning, because they motivate students towards actively participating and interacting with the game’s activities. Thus, we have developed an educational multiplayer game that aims to further enhance computer programming education by addressing occurring problems. This process, however, requires proper planning during the design of educational games, and thus the availability of adequate guidelines that include all characteristics that should be incorporated in such games. This paper aims to introduce and elaborate on a holistic framework that has been constructed as a guide towards the development of this game. To this end, we …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Academic Conferences Limited. Curtis Farm, Kidmore End, Nr Reading, RG4 9AY, UK"
        },
        {
            "Title": "Evaluating objectKarel-an educational programming environment for object oriented programming",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.103.4715&rep=rep1&type=pdf",
            "Abstract": "A common experience of those who teach introductory programming courses is that learning to program is difficult. So, special programming languages and educational environments have been devised with the aim of making the learning process easier. Unfortunately, in many cases the true value of these methods was not evaluated. Based on previous research findings and our experience in teaching object-oriented programming (OOP), we developed an environment called objectKarel. objectKarel is being used for three years in our University and this paper presents a systematic analysis of its didactic effectiveness based on evaluations from students themselves. Besides the evaluation of the effectiveness of the environment, this research allowed us to state some more general proposals regarding the design of programming languages and educational environments for an introduction to programming.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Technology enhanced learning in programming courses–international perspective",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-016-9565-y",
            "Abstract": "Technology enhanced learning (TEL) is increasingly influencing university education, mainly in overcoming disadvantages of direct instruction teaching approaches, and encouraging creativity, problem solving and critical thinking in student-centered, interactive learning environments. In this paper, experiences from object-oriented programming (OOP) courses that are taught in three institutions from three different European countries are presented and compared. The courses are based on Java and are delivered in the second year of studies, after students have attended an introductory programming course. The emphasis is given on TEL approaches and accompanying tools and services, focusing mainly on Learning Management Systems (LMS). Our students completed an appropriate questionnaire to evaluate the importance and utilization of TEL services that are used or planned to be used at the …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Students’ perspective on the first programming language: C-like or Pascal-like languages?",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-017-9601-6",
            "Abstract": "The choice of the first programming language (FPL) has been a controversial issue for several decades. Nearly everyone agrees that the FPL is important and affects students’ subsequent education on programming. The study presented in this article investigates the suitability of various C-like and Pascal-like programming languages as a FPL. Students from three Universities express their perceptions on the FPL through a specially designed questionnaire. The students had been introduced to programming using different FPLs and having experience on more than one language and formulated two distinct groups: a group introduced to programming with a C-like and another with a Pascal-like language. The statistical analysis of the data collected showed that the choice of the FPL does not have a deep impact on difficulties that novices may experience when learning the basics of programming. However …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Optimization of server performance in the CMX educational MMORPG for Computer Programming",
            "Publication year": 2014,
            "Publication url": "http://www.doiserbia.nb.rs/Article.aspx?id=1820-02141400078M",
            "Abstract": "A new generation of computer games has taken over during the last few years,    called Massive Multiplayer Online Role Playing Games (MMORPG). In parallel,    the usage of games in education has increased, exploiting the fact that young    people are familiarized with them and would be more motivated to learn while    entertained. However, MMORPG require significant amounts of resources, such    as bandwidth, RAM and CPU capacity to support learning. In this paper, we    propose a new methodology to achieve monitoring and optimization of the load    balancing, so that the essential resources for the proper execution of an    educational MMORPG for computer programming can be foreseen and bestowed    without overloading the system. Moreover, we present an educational MMORPG    called CMX, which aims to teach computer programming through interactive    activities and role-playing. We finally apply the proposed model to CMX by    conducting an experiment and conclude that the server’s performance is indeed    increased.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Usage of technology enhanced educational tools for delivering programming courses",
            "Publication year": 2011,
            "Publication url": "https://www.learntechlib.org/p/45116/",
            "Abstract": "Methods and approaches behind technology enhanced learning (TEL) in programming courses at a university level encourage continuous research in the last 20 years. Still there is no generally applicable way that would guarantee success. In this paper some experiences gathered during years of a technology-enhanced approach in teaching Object-Oriented Programming (OOP) at two universities in two countries are presented and compared. Emphasis is given on the technology-enhanced educational tools that were selected or developed by the two institutions for teaching OOP. Different traditions and independent development at both institutions allow us to draw generally applicable conclusions and recommendations.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:hqOjcs7Dif8C",
            "Publisher": "International Journal of Emerging Technology in Learning"
        },
        {
            "Title": "An evaluation of knowledge transfer from microworld programming to conventional programming",
            "Publication year": 2012,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.2190/EC.47.3.b",
            "Abstract": "Programming microworlds are being used for introducing students to programming for many years. Although many professors and school teachers report positive results from using programming microwords, these results are usually based on anecdotal evidence rather than rigorous empirical evaluation. A question that has not been answered yet with certainty is whether the knowledge acquired in the context of a programming microworld is transferred to a conventional programming language. In an attempt to investigate this issue we used a specially designed middle-term exam and a questionnaire at the end of an undergraduate Object-Oriented Programming (OOP) course. The course uses the programming microworld objectKarel for a short introduction to the most fundamental OOP concepts, and then the environment BlueJ and Java for presenting the real thing. The analysis of students' replies in the …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "CMX: The effects of an educational MMORPG on learning and teaching computer programming",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7458859/",
            "Abstract": "Computer programming has for decades posed several difficulties for students of all educational levels. A number of teaching approaches have been proposed over the years but none seems to fulfil the needs of students nowadays. Students use computers mainly for playing games and the Internet and as quite a few researchers state this aspect of computers should be taken into account in the way we educate them. Towards this direction, this paper aims to examine the effects of using an educational Massive Multiplayer Online Role Playing Game (MMORPG) on teaching and learning computer programming. The educational features of an MMORPG called CMX are presented along with a design framework that was devised taking into account previous work in designing educational games. The effects of CMX on teaching and learning computer programming are assessed through a study with first-year …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Long-term evaluation and reformation of an object oriented design and programming course",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5194164/",
            "Abstract": "In this paper we present important results from a long-term evaluation of an ldquoobject-oriented design and programmingrdquo course. In its last form the course is based on the combined use of the microworld objectKarel and the environment BlueJ, while some important modifications on the original teaching approach based on BlueJ have been made.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Empirical Study on Pair Performance and Perception in Distributed Pair Programming",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11935-5_72",
            "Abstract": "This paper reports students’ perceptions and experiences attending an object-oriented programming course in which they developed software using the Distributed Pair Programming (DPP) technique. Pair programming (PP) is typically performed on one computer, involving two programmers working collaboratively on the same code or algorithm. DPP on the other hand is performed remotely allowing programmers to collaborate from separate locations. PP started in the software industry as a powerful way to train programmers and to improve software quality. Research has shown that PP (and DPP) is also a successful approach to teach programming in academic programming courses. The main focus of PP and DPP research was PP’s effectiveness with respect to student performance and code quality, the investigation of best team formation strategies and studies of students’ attitudes. There are still …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Teaching Java with BlueJ: a Two-Year Experience",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Maya-Satratzemi/publication/220807189_Teaching_java_with_BlueJ_a_two-year_experience/links/00463516eb79c28503000000/Teaching-java-with-BlueJ-a-two-year-experience.pdf",
            "Abstract": "In this paper we present our two-year experience on teaching Java with BlueJ on the context of a compulsory course at a Department of Technology Management. The course was taught for the first time in 2005-06 and was heavily based on the features of the programming environment BlueJ and on books/papers related to BlueJ [1]. In the context of the course 11 two-hour lectures and 11 two-hour labs were given.The 2nd time of teaching the course in 2006-07 some changes were made in order to face difficulties that were attributed to the underlying teaching approach and might not be characterized as intrinsic to OOP. The most important changes were:(i) the features of BlueJ were used more carefully, while the main method was taught much earlier in the course (4th lesson), so as to avoid specific difficulties related to object instantiation and the dynamic aspects of OOP;(ii) students started by making small changes to existing code, but soon enough they started creating small projects from scratch in order to apply the principles of good class design and Java presented to them and develop problem solving skills;(iii) two lessons were devoted to ArrayLists and arrays.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:70eg2SAEIzsC",
            "Publisher": "ACM ASSOCIATION FOR COMPUTING MACHINERY"
        },
        {
            "Title": "The challenges of teaching web programming-Literature Review and Proposed Guidelines",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/papers/2012/39609/",
            "Abstract": "The main concern of this paper is the exploration of current challenges, teaching techniques, course design methods and topics covered when attempting to teach a web programming course in technology-oriented higher education departments. The authors attempted a literature review of the subject in order to identify, compare and analyse the existing experience upon which one can establish solid guidelines towards a manageable, efficient and comprehensible course model. In the paper, the presentation of the value of teaching web programming is followed by an extensive listing of the underlying challenges. Consequently, the various teaching approaches are presented comparatively and comments are made as regards the topics covered and the tools used. The study and analysis of this gathered experience naturally leads to certain outcomes. An extensive list of questions is summed in a list view and this …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:D03iK_w7-QYC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "Designing Serious Games for People with Special Needs: Implications from a Survey",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-34350-7_7",
            "Abstract": "Serious Games (SGs) are games that have a serious purpose besides the entertainment of the player. SGs are used in various sectors with quite promising results. One field that SGs are used is education, since SGs are considered to offer promising technology enhanced learning opportunities. This paper focuses on SGs that aim to deal with the limitations that people with Intellectual Disabilities (ID) and Autism Spectrum Disorder (ASD) have in acquiring conceptual, social, practical and cognitive skills. In particular, we present the results of a questionnaire designed to investigate the perceptions of special education professionals and teachers regarding the use of SGs in the education of people with ID and ASD. Specifically, we investigate the usefulness and the effectiveness of SGs as teaching/learning tools, the ease of use by people with ID and ASD, and the ideal age group for SGs targeted to various …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Designing a Serious Game for Independent Living Skills in Special Education",
            "Publication year": 2019,
            "Publication url": "https://search.proquest.com/openview/33c5f0742fa6af7367c56a70d2a18c94/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "The transition from school life to independent living is an important and demanding step for every person. People with Intellectual Disability (ID) and people with Autism Spectrum Disorder (ASD) face more difficulties in this transition due to their limitations in daily living skills. Serious Games (SGs) are considered as a promising tool that can support the acquisition of such skills. The aim of this paper is to present the design of a new set of mini games that aim to support people with ID and ASD in acquiring skills for independent living, such as self-care, transportation and safety. Participatory design is considered important for designing serious games for the specific target group and in this sense it is our aim to incorporate anyone interested in the design process of the new game. The skills that we will try to incorporate in the game are examined in the context of the existing literature, a survey with special education …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:rO6llkc54NcC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Αρχές σχεδίασης ολοκληρωμένων περιβαλλόντων προγραμματισμού για αρχάριους",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=6734565797436121421&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Opportunities and challenges of mobile location-based games in education: Exploring the integration of authoring and analytics tools",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8363452/",
            "Abstract": "Mobile technology is becoming an integral part of student's life. The new mobile landscape shifts the educational ground demanding for innovative ways to create games for educational purposes. Location-based games provide new opportunities for effective learning in authentic environments. On the other hand, this game genre poses new challenges to educational practitioners that are closely related to technological advances and established pedagogical practices. The aim of this study is to investigate on the limitations and challenges of authoring tools regarding the support of new trends and standards. In the first place, we explore educational scenarios implemented in the form of location-based games and a general conceptual model that comprises common game elements is formulated. Secondly, two typical authoring tools that actively support location-based experiences and games are presented with a …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A comparative analysis of tools for developing location based games",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1875952120301117",
            "Abstract": "The extended usage of mobile digital devices has nowadays become commonplace. Location-based games make the most of the mobile technologies by being played solely on mobile devices. The ever-growing interest for this type of applications goes beyond the mere goal of player entertainment, even reaching to the advocacy of civilization, research and education. In this article, three of the most famous and modern authoring tools for location-based games, Taleblazer, ARIS and Unity with Mapbox, are studied in-depth. The objective is to produce a comparative analysis of the aforementioned tools. Game developers may refer to this analysis to opt for the appropriate tool based on their needs, goals and technical expertise. In order to better understand the tool functionality and thus construct a reliable comparison framework, three game prototypes have been implemented. The results have shown that all …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:_xSYboBqXhAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Microworlds, games and collaboration: Three effective approaches to support novices in learning programming",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801081.2801094",
            "Abstract": "Specially designed programming environments have been used for decades to support the novice programmers learning programming. In this paper, we present various forms of Educational Technology that have guided the design of educational programming environments the last two decades. The design and aspirations of three distinct programming environments developed at the University of Macedonia are presented. These include a Programming Microworld, an Educational Game and a Distributed Pair Programming system. The potential benefits of the different features of the three environments are presented along with results from their evaluation. Conclusions are drawn regarding the technologies incorporated in these different programming environments. Specifically, emphasis is given on technologies and features that seem to be important for motivating and engaging students in learning programming …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An integrated programming environment for teaching the object-oriented programming paradigm",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36087-5_64",
            "Abstract": "In this paper we propose a new integrated programming environment for teaching the object-oriented programming paradigm. The environment is based on the microworld approach to teaching programming and the programming language of Karel++. Its main features are: a series of e-lessons, a special kind of structure editor, run-time error detection, program animation and recordability of students’ actions. In this paper we present the programming environment, the results and our own experiences in using the integrated programming environment to teach object-oriented programming to undergraduate students.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bill Davey",
            "Publication year": 2020,
            "Publication url": "https://search.proquest.com/openview/c419ce3060fa3703c1cd9f6385095997/1?pq-origsite=gscholar&cbl=55384",
            "Abstract": "Acknowledgement to reviewers Acknowledgement to reviewers Full Text Acknowledgement \nto reviewers Published online: 19 February 2020 # Springer Science+Business Media, LLC, \npart of Springer Nature 2020 Education and Information Technologies relies heavily on the \ngenerous contributions of all reviewers who assist in reviewing manuscripts submitted to the \njournal. For the reviews received in the calendar year 2019, we would like to gratefully \nacknowledge the reviewers listed below who willingly shared their expertise and time. \nEducation and Information Technologies (2020) 25:1459–1461 https://doi.org/10.1007/s10639-020-10131-5 \nBill Davey Yaacov Katz Mohamed Amasha Paul Juinn Bing Tan Yaw Owusu-Agyeman Arthur \nTatnall Abbas Pourhosein Gilakjani Milorad Cerovac Michail Kalogiannakis Therese Keane \nMadhury Khatun Ahmad Zam Samsudin Gaurav Kumar Maria Liashenko Shah Miah B N…",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolution of method invocation and object instantiation patterns in a PHP ecosystem",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003777",
            "Abstract": "PHP is one of the most frequently used scripting languages for server-side programming, since approximately 75% of successful web applications have been developed with PHP. The main benefits of PHP are its low learning curve and the rich variety of dynamic features that it offers. These benefits have contributed towards the development of a large community of programmers around PHP, which in turn created a vast ecosystem of applications and frameworks. In this study we have empirically investigated ten famous PHP frameworks/applications and over 240 MLOC in order to explore their internal structure. More specifically, we present some demographics on method invocation and object instantiation patterns, empowered by the dynamic nature of the PHP language. To present the results we employ statistical methods inspired by ecology. In particular, we explore the diversity and dominance of these patterns …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "BlocklyScript: Design and Pilot Evaluation of an RPG Platform Game for Cultivating Computational Thinking Skills to Young Students",
            "Publication year": 2020,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=914759",
            "Abstract": "At 21st century Computational Thinking (CT) is considered a fundamental skill that anyone should possess and develop from a young age. Serious games and more specifically educational games (EGs) are a promising means of introducing algorithmic thinking and programming concepts and engaging students through the process of learning. In this article, a new EG called BlocklyScript is presented. BlocklyScript aims to help students develop their CT by learning basic programming concepts, designing algorithms and correcting mistakes. During the designing phase different EGs were taken under consideration and an EG design framework was followed in order to provide a better user experience. The game was evaluated by 10 experienced computer science educators of primary and secondary schools. The positive results of this pilot evaluation show that BlocklyScript is expected to help students understand …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:f2IySw72cVMC",
            "Publisher": "Vilnius University Institute of Data Science and Digital Technologies"
        },
        {
            "Title": "Exploring the effects of collaboration scripts embedded in a distributed pair programming system",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2462476.2462500",
            "Abstract": "Collaboration scripts provide an integrated framework aimed to foster fruitful collaboration in collaborative learning settings. Since pair programming is also a form of collaborative learning, we explored whether collaboration scripts can improve collaboration in distributed pair programming. For this purpose, we incorporated collaboration scripts in an existing distributed pair programming system. We conducted a pilot study to evaluate the new system by a group of students. Our goal was to examine students' perceptions of computer mediated scripted collaboration and furthermore to evaluate the effectiveness of adaptive role switching in students' participation. The study showed that students' attitude toward distributed pair programming and scripted collaboration was quite positive, however they prefer to distribute tasks by themselves which led half of them not to follow system's suggestions for role distribution.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Analysis of Students' Difficulties with ArrayList Object Collections and Proposals for Supporting the Learning Process",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561660/",
            "Abstract": "The use of collections for grouping objects is very common in object oriented applications, and even small-scale programs developed by undergraduate students. One of the most popular collections is the ArrayList that according to many researchers should be emphasized over the fundamental data structure of Arrays. However, learning to use an ArrayList collection correctly is not easy. In this paper we present an analysis of undergraduate students' difficulties with ArrayLists and some proposals for supporting the learning process.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convergence of Internet of things and mobile cloud computing",
            "Publication year": 2014,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/21642583.2014.913213",
            "Abstract": "As an integral element of future Internet, Internet of things (IoT) could be described as a real-world interaction with everything connected via intelligent network infrastructure and advanced communication technologies. Mobile cloud computing (MCC), on the other hand, offers an infrastructure wherein both data storage and data processing take place outside of the mobile device. As a more mature infrastructure, MCC offers several advantages, while the relatively new IoT has several limitations. In this paper, we present a survey of IoT limitations and MCC advantages. Specifically, we present the most advantageous aspects of MCC and how they alleviate the limitations of IoT. Furthermore, we discuss several IoT-enabled business services to highlight the benefits of converging IoT and MCC.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Object-Oriented Programming–What Do Students Think of Objects and Classes",
            "Publication year": 2011,
            "Publication url": "http://ftp.actapress.com/PDFViewer.aspx?paperId=452331",
            "Abstract": "OBJECT-ORIENTED PROGRAMMING – WHAT DO STUDENTS THINK OF OBJECTS AND \nCLASSES? Stelios Xinogalos Department of Technology Management, University of \nMacedonia Loggou-Tourpali, 59200 Naoussa, Greece stelios@uom.gr ABSTRACT In this \npaper we present the results of a study exploring students’ conceptions of the most \nfundamental Object- Oriented Programming (OOP) concepts of “object” and “class”. Data \nwas collected from open type questions included in a middle-term exam of the \nundergraduate course “Object-Oriented Design and Programming”. The course uses the \nprogramming microworld objectKarel in the first two lessons for presenting the most \nfundamental OOP concepts and the environment BlueJ. The results of the study are \npresented and analysed in conjunction with results from similar studies. KEY WORDS Object-Oriented \nProgramming, object, class, conceptions, 1. out ’ …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MYTH TROUBLES: An open-source educational game in scratch for Greek Mythology",
            "Publication year": 2018,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1046878117748175",
            "Abstract": "Background. Educational games are nowadays used for facilitating the teaching and learning process of various subjects. History is one of the subjects that simulations and games are used for promoting active learning and supporting students in comprehending various history-related subjects.Aim. This article reports on a new educational game on Greek mythology, called MYTH TROUBLES, designed and developed from scratch with the aim of supporting primary school students in studying Greek mythology and raising their interest on the subject of history.Method. The article presents the educational rationale and design of MYTH TROUBLES in the context of an educational games design model proposed in the literature. Since the game was implemented with the platform of Scratch and it is available online both for students (or anyone interested in Greek Mythology) and game developers, some information for …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:maZDTaKrznsC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Introducing novices to programming: a review of teaching approaches and educational tools",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/44125012/Introducing_Novices_to_Programming_a_rev20160326-26058-1tfvkcj.pdf",
            "Abstract": "Learning programming poses students with many difficulties. The extensive research that has been carried out in the last decades regarding novice programmers has shown that an important factor of these difficulties is the teaching approach used. This approach, know as the classic approach, is based on a general purpose programming language, a professional programming environment and a set of problems from the area of number and symbol processing. In this paper, we present the difficulties encountered by students when they are taught programming with the classic approach. The difficulties presented are general and are not related to the programming paradigm (procedural or object-oriented). Next we review the various approaches to teaching programming to novices and the educational tools that have been developed in their context.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Student perceptions on the benefits and shortcomings of distributed pair programming assignments",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7943050/",
            "Abstract": "Pair Programming (PP) has been extensively used for enhancing the learning of programming. Specifically, PP is considered to: make the learning of programming more pleasant, promote collaboration and communication between the members of pairs, encourage the sharing of knowledge and skills, and even improve code quality. More recently, systems have appeared that support Distributed Pair programming (DPP). DPP is considered to maintain all the benefits of PP and in addition to allow for the distributed collaboration of pairs from anywhere and at any time. However, DPP might impose limitations as well, such as the requirement from students to configure their systems and ensure a good Internet connection. In order to draw safer conclusions on the benefits and shortcomings of DPP and maximize its effects on the learning of programming, it is necessary to investigate its impact under real world situations …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Designing and deploying programming courses: Strategies, tools, difficulties and pedagogy",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-014-9341-9?sa_campaign=email/event/articleAuthor/onlineFirst&error=cookies_not_supported&error=cookies_not_supported&code=72e64db0-9178-49e6-8571-a8faa818fff3&code=0a627e85-9927-46e6-9721-33c8c33a825a",
            "Abstract": "Designing and deploying programming courses is undoubtedly a challenging task. In this paper, an attempt to analyze important aspects of a sequence of two courses on imperative-procedural and object-oriented programming in a non-CS majors Department is made. This analysis is based on a questionnaire filled in by fifty students in a voluntary basis. The issues of the programming courses that are investigated refer to: the strategy selected for the introduction to programming; the sequence of the programming techniques and languages taught and the transition from the one to the other; students’ difficulties with programming in general and with imperative-procedural and object-oriented programming in specific; the teaching and learning design of both courses; and the material that students rely on for learning programming. Based on the analysis of students’ replies on the questionnaire, related work …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Examining the Compatibility of Students in Distributed Pair Programming",
            "Publication year": 2019,
            "Publication url": "https://search.proquest.com/openview/89861f1e066a374ea74838d33129e796/1?pq-origsite=gscholar&cbl=1796419",
            "Abstract": "Pair Programming (PP) has a long history both in the software industry and education. More recently, specially designed environments have made the application of Distributed Pair Programming (DPP) possible, which enables two programmers to work remotely. Through these collaborative activities, students produce better programs, improve their performance and programming skills, and increase their self-confidence. Student attitudes towards Distributed Pair Programming and the factors that affect them, remain largely unexplored, while some of the existing studies have yielded mixed results. One important aspect is to understand the underlying factors that contribute to a successful pairing formation, ie, factors that make pairs very compatible. This paper focuses on the examination of possible factors which we felt had the potential to affect the compatibility of student pairs who worked remotely. The present …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:u_35RYKgDlwC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Preparing teachers for teaching informatics: Theoretical considerations and practical implications",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2481449.2481468",
            "Abstract": "The integration of ICT in Primary and Secondary Education is considered of great importance for the enhancement of both teaching and learning. However, a successful integration of ICT in the teaching practice requires a well-organized training of teachers. In this paper, we present qualitative results from a national-scale program aiming at training Secondary Education teachers in the usage of ICT. Specifically, we focus on the training of Informatics and Computer Science teachers that were for the first time included in this training program taking place the last 12 years in Greece. These trainee-teachers will act as trainers of teachers after the successful completion of their own training. Several important aspects of organizing the training of trainers are examined, while some findings concerning the major problems of preparing teachers for teaching Informatics are analysed.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Students’ perspective on the first programming language: C-like or Pascal-like languages?",
            "Publication year": 2018,
            "Publication url": "https://is.muni.cz/publication/1378088/cs/Pitner-Ivanovic-Savic-Xinogalos/Students-perspective-on-the-first-programming-language-C-like-or-Pascal-like-languages",
            "Abstract": "The choice of the first programming language (FPL) has been a controversial issue for several decades. Nearly everyone agrees that the FPL is important and affects students’ subsequent education on programming. The study presented in this article investigates the suitability of various C-like and Pascal-like programming languages as a FPL. Students from three Universities express their perceptions on the FPL through a specially designed questionnaire. The students had been introduced to programming using different FPLs and having experience on more than one language and formulated two distinct groups: a group introduced to programming with a C-like and another with a Pascal-like language. The statistical analysis of the data collected showed that the choice of the FPL does not have a deep impact on difficulties that novices may experience when learning the basics of programming. However, this result was recorded in the context of three distinct programming courses that were positively evaluated by students in relation to their content, organization and quality. Consequently, this study indicates that the overall quality of the course and the instructors have a great impact on a smooth introduction to programming no matter what the FPL is.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Re-designing an OOP course based on BlueJ",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4281121/",
            "Abstract": "In this paper we present our findings on teaching Object Oriented Programming (OOP) with BlueJ in the context of a one-semester programming course. Specifically, we present the evolution of the course, results from its evaluation and proposals for a more effective teaching of OOP. Our proposals focus on the way that the features of BlueJ, the accompanying textbook and the well-known guidelines for teaching object orientation with Java presented by the team of BlueJ should be used, in order to avoid some underlying pitfalls.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A holistic framework for the development of an educational game aiming to teach computer programming",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/44125019/A_holistic_framework_for_the_development20160326-27983-12pqcww.pdf",
            "Abstract": "Computer science is gradually changing, evolving and adapting according to the needs of each time period by incorporating the technological developments available. However, despite the occurring changes and the current progress in the domain, computer programming is still a vital chapter within computer science, and its teaching remains a difficult endeavour. On the other hand, students have changed the way with which they learn, interact with and search for knowledge. They spend significant amounts of their everyday lives from a very young age interacting with the computers by playing games. Thus, they are used to environments with impressive special effects and graphical interfaces where they have full control of the situation and interact with the environment’s elements. Therefore, today’s teachers are trying to connect computer programming learning with students’ everyday usage of the computer, which does not include simple textual editors for programming lines of code with no other interaction functionalities. Hence, teachers face the challenge of incorporating environments that are similar to students’ existing mentality and of creating tasks and assignments that can be executed within these environments and can provide students with the necessary programming knowledge and skills. A number of software solutions were developed towards facing the aforementioned difficulties. They can be classified into three main categories, namely educational programming environments, microworlds and educational games. Educational games used in computer programming courses are considered to present added value, due to their …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Η εισαγωγή στον προγραμματισμό: Διδακτικές Προσεγγίσεις και Εκπαιδευτικά Εργαλεία",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Technology enhanced learning for programming courses—Experiences and comparison",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6059545/",
            "Abstract": "Methods and approaches behind technology enhanced learning (TEL) in programming courses at a university level encourage continuous research in the last 20 years. Still there is no generally applicable way that would guarantee success. In this paper some experiences gathered during years of a technology-enhanced approach in teaching programming at two universities in two countries are presented and compared.",
            "Abstract entirety": 1,
            "Author pub id": "TquBXjAAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying Software Engineering Principles in Android Development",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/George-Violettas/publication/338393159_Applying_Software_Engineering_Principles_in_Android_Development/links/5e11b47ca6fdcc283757d07e/Applying-Software-Engineering-Principles-in-Android-Development.pdf",
            "Abstract": "The tremendous popularity of mobile computing and Android in particular has attracted millions of developers who see opportunities for building their own start-ups. As a consequence computer science students express an increasing interest into the related technology of Java development for Android applications. Android projects are complex by nature and relatively large software products, while their development calls for the application of established software engineering practices and tools.Computer science and information technology curricula include software engineering as a key knowledge area (ACM 2013), and as a result, most computer science-related departments offer at least one “conventional” software engineering course. By conventional we mean that in most cases, the introduced concepts are exemplified on either desktop applications standing individually on a personal computer and recently on web applications employing server and/or client side development. To the best of our knowledge, there are very few courses that introduce software engineering concepts to a mobile software development course. At the same time, software development for particular platforms is often perceived and taught as a purely technological skill with no direct connections to software engineering. The consequence is that even experienced mobile application programmers do not embrace or apply software engineering practices. Moreover, the lure of Android development can serve as a vehicle for conveying software engineering concepts to computer science students in an attractive way. All these issues have resulted in interesting proposals …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Review on serious games for people with intellectual disabilities and autism",
            "Publication year": 2016,
            "Publication url": "https://ruomo.lib.uom.gr/handle/7000/488",
            "Abstract": "People with Intellectual Disabilities (ID) are those who have low intellectual abilities and limitations in behavioural and social functioning. ID can be observed in a very early stage in their lives, while every person with ID has individual characteristics. Autism Spectrum Disorder (ASD) is a mental disorder that causes issues in social, communicational and emotional behaviour. Many people with ASD have high intellectual abilities, whereas there are others with cognitive disabilities. Therapists have identified several intervention methods to provide aid and teach people with ID and ASD several skills. The traditional methods include special educational programmes, individual or team sessions with therapists and team bonding activities. However, the technological advancements have allowed therapists, organizations and researchers invent new intervention methods. Such methods include software solutions and Serious Games (SGs). In this study, the state-of-the-art in SGs that have already been developed is explored. The findings are categorized based on the limitations they try toaddress that fall into two categories, namely intellectual functioning and adaptive behaviour. SGs falling in the adaptive behavior category are classified according to the categories of skills they aim to promote, namely conceptual, socialand practical skills. Finally, the SGs presented are classified according to the specific  skills (i.e. language and literacy, daily living) they aim to improve. SGs are comparatively analysed taking into account their target group, specific purpose, type/platform and evaluation results. Based on this analysis conclusions are drawn that can assist …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating learning analytics in an educational MMORPG for computer programming",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901446/",
            "Abstract": "The educational landscape continues to transform significantly in a way that it engages students' interest and improves learning processes. Such an example is the gradual use of educational games, which seem to be an exceptional means to motivate and engage students in ways that will make learning more challenging and interesting for them. However, although educational games are a very interesting tool that could be used in education, an interesting challenge that should be addressed is the identification of all the ways students' progress and results can be measured for examination. This way, there is a high demand for accountability regarding the measurement and analysis of enriched game based learning activities or game-based learning analytics (GBLA). This demand is especially highlighted in one of the most difficult areas of Computer Science, which is computer programming education. In this …",
            "Abstract entirety": 0,
            "Author pub id": "TquBXjAAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        }
    ]
}]