[{
    "name": "Συμεών Ρετάλης",
    "romanize name": "Symeon Retalis",
    "School-Department": "Ψηφιακών Συστημάτων",
    "University": "unipi",
    "Rank": " Καθηγητής",
    "Apella_id": 5704,
    "Scholar name": "Symeon Retalis",
    "Scholar id": "JUX2KJcAAAAJ",
    "Affiliation": "Professor University of Piraeus, Department of Digital Systems",
    "Citedby": 3112,
    "Interests": [
        "Learning Design",
        "Interaction Design for Children",
        "Learning Games"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=JUX2KJcAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A critical perspective on design patterns for e-learning",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-learning...learning/20879",
            "Abstract": "“A design pattern describes a problem which occurs over and over again in our environment, and then describes the core of the solution to that problem, in such a way that you can use this solution a million times over, without ever doing it the same way twice”(Alexander et al., 1977). In the field of e-learning, design patterns are frequently advocated as a powerful way of providing structured, teacher-friendly, textual representations of learning designs, or of expressing the design rationale underlying learning objects. The purpose of this chapter is to look at e-learning design patterns from a critical perspective. We provide a historical, multidisciplinary excursus of the notion of design patterns. We propose a taxonomy of e-learning design patterns, providing examples in the various categories. Finally, we discuss both the benefits of design patterns for e-learning professionals (particularly, novice ones) and their …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:8k81kl-MbHgC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Learning Technology Systems: issues, trends, challenges",
            "Publication year": 2001,
            "Publication url": "http://www.cs.rug.nl/paris/papers/IOSTE01.pdf",
            "Abstract": "This paper elaborates on a comparative analysis of contemporary LTSs. We have selected a number of the most important, commonly used, modern LTSs and put them through a thorough evaluation process, based on the services, tools, and features they support, and the usability of their hypertext user interface. The result of the evaluation is twofold: to explore the utility of LTSs and consequently discover the real nature of these systems, based on the features they support; and to delve into the usability of LTSs, a critical factor in the acceptance of these systems by the market.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "Defining a UML Profile for Web–based Educational Applications",
            "Publication year": 2005,
            "Publication url": "ftp://ceur-ws.org/pub/publications/CEUR-WS/Vol-153.zip#page=44",
            "Abstract": "This paper presents a UML profile for web–based educational applications. The definition of the profile is provided by applying a certain formalism which is based on the metamodeling architecture of the UML language. An example is given throughout the paper for the illustration of an instantiated model based on the profile.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing and generating educational adaptive hypermedia applications",
            "Publication year": 2005,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.8.3.26.pdf",
            "Abstract": "Educational Adaptive Hypermedia Applications (EAHA) provide personalized views on the learning content to individual learners. They also offer adaptive sequencing (navigation) over the learning content based on rules that stem from the user model requirements and the instructional strategies. EAHA are gaining the focus of the research community as a means of alleviating a number of user problems related to hypermedia. However, the difficulty and complexity of developing such applications and systems have been identified as possible reasons for the low diffusion of Adaptive Hypermedia in web-based education. Experience from traditional Software Engineering as well as Hypermedia Engineering suggests that a model-driven design approach is appropriate for developing applications where such requirements and constraints occur. This paper presents on a model-driven design process of EAHA. This …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:W7OEmFMy1HYC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Design Patterns for E-learning, Part I",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/11690/",
            "Abstract": "Recently we have seen a renewal of interest in systematic approaches to educational design, and some of this work gives proper regard to the complexity of learning. E-learning design patterns offer a challenging method for systematic educational design, and tries to re-use design knowledge to provide means for sharing design experience and to support the work of multidisciplinary e-learning development teams. The aims of this symposium is to promote the creation and use design patterns in the e-learning community, to discuss their possible added value or shortcomings, as well as to introduce participants to the latest advances in the construction of e-learning design patterns. We bring together researchers who have long experience in elearning research and development and have been involved in projects that deal with design patterns in the educational context.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Giving More Adaptation Flexibility to Authors",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=5657481502379210330&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present AthenaQTI, a tool for authoring personalized assessments, which gives the author significant flexibility in terms of the adaptation that s/he can incorporate in the assessments s/he builds. We focus on presenting the functionality of the authoring environment and the tool's conformance to the IMS-QTI specification, a fact that gives it the advantage of in-teroperability. Furthermore, we briefly describe the user model and the philoso-phy of its manipulation.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:cWzG1nlazyYC",
            "Publisher": "Springer"
        },
        {
            "Title": "Towards networked learning analytics–A concept and a tool",
            "Publication year": 2006,
            "Publication url": "http://www.lancaster.ac.uk/fss/organisations/netlc/past/nlc2006/abstracts/pdfs/P41%20Retalis.pdf",
            "Abstract": "Networked learning is much more ambitious than previous approaches of ICT-support in education. It is therefore more difficult to evaluate the effectiveness and efficiency of the networked learning activities. Evaluation of learners’ interactions in networked learning environments is a difficult, resource and expertise demanding task. Educators participating in online learning environments, have very little support by integrated tools to evaluate students’ activities and identify learners’ online browsing behavior and interactions. As a consequence, educators are in need for non-intrusive and automatic ways to get feedback from learners’ progress in order to better follow their learning process and appraise the online course effectiveness. They also need specialized tools for authoring, delivering, gathering and analysing data for evaluating the learning effectiveness of networked learning courses.Thus, the aim of this paper is to propose a new set of services for the evaluator and lecturer so that he/she can easily evaluate the learners’ progress and produce evaluation reports based on learners’ behaviour within a Learning Management System. These services allow the evaluator to easily track down the learners’ online behavior at specific milestones set up, gather feedback in an automatic way and present them in a comprehensive way. The innovation of the proposed set of services lies on the effort to adopt/adapt some of the web usage mining techniques combining them with the use of semantic description of networked learning tasks",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fostering business opportunity identification skills in secondary education via an orchestrated technology enhanced learning script",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s41959-021-00045-9",
            "Abstract": "Due to global economic and technological changes, Europe requires a greater number of young people who are willing and able to become entrepreneurs. Thus, there is a need for the provision of effective Entrepreneurship Education (EE) in high schools via validated well-structured instructional methods. Although business opportunity identification has been regarded as the starting learning objective for every educational approach on entrepreneurship, so far not great emphasis has been given on it within EE programs. This paper proposes a technologically enhanced instructional approach that specifically promotes high school students’ business opportunity identification skills, focusing on their entrepreneurial readiness and providing them with the opportunity to fill cognitive gaps using digital learning material in an online learning environment. This approach has been validated via a research study which was …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:HIFyuExEbWQC",
            "Publisher": "Springer Singapore"
        },
        {
            "Title": "Technology-enhanced learning: Design patterns and pattern languages",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=43wfEAAAQBAJ&oi=fnd&pg=PR3&dq=info:N7w1VC7ySiIJ:scholar.google.com&ots=D8G-ftm8vP&sig=6Gc9W_7_91XfqzPa59D97KQJ2IE",
            "Abstract": "Designing for technology enhanced learning (TEL) is often a demanding process. It involves creating challenging learning tasks, making sure that students have access to the right tools and resources, and ensuring there are appropriate opportunities for them to learn with and from each other. This book introduces the use of design patterns and pattern languages as ways of capturing and sharing TEL design knowledge. The editors have assembled a team of authors who have pioneered research and development in this rapidly expanding field.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "BRILL"
        },
        {
            "Title": "Children's Interaction with Motion-Based Touchless Games: Kinecting Effectiveness and Efficiency",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3383668.3419937",
            "Abstract": "Leveraging movement data to support children's learning is appealing and technically challenging. However, there is limited knowledge about exploiting the complete design potential of bodily interplay in learning games. We conducted an in-the-wild study with 8 children, with special educational needs, playing a language based educational motion-based touchless game. We collected children's interaction data (correctness and reaction time), and data regarding the different design elements (game settings) implemented in 90 game sessions. Our analysis shows that number of items on-screen, selection gestures, and time to select items, impact the effectiveness (correctness) and efficiency (reaction time) of the children. We highlight the value of interaction analytics and quantify the relationship between different game design elements and children? s efficiency and effectiveness. Our findings help shape the future …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:IUKN3-7HHlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Making learning designs in layers: The CADMOS approach",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=13919219819581442446&hl=en&oi=scholarr",
            "Abstract": "There are various tools that teachers can use today in order to design a learning unit in a formal and reusable way. This paper gives an overview of the various features that current learning design tools support and discusses the required ones that will make these tools more appealing to the teachers. Factors that discourage teachers from using these tools are the lack of both user friendly graphical notation and the non support of a layered approach to learning design. Thus, this paper proposes to build learning design tools following the concept of the “separation of concerns” that stems from the principles of web engineering. A graphical, IMS-LD level A compliant learning design tool, called CADMOS, which supports the “separation of concerns” concept in learning design, is being presented.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interaction patterns for Windows 8 tablet applications",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2739011.2739018",
            "Abstract": "Tablet devices are selling in millions every year and it currently seems that this trend will continue in the following years. Most of these devices come with\" Application Stores\", which users can browse and select applications to download from. These applications pose various interesting challenges to user interaction designers, because their interaction design process has many differences compared to other app paradigms, such as mobile apps and classical desktop apps. Some of these challenges come from the fact that the only method of input is by using touch interactions, due to the specific operating system ways of handling user input and how running apps can be shown to the user. In this paper, we propose five patterns for interaction design for Windows 8 applications in tablet devices. These patterns are accompanied by some thumbnails that can be found in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing a Blended Learning Strategy for Teaching Object-Oriented Programming Using the’Model First’Approach",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Yannis-Psaromiligkos/publication/267258224_Developing_a_blended_learning_strategy_for_teaching_Object-Oriented_Programming_using_the_%27Model_First%27_approach/links/58517f5508ae95fd8e15a4c4/Developing-a-blended-learning-strategy-for-teaching-Object-Oriented-Programming-using-the-Model-First-approach.pdf",
            "Abstract": "Although the OOP paradigm and its concepts reflect the “real world” which consists of objects that have attributes and perform actions, it has been proven that learners find hard to conceptualise the OOP philosophy and its concepts [1],[2],[3],[4],[5],[6]. Students undoubtedly need to overcome a lot of barriers during the instructional process of OOP such as to understand new concepts (eg object, class, attributes, encapsulation, inheritance, polymorphism), to learn an OO programming language, etc [7]. Various approaches have been proposed for augmenting the learning effectiveness of OOP instructional practices such as the adoption of “objects-first” strategy [8], the gradual explanation of concepts from simple to higher level ones [9], the use of guidelines like “Don’t start with a blank screen”, and “Read code”[8] etc.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic Generation of Weather Forecasts: KAIROS project [in Greek]",
            "Publication year": 2001,
            "Publication url": "http://archive.ilsp.gr/en/profile/research-departments/speechmediacontent?view=publication&task=show&id=269",
            "Abstract": "In this paper, we present ongoing work for the development of a Natural Language Generation system, in the framework of the research project KAIROS, for the automatic generation of weather forecasts and summaries in two languages, English and Greek. We outline the general prerequisites for building such a system, together with the specifications and the main components of the system.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning design Rashomon II: exploring one lesson through multiple tools",
            "Publication year": 2013,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00872208/",
            "Abstract": "An increasing number of tools are available to support the learning design process at different levels and from different perspectives. However, this variety can make it difficult for researchers and teachers to assess the tool that is best suited to their objectives and contexts as learning designers. Several of the tools are presented elsewhere in this issue. In this article, the aforementioned tools are used as lenses to view the same learning design narrative - an inquiry-based learning lesson on healthy eating aimed at secondary-school students - from different perspectives, in a manner inspired by the plot structure of Kurosawa's film \"Rashomon\". In modelling the lesson on five tools, we uncovered similarities and differences in relation to the challenges posed by modelling a particular learning scenario, the ease of implementation of the computer-interpretable products' output by the tools and their different target audiences and pedagogical specialities. This comparative analysis thus illustrates some of the current underlying issues and challenges in the field of Learning Design.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using e-learning design patterns to augment learners' experiences",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.chb.2009.02.001",
            "Abstract": "Editorial: Using e-learning design patterns to augment learners' experiences: Computers in \nHuman Behavior: Vol 25, No 5 ACM Digital Library home ACM home Google, Inc. (search) \nAdvanced Search Browse About Sign in Register Advanced Search Journals Magazines \nProceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch \nAdvanced Search Computers in Human Behavior Periodical Home Latest Issue Archive Authors \nAffiliations Award Winners More HomeBrowse by TitlePeriodicalsComputers in Human \nBehaviorVol. , No. Editorial: Using e-learning design patterns to augment learners' experiences \narticle Editorial: Using e-learning design patterns to augment learners' experiences Share on \nAuthors: Yannis A Dimitriadis profile image Y. Dimitriadis Department of Signal Theory, \nUniversity of Valladolid, Communication and Telematics Engineering, Camino del Cementerio s/, …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:aqlVkmm33-oC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Η Αξιολόγηση της Επίδοσης των Εκπαιδευομένων στα Σύγχρονα Εκπαιδευτικά Περιβάλλοντα",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/handle/11419/236",
            "Abstract": "Το κεφάλαιο αυτό εστιάζει στην εννοιολογική αποσαφήνιση του όρου «αξιολόγηση της επίδοσης των εκπαιδευόμενων στα σύγχρονα εκπαιδευτικά περιβάλλοντα» και αναδεικνύονται οι βασικές αρχές που διέπουν τη σύγχρονη προσέγγιση της αξιολόγησης των εκπαιδευόμενων στον 21ο αιώνα. Παράλληλα παρουσιάζονται αναλυτικά οι πιο γνωστές τεχνικές αξιολόγησης της επίδοσης των εκπαιδευομένων που χρησιμοποιούνται από τους εκπαιδευτικούς στα περιβάλλοντα. Τέλος αναδεικνύεται ο καταλυτικός ρόλος που διαδραματίζουν οι εκπαιδευτικές τεχνολογίες σε αυτό το επιστημονικό πεδίο.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach for usability evaluation of e-commerce sites based on design patterns and heuristics criteria",
            "Publication year": 2003,
            "Publication url": "https://core.ac.uk/download/pdf/232380837.pdf",
            "Abstract": "DEPTH (evaluation approach based on DEsign PaTterns & Heuristic criteria) is an approach for performing scenario-based heuristic usability evaluation for e-commerce sites. It is comprised of a preparatory and execution phase where specific steps are performed for evaluating the usability along three axis: usability comparison tests among similar e-commerce sites, expert/heuristic evaluation, scenario-based user inspection/enquiry sessions.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:MXK_kJrjxJIC",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "Designing configurations of CSCL scripts using interaction analysis findings",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5702137/",
            "Abstract": "Various learning strategies have been widely used in the Computer-Supported Collaborative Learning (CSCL) script design practice. For this reason strategies have been documented in a designer friendly way as collaborative flow design patterns (CLFP). A CLFP defines the sequence of the tasks that the strategy dictates as well as other elements needed for the various tasks, such as the duration of a task, the use of a particular tool for a given task and so on. Designers often face the difficulty of mixing and matching strategies in order to create personalized scripts that are more appropriate to the learners' preferences, knowledge level, needs and the learning context in general. Designers need to make configurations of a “traditional” CLFP in order to balance a variety of organizational, administrative, instructional and technological components. This task is even more challenging when such configurations need to …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CADMOS Learning Design Tool",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=10733857911021316608&hl=en&oi=scholarr",
            "Abstract": "This paper gives an overview of the CADMOS learning design tool that promotes the concept of “separation of concerns” during the design process. CADMOS is a graphical IMS-LD Level A & B compliant learning design tool. According to the feedback from an evaluation case study with 36 participants, CADMOS is a user friendly tool that allows educational practitioners to design flows of learning activities from different perspectives and in different layers.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing an e-Learning Objects Brokerage System",
            "Publication year": 2003,
            "Publication url": "https://core.ac.uk/download/pdf/148196287.pdf",
            "Abstract": "E-Learning Objects Brokerage Systems are considered as the state-of-the-art in systems that facilitate the exchange of learning objects. These systems currently exist and operate at a limited scale but their use is vastly increasing, especially in multi-party educational organizations, such as virtual universities. This paper performs a study of existing e-Learning Objects Brokerage Systems, and specifies the ideal requirements for such a system. It also proposes a distributed architecture that would enable the interoperation between different e-Learning Objects Brokerage Systems.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:bFI3QPDXJZMC",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "D1. 1-State of the Art Pedagogical Strategies: idSpace project Deliverable D1. 1",
            "Publication year": 2008,
            "Publication url": "https://vbn.aau.dk/en/publications/d11-state-of-the-art-pedagogical-strategies-idspace-project-deliv",
            "Abstract": "D1.1 - State of the Art Pedagogical Strategies: idSpace project Deliverable D1.1 — Aalborg \nUniversity's Research Portal Skip to main navigation Skip to search Skip to main content \nAalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications \nActivities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, \nname or affiliation D1.1 - State of the Art Pedagogical Strategies: idSpace project Deliverable \nD1.1 Marlies D1.1 - State of the Art Pedagogical Strategies, Kees Pannekeet, Marjo Rutjens, \nPeter Sloep, Petros Georgiakakis, Symeon Retalis, Peter Dolog Department of Computer \nScience Daisy - Center for Data-intensive Systems Research output: Book/Report › Report › \nResearch Overview Projects (1) Original language English Publication status Published - 2008 \nAccess to Document http://dspace.ou.nl/bitstream/1820/1656/1/idSpace%20D1.%20final%--…",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the Learning Effectiveness of Collaborative Problem Solving in Computer-Mediated Settings",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/knowledge-networks-social-software-perspective/25452",
            "Abstract": "here is a growing need for systematic evaluations of computer-supported collaborative learning environments. The present chapter focuses on the evaluation of the learning effectiveness of the interactions that take place in computer-supported problem solving environments. This chapter emphasizes the need for supporting evaluators of such environments with holistic evaluation conceptual frameworks and tools that can facilitate the analysis of data gathered during the evaluation process. We discuss in detail such a holistic framework which has been tested through a primary education case-study.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:_xSYboBqXhAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Learning styles and instructional design as inputs for adaptive educational hypermedia material design",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Aimilia-Tzanavari/publication/237081238_Learning_Styles_and_Instructional_Design_as_Inputs_for_Adaptive_Educational_Hypermedia_Material_Design/links/00b7d51b629927bd29000000/Learning-Styles-and-Instructional-Design-as-Inputs-for-Adaptive-Educational-Hypermedia-Material-Design.pdf",
            "Abstract": "In education, instructors adopt different instructional modes that correspond to their preferred teaching style: some focus on principles and others on applications; some present the material in a logical progression of small incremental steps, others proceed from the big picture to the detail and so on. On the other side, students are characterized by different learning styles: preferences or predispositions to behave in a particular way when engaged in a learning process. In the elearning area, adaptive educational hypermedia applications are designed in order to offer personalised learning experience based on the personal learning style. It has been proven that the good match between learning style and instructional design drives to effective learning. This paper proposes a systematic approach for designing leaning tasks for educational hypermedia applications that suit the individual learning style. In particular, we show how the design patterns approach can be used as a design model tool.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Leveraging the 1: 1 iPad approach for enhanced learning in the classroom",
            "Publication year": 2018,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2018.1512463",
            "Abstract": "Mobile technologies are integrated parts of our lives, and their use in educational settings could provide new, exciting opportunities for teaching and learning. The integration of the iPad in education, in particular, is thought to bring a paradigm shift and transform the twenty-first century classroom. However, as it is relatively new and experiences from pilot projects are just now beginning to surface, little concrete research on how it can be effectively adopted in the classroom and in other pedagogical activities exists. This raises the question of how to support students and teachers to realize the full potential of the 1:1 iPad approach. We followed the principles of action research in order to explore students’, teachers’ and parents perception of 1:1 iPad approach in the classroom. Towards this, we conducted a mixed-method research and combined quantitative and qualitative data. For the needs of this research, we …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:_axFR9aDTf0C",
            "Publisher": "Routledge"
        },
        {
            "Title": "CADMOS: A learning design tool for Moodle courses",
            "Publication year": 2012,
            "Publication url": "https://research.moodle.org/68/1/03%20-%20Boloudakis%20-%20CADMOS-%20A%20learning%20design%20tool%20for%20Moodle%20courses.pdf",
            "Abstract": "This paper presents CADMOS, a graphical learning design tool that allows a practitioner to easily create lesson plans. One of the main innovative features of CADMOS is that a lesson plan can be exported so that it can be deployed and enacted in a Moodle platform.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web-based learning Environments: issues, trends, challenges",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=1500102693621606842&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Patterns for designing Adaptable/Adaptive Educational Hypermedia",
            "Publication year": 2005,
            "Publication url": "https://re.public.polimi.it/handle/11311/525579",
            "Abstract": "La presente simulazione è stata realizzata sulla base delle regole riportate nel DM 598/2018 e allegata Tabella A. Cineca non si assume alcuna responsabilità in merito all’uso che il diretto interessato o terzi faranno della simulazione. Si specifica inoltre che la simulazione contiene calcoli effettuati con dati e algoritmi di pubblico dominio e deve quindi essere considerata come un mero ausilio al calcolo svolgibile manualmente o con strumenti equivalenti. Informazioni sui dati: vengono considerati tutti i prodotti in stato definitivo. Per i prodotti indicizzati wos/scopus, l’anno di riferimento e la tipologia sono quelli riportati in banca-dati.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Acta Press Calgary"
        },
        {
            "Title": "Remote learning for children with Special Education Needs in the era of COVID-19: Beyond tele-conferencing sessions",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2021.1930477",
            "Abstract": "The unprecedented situation of Covid-19 which resulted in the closure of schools, enforced the educational community worldwide to find alternative ways to design the learning process. In special education the challenges are greater due to the need of individualized learning in 1:1 base, physical prompt, visual support and direct reinforcement. Nowadays, the internet services, like remote learning and teletherapy, could be an alternative and effective method of providing virtual intervention services using either well known video conferencing platforms, or more specialized ones. However, while such platforms hold great promise, there are few research studies that discuss the design decisions of the remote learning services and the most effective learning model that could be offered to children with Special Education Needs (SEN). The goal of this paper is to present a case study where SEN teachers and therapists …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Secondary school students build multiple skills in evaluating business opportunities via technology-enhanced learning activities",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s41959-020-00026-4",
            "Abstract": "Developing knowledge, skills and positive attitude toward entrepreneurship for students in secondary education is an evolving process of particular importance to entrepreneurship education. There is a lack of evidence about effective entrepreneurship education methods at the lower level and upper secondary school settings despite the growing efforts of integrating entrepreneurship as a key competence into school curricula of various countries worldwide. This paper proposes a technology-enhanced teaching approach that focuses on helping students acquire multiple skills for identifying and evaluating business opportunities. The positive quantitative and qualitative results of a research study conducted in six (6) high schools involving 124 students aged 15–17 years on learning effectiveness and acceptability of the proposed approach are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:DUooU5lO8OsC",
            "Publisher": "Springer Singapore"
        },
        {
            "Title": "Yet another approach to support the design process of educational adaptive hypermedia applications",
            "Publication year": 2004,
            "Publication url": "http://users.softlab.ntua.gr/~retal/papers/conferences/AH2004/Franca_ChristeaWorkshop/paper_workshop_retal.doc",
            "Abstract": "Educational Adaptive Hypermedia Applications (EAHA) provide personalized views on the learning content to individual learners. They also offer adaptive sequencing (navigation) over the learning content based on rules that stem from the user model requirements and the instructional strategies. EAHA are gaining the focus of the research community as a means of alleviating a number of user problems related to hypermedia. However, despite the growing interest of the community and the increasing number of available systems, the actual impact of these systems in e-learning remains low. The difficulty and complexity of developing such applications and systems have been identified as a possible reason for this low diffusion of Adaptive Hypermedia in web-based education. The development of EAHA (authoring process) is a complex task engaging people with different backgrounds: instructional designers, subject matter experts, content developers, multimedia developers, user interface experts, programmers, etc. Experience from traditional Software Engineering as well as Hypermedia Engineering suggests that a model-driven design approach is appropriate in developing applications where such requirements and constraints occur. This paper presents on a model-driven design process of EAHA. This process accords to the principles of hypermedia engineering and its innovation is the use of a formally specified object oriented design model.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the usability of web-based learning management systems",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/43010100/Evaluating_the_usability_of_web-based_le20160224-10649-1ot8mdo.pdf",
            "Abstract": "A great number of Learning Management Systems (LMSs), commercial or open source exists nowadays (eg WebCT, Blackboard, IBM LearningSpace, etc.) offering integrated services such as the creation and distribution of on-line learning material, the communication between stakeholders, the management of the instruction process etc., thus providing the basic software platform for supporting web-based learning in an easy-touse, and pedagogically flexible manner. This paper proposes a framework on the analysis of potentiality and on the evaluation of LMSs’ admissibility. The most commonly used LMSs have been selected for the application of this specific framework. The aim of the evaluation is twofold; to search their usefulness and their quality in use.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using computer supported collaborative learning strategies for helping students acquire self-regulated problem-solving skills in mathematics",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131509000499",
            "Abstract": "The main objective of this paper is to investigate the effectiveness of a proposed computer-based instructional method in Primary Education for self-regulated problem solving. The proposed instructional method is based on Sternberg’s model of problem solving within an authentic context. It consists of three main phases: observation, collaboration and semi-structured guidance. The ultimate learning objective is to augment the autonomous problem-solving skills of primary school children. In our study the Synergo tool was used, which is a synchronous computer supported collaborative learning tool, as well as the Moodle learning management system. The context which frames the method is authentic, very close to a students’ realistic learning situation. The findings of this study advocate that students can increase their problem-solving skills in a relatively short period of time. At the same time, they can improve their …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Μοντέλα Εκπαιδευτικής Αξιολόγησης",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/235",
            "Abstract": "Το κεφάλαιο αυτό αποσκοπεί στην ανάλυση  του θεωρητικού πλαισίου πάνω στο οποίο εδράζεται η εκπαιδευτική αξιολόγηση. Ιδιαίτερη έμφαση δίνεται στην συνοπτική παρουσίαση των πιο δημοφιλών μοντέλων εκπαιδευτικής αξιολόγησης (π.χ. CIPP, Τεσσάρων επιπέδων, Δυναμικό, κλπ. ),της δυναμικής τους και των ιδιαίτερων χαρακτηριστικών που τα διέπουν.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formal discussion summaries",
            "Publication year": 2004,
            "Publication url": "http://elibrary.lt/resursai/Uzsienio%20leidiniai/IEEE/English/2006/Volume%207/Issue%204/Jets_v7i4_00.pdf",
            "Abstract": "ISSN 1436-4522.© International Forum of Educational Technology & Society (IFETS). The authors and the forum jointly retain the copyright of the articles.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Learning Analytics in Moodle for assessing students’ performance",
            "Publication year": 2013,
            "Publication url": "https://research.moodle.org/19/1/Using%20Learning%20Analytics%20in%20Moodle....pdf",
            "Abstract": "The assessment of students’ performance in online learning environments is a challenging and demanding task for the teachers. Moodle offers several assessment tools. This paper presents a new assessment tool, called Learning Analytics Enriched Rubric (LAe-R). LAe-R is based on the concept of assessment rubrics which is a very popular assessment technique in education. LAe-R contains “enriched” criteria and grading levels that are associated to data extracted from the analysis of learners’ interaction and learning behavior in an e-learning environment. LAe-R has been developed as a plug-in for the Moodle learning management system. The findings of a case study showed that LAe-R is a very usable tool that is highly appreciated by teachers and students.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic Discovery of Services in Democratized Grids",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-social-dimensions-semantic/35745",
            "Abstract": "This chapter aims at discussing issues concerning the advertisement and semantic discovery of Web services in a democratized Grid environment: an environment in which users are agnostic of the low-level details for managing the services offered and requested. This type of environment poses new requirements, and thus, it affects the functionality of a service advertisement/discovery system. In the context of this aim, the chapter presents the motivation and the technologies developed towards a semantic information system in the Grid4All environment. The chapter emphasizes on bridging the gap between Semantic Web and conventional Web service technologies, supporting developers and ordinary users to perform resources’ and services’ manipulation tasks, towards a democratized Grid.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Eliciting design patterns for e-learning systems",
            "Publication year": 2006,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08993400600773323",
            "Abstract": "Design pattern creation, especially in the e-learning domain, is a highly complex process that has not been sufficiently studied and formalized. In this paper, we propose a systematic pattern development cycle, whose most important aspects focus on reverse engineering of existing systems in order to elicit features that are cross-validated through the use of appropriate, authentic scenarios. However, an iterative pattern process is proposed that takes advantage of multiple data sources, thus emphasizing a holistic view of the teaching – learning processes. The proposed schema of pattern mining has been extensively validated for Asynchronous Network Supported Collaborative Learning (ANSCL) systems, as well as for other types of tools in a variety of scenarios, with promising results.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Online Resource Page: Using Technology to Enhance the Teaching and Learning Process",
            "Publication year": 2003,
            "Publication url": "http://elibrary.lt/resursai/Uzsienio%20leidiniai/IEEE/English/2006/Volume%206/Issue%202/Jets_v6i2_00.pdf",
            "Abstract": "Journal of Educational Technology & Society Online Resource Page: Using Technology to \nEnhance the Teaching and Learning Proc Page 1 Journal of Educational Technology & Society \nVolume 6 Number 2 2003 Table of contents Formal discussion summaries Online Resource \nPage: Using Technology to Enhance the Teaching and Learning Process Moderator and \nSummarizer: Brent Muirhead 1-10 Full length articles Towards a Pattern Language for Learning \nManagement Systems Paris Avgeriou, Andreas Papasalouros, Symeon Retalis and Manolis \nSkordalakis 11-24 Uncovering the Provisos behind Flexible Learning Der-Thanq Chen 25-30 \nAn Evaluation Instrument for Hypermedia Courseware Georgiadou Elissavet and Anastasios \nA. Economides 31-44 Students' attitudes toward the use of the Internet for learning: A study \nat a university in Malaysia Kian-Sam Hong, Abang Ahmad Ridzuan and Ming-Koon Kuek …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards the improvement of the cognitive, motoric and academic skills of students with special educational needs using Kinect learning games",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212868916300186",
            "Abstract": "There is an ongoing interest in developing motion Kinect-based learning games that are in accordance with intervention protocols for helping children with special educational needs. These games, which offer natural user interaction modalities, seem to be very beneficial for this population because of the combination of physical activities with cognitive-training tasks. There is still an open research issue about how to integrate such games into schools and how to organize systematic evaluation studies for showing their added value. This paper presents the positive findings of a pilot research study in inclusive classroom settings that were carried out at two primary schools with 20 children who have special educational needs and who used the Kinems suite that contains movement-based educational games for such children. Analysis of data gathered via pre- and post-test questionnaires, interviews and an in-depth …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:SpbeaW3--B0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Using educational tools for teaching object oriented design and programming",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.134.2804&rep=rep1&type=pdf",
            "Abstract": "The development of software systems is a complex process which requires a diverse set of skills and expertise. The Object Oriented programming paradigm has been proven to better organize the inherent complexity of software systems, than the traditional procedural paradigm. Hence, Object Oriented (OO) is becoming the dominant paradigm in the recent years. The software industry is placing increasing emphasis on newer, object-oriented programming languages and tools, such as Java. It is highly interested for software engineers capable to analyze and develop systems using the OO programming paradigm. The early exposure of students to object oriented programming has become increasingly important in both academia and industry. As an effect, after IEEE and ACM recommendations, the object oriented programming approach has established its place in the Computing Science (CS) Curricula of the Universities. Furthermore, a lot of research is being conducted with regards to the effective instructional methods for the Object Oriented design and programming. Such methods propose the utilization of educational tools for helping students overcome learning difficulties. The scope of this paper is to present some of the well known educational tools which can support the instructional process of Object Oriented design and programming. It also aims to show how one of the most widely known educational tool, called BlueJ, has been utilised and evaluated by students within an educational setting. Finally it discusses trends in the development of this tool (and other related ones) which could influence the teaching of Object Oriented design …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building Interoperability among Learning Content Management Systems.",
            "Publication year": 2003,
            "Publication url": "http://www.softlab.ntua.gr/~retal/papers/conferences/www2003/Interoperability_poster.pdf",
            "Abstract": "This paper addresses interoperability issues of learning content management systems. Motivation and design challenges are presented and an interoperability framework implemented at the Universal Brokerage Platform for learning resources is specified.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A learning research informed design and evaluation of a web-enhanced object oriented programming seminar",
            "Publication year": 2007,
            "Publication url": "https://search.proquest.com/openview/e7b1bc8de4cc121fb2fc542a02fe0b15/1?pq-origsite=gscholar&cbl=25848",
            "Abstract": "\" Object-Oriented Programming\" subject is included in the ACM Curriculum Guidelines for Undergraduate and Graduate Degree Programs in Computer Science as well as in Curriculum for K-12 Computer Science. In a few research studies learning problems and difficulties have been recorded, and therefore, specific pedagogical guidelines and educational tools have been proposed which aim at better supporting the instructional process of Object-Oriented Programming. This paper presents an empirical pilot study of a seminar related to the basic principles-concepts of Object-Oriented Programming. The seminar was at undergraduate educational level using the Java language and web technologies. Its instructional approach was based on selected best instructional practices (either in the form of guidelines or design patterns) already published in the literature. The fundamental aim of the present study was to …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:NMxIlDl6LWMC",
            "Publisher": "EDSIG"
        },
        {
            "Title": "Pilot use of digital educational comics in language teaching",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2011.576522",
            "Abstract": "This paper presents a case study about the use of digital comics in teaching modern Greek in high schools (aged 12–13). The ultimate goal of the educational use of digital comics is to promote students’ acquisition of language skills and to help them apply their imaginations and reuse their cultural experiences in creating multimodal comic‐like digital stories. The core idea of this case study, which was conducted at a high school in Greece, was to provide the opportunity to students become authors of their own digital comic stories using an innovative authoring tool called ComicLab.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Utilising adaptive self-assessment tools for accountants’ continuing professional education",
            "Publication year": 2015,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/4602",
            "Abstract": "Eureka! Institutional Repository: Utilising adaptive self-assessment tools for accountants’ \ncontinuing professional education Skip navigation Home Browse Communities & Collections \nBrowse Items by: Issue Date Author Title Subject Item Type Advanced Search Useful Links \nInformation Sign on to: My DSpace Receive email updates Edit Profile Saved Searches Favorites \nEureka! Institutional Repository 1.Eureka! Institutional Repository 2.Σχολή Διοίκησης & Οικονομίας \n3.Τμήμα Διοίκησης Επιχειρήσεων 4.Δημοσιεύσεις ΕΠ 5.Δημοσιεύσεις σε Περιοδικά Ελληνικά \nEnglish Utilising adaptive self-assessment tools for accountants’ continuing professional \neducation Sarmaniotis, Christos/ Retalis, Symeon/ Kargidis, Theodoros/ Καργίδης, Θεόδωρος/ \nΡετάλης, Συμεών/ Σαρμανιώτης, Χρήστος Institution and School/Department of submitter: \nΤΕΙ Θεσσαλονίκης Keywords: Professional education;Accountants;Self-assessment tools : 3-…",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "From Pedagogical Paradigms to Hypermedia Design Patterns: Where to start?",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/11684/",
            "Abstract": "Several studies exist that have reached the conclusion that there are significant correlations between learning style and learning outcome. Therefore, it becomes apparent that since a successful instructor is one who achieves the best\" learning outcome\" from most of his/her students, then he/she should be able to cater for his/her students' different learning styles. When the instructor's role is played by an educational hypermedia system, then its capabilities should be such so as to deal with different learning styles-something that can be regarded as primarily a design issue. This paper introduces the idea of using design patterns to provide solutions to the problem of how to best support learning styles via educational hypermedia applications",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "The impact of training on first generation immigrants: Preliminary findings from Greece",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5529555/",
            "Abstract": "The evaluation of the economic contribution of training programs of first generation adult immigrants is a field of importance against social exclusion and in favor of economic and social integration. The aim of this paper is to present some preliminary findings on the impact of language training programs on adult immigrant' income in Greece. Data were collected from the population of foreigners who attended a Greek language course organized by the Ministry of Education General Secretariat for Lifelong Learning. Overall, the results indicate that change in income was more noticeable for female immigrants, as compared to their male counterparts, two years after the completion of the training program. We conclude by highlighting the importance of such initiatives and offer further directions for future research.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Collaborative Moderation-Fostering Creativity with a Corporate Wiki.",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Christian-Prause/publication/267560082_Collaborative_Moderation_-_Fostering_Creativity_with_a_Corporate_Wiki/links/5759665b08ae414b8e43b824/Collaborative-Moderation-Fostering-Creativity-with-a-Corporate-Wiki.pdf",
            "Abstract": "Voluntary participation in a corporate Wiki can be low due to personal priority preference. But high participation of professionals is necessary to enable group innovation through a Wiki. We present a tool that offers rewards to committed users, and triggers a sportive competition that fosters the creativity process through knowledge exchange.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using a Story-Driven Board Game to Engage Students and Adults With Cultural Heritage",
            "Publication year": 2021,
            "Publication url": "https://www.igi-global.com/article/using-a-story-driven-board-game-to-engage-students-and-adults-with-cultural-heritage/274327",
            "Abstract": "Serious games are used in the field of cultural heritage as a means to transmit cultural knowledge and enable an experiential contact with cultural content. The authors' aim is to investigate whether a game design exploiting the less used combination of complex storytelling, endogenous cooperation, and competition has the potential to sufficiently convey cultural content. More specifically, through four game interventions, it was investigated how a story-driven board game functions with teenage and adult users alike. A mixed research methodology was followed in all game sessions and data were collected through observation, semi-structured group interviews, and short questionnaires. Findings confirmed the playability of the suggested design and the potential to amuse players while providing learning gains and engagement with cultural content. Nevertheless, further evaluation in formal and non-formal …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:dBIO0h50nwkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "CADMOS: an approach to developing Web-based instructional systems",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563201000103",
            "Abstract": "The educational use of the Internet and the World Wide Web has grown enormously over the last few years and continues to grow at a tremendous rate. Instructional systems, based on these networked technologies, have been constructed to solve instructional problems. There is evidence that these systems efficiently support the instructional process. Instructional developers should follow effective and quality driven development methodologies, which are specifically developed to support the development of network-based instructional systems. This article presents a methodology, CADMOS, which accords to the principles of the third and partially the fourth generation of Instructional Systems Development (ISD). The main innovation of CADMOS is its advocacy on splitting an instructional system into four sub-systems: human, webware, other learning resources, and specific infrastructure sub-systems.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:qUcmZB5y_30C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "\" Kairos\": A Web-Based System for Automatic Generation of Weather Forecasts in Two Languages, Greek-English",
            "Publication year": 2001,
            "Publication url": "https://openreview.net/pdf?id=BJWaFMZOZB",
            "Abstract": "Forecast composition is a time consuming task requiring the interaction and the integration of knowledge about meteorology, knowledge about language and knowledge about the conventions used to communicate the right amount of information to meet the needs of diverse user communities. The project “KAIROS” facilitates this work by (semi-) automating the configuration and the generation of forecasts in two languages, English and Greek via a web-based system. Among the major innovative features of “KAIROS” are the following: Generator configuration by means of several resources in which the user specifies different textual plans, the output format of the forecasts, the terminology that will be used as also the concept mappings of the data. Additionally, the modular design and the user intervention functionality of the system enforce two valuable characteristics: reusability and maintainability. In this paper, brief analysis of the architecture of the system under development\" KAIROS\" is given.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Skills and Competencies of Trainers in E-Learning",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/28884/",
            "Abstract": "During the past few years there have been strides in the advancement of technology that make feasible innovative learning possibilities, such as e-learning. In response to this call for documentation of such skills, the aim of this paper is to specify the skills and competencies of e-trainers in e-learning as well as to create a questionnaire that could help in systematically diagnosing a trainer’s existing skills and competencies. This is significant given the need to prepare educators and instructional designers to act as online trainers and deliver instruction via e-learning. The target audience of this paper is teachers/trainers in colleges/Universities and in Vocational Educational training organizations (VET) organizations and, in general, organizations that offer, as a part of their business or for internal use, training services.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "A multifaceted students’ performance assessment framework for motion-based game-making projects with scratch",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2019.1669876",
            "Abstract": "In the last few years, engaging students to create digital games has been a pole of attraction for many teachers and researchers, resulting in highly positive learning experiences and promoting their thinking skills, e.g., programming and computational thinking (CT) skills. Researchers have already stated about the need for further research not only around the evaluation techniques and tools of the quality of these complex educational interventions, but mainly about ways to ease the assessment of students’ performance from multiple perspectives with authenticity. This paper contributes to proposing a multifaceted assessment framework of the degree of students’ acquisition of multiple skills, when they get involved in digital motion-based touchless game-making course-projects with the MIT Scratch tool. The results of its implementation during a pilot study with computer science undergraduate students, which are …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:anf4URPfarAC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Educational innovation with learning networks: Tools and developments.",
            "Publication year": 2012,
            "Publication url": "http://www.jucs.org/jucs_18_1/educational_innovation_with_learning/jucs_18_01_0044_0061_sloep.pdf",
            "Abstract": "Professional Development is ill served by traditional ways of learning. It can profit from a Learning Networks approach, which emphasizes logistic, content and didactic flexibility. Learning Networks are online, social networks that have been designed and tooled to foster informal learning. Three European projects are discussed–idSpace, LTfLL, Handover-which have developed tools befitting networked learning. Each in its own way, the projects illustrate the benefits of a networked learning approach. This goes for all three flexibilities but in particular for the need to be didactically flexible. Finally, it is argued that formal education could profit from the tools discussed.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning, technology and design",
            "Publication year": 2010,
            "Publication url": "https://brill.com/downloadpdf/book/edcoll/9789460910623/BP000002.pdf",
            "Abstract": "This chapter provides an orientation to the key themes of the book, as well as an overview of the individual contributions. We introduce and develop a number of ideas that underpin the coherence of the collection. Learning is, of course, at the centre of our concerns–supporting other people’s learning is the point of our enterprise. But we approach this indirectly. The book itself is about how people who are professionally engaged in supporting other people’s learning can share their experiences. To bring extra focus to the book, we are specially concerned with situations in which technology is also being used to help people learn. The umbrella term we are using for this is ‘technology-enhanced learning’or TEL, but other terms, such as computer-assisted instruction (CAI), computer-aided learning (CAL), networked/online learning and e-learning carry similar connotations. Using technology to help other people learn …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:N5tVd3kTz84C",
            "Publisher": "Brill Sense"
        },
        {
            "Title": "Creating personalised quizzes both to the learner and to the access device characteristics: the Case of CosyQTI",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.98.5046&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present CosyQTI, a tool for authoring adaptive assessments, which gives the educator/author significant flexibility in terms of the adaptation that s/he can incorporate in the assessments s/he builds. The assessments can be accessed via a variety of access devices including desktop and handheld ones. We illustrate the architecture of the CosyQTI tool and advocating that the tool fully conforms to the IMS_QTI and web standard, serving the goal of interoperability.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formal discussion summaries",
            "Publication year": 2005,
            "Publication url": "https://search.proquest.com/openview/25d804c5aa549f1e4cc507bc8b7b68d0/1.pdf?pq-origsite=gscholar&cbl=1586335",
            "Abstract": "ISSN 1436-4522.© International Forum of Educational Technology & Society (IFETS). The authors and the forum jointly retain the copyright of the articles.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CSCL scripting patterns: hierarchical relationships and applicability",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1652452/",
            "Abstract": "The use of patterns in e-learning is being recently proposed with different purposes and scopes. This paper provides a unifying view of several representative proposals in order to situate and introduce the types of patterns that can be used for generating collaboration scripts that are suitable of being computationally represented and interpreted by learning management systems (LMSs). The paper also presents a hierarchical structure that relates these patterns according to their focus and granularity. The structure shows how the different types of patterns are complementary and should be considered in the process of creating a script. In addition to authoring tools and LMSs, there are other types of tools in which the application of patterns may be useful. This paper points out these tools locating them along the \"life cycle\" of the scripts",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modelling web-based instructional systems",
            "Publication year": 2002,
            "Publication url": "https://www.learntechlib.org/p/111585/",
            "Abstract": "The size and complexity of modern instructional systems, which are based on the World Wide Web, bring about great intricacy in their crafting, as there is not enough knowledge or experience in this field. This imposes the use of new instructional design models in order to achieve risk-mitigation, cost and time efficiency, high pedagogical quality of the end product, which will capitalise on the potential of the networked technologies. This paper presents a model for constructing such systems, using a problem solving approach that defines the solution of an instructional problem in both a pedagogical and a technical manner in a holistic view. This model tries to standardise the development of such systems supporting reusability at the design as well as the implementation level. The pedagogical or non-technical solution is comprised of five interconnected sets of learning elements: the learning objectives, the didactic …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Informing Science Institute"
        },
        {
            "Title": "DEPTH: A Methodology for Usability Evaluation of Web Sites Based on Design Patterns and Heuristics Criteria.",
            "Publication year": 2004,
            "Publication url": "https://www.pst.ifi.lmu.de/~baumeist/icwe/ws/ws1/DEPTH_2004_ACM_Format.pdf",
            "Abstract": "This paper presents DEPTH (usability evaluation based on DEsign PaTterns & Heuristics criteria) a methodology for performing scenario-based heuristic usability evaluation of Web sites. It is comprised of two operational phases, the preparatory and the execution phase, where specific steps are performed for evaluating the usability along three axis: usability comparison tests among similar Web sites, expert/heuristic evaluation, scenario-based user inspection/enquiry sessions. DEPTH’s innovation lies on the use of usability design patterns both as a mean for identifying best practices of usability design as well as for specifying the scenarios and tasks for user inspection. It is also a method for capturing, adapting and refining usability resources of a Web site. DEPTH is also supported by a CASE tool whose functionality is described. Finally, we present a small example demonstrating the basic steps of DEPTH.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Εργαλεία Αξιολόγησης ενσωματωμένα στην πλατφόρμα του Moodle",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/bitstream/11419/239/1/chapter_8.pdf",
            "Abstract": "Ο κύριος σκοπός του κεφαλαίου είναι να παρουσιάσει αναλυτικά τις δυνατότητες των προηγμένων εργαλείων αξιολόγησης και αποτίμησης, με βαθμολογία του Συστήματος Διαχείρισης Μάθησης Moodle. Στο πλαίσιο του κεφαλαίου, θα αναλυθεί ο τρόπος χρήσης των εργαλείων και τα παιδαγωγικά οφέλη που απορρέουν από τη χρήση τους στην καθημερινή παιδαγωγική πρακτική.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:GtLg2Ama23sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engineering e-learning systems(ELS)",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4341891273912933494&hl=en&oi=scholarr",
            "Abstract": "not available.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling learning technology systems as business systems",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10270-003-0022-1.pdf",
            "Abstract": "The design of Learning Technology Systems, and the Software Systems that support them, is largely conducted on an intuitive, ad hoc basis, thus resulting in inefficient systems that defectively support the learning process. There is now justifiable, increasing effort in formalizing the engineering of Learning Technology Systems in order to achieve better learning effectiveness as well as development efficiency. This paper presents such an approach for designing Learning Technology Systems and their most popular specialization, the Web-based Learning Systems, by modeling them as business systems, using business-modeling methods. The aim is to provide an in-depth analysis and comprehension of the Learning Technology Systems and Web-based Learning Systems’ domain, that can be used for improving the systems themselves, as well as for building the supporting software systems. Our work is …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Enriched assessment rubrics: a new medium for enabling teachers to easily assess student’s performance when participating in complex interactive learning scenarios",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s12351-009-0047-5.pdf",
            "Abstract": "Nowadays, teachers in school practice design and apply complex interactive learning scenarios according to standardised collaborative learning strategies such as jigsaw, TPS, etc. There is a well justified and an immediate need to help teachers to easily assess student’s performance. The assessment process in such complex educational scenarios is not a trivial issue since teachers have to combine data gathered during student’s individual performance along with the data which has been gathered throughout group collaboration-activities. Effective means of facilitating the assessment task is the use of rubrics as well as the interaction analysis indicators. This paper has proposed the idea of enriching the traditional assessment rubrics with indicators that measure the students’ performance in computer supported synchronous or asynchronous collaborative activities. Thus in this paper we propose a new …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Using embodied learning technology to advance motor performance of children with special educational needs and motor impairments",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-66610-5_9",
            "Abstract": "Embodied learning, under the lens of Embodied Cognition theory, emphasizes on the inseparable link between brain, body and the world; it considers that the active human body can alter the function of the brain and therefore the cognitive process. From this perspective, the exploration of learning environments that promote bodily activity in relation to cognitive tasks are gaining the attention of the research community in the recent days. One such case is the use of multimodal, motion-based games mediated by sensors like a Kinect camera to enable learning through active and embodied interaction with learning content. This paper presents findings from an empirical investigation of using embodied touchless interactive games to enhance motor performance for children with learning disabilities and motor impairments. Young children, mainly attending special units within mainstream elementary schools …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards a pattern language for adaptive web-based educational systems",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1078.1464&rep=rep1&type=pdf",
            "Abstract": "Adaptive Web-based Educational Systems represent an emerging technology that provides a unique advantage over traditional Web-based Educational Systems; that is the ability to adapt to the user's needs, goals, preferences etc. Adaptive Web-based Educational Systems are increasingly becoming part of the mainstream education, yet there does not exist a disciplined way of designing them-most of the development is ad-hoc. This paper aims to fill this void, which is the absence of disciplined design, by recording the expertise of existing Adaptive Web-based Educational Systems in the form of design patterns. We present a categorization of the patterns according to an established paradigm in Adaptive Hypermedia and we provide three exemplary patterns.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adult Distance Education and Training Centre (ADETC)'s e-Learning Model",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Constantinos-Tsamadias/publication/268176738_Adult_Distance_Education_and_Training_Centre_ADETC%27s_e-Learning_Model/links/54e2e6c30cf2c3e7d2d4dfd2/Adult-Distance-Education-and-Training-Centre-ADETCs-e-Learning-Model.pdf",
            "Abstract": "The Adult Distance Education and Training Centre (ADETC) of the General Secretariat for Adult Education (GSAE) has been established in order to reach more target groups of learners and to promote the principle of lifelong e-learning, especially in the periphery of Greece. Courses and Programs are designed having in mind the idea to give students the flexibility to study wherever they want, in their homes and workplaces. Teaching and learning are delivered with the use of Information and Communication Technologies after careful design and by focusing on the value they add to the learning process. In this paper, ADETC’s e-learning model is described, as well its first deployment.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "LAe-R: A new learning analytics tool in Moodle for assessing students’ performance",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Katerina-Kasimatis-2/publication/287297028_LAe-R_A_new_learning_analytics_tool_in_moodle_for_assessing_students'_performance/links/5fe330b8299bf1408837a2be/LAe-R-A-new-learning-analytics-tool-in-moodle-for-assessing-students-performance.pdf",
            "Abstract": "A challenging and demanding task for the teachers in e-learning environments is the assessment of students’ performance. Several learning management systems (LMS) like Moodle offer several assessment tools such as quizzes, scales,“classic” rubrics, etc. In this paper, we present a new cloud based assessment tool, called Learning Analytics Enriched Rubric (LAe-R) which is seamlessly integrated into Moodle. LAe-R is based on the concept of the “enriched rubrics”, which is becoming a popular assessment technique in education. This technique is a blend of marking criteria and grading levels of a “classic/traditional” rubric and performance indicators stemmed from analysis of learners’ interaction and learning behavior in a LMS based e-learning environment. Finally, in this paper we present the findings of a case study scenario showed that LAe-R is a very usable tool and is highly appreciated by teachers and students.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Orchestrating learning activities using the CADMOS learning design tool",
            "Publication year": 2013,
            "Publication url": "https://journal.alt.ac.uk/index.php/rlt/article/view/1293",
            "Abstract": "This paper gives an overview of CADMOS (CoursewAre Development Methodology for Open instructional Systems), a graphical IMS-LD Level A & B compliant learning design (LD) tool, which promotes the concept of “separation of concerns” during the design process, via the creation of two models: the conceptual model, which describes the learning activities and the corresponding learning resources, and the flow model, which describes the orchestration of these activities. According to the feedback from an evaluation case study with 36 participants, reported in this paper, CADMOS is a user-friendly tool that allows educational practitioners to design flows of learning activities using a layered approach.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing and orchestrating the classroom experience for technology-enhanced embodied learning",
            "Publication year": 2020,
            "Publication url": "https://45.55.127.102/handle/1/6297",
            "Abstract": "The concepts of embodiment and embodied learning, deeply rooted in theories of embodied cognition, are gaining traction in the field of education. New and affordable educational technologies (e.g., motion-based technologies, AR, VR) enable researchers and practitioners to include more gestures and body movements into their learning designs. Yet, while technology-enhanced embodied learning shows positive results during controlled trials in laboratory settings or one-to-one interventions in special classrooms or units, findings are dissimilar when relevant implementations are conducted in mainstream school classrooms. This paper presents the first stage of a design-based research study aiming at implementing an orchestration strategy for technology-enhanced embodied learning, guided by an already published conceptual framework on classroom orchestration. With this study we aim to spark the dialog on classroom orchestration strategies for the successful enactment of technology-enhanced embodied learning in the classroom, highlighting the essential need to consider learning design as it is not a simple process to shift laboratory success to real world learning.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:mlAyqtXpCwEC",
            "Publisher": "International Society of the Learning Sciences (ISLS)"
        },
        {
            "Title": "The Impact of a Greek Governmental Initiative Towards Lifelong e-Learning",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/George-Korres-3/publication/237469913_The_Impact_of_a_Greek_Governmental_Initiative_Towards_Lifelong_e-Learning/links/5661ccf108ae4931cd5bb68c/The-Impact-of-a-Greek-Governmental-Initiative-Towards-Lifelong-e-Learning.pdf",
            "Abstract": "Nowadays, several national and international policies are happening to promote lifelong learning practices. These policies can lead to quantifiable outcomes such as employability, human resource development, and digital literacy. Greece is trying to create the foundations for fostering sustainable and viable lifelong learning initiatives. Thus, during the last years, there is a continuous increase of public and private investments in lifelong learning in Greece. The aim of this paper is to illustrate one of the key actions of the Greek Ministry of Education towards the increase of lifelong e-learning opportunities in Greece as well as the future plans which will be correlated to the European directives. The ultimate goal is to highlight what has been achieved so far and which direction to help improve the quality, attractiveness and accessibility of the opportunities for lifelong learning in Greece.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating undergraduate students' attitudes on the use of the networked technology",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=11171408031927846462&hl=en&oi=scholarr",
            "Abstract": "In most evaluation studies, the question in focus concerns the comparative effectiveness of various types of web based learning systems to traditional ones rather than the innovation of the delivery model itself and the factors, which may contribute to its effectiveness. With this paper we are presenting an evaluation study which follows a specific summative evaluation method attempting to define clearly why the evaluation is being performed, what is being evaluated, when it will be performed, how it will be performed, and what was learned. This stepwise evaluation method is supported by specially developed pre-test and post-test questionnaires, which provide data for both quantitative and qualitative analysis. The focus of this evaluation is on the learning effectiveness of the course and its instructional model as well as the identification of extensions and revisions needed to be made.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:hkOj_22Ku90C",
            "Publisher": "Rapid Intellect Group, Inc."
        },
        {
            "Title": "Orchestrating learning activities with CADMOS: from the design to the enactment",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=13656380789878877516&hl=en&oi=scholarr",
            "Abstract": "This paper discusses how the CADMOS learning design tool can help in bridging the gap between designing and enacting of a learning script. CADMOS is a graphical tool that allows a practitioner to easily create a learning script that could be deployed in a Moodle platform.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CSCL scenarios:= A cocktail of CLFPs",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.232.8088&rep=rep1&type=pdf#page=34",
            "Abstract": "Collaborative Flow Design Patterns are used to describe CSCL scenarios and strategies known as best practices. However, very often there is a need to make effective blending of strategies. Here, we describe a proposal of adding an extra element called “variations” that includes all proposals related to the presented solution and we show our proposal by setting the example of a complex CSCL strategy.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analyze me: open learner model in an adaptive web testing system",
            "Publication year": 2007,
            "Publication url": "https://content.iospress.com/articles/international-journal-of-artificial-intelligence-in-education/jai17-3-03",
            "Abstract": "This paper presents the open learner modelling capabilities offered by an adaptive web testing tool. Adaptation decisions are based on user customizable compound rules requiring the identification of several learner characteristics which are then displayed graphically and textually to learners and educators. The open learner modelling capabilities include anonymous access to models of peers and restricted named access to friend peers. Opening the learner profiles supports learner and educator involvement in decision making so as to create a more credible learner model. The educational advantages of the open learner modelling capabilities are discussed on the basis of an evaluative study.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A groupware system for supporting collaborative creativity",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=11429863040529131159&hl=en&oi=scholarr",
            "Abstract": "• A submitted manuscript is the version of the article upon submission and before peer-review. There can be important differences between the submitted version and the official published version of record. People interested in the research are advised to contact the author for the final version of the publication, or visit the DOI to the publisher's website.• The final author version and the galley proof are versions of the publication after peer review.• The final published version features the final layout of the paper including the volume, issue and page numbers.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:4vMrXwiscB8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "State of the Art on Current Practices in the Education and Training of Teachers in Southern Europe-The Case of Cyprus, Greece, Italy and Spain.",
            "Publication year": 2019,
            "Publication url": "https://eric.ed.gov/?id=ED607663",
            "Abstract": "The present report provides an overview of current practices on teacher training, and how teacher training covers the needs of students with disabilities under the paradigm of inclusive education. The report aims at analysing the situation in the Southern Europe, namely presenting the cases of Cyprus, Greece, Italy and Spain. After a general overview of the gradual change in the provision of special education services into the mainstream educational system at an international level, this report presents the analysis of teacher training/teacher preparation in Cyprus, Greece, Italy and Spain. It describes the context of teachers’ education and provides an overview of the most frequently assessed types of disabilities that are reported in each country. Then, a review of the main teacher training providers is presented, together with a final statement about possibilities of providing teacher training/teacher preparation in the respective counties. The report should be of interest to the educational community, particularly researchers and practitioners in inclusive education and teacher preparation.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:OTTXONDVkokC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web engineering: new discipline, new educational challenges",
            "Publication year": 2000,
            "Publication url": "https://content.iospress.com/articles/information-services-and-use/isu293",
            "Abstract": "The WWW has turned into a development and run-time environment for large-scale and complex applications. Such sophisticated applications are being deployed in increasing numbers without having been developed according to appropriate methodologies and quality standards. The main reason for this ad hoc development philosophy is the lack of specialised training/education on the web engineering subject domain. This domain/discipline is new, still immature and has recently started getting the attention of researchers, developers, and other major players in the web-based application development market and training market. There is now justifiable and increasing concern about the manner in which students and lifelong learners are well educated and trained in this new discipline. It’s also only one year ago that few universities have started providing special courses on this discipline and offer seminars to …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "idSpace D6. 1–Dissemination Plan",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11620468306044149150&hl=en&oi=scholarr",
            "Abstract": "The aim of this document is to specify and explain the steps the idSpace project team will take to ensure effective and efficient dissemination. The document comprises four main sections. Section 1 provides an overview of the aims and approach being proposed by the idSpace project. Section 2 analyses the various target audiences towards whom the project’s dissemination effort is geared. Section 3 summarises the main goals for the dissemination effort. Section 4 presents a plan for achieving each of these goals: identifying the main dissemination actions and dissemination products and outlining a schedule for the dissemination activities.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A model for interoperability in computer supported collaborative learning",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1652363/",
            "Abstract": "Computer supported collaborative learning activities involve combination of complex software tools that often need to interoperate in a wider context of learning. This paper proposes a data model that accommodates requirements of typical collaborative learning situations and facilitates interoperability of tools and interchange of products of collaboration and evaluation data. The model has been tested against various typical tools used for both synchronous and asynchronous collaboration of groups of students",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:Mojj43d5GZwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic description of educational adaptive hypermedia based on a conceptual model",
            "Publication year": 2004,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.7.4.129.pdf",
            "Abstract": "The role of conceptual modeling in Educational Adaptive Hypermedia Applications (EAHA) is especially important. Α conceptual model of an educational application depicts the instruc-tional solution that is implemented, containing information about concepts that must be ac-quired by learners, tasks in which learners must be involved and resources that will be used. The importance of such a model is multifold. It formally depicts the outcomes of instructional analysis, drives the development of actual applications and provides the information basis for automatic application generation in the context of Adaptive and Intelligent Tutoring Systems. In this paper we begin by describing a method for designing EAHA. Our method uses UML as the modeling language and defines the design process in three distinct steps. We propose an RDF encoding of the Conceptual Model, which is the outcome of the first step, following a …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:qjMakFHDy7sC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Building a tool to help teachers analyse learners’ interactions in a networked learning environment",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2010.518815",
            "Abstract": "Educators participating in networked learning communities have very little support from integrated tools in evaluating students’ learning activities flow and examining learners’ online behaviour. There is a need for non‐intrusive ways to monitor learners’ progress in order better to follow their learning process and appraise the online course effectiveness. This paper presents a conceptual framework and an innovative tool, called LMSAnalytics, that allows teachers and evaluators easily to track the learners’ online behaviour, make judgments about learners’ activity flow and gain a better insight about the knowledge constructed and skills acquired in a networked learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:WbkHhVStYXYC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Usable and interoperable e-learning resources repositories",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/interactive-multimedia-education-training/24544",
            "Abstract": "The Web puts a huge number of learning resources within reach of anyone with Internet access. In many cases, these valuable resources are difficult for most users to find in an efficient and effective manner. What makes an e-learning resources repository much more than a portal is the ability to discover a learning object and put it to a new use. The purpose of an e-learning resources repository is not simply safe storage and delivery but the ability of their administration, in terms of updating, identifying, utilizing, sharing and re-using them, which remains a great challenge. Moreover, the various repositories are either closed systems or systems that allow user access only through proprietary interfaces and data formats. In brief, there is lack of interoperability. The aim of this chapter is to present the requirements of an ideal e-learning resources repository that will provide services for covering the aforementioned critical …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:e_rmSamDkqQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards a generic conceptual design meta-model for web-based educational applications",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.106.3278&rep=rep1&type=pdf",
            "Abstract": "The WWW has turned into a development and run-time environment for large-scale and complex applications among which are the educational applications. There are now justifiable research and development efforts that attempt to formalize the engineering process of such applications in order to achieve better learning effectiveness as well as development efficiency. A lot of work has been done in the field of the instructional designing rather than on hypermedia designing of such applications. Most of the design methods that have been used are general purpose hypermedia design methods which do not allow much in either the conformance of the design models to the latest learning technology standards, or in their seamless translation to standard data formats. This paper presents an attempt for facilitating the conceptual design of web-based educational application by meta-modelling their underlying content and navigational structure. This work is based upon and also extends the OOHDM principles. The Unified Modeling Language (UML) serves the purpose of notation syntax and semantics for this meta-model. The theoretical analysis of the model is accompanied by relevant examples.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Combining streaming media and collaborative elements to support lifelong learning",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04001-6_2",
            "Abstract": "This chapter presents the educational value of streaming media combined with asynchronous collaborative learning and describes the particular characteristics and the limitations of the supporting Asynchronous Multimedia Collaborative Systems (AMCL). Then CELSIA, an innovative AMCL system, is described as an example of new trends in AMCL systems that come to address the limitations of the current systems and to enhance the educational value of streaming media!",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Learner’s Mirror-Designing a User Modelling Component in Adaptive Hypermedia Educational Systems",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.562.5470",
            "Abstract": "Adaptive Hypermedia Educational Systems, AHES, represent an emerging technology that provides a unique advantage over traditional Web-based Educational Systems; that is the ability to adapt to the user's needs, goals, preferences etc. These systems are increasingly becoming part of mainstream education, yet there does not exist a disciplined way of designing them-most of the development is ad-hoc. This paper aims to fill this void, which is the absence of disciplined design, by recording the expertise of existing Adaptive Hypermedia Educational Systems in the form of design patterns. In this paper we present three of these patterns: User Model Definition, User Model Initialisation and User Model Maintenance, as well as a more complete organization map that illustrates the entire pattern language based on the patterns’ relations.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ρουμπρίκες Αξιολόγησης (Rubrics Assessment) της Επίδοσης των Εκπαιδευομένων",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/bitstream/11419/231/1/chapter_5.pdf",
            "Abstract": "Οι «Ρουμπρίκες Αξιολόγησης» αποτελούν μια ιδιαίτερα δυναμική και καινοτόμα τεχνική αξιολόγησης της επίδοσης των εκπαιδευομένων που χρησιμοποιούνται ευρέως από τους εκπαιδευτικούς, τόσο στη διεθνή όσο και στην ελληνική εκπαιδευτική πρακτική (Andrade, 2000· Arter & McTighe, 2001· Arter & Chappuis, 2009· Buzetto-More & Alade, 2006· Jonsson & Svingby, 2007· Κοσμοπούλου κ. ά., 2010· Petkov & Petkova, 2006· Πετροπούλου κ. ά., 2008· Σοφός & Λιάπη, 2007· ΥΠΕΠΘ-KEE, 1998· 1999· ΥΠΕΠΘ-ΠΙ, 2002· 2004· 2007· Wren, 2009· ΠΔ 152, ΦΕΚ, 240-5/11/2013). Η «ρουμπρίκα» αντιστοιχεί στη διεθνή βιβλιογραφία με τον όρο rubric assessment, ενώ στην ελληνική συναντάται επίσης με τοv όρο κλίμακα διαβαθμισμένων κριτηρίων (Κουλουμπαρίτση & Ματσαγγούρας, 2004).Η ρουμπρίκα αξιολόγησης (assessment rubric) τυπικά ορίζεται ως περιγραφικός οδηγός βαθμολογίας, ο οποίος αποτελείται από ειδικά εκ των προτέρων καθορισμένα κριτήρια απόδοσης (Allen & Tanner 2006· Andrade, 2000· Andrade & Valtcheva, 2008· Jonsonn & Svingby, 2007· Mertler, 2001· Stevens & Levi, 2005). Δομικά στοιχεία της ρουμπρίκας αξιολόγησης αποτελούν:",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:9pM33mqn1YgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network-based business simulation activities in technical professional education",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1076/ilee.11.3.169.16544",
            "Abstract": "For a long time on-the-job training has been considered as the single point of contact of technical education with the real world job market. Indeed, traditional on-the-job training activities are of great educational value and complement uniquely any classroom-based learning activity. However, it has been observed that several obstacles arise when integrating on-the-job training with traditional learning and that new network-based tools can be used to improve the situation. Following this concept, in this paper we introduce a network-assisted educational structure for business simulation activities which can be considered as an alternative or a complement to on-the-job training activities in technical professional education. Business Simulation Activities are based on the execution of business scenarios in a controlled educational environment with support by network tools. A simulation of the real world business …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:4TOpqqG69KYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Enhancing primary school children collaborative learning experiences in maths via a 3D virtual environment",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-012-9198-8",
            "Abstract": "Over the last years there has been a growing use of 3D virtual environments for educational purposes. Many studies advocate the integration of these environments in the daily teaching practice of various subjects. This requires innovative design in order create the appropriate affective/ pedagogical conditions as well as the development and use of well-structured activities in order to achieve effective collaborative learning. This paper presents an exploratory study in which collaborative learning strategies and cognitive apprenticeship models act as the pedagogical framework to facilitate learning and collaboration. The context is the teaching of mathematics in primary education via a 3D virtual environment. Specifically, we focus on evaluating students’ engagement (behavioral, affective and cognitive) in the collaborative learning process as they learn fractional concepts in a meaningful way. The findings …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A new approach to collaborative creativity support of new product designers",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWBC.2011.042992",
            "Abstract": "Effective collaborative creativity is crucial to contemporary professionals who have to continuously produce innovative products and services. The technological nature and complexity of the innovations require team work, among specialists from different disciplines. Often these teams work in a distributed fashion, across boundaries of time and place. Therefore, they need electronic ‘spaces’ that support (‘afford’) their creative collaboration. Co-creativity support is not only a matter of making appropriate groupware spaces available but also of providing concurrent support in all these dimensions. These considerations inspired the development of the idSpace platform. idSpace is a collaboration platform integrating a variety of creativity tools with pedagogy-based guidance. It aims to optimise both the use of creativity techniques themselves and of the supporting processes of team collaboration and knowledge creation …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Empowering children with ADHD learning disabilities with the Kinems Kinect learning games",
            "Publication year": 2014,
            "Publication url": "https://search.proquest.com/openview/3f37f7726ce449193d86544a71ab38ac/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "The recent trend in digital games is tightly linked to the natural user interaction technologies that make use of the affordances of sensors like the Microsoft Kinect camera. The Kinect camera detects user's body movements and gestures, which means that the full body becomes the controller. Lately, there is a tremendous interest in developing Kinect educational games. In this paper, we present the innovative Kinems learning games which have been developed for helping children with learning disabilities such as autism, dyspraxia and ADHD improve their skills. The paper contains the outcomes of a recent study, which was to investigate and measure the Kinems learning effectiveness. The research hypotheses were examined through an educational intervention that lasted about one month and was implemented with 11 children with ADHD of 4-8 years old. The study was conducted at the premises of the ADHD …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:NJ774b8OgUMC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Proceedings of the Workshop on Methods & Tools for Computer Supported Collaborative Creativity Process: Linking creativity & informal learning",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=17035438006929664535&hl=en&oi=scholarr",
            "Abstract": "Creativity is best described as the human capacity regularly to solve problems in a way that is initially novel but ultimately acceptable in a culture [1]. Creativity process is an intense collaborative process of generating and exploring ideas meant to contribute to innovative solution of particular problems. During this process, team members go through cycles of divergence, in which new ideas are generated and explored, and convergence, in which new ideas are valued and detailed. Innovators need appropriate methods and supportive tools to generate ideas, reuse them, take them apart, criticise them, or even reject them. Empowering team members to personalise their creativity process in a supportive computer-based collaborative environment of peer assistance, reflection and critique and in interaction with experts and domain specialists can lead also to effective informal learning activities.Networked technologies …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Learner's Mirror.",
            "Publication year": 2004,
            "Publication url": "https://core.ac.uk/download/pdf/232380359.pdf",
            "Abstract": "Adaptive Hypermedia Educational Systems, AHES, represent an emerging technology that provides a unique advantage over traditional Web-based Educational Systems; that is the ability to adapt to the user's needs, goals, preferences etc. These systems are increasingly becoming part of mainstream education, yet there does not exist a disciplined way of designing them-most of the development is ad-hoc.This paper aims to fill this void, which is the absence of disciplined design, by recording the expertise of existing Adaptive Hypermedia Educational Systems in the form of design patterns. In this paper we present three of these patterns: User Model Definition, User Model Initialisation and User Model Maintenance, as well as a more complete organization map that illustrates the entire pattern language based on the patterns’ relations.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation in e-learning",
            "Publication year": 2012,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54889",
            "Abstract": "The aim of this study was to develop an instrument to evaluate the knowledge of preschool children about healthy lifestyle behavior. The innovation was that the instrument was designed to get direct evidence about healthy...",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Nova Science Publishers"
        },
        {
            "Title": "Using sensing technologies to explain children's self-representation in motion-based educational games",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3392063.3394419",
            "Abstract": "Motion-Based Touchless Games (MBTG) are being investigated as a promising interaction paradigm in children's learning experiences. Within these games, children's digital persona (ie, avatar), enables them to efficiently communicate their motion-based interactivity. However, the role of children's Avatar Self-Representation (ASR) in educational MBTG is rather under-explored. We present an in-situ within subjects study where 46 children, aged 8--12, played three MBTG with different ASRs. Each avatar had varying visual similarity and movement congruity (synchronisation of movement in digital and physical spaces) to the child. We automatically and continuously monitored children's experiences using sensing technology (eye-trackers, facial video, wristband data, and Kinect skeleton data). This allowed us to understand how children experience the different ASRs, by providing insights into their affective and …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating e-travel sites with the use of design patterns",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/43010071/A_077-086_Georgiakakis.pdf",
            "Abstract": "This paper presents an innovative expert usability evaluation method called DEPTH (usability evaluation method based on DEsign PaTterns & Heuristics criteria). DEPTH is a method for performing expert-based scenario driven heuristic usability evaluation of e-sites. DEPTH focuses on the functionality of e-sites and emphasizes on usability characteristics within their context. This can be done not only by examining the availability of functionality of an e-site but also the usability performance of the supported functionality according to specific context related usage scenarios. Scenario driven expert based usability evaluation/inspection is resource demanding. Moreover, it is not easy to find usability experts for specific types/genres of e-sites. Thus, the main motivational idea for proposing DEPTH have been: i) to minimize the preparatory phase of a usability evaluation process by re-using inspection scenarios and ii) to assist a novice usability evaluator (one who is not necessarily familiar with the genre of the e-site) by showing best design practices. Thus, DEPTH proposes the (re) use of expert’s knowledge captured in design patterns. This paper briefly describes the DEPTH method and presents findings from applying it to a usability evaluation study of e-travel sites.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing an Architecture for the Software Subsystem of a Learning Technology System-An Engineering Approach",
            "Publication year": 2001,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/34260",
            "Abstract": "Developing an Architecture for the Software Subsystem of a Learning Technology System - An \nEngineering Approach Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → \nΔημοσιεύσεις μελών ΔΕΠσε συνέδρια → Εμφάνιση Τεκμηρίου HEAL DSpace Developing an \nArchitecture for the Software Subsystem of a Learning Technology System - An Engineering \nApproach Αποθετήριο DSpace/Manakin Developing an Architecture for the Software Subsystem \nof a Learning Technology System - An Engineering Approach Retalis, S; Papasalouros, A; \nSkordalakis, M URI: http://hdl.handle.net/123456789/34260 Ημερομηνία: 2001 Εμφάνιση \nπλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή Δεν \nυπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην \nακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε συνέδρια Περιήγηση Σε όλο το DSpace & / /…",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:IRz6iEL74y4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Giving more adaptation flexibility to authors of adaptive assessments",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-27780-4_47",
            "Abstract": "In this paper, we present AthenaQTI, a tool for authoring personalized assessments, which gives the author significant flexibility in terms of the adaptation that s/he can incorporate in the assessments s/he builds. We focus on presenting the functionality of the authoring environment and the tool’s conformance to the IMS- QTI specification, a fact that gives it the advantage of interoperability. Furthermore, we briefly describe the user model and the philosophy of its manipulation.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Ob-AHEM: A UML-enabled model for Adaptative Educational Hypermedia Applications",
            "Publication year": 2002,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=4544727",
            "Abstract": "The work presented in this paper is comprised of a visual design model for adaptive hypermedia educational systems that follows the principles of the object-oriented paradigm. The model is primarily originated on the Adaptive Hypermedia Applications Model (AHAM), and extends it by defining the presentation layer of a particular Hypermedia Application. The Unified Modeling Language (UML) serves the purpose of notation syntax and semantics for this model. The theoretical analysis of the model is accompanied by an case study application for the design of an adaptive web-based testing system.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Digital Education Observatory (OED)"
        },
        {
            "Title": "Analysing interaction behaviour in network supported collaborative learning environments: a holistic approach",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKL.2007.016705",
            "Abstract": "In a Network Supported Collaborative Learning (NSCL) environment, the teacher needs to be able to conduct a similar analysis and learner evaluation as in traditional settings. However, recording, analysing and interpreting learners' interactions during a NSCL process is an open research issue. This paper proposes a conceptual framework for interaction analysis which is accompanied by a set of evaluation techniques such as descriptive statistics, log file analysis and social network analysis. Our main goal is the in-depth understanding of the nature of learners' interactions within NSCL environments in order to help teachers get a holistic picture of the learning process. We applied the proposed framework in a pilot study where primary school children attended a NSCL course on Mathematics in order to augment their self-regulative problem-solving skills. The findings from this study seem promising while at the …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Design patterns for inspection-based usability evaluation of e-learning systems",
            "Publication year": 2010,
            "Publication url": "https://brill.com/downloadpdf/book/edcoll/9789460910623/BP000011.pdf",
            "Abstract": "This chapter discusses how design patterns can be used and re-used for the difficult task of evaluating the usability of e-learning systems. We describe the DEPTH method (usability evaluation based on DEsign PaTterns & Heuristics criteria)-a method for performing scenario-based heuristic usability evaluation of e-learning systems. DEPTH focuses on the functionality of e-learning systems and emphasizes usability characteristics within the e-learning context. This can be done by examining not only the functionality of an e-learning system, but also the usability performance of the supported functionality according to the specific context of use in an e-learning setting. The main underlying ideas of DEPTH are:(a) to minimize the preparatory phase of a usability evaluation process, and (b) to assist a novice usability expert (one who is not necessarily familiar with the e-learning systems). Thus, we (re) use expert …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Brill Sense"
        },
        {
            "Title": "idSpace D1. 1 State of the Art on Pedagogical Strategies",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=17091025307842461793&hl=en&oi=scholarr",
            "Abstract": "This deliverable focuses on support to enhance creativity via pedagogical strategies. It does so by influencing learning processes involved in the collaborative creation of new products. It presents an overview of the state of art regarding context factors that need to be taken into account when creating affording circumstances for creativity. And it surveys the development over time of perspectives on creativity and collaborative knowledge creation. Finally, it describes a selection of approaches to collaborative learning and working that are particularly relevant for the design of support strategies for idSpace  and are based on existing pedagogical insight.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CRITON: A hypermedia design tool",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-005-2712-x",
            "Abstract": "The WWW has turned into a development and run-time environment for large-scale and complex applications. Such sophisticated applications are being deployed in increasing numbers without having been developed according to appropriate methodologies, tools and quality standards. The reason is not only that the hypermedia industry resists to utilize formal methods, but also that these methods and corresponding tools are very few and of dubious standards. The consequence is that the hypermedia applications being developed are of poor functionality and lack qualities such as modifiability, usability and maintainability. Especially the design phase is one of the phases that lack sufficient support from methods and CASE tools. This paper presents CRITON, a cross platform tool, built to support a hypermedia design method within an integrated environment. CRITON manages all three aspects of …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:TQgYirikUcIC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Learning object metadata in a Web-based learning environment",
            "Publication year": 2000,
            "Publication url": "http://www.cs.rug.nl/paris/papers/TTLHE00lom.pdf",
            "Abstract": "The plethora and variance of learning resources embedded in modern web-based learning environments require a mechanism to enable their structured administration. This goal can be achieved by defining metadata on them and constructing a system that manages the metadata in the context of the learning environment. Both activities have to meet certain standards.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:NhqRSupF_l8C",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "Towards a pattern language for learning management systems",
            "Publication year": 2003,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.6.2.11.pdf",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to ‘re-invent the wheel’. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:u5HHmVD_uO8C",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Moving bodies to moving minds: A study of the use of motion-based games in special education",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11528-018-0294-5",
            "Abstract": "From an embodied learning perspective, the active human body can alter the function of the brain and therefore, the cognitive process. In this work, children’s activity using motion-based technology is framed as an example of embodied learning. The present investigation focuses on the use of a series of Kinect-based educational games by 31 elementary students with special educational needs in mainstream schools, during a five-month intervention study. Results based on psychometric pre-post testing in conjunction with games-usage analytics, a student attitudinal scale, teachers’ reflection notes and teacher interviews, demonstrated the positive impact of the games on children’s short-term memory skills and emotional stage. Overall, the study improves our understanding of embodied learning via motion-based technology in teaching and learning with children with special educational needs.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:hCrLmN-GePgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "From digitised comic books to digital hypermedia comic books: their use in education",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=8407583279823711501&hl=en&oi=scholarr",
            "Abstract": "The scope of this paper is to present the concept of hypermedia comic books and their added value in education. Comics were introduced as an educational medium in USA in the middle of 20th century while in Greece, which is our country in focus, fewer efforts have taken place. We believe in the strengths of comics as educational tools and so we go one step forward introducing web comics. Our team of CoSy-LLab, Computer Supported Learning Engineering Lab [http://cosy. ted. unipi. gr] has created a tool for presentation and creation of digital-web comic books, having in mind that the use of plurimedia will render teaching, through comics, more effective. Closing we will report the results of experimental teaching using comics in a postgraduate e-learning course of 22 students (the majority of them were teachers of primary or secondary schools) in University of Piraeus.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Demystifying the asynchronous network supported collaborative learning systems",
            "Publication year": 2006,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCAT.2006.009067",
            "Abstract": "In this paper, we focus on the design of Asynchronous Network-Supported Collaborative Learning (ANSCL) systems. ANSCL systems offer a variety of features. Developers need guidance for building them to be usable. Design patterns are a promising means for assisting ANSCL developers in this task. In this paper, we give an overview of the ANSCL systems functionality after having performed an expert usability evaluation study of a large set of well-known ANSCL systems. On the basis of our results, we propose a set of relevant patterns for designing usable ANSCL systems.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:XiVPGOgt02cC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Automating standards-based courseware development using UML",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Papasalouros/publication/220940782_Automating_Standards-Based_Courseware_Development_Using_UML/links/0c96053ad35f970e06000000/Automating-Standards-Based-Courseware-Development-Using-UML.pdf",
            "Abstract": "This paper describes a design method for Web-based Courseware applications. This method facilitates a design model based on the Unified Modeling Language (UML). The paper also proposes the appropriate design steps for the creation of the various products (artifacts) of this model. Courseware models can be created using either general purpose or specialized UML tools. The construction of actual courseware applications from XML descriptions of UML models is also demonstrated. The created courseware applications conform to a related Learning Technology Standard for learning material interchange, namely the IMS Content Packaging standard.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Current challenges in learning design and pedagogical patterns research",
            "Publication year": 2010,
            "Publication url": "http://www.lancaster.ac.uk/fss/organisations/netlc/past/nlc2010/abstracts/Conole.html",
            "Abstract": "This paper provides an overview of the range of representations that can be used to describe learning designs. It provides a definition for learning designs and demonstrates how the different representations can be used for different levels of granularity and to foreground different aspects of the design process.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing and enacting an inquiry based collaborative learning script using the CADMOS tool",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=3513114626289604992&hl=en&oi=scholarr",
            "Abstract": "Educators often use a learning design tool, that can help them on creating their learning scripts in a graphical way before enacting it in a learning delivery platform. The scope of this paper is to present the CADMOS learning design tool which allows educators to create learning scripts in a user friendly graphical environment and export them as Moodle lesson packages thus bridging the gap between design and enactment.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Creating adaptive e-learning board games for school settings using the ELG environment.",
            "Publication year": 2008,
            "Publication url": "http://jucs.org/jucs_14_17/creating_adaptive_elearning_board/jucs_14_17_2897_2908_retalis.pdf",
            "Abstract": "The use of digital games in education is well documented in the literature. They have been used in preschool, K-12, the university. A specific type of digital games is board games. Adding board games to the educational process can lead to an interactive stimulating learning experience. With a board game, players often learn from one another while at the same time having fun in a competitive environment. In this paper we propose the “ELG” game, an elearning board game that adopts the basic elements of a racing board game but fosters students’ creativity, problem-solving skills, and imagination as students are trying to reach the end by improving their performance in a variety of learning activities. The innovative feature of the ELG is that it offers an adaptive authoring tool that enables teachers to customize their games according to the needs, interests and motives of students. The teacher enters hierarchically …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual environments for collaborative innovation and learning",
            "Publication year": 2011,
            "Publication url": "http://www.jucs.org/jucs_17_12/virtual_environments_for_collaborative/jucs_17_12_1634_1637_editorial.pdf",
            "Abstract": "Networked technologies, especially social software applications, provide new affordances that facilitate collaborative creativity among staff members of organizations. This editorial paper gives an overview of the scope of this special issue which focuses on the design of virtual environments for collaborative innovation and learning.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SyCo: a collaborative learning tool for generating ideas in private and in public",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1551788.1551817",
            "Abstract": "In this paper a synchronous computer supported collaborative learning tool called SyCo is presented. It was designed to facilitate students in performing tasks according to the principles of various collaborative learning strategies, such as Jigsaw and eARMA. SyCo innovates because during the collaborative learning process it allows each student to have a private space to think and draw their ideas before presenting them to their peer-students in the public space. Thus, within SyCo peers can move into and out of a shared space, work privately, copy and paste parts of their own work that had been sketched in their private space in order to share them with others.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach for managing the evolution of web-based educational applications",
            "Publication year": 2004,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2004.004126",
            "Abstract": "The management of the infrastructure and content of the World Wide Web is a growing problem for the development of web-based educational applications (WbEA) and is hidden beneath the tremendous benefits of the web. Moreover, such systems undergo more frequent and quite extensive changes in their development and operational period because the client's perception (either the learner, the teacher or institutional organisation) of the complete end product is a \"moving target\". So, there is a need for a disciplined approach to managing the evolution of web-based educational applications. Such a disciplined approach as applied throughout the software engineering process is called software configuration management (SCM). This paper begins a discussion of how the development of web-based educational applications could benefit from SCM techniques and tools and proposes a model for the management …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Towards a Pattern Language for Learning Management Systems",
            "Publication year": 2003,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/26777",
            "Abstract": "Towards a Pattern Language for Learning Management Systems Αρχική Σελίδα → Κεντρική \nΒιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση \nΤεκμηρίου HEAL DSpace Towards a Pattern Language for Learning Management Systems \nΑποθετήριο DSpace/Manakin Towards a Pattern Language for Learning Management Systems \nPapasalouros, A; Retalis, S; Skordalakis, M URI: http://hdl.handle.net/123456789/26777 \nΗμερομηνία: 2003 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος \nΜορφότυπο Προβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το \nτεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά \nΠεριήγηση Σε όλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς \nΤίτλοι Θέματα Αυτή η Συλλογή Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Ο μου / ΙΑ - /- -…",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:_5tno0g5mFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of CSCL design patterns as a vehicle for effective & efficient learning designs: linking patterns to authentic educational case studies",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1599600.1599752",
            "Abstract": "The scope of this workshop is to identify the way of linking design patterns with authentic cases and thus towards a better elicitation process for patterns of various kinds, eg system oriented patterns, learning flow design patterns, subject oriented patterns. Design patterns are general repeatable well justified solutions to a commonly-occurring learning design problem. This workshop can be regarded as a live multidisciplinary forum where attendants will exchange their know-how and ideas on how to take benefit of sharing and reusing design experiences and theoretical results in different fields, and how to apply design patterns as a way for creating usable and useful interactive learning Environments more effectively.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Τεστ Αυτό-αξιολόγησης (Quiz Self-Assessment)",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/237",
            "Abstract": "Στο κεφάλαιο αυτό παρουσιάζεται αναλυτικά η προστιθέμενη παιδαγωγική αξία της Αυτό-αξιολόγησης των εκπαιδευομένων ως τεχνική αξιολόγησης της επίδοσης τους. Επιπρόσθετα στο κεφάλαιο περιλαμβάνεται ένα αντιπροσωπευτικό δείγμα των πιο δημοφιλών και εύχρηστων εργαλείων-λογισμικών τεστ αυτό-αξιολόγησης που αξιοποιούνται από τους εκπαιδευτικούς στη διεθνή εκπαιδευτική πρακτική.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessing students' performance using the learning analytics enriched rubrics",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2460296.2460335",
            "Abstract": "The assessment of students' performance in e-learning environments is a challenging and demanding task for the teachers. Focusing on this challenge, a new assessment tool, called Learning Analytics Enriched Rubric (LAe-R) is presented in this paper. LAe-R is based on the concept of assessment rubrics which is a very popular assessment technique in education. LAe-R contains\" enriched\" criteria and grading levels that are associated to data extracted from the analysis of learners' interaction and learning behavior in an e-learning environment. LAe-R has been developed as a plug-in for the Moodle learning management system. Via an example, we will show how LAe-R can be used by teachers and students.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching cultural heritage through a narrative-based game",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3414833",
            "Abstract": "Games are used in various learning situations and domains, among which is cultural heritage. Storytelling is used in games regarding cultural places, but it often takes a simple form. Thus, the authors’ aim is to investigate the possibility to communicate cultural content through a narrative-based game that can function with multiple narratives. Another core element of our design is the less exploited in serious games combination of endogenous cooperation and competition. The social dimension of our design was expressed through features of Classroom Multiplayer Presential Games (CMPGs), in respect of using a one-to-many game environment projected on a single screen, while enhancing collaborative work in small teams. After providing an overview of the game, we briefly explain how this was implemented with the use of Twine, a free authoring tool for the creation of interactive stories and text-based games …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:9c2xU6iGI7YC",
            "Publisher": "ACM"
        },
        {
            "Title": "An Architecture for Open Learning Management Systems",
            "Publication year": 2001,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/34245",
            "Abstract": "An Architecture for Open Learning Management Systems Αρχική Σελίδα → Κεντρική Βιβλιοθήκη \nΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε συνέδρια → Εμφάνιση Τεκμηρίου \nHEAL DSpace An Architecture for Open Learning Management Systems Αποθετήριο \nDSpace/Manakin An Architecture for Open Learning Management Systems Retalis, S; \nSkordalakis, M URI: http://hdl.handle.net/123456789/34245 Ημερομηνία: 2001 Εμφάνιση πλήρους \nεγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή Δεν υπάρχουν \nαρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην ακόλουθη \nσυλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε συνέδρια Περιήγηση Σε όλο το DSpace Κοινότητες & \nΣυλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Αυτή η Συλλογή Ανά Ημερομηνία \nΕκδοσης Συγγραφείς Τίτλοι Θέματα Ο Λογαριασμός μου Σύνδεση Εγγραφή Οδηγίες / Χρήσης …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:2VqYfGB8ITEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Industrial Track Session¿ Introduction",
            "Publication year": 2008,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/csmr/2008/04493333/12OmNy7QflC",
            "Abstract": "Video summarization is a challenging problem in part because knowing which part of a video is important requires prior knowledge about its main topic. We present TVSum, an unsupervised video summarization framework that uses title-based image search results to find visually important shots. We observe that a video title is often carefully chosen to be maximally descriptive of its main topic, and hence images related to the title can serve as a proxy for important visual concepts of the main topic. However, because titles are free-formed, unconstrained, and often written ambiguously, images searched using the title can contain noise (images irrelevant to video content) and variance (images of different topics). To deal with this challenge, we developed a novel co-archetypal analysis technique that learns canonical visual concepts shared between video and images, but not in either alone, by finding a joint-factorial …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Affective aspects of web museums",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/50234431/Affective_Aspects_of_Web_Museums20161110-29650-u5zpo9.pdf",
            "Abstract": "The purpose of this paper is to investigate the relationship between usability and user satisfaction in Web Museums. Web museums are websites that have specific goals to meet in terms of influencing their visitors’ experiences. A user experience study was conducted with 28 graduate students, in which in addition to the students’ opinions on the web museum’s characteristics, it was attempted to capture the satisfaction and dissatisfaction levels that resulted from visiting those web museums. These results were analyzed in order to identify correlations between users’ perceptions of web museum features and their subsequent (dis) satisfaction levels. It was concluded that most users’ emotions of (dis) satisfaction were influenced by their perceptions of colours, image quality and information organization. Furthermore, we discovered that the users’ overall opinion of the web museum was influenced by both aesthetic design and the features/functions offered. The paper concludes with a discussion on the implications of this work and provides suggestions for future research directions.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Transitory Phase to the Attainment of Self-Regulatory Skill in Mathematical Problem Solving.",
            "Publication year": 2007,
            "Publication url": "https://eric.ed.gov/?id=EJ841661",
            "Abstract": "A productive and independent learner tends to be one of the first priorities of a contemporary educational system almost all over the world. It is recognised that the capability of self-regulation exists in all human beings and this enables us to survive, evolve and improve ourselves. Researchers have indicated that self-regulation can be taught, but the period of the attainment is often long. However, a start must be made and the earlier the better. While problem solving is placed in the heart of mathematics (NCTM, 2000), it is considered to contribute to the whole thinking processes. Nevertheless, differences in mathematical problem solving ability begin to appear in Grade 1 and increase gradually throughout the formal years of schooling. These differences have already been recorded and are known as ‘novice’compared to ‘expert’differences. However, there is a period of unknown duration which raises some questions in which novices are transformed into experts. Students who pass through this period in mathematics are called ‘medium’solvers by their teacher. The present pilot study examines this period in three different environments in an effort to describe under what conditions the transformation is achieved more effectively. Additionally, the study explores the main characteristics of this category of students.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:HDshCWvjkbEC",
            "Publisher": "Australian and New Zealand Comparative and International Education Society. ANZCIES Secretariat, Curtin University, Box U1987, Perth, WA Australia"
        },
        {
            "Title": "Contemporary educational assessment with the use of educational technology",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/232",
            "Abstract": "Αναμφίβολα σήμερα στο κατώφλι του 21ου αιώνα η εκπαίδευση σε όλες τις εκφάνσεις της βρίσκεται σε μια επιταχυνόμενη πορεία μετασχηματισμού, προσπαθώντας να ανταποκριθεί στις συνεχείς και ραγδαίες μεταβολές που συντελούνται στα πλαίσια του παγκοσμιοποιημένου οικονομικού και τεχνολογικού περιβάλλοντος. Πρωτεύον μέλημα και κυρίαρχος στόχος της εκπαίδευσης στη σημερινή Κοινωνία της Μάθησης (Learning Society) αποτελεί όχι μόνο η διδασκαλία χρήσιμων και απαραίτητων γνώσεων σε κάθε γνωστικό αντικείμενο αλλά κυρίως η ανάπτυξη και η καλλιέργεια ισχυρών γνωστικών, μεταγνωστικών, κοινωνικών, και επικοινωνιακών δεξιοτήτων, που θα επιτρέψουν σε κάθε μαθητή να γίνει ένας ανεξάρτητα σκεπτόμενος και ενεργός πολίτης του 21ου αιώνα. Ένα βασικό θέμα είναι πώς μπορεί ο εκπαιδευτικός να αξιολογήσει ότι ο εκπαιδευόμενος έχει κατακτήσει τις απαιτούμενες γνώσεις και δεξιότητες; Οι Σύγχρονες Μορφές της Εκπαιδευτικής Αξιολόγησης που αξιοποιούν τις ψηφιακές τεχνολογίες αναδεικνύονται ως ένα από τα πιο δυναμικά εργαλεία που μπορούν να συμβάλλουν καθοριστικά στο να δώσουν απάντηση στο παραπάνω ερώτημα και στο να επιβεβαιώσουν ότι η αξιολόγηση μπορεί να αξιοποιηθεί για την αναβάθμιση της εκπαιδευτικής διαδικασίας. Ασφαλής επιβεβαίωση αυτού αποτελεί η ολοένα και αυξανόμενη βιβλιογραφία (βιβλίων, άρθρων σε διεθνή περιοδικά και συνέδρια) που καταγράφεται τα τελευταία χρόνια. Ωστόσο στην ελληνική βιβλιογραφία δεν υπάρχει ως σήμερα κάποιο αντίστοιχο βιβλίο που να παρουσιάζει τις Σύγχρονες Μορφές της Εκπαιδευτικής Αξιολόγησης. Το βιβλίο αυτό έρχεται να καλύψει αυτό το κενό παρουσιάζοντας …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introduction to the special issue on Web-2.0 technologies in support of team-based learning for innovation",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.chb.2014.04.031",
            "Abstract": "Introduction to the special issue on Web-2.0 technologies in support of team-based learning \nfor innovation | Computers in Human Behavior ACM Digital Library home ACM home Google, \nInc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals \nMagazines Proceedings Books SIGs Conferences People More Search ACM Digital Library \nSearchSearch Advanced Search Computers in Human Behavior Periodical Home Latest \nIssue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsComputers \nin Human BehaviorVol. , No. CIntroduction to the special issue on Web-2.0 technologies in \nsupport of team-based learning for innovation research-article Introduction to the special issue \non Web-2.0 technologies in support of team-based learning for innovation Share on Authors: \nPeter B Sloep profile image Peter B. Sloep Open Universiteit Nederland, 177, 6419 AT , .…",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Configuration management for web-based instructional systems",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.96.105&rep=rep1&type=pdf",
            "Abstract": "The design of web-based instructional systems is largely conducted on an intuitive, ad hoc basis, thus resulting in inefficient systems that do not capitalise on the strengths of networked technologies. Among these strengths, one could mention: multiple media delivery formats, synchronous and asynchronous communication and relaxation of constraints in place and time of instructional delivery. Moreover, the web-based instructional systems are inherited the growing problem hidden beneath the tremendous benefits of the World Wide Web (WWW) which is the management of the web’s infrastructure and its content. Change is inevitable when computer software is built, but the web-based systems undergo changes more often and quite extensively, in their development and operational period. Additionally, a web-based instructional system must be developed through an evolution rather than a revolution, meaning that it is not released in one “big bang” at the end of the project. This is because the client’s perception (either learner’s or teacher’s or institutional organisation’s) of the complete end product is a “moving target”. So, there is a need for a disciplined approach to managing the evolution of such systems. Such a disciplined approach that is applied throughout the software engineering process is called software configuration management (SCM). This paper begins a discussion of how the development of web-based instructional systems could benefit from SCM techniques and tools in order to achieve better learning effectiveness as well as development efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Systematic design and rapid development of motion-based touchless games for enhancing students’ thinking skills",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/256072",
            "Abstract": "During the last few years, there has been a growing interest in students getting engaged in digital game-making activities so as to enhance their thinking skills. The findings of studies that have examined the impact of such initiatives are quite positive, especially concerning the promotion of 21st century skills; however, many students seem to face difficulties in getting a deeper understanding of the game development life cycle. Additionally, students often have difficulties in meaningfully reusing and applying the concepts from various subjects, mainly mathematics and physics, into their game-making tasks or in understanding advanced programming commands while creating their games. The present study presents an innovative game-making teaching approach that suggests a series of steps for the systematic design and rapid development of motion-based touchless games, ie, games that are based on natural user interaction technologies, like the Microsoft Kinect camera. Findings from evaluation studies in two (2) secondary schools indicate that this approach can increase student motivation, strengthen their computational thinking, enhance their understanding of geometric principles and improve their social skills. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:0N-VGjzr574C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Design patterns in adaptive web-based educational systems: An overview",
            "Publication year": 2004,
            "Publication url": "http://www.softlab.ntua.gr/~retal/papers/conferences/WbE2004/AWESpatterns_overview.pdf",
            "Abstract": "Adaptive Web-based Educational Systems represent an emerging technology that provides a unique advantage over traditional Web-based Educational Systems; that is the ability to adapt to the user's needs, goals, preferences etc. Adaptive Web-based Educational Systems are increasingly becoming part of the mainstream education, yet there does not exist a disciplined way of designing them-most of the development is ad-hoc. This paper aims to fill this void, which is the absence of disciplined design, by recording the expertise of existing Adaptive Web-based Educational Systems in the form of design patterns. We present a categorization of the patterns according to an established paradigm in Adaptive Hypermedia, we examine the patterns in one of these categories and provide an exemplary pattern.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Making adaptations of CSCL scripts by analyzing learners’ online behavior",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28586-8_8",
            "Abstract": "Teachers often use flow design patterns of particular learning strategies in order to define the type of the learning and supportive tasks, their duration, their orchestration as well as the use of learning objects, tool and services needed to support the execution of these tasks. It is quite easy for teachers (even novice learning designers) to create a learning script by applying a flow design pattern. However, they often need to mix and match learning strategies in order to create customized learning scripts that are more appropriate to the learners’ preferences and the learning context in general. This task is even more challenging when such adaptations need to be made on-the-fly, i.e. during the learning process and in response to the learner’ online behavior. The aim of this paper is to discuss how the learners’ interaction data that is collected during an online learning process and analyzed using interaction …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Use of Design Patterns for Evaluating Personalisable Web-based Systems",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.493.1297&rep=rep1&type=pdf",
            "Abstract": "This paper presents a method for performing expert-based scenariodriven usability evaluation of personalisable and configurable web-based systems, based on an innovative method called DEPTH (DEsign PaTterns & Heuristics criteria). DEPTH focuses on the specificities of web-based system functionality, emphasises usability issues within the specific context of their use (eg e-learning, e-commerce, etc) and adopts the main principles of the scenario-based evaluation techniques. The main idea behind DEPTH is to minimize the preparatory phase of a usability evaluation process, and allow a novice usability expert (ie one who is not necessarily familiar with the specific genre/type of the web-based system under evaluation) to perform the usability evaluation study effectively. Towards this goal, we (re) use expert’s design knowledge captured in design patterns for the specific genre of the system under evaluation. Such use of design patterns, which are also associated with scenarios for expert’s inspection, is one of the innovative aspects of our method. In this paper we will describe an example of DEPTH’s application for evaluating adaptive web-based systems, thus clarifying the main points of the method.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How Can We Educate Students on the Web Engineering Discipline Via the Web? The NTUA's Approach",
            "Publication year": 2000,
            "Publication url": "https://research.rug.nl/files/3144776/2000ProcTTLHERetalis.pdf",
            "Abstract": "Over the last years the Web has been increasingly used as a platform for supporting the delivery of flexible and interactive hypermedia applications. However, it is admitted that the dominant approach is ad hoc development. Developers should be educated in the use of effective processes, process models, methods, tools and documentation guidelines. In few words, they should be trained on the Web Engineering discipline. The number of courses which deal with this discipline is augmenting. National Technical University of Athens (NTUA), Greece offers such a course with a main pedagogical aim to make students well aware of the advantages when following systematic hypermedia development approaches contrary to ad hoc practices. NTUA’s approach was to use open learning methods based on a Web-based instructional system. NTUA team developed the instructional system in a systematic way having challenged itself that such way can lead to pedagogically effective instructional delivery and to learning material fo high quality. The evaluation results showed that the challenge was met. This paper presents the NTUA’s instructional approach about the web engineering discipline and the qualitative evaluation results.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "idSpace project: tools for distributed collaborative product innovation",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=3938773973183207465&hl=en&oi=scholarr",
            "Abstract": "Retalis, S., & Greller, W. (2009). idSpace project: tools for distributed collaborative product innovation. Presentation at the Edumedia conference. May, 4-5, 2009, Salzburg, Austria.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Re-evaluating the effectiveness of a web-based learning system: A comparative case study",
            "Publication year": 2003,
            "Publication url": "https://www.learntechlib.org/p/17798/",
            "Abstract": "Much is unknown about the effectiveness of networked technology in education. Although a great deal of research exists dealing with the effectiveness of various types of web-based learning systems, the focal question of most evaluation studies does not concern the innovation of the delivery model itself and the factors that contribute to its effectiveness. Moreover, there is a lack of a theoretical or conceptual framework in many existing studies. The authors applied a systematic evaluation method (called CADMOS-E), and present the quantitative and qualitative results of a re-evaluation study on the effectiveness of a web-based learning system used at the National Technical University of Athens (NTUA), Greece, over a period of three years (1998, 1999, and 2000). The system supports an introductory course in software engineering offered by the Software Engineering Laboratory of the Electrical and Computer …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Commentary by Symeon Retalis on Littlejohn, A.(2003) Reusing Online Resources, Chapter 3: Keeping the Learning in Learning Objects, by Dan Rehak and Robin Mason",
            "Publication year": 2004,
            "Publication url": "https://jime.open.ac.uk/article/view/2003-1-reuse-05/reuse-01.html/",
            "Abstract": "Recognising the fact that learning objects are still a new concept, D. Rehak and R. Mason have tackled the significant issue of how to make learning objects work in practice in a very interesting and thorough manner. They clearly state that the topic of learning objects is rather new and in an experimental phase. There is an agreement about the attributes of a learning object (reusability, accessibility, interoperability-portability, duration) within the learning technology community. However, stakeholders see the usefulness of learning objects from different optical angles: on the one hand, the training sector tends to be engaged in reuse and just-in-time/on-demand content aggregation in order to augment their market share; on the other hand universities and the learning sector in general, consider the reuse and repurposing of learning material as a big opportunity to save resources as well as to offer new (more enhanced) learning experiences.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Ubiquity Press"
        },
        {
            "Title": "Designing collaborative learning sessions that promote creative problem solving using design patterns",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Georgia-Lazakidou/publication/267804996_Designing_Collaborative_Learning_Sessions_that_Promote_Creative_Problem_Solving_Using_Design_Patterns/links/54d3a0020cf2501791826e3a/Designing-Collaborative-Learning-Sessions-that-Promote-Creative-Problem-Solving-Using-Design-Patterns.pdf",
            "Abstract": "Solving problems is considered as a very important learning activity in formal educational settings concerning all grades of education from primary to tertiary education. Students’ engagement in problem solving activities helps them to acquire not only knowledge and skills on a subject domain but also useful attitudes such as thinking, flexibility, creativity, and productivity which are very important to real life. As a result numerous problem solving models and creativity techniques, mostly collaborative ones, have been proposed for aiding students solve problems. These models specify the steps of a systematic process of solution-building for a given problem description. One main open research question is “how can students learn how to apply a problem solving model”? Research has demonstrated the potential of collaborative learning sessions for enhancing young children's cognitive development and learning. The scope of this paper is to show how collaborative learning flow patterns (CLFP) can help teachers to design effective interactive learning scenarios based on well defined strategies such as Jigsaw, TPS and others that can help students learn apply problem solving models and at the same time acquire higher-order thinking skills. It is argued that CLFPs are a designer friendly way to portray the coordination and the sequencing of tasks during the learning process as well as the rationale behind them. We will present a CLFP of a collaborative problem solving strategy called e-ARMA in an attempt to explain the added value of the use of CLFPs for designing learning sessions that foster the acquisition of creative problem solving skills.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "idSpace: Supporting Designers to develop Innovative Products",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=9653091082377545303&hl=en&oi=scholarr",
            "Abstract": "idSpace: Supporting Designers to develop Innovative Products Learning support to enhance group creativity. Presentation presenting idSpace at the start of the Workshop on Tooling of and Training for Collaborative, Distributed Product Innovation.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling learning technology systems as business systems",
            "Publication year": 2003,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/26716",
            "Abstract": "Modeling learning technology systems as business systems Αρχική Σελίδα → Κεντρική \nΒιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → \nΕμφάνιση Τεκμηρίου HEAL DSpace Modeling learning technology systems as business systems \nΑποθετήριο DSpace/Manakin Modeling learning technology systems as business systems \nRetalis, S; Papaspyrou, N URI: http://hdl.handle.net/123456789/26716 Ημερομηνία: 2003 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή \nΔεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην \nακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά Related items Showing items \nrelated by title, author, creator and subject. LEARNING OBJECT METADATA IN A WEB-BASED \nLEARNING ENVIRONMENT ﻿ Koutoumanos, A; Retalis, S; Papaspyrou, N (2000) Μελέτη και της ﻿ …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:YohjEiUPhakC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Helping educators analyse interactions within networked learning communities: A framework and the AnalyticsTool system",
            "Publication year": 2008,
            "Publication url": "http://www.lancaster.ac.uk/fss/organisations/netlc/past/nlc2008/abstracts/PDFs/Petropoulou_317-324.pdf",
            "Abstract": "Networked learning is much more ambitious than previous approaches of using technology in education. It is, therefore, more difficult to evaluate the effectiveness and efficiency of the networked learning activities. Evaluation of learners’ interactions in networked learning environments is a resource and expertise demanding task. Educators participating in networked learning communities, have very little support by integrated tools to evaluate students’ learning activities flow and identify learners’ online browsing behaviour and interactions. As a consequence, educators are in need for non-intrusive and automatic ways to become informed about learners’ progress in order to better follow their learning process and appraise the online course effectiveness. They also need specialized tools for gathering and analysing data for evaluating the learning effectiveness of networked learning instructional models. The aim of this paper is to present a conceptual framework and an innovative tool, called AnalyticsTool, which is based on this framework, that allow teacher and evaluator to easily track the learners’ online behaviour, make judgements about learners’ activity flow and have a better insight about the knowledge constructed and skills acquired in a networked learning environment. The innovation of the proposed tool is that interoperates with the Moodle learning management system and that it guides the educator perform the interaction analysis of collaborative learning scenarios that have been designed following specific learning strategies such as TPS, Jigsaw, Pyramid, etc.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "e-Learning resource brokers",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Paris-Avgeriou/publication/30496984_e-Learning_Resource_Brokers/links/0046352f9025762ed6000000/e-Learning-Resource-Brokers.pdf",
            "Abstract": "There is an exponentially increasing demand for provisioning of high-quality learning resources, which is not satisfied by current web technologies and systems. E-Learning Resource Brokers are a potential solution to this problem, as they represent the state-of-the-art in facilitating the exchange of learning resources between multiple parties. These systems currently operate at a limited scale but their use is vastly increasing, especially in the context of multi-faceted educational organizations, such as virtual universities. This paper presents some of these systems that are extensively used in the e-learning market. It then moves on to provide an overview of the ideal functionality that e-Learning Resource Brokers should provide. Finally it discusses future trends in their development, within the context of global e-learning forces.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Educational Innovation with Learning Networks: some pertinent tools and developments",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/30825291/EdTech.pdf",
            "Abstract": "Professional Development is ill served by traditional ways of learning. It can profit from a Learning Networks approach, which emphasizes logistic, content and didactic flexibility. Three European projects are discussed–idSpace, LTfLL, Handover-which have developed tools befitting networked learning. Each in its own way, the projects illustrate the benefits of a networked learning approach.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Critical Perspective on Design Patterns for E-Learning",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=507057999832542132&hl=en&oi=scholarr",
            "Abstract": "“A design pattern describes a problem which occurs over and over again in our environment, and then describes the core of the solution to that problem, in such a way that you can use this solution a million times over, without ever doing it the same way twice\"(Alexander et al., 1977). In the field of e-learning, design patterns are frequently advocated as a powerful way of providing structured, teacher-friendly, textual representations of learning designs, or of expressing the design rationale underlying learning objects. The purpose of this chapter is to look at e-learning design patterns from a critical perspective. We provide a historical, multidisciplinary excursus of the notion of design patterns. We propose a taxonomy of e-learning design patterns, providing examples in the various categories. Finally, we discuss both the benefits of design patterns for e-learning professionals (particularly, novice ones) and their drawbacks, and investigate how such pros and cons may affect the role of patterns for learning designs.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "DEPTH TOOLKIT: A Web-Based tool for designing and executing usability evaluations of E-Sites based on design patterns",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73105-4_50",
            "Abstract": "This paper presents a tool that supports a scenario based expert evaluation method called DEPTH (usability evaluation method based on DEsign PaTterns & Heuristics criteria). DEPTH is a method for performing scenario-based heuristic usability evaluation of e-systems. DEPTH focuses on the functionality of e-systems and emphasizes on usability characteristics within their context. This can be done not only by examining not only the availability of a functionality within an e-system but also the usability performance of the supported functionality according to a specific context of use. The main underlying ideas of DEPTH are: i) to minimize the preparatory phase of a usability evaluation process and ii) to assist a novice usability expert (one who is not necessarily familiar with the genre of the e-system). Thus, we (re)use expert’s knowledge captured in design patterns and structured as design pattern …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Εικονικά Πανεπιστήµια: Τάσεις, Προκλήσεις και Προβληµατισµοί",
            "Publication year": 2001,
            "Publication url": "https://research.rug.nl/en/publications/%CE%B5%CE%B9%CE%BA%CE%BF%CE%BD%CE%B9%CE%BA%CE%AC-%CF%80%CE%B1%CE%BD%CE%B5%CF%80%CE%B9%CF%83%CF%84%CE%AE%C2%B5%CE%B9%CE%B1-%CF%84%CE%AC%CF%83%CE%B5%CE%B9%CF%82-%CF%80%CF%81%CE%BF%CE%BA%CE%BB%CE%AE%CF%83%CE%B5%CE%B9%CF%82-%CE%BA%CE%B1%CE%B9-%CF%80%CF%81%CE%BF%CE%B2%CE%BB%CE%B7%C2%B5%CE%B1%CF%84%CE%B9%CF%83%C2%B5%CE%BF%CE%AF",
            "Abstract": "There are on-going efforts in accomplishing the demand from students, lifelong learners in offering an educational system which won’t impose constraints in time and place of study. One such effort is the establishment of virtual universities. The term “virtual university” has been widely used with various meanings. In this paper we aim to define this term as accurately as possible. Moreover, we intend to present the requirements and the challenges that led to their establishments as well as to make comments about the way they operate without making negative criticism but with the will of posing open questions to encourage a dialogue among researchers, educational managers and decision makers.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:umqufdRvDiIC",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "Design evaluation for air quality information portals",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Ralf-Denzer-2/publication/269166795_Environmental_Software_Systems_Volume_7_Second_Edition/links/54847f450cf283750c370758/Environmental-Software-Systems-Volume-7-Second-Edition.pdf#page=352",
            "Abstract": "Air quality information portals (AQIP) serve the need to communicate environmental information, taking into account human perception concerning (a) the content and (b) the communication channel employed. The design of such portals has not been extensively studied, and it is usually undertaken on the basis of arbitrary,“common sense” assumptions. Nevertheless, a first look in some of the existing ones, suggests that they offer information services with a high degree of similarity, in spite of their differences in architecture, technical specifications and software resources used. It is of course evident that some design decisions about the same or similar services are much better than others. Thus, there is a need for defining, developing and disseminating good design practices about air quality information portals, in order to increase the effectiveness of human-computer interaction. One way of achieving this goal is by studying design patterns for environmental portals. In the present paper, we examine the main characteristics of AQIP and we study their basic design patterns, in order o come up with a list of suggested AQIP evaluation criteria and usability best practices.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Design of AIED Systems: Learner-Centred and Design Pattern Approaches",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1563601.1563755",
            "Abstract": "The Design of AIED Systems | Proceedings of the 2007 conference on Artificial Intelligence in \nEducation: Building Technology Rich Learning Contexts That Work ACM Digital Library home \nACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced \nSearch Journals Magazines Proceedings Books SIGs Conferences People More Search ACM \nDigital Library SearchSearch Advanced Search Browse Browse Digital Library Collections \nMore HomeBrowse by TitleProceedingsProceedings of the 2007 conference on Artificial \nIntelligence in Education: Building Technology Rich Learning Contexts That WorkThe Design \nof AIED Systems: Learner-Centred and Design Pattern Approaches Article The Design of \nAIED Systems: Learner-Centred and Design Pattern Approaches Share on Authors: Vladan \nDevedzic University of Belgrade, [email protected] University of Belgrade, [email protected] , , […",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building Quality into Learning Management Systems-An Architecture-Centric Approach",
            "Publication year": 2002,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/34334",
            "Abstract": "Building Quality into Learning Management Systems - An Architecture-Centric Approach Αρχική \nΣελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε \nσυνέδρια → Εμφάνιση Τεκμηρίου HEAL DSpace Building Quality into Learning Management \nSystems - An Architecture-Centric Approach Αποθετήριο DSpace/Manakin Building Quality into \nLearning Management Systems - An Architecture-Centric Approach Retalis, S; Skordalakis, M \nURI: http://hdl.handle.net/123456789/34334 Ημερομηνία: 2002 Εμφάνιση πλήρους εγγραφής \nΑρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή Δεν υπάρχουν αρχεία που \nσχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) \nΔημοσιεύσεις μελών ΔΕΠσε συνέδρια Περιήγηση Σε όλο το DSpace Κοινότητες & Συλλογές \nΑνά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Αυτή η Συλλογή Ανά Εκδοσης Ο /…",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilising a collaborative macro-script to enhance student engagement: A mixed method study in a 3D virtual environment",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131511002090",
            "Abstract": "This study examines the effect of using an online 3D virtual environment in teaching Mathematics in Primary Education. In particular, it explores the extent to which student engagement - behavioral, affective and cognitive - is fostered by such tools in order to enhance collaborative learning.For the study we used a purpose-created 3D virtual environment and a macro-script incorporating learning tasks related to basic fractions. The study itself took place during four teaching sessions in a primary school classroom. The data collected and analyzed included chat logs, classroom observation notes and the results of pre- and post-tests.The findings indicate that the 3D virtual environment actively engages the students’ interest and leads to richer interaction between them. This in turn results in a higher level of student engagement in the collaborative learning process.We believe that 3D virtual environments provide novel …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Ο Εννοιολογικός Χάρτης (Concept Map) ως Εργαλείο Αξιολόγησης της Επίδοσης των Εκπαιδευομένων",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/handle/11419/238",
            "Abstract": "Στο κεφάλαιο αυτό παρουσιάζεται αναλυτικά πώς μπορεί να αξιοποιηθεί ο Εννοιολογικός Χάρτης από τους εκπαιδευτικούς ως δυναμική τεχνική αξιολόγησης της επίδοσης των εκπαιδευομένων. Γίνεται αναλυτική περιγραφή των πιο γνωστών εκπαιδευτικών λογισμικών (εμπλουτισμένα με πολυμεσικό υλικό) ανάπτυξης εννοιολογικών χαρτών που μπορούν να αξιοποιηθούν στην εκπαιδευτική πράξη.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Pattern Language for Learning Management Systems",
            "Publication year": 2015,
            "Publication url": "http://evidence.thinkportal.org/handle/123456789/20186",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to re-invent the wheel. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:NXb4pA-qfm4C",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Quality assurance procedures and e-ODL",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Petros-Kefalas/publication/267852731_QUALITY_ASSURANCE_PROCEDURES_AND_e-ODL/links/5476ce350cf245eb43727d8e/QUALITY-ASSURANCE-PROCEDURES-AND-e-ODL.pdf",
            "Abstract": "This paper aims to initiate preliminary discussion among researchers and practitioners on the Quality Assurance (QA) systems that are appropriate to be applied in network based Open and Distance Learning (e-ODL). We discuss the barriers, towards applying such a system and we list a number of resources for acquiring useful information on the current state of QA in e-ODL. Finally, we include a number of questions, which we believe that an institution should answer prior to apply a QA system.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Patterns for designing adaptive/adaptable educational hypermedia",
            "Publication year": 2004,
            "Publication url": "http://users.softlab.ece.ntua.gr/~retal/papers/JOURNALS/SpecialIssueAdaptive_Alexandra/Garzotto-RetalisWBE%20patterns.pdf",
            "Abstract": "A number of studies in traditional class based education show that students whose learning styles match with the instructional approach “tend to retain information longer, apply it more effectively, and have more effective post course attitudes towards the subject than do their counterparts who experience learning/teaching mismatch. Thus, the goals of a “good instructor” should be both to adapt, at some degree and at least part of the time, his or her instructional approach according to students’ learning preferences, and to help students build their skill in their preferred and less preferred learning modes. Taking for granted that in a “student-centered” hypermedia learning environment, learning preferences and design of hypermedia learning applications should be also related, this paper aims to define the structure of the hypermedia design patterns that provide solutions to the problem of how to best support learning preferences via educational hypermedia applications and more specifically via adaptive/adaptable educational hypermedia applications.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Pattern Language for Learning Management Systems (SIG 1)",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Ellen-Rusman/publication/242739950_The_production_of_e-learning_design_patterns_and_a_research_road_map_for_e-learning/links/559547fb08ae99aa62c6a896/The-production-of-e-learning-design-patterns-and-a-research-road-map-for-e-learning.pdf#page=30",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to ‘re-invent the wheel’. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Training Νovice teachers to design moodle‐based units of learning using a CADMOS‐enabled learning design sprint",
            "Publication year": 2018,
            "Publication url": "https://bera-journals.onlinelibrary.wiley.com/doi/abs/10.1111/bjet.12678",
            "Abstract": "Numerous research publications have mentioned the need to prepare teachers to design and enact technologically enhanced learning experiences for students, thus increasing their academic performance and their engagement when learning. This paper addresses the crucial issue of how to train pre‐service and novice teachers effectively to become good designers of Moodle‐based units of learning (UoLs), and to improve their critical thinking skills when engaging in peer‐review sessions. A teacher training professional development approach for teachers that requires trainees to elicit, depict, reflect on, share design ideas, and co‐create small UoLs in a Moodle learning management system is proposed. The training process follows the phases of the Think–Pair–Share learning strategy, and makes use of the features of the CADMOS graphic learning design editor that allows designers to see a preview of their …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:86PQX7AUzd4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "idSpace: A groupware system for supporting collaborative creativity",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=8939681350642310953&hl=en&oi=scholarr",
            "Abstract": "Nowadays, to invent and design new/innovative products and/or services requires collective creative performance: creative action in combination with collaboration.. Creativity is being seen as a “universal attribute, suggesting a need for greater creativity in order to both survive as well as thrive in the twenty-first century”(Craft, 2006). Several creativity techniques such as TRIZ, SCAMPER, Six Hats, 5W1H and more than 90 others have been created in order to encourage people’s original thoughts and divergent thinking. Some techniques require groups of two or more people while other techniques can be accomplished by individual. All techniques try to steer thought processes and help the individual or the group to find a structured approach to answer questions, to see problems in their entirety, generate new ideas and to reach to faster and better decisions.Fostering creativity is increasingly seen as a key direction …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using digital madia and networked technologies for learning purposes in cultural domain",
            "Publication year": 2006,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=2200058",
            "Abstract": "Localización: Tecnologías de la información y comunicación (TICs), arte y patrimonio cultural: aplicaciones, desarrollo local y aprendizaje informal: Primer Seminario Internacional celebrado en Donostia-San Sebastián el 5 de mayo de 2003/coord. por Aurkene Alzua Sorzabal, 2006, ISBN 84-9830-036-3, págs. 231-237",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Servicio de Publicaciones= Argitalpen Zerbitzua"
        },
        {
            "Title": "Editorial message: special track on engineering e-learning systems",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/967900.968085",
            "Abstract": "• Methods, Methodologies and Processes• Adaptive e-Learning Systems• Instructional Design of e-Learning Systems• Authoring of e-Learning Content",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "What’s on the menu? Today’s specialty: a European networked university",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64498",
            "Abstract": "In the midst of one of the greatest challenges ever faced, the great demand for learning, educational organizations are being reformed. The MENU consortium is working on meeting this challenge by creating a European Networked University (ENU). This paper provides a macroscopic view of the process of creating such aon organization. It describes the concerns that have to be taken into account and it presents the strategy of ENU. It also identifies ENU customers as well as competitors and articulates where ENU is going and why. Most importantly, it presents the business processes that ENU shall carry out.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "kkS of Information Systems Education; Summer 2007; 18, 2; Research Library",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=4332452292887707485&hl=en&oi=scholarr",
            "Abstract": "“Object-Oriented Programming” subject is included in the ACM Curriculum Guidelines for Undergraduate and Graduate Degree Programs in Computer Science as well as in Curriculum for K-12 Computer Science. In a few research studies learning problems and difficulties have been recorded, and therefore, specific pedagogical guidelines and educational tools have been proposed which aim at better supporting the instructional process of Object-Oriented Programming. This paper presents an empirical pilot study of a seminar related to the basic principles-concepts of Object-Oriented Programming. The seminar was at undergraduate educational level using the Java language and web technologies. Its instructional approach was based on selected best instructional practices (either in the form of guidelines or design patterns) already published in the literature. The fundamental aim of the present study was to …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Perspectives on E-learning: Case studies from Cyprus",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/49997468/Perspectives_on_e-learning_Case_studies_20161031-23436-ue6nf.pdf",
            "Abstract": "INTRODUCTION uring the past decade there has been tremendous progress in the advancement of educational technology, making innovative learning solutions such as e-learning and online education increasingly more feasible in many educational settings. In several countries, the use of e-learning has now begun to noticeably contribute to economic growth. In Cyprus, an island in the Mediterranean Sea located at the crossroads of Europe, Asia, and Africa, many large-scale e-learning initiatives are currently being undertaken by both public and private organizations, establishing the country as a center for education in the region.Between the 1960s and 1990s, educational technology efforts in Cyprus schools were limited to the use of traditional audiovisual equipment and a few educational radio and television programs produced by the government. In recent years, however, considerable efforts have been devoted to promoting lifelong learning and integrating information and commu-",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:uLbwQdceFCQC",
            "Publisher": "Information Age Publishing"
        },
        {
            "Title": "Part II-Usability and Evaluation Methods and Tools-DEPTH TOOLKIT: A Web-Based Tool for Designing and Executing Usability Evaluations of E-Sites Based on Design Patterns",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=11128534576017296441&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:rO6llkc54NcC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Assessing the Performance of Learners Engaged in Computer-Supported Collaborative Problem-Solving Activities",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/assessing-performance-learners-engaged-computer/46916",
            "Abstract": "Teachers often utilise a Computer-Supported Collaborative Learning (CSCL) strategy to teach a concept, a method, a problem, and so forth. Following guidelines from a script (based on a CSCL strategy), they must ultimately assess their students’ performance during their engagement in various learning activities; however, content and process assessments differ from script to script. Thus, a teacher faces a serious problem during content and process assessment. Here, the authors present a holistic framework for performance assessment and specify indexes for it. The authors aim to facilitate the teacher/evaluator’s work by equipping him or her with easy-to-apply tools and techniques for in-depth analysis of interactions. Finally, they describe our application of the proposed framework in an exploratory case study of a problem-solving activity in which a complex collaborative strategy is applied.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:isC4tDSrTZIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Design Patterns for Technology-Enhanced Learning: Achievements and Opportunities",
            "Publication year": 2010,
            "Publication url": "https://brill.com/downloadpdf/book/edcoll/9789460910623/BP000019.pdf",
            "Abstract": "In this book, we have explored the notion of TEL design patterns from multiple viewpoints. We have framed the concept in an historical perspective, have analysed the various types of patterns that can be found in the literature and in online repositories and we have discussed how design patterns can be used systematically for the design of TEL environments.In this chapter we aim to provide a synoptic view of the main achievements of the R&D efforts described in the book. It seems that design patterns are emerging as a valuable conceptual design tool for experienced TEL practitioners and novice designers. Design patterns can help because of their empirical foundations, their inclusive or democratic nature, the way they offer action-oriented, evidence-based advice, the scope they leave for creativity and their emphasis on the reusability of good design practices. Towards the end of the chapter, we will also make …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Brill Sense"
        },
        {
            "Title": "Έννοια και Περιεχόμενο Εκπαιδευτικής Αξιολόγησης στον 21ο Αιώνα",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/handle/11419/233",
            "Abstract": "Το κεφάλαιο αυτό εστιάζει στην εννοιολογική αποσαφήνιση της Εκπαιδευτικής αξιολόγησης στον 21ο αιώνα.  Ιδιαίτερη έμφαση δίνεται στην αναλυτική περιγραφή των γνωστικών, μεταγνωστικών, κοινωνικών, και επικοινωνιακών δεξιοτήτων που πρέπει οι εκπαιδευόμενοι να αποκτήσουν μέσα στο πλαίσιο της εκπαίδευσης, ώστε να είναι σε θέση να λειτουργούν ως “ανεξάρτητα σκεπτόμενοι και ενεργοί πολίτες” του 21ου αιώνα. Παράλληλα παρουσιάζονται αναλυτικά οι βασικές αρχές που διέπουν τις σύγχρονες μορφές της εκπαιδευτικής αξιολόγησης και καταδεικνύεται ο καταλυτικός ρόλος που διαδραματίζουν στον μετασχηματισμό της εκπαίδευσης.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Η Φιλοσοφία του Αξιολογικού Πλαισίου",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/handle/11419/234",
            "Abstract": "Στο κεφάλαιο αυτό περιγράφεται αναλυτικά τι εννοούμε με τον όρο αξιολογικό πλαίσιο της εκπαιδευτικής αξιολόγησης, ποια είναι τα δομικά του στοιχεία (π.χ. στόχοι, κριτήρια, αντικείμενα, κλπ) και οι βασικοί του άξονες. Επιπρόσθετα μέσω αναλυτικών παραδειγμάτων αποσαφηνίζεται  η προστιθέμενη παιδαγωγική δυναμική του αξιολογικού πλαισίου.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:rmuvC79q63oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing a Moodle course with the CADMOS learning design tool",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2012.745771",
            "Abstract": "CADMOS is a graphical learning design (LD) authoring tool that helps a teacher design a unit of learning in two layers: (i) the conceptual layer, which seems like a concept map and contains the learning activities with their associated learning resources and (ii) the flow layer, which contains the orchestration of these activities. One of CADMOS’ main innovative features is that it can bridge the gap between the design of a unit of learning and its enactment into Moodle. This paper presents how one can create a LD using CADMOS and deploy it into Moodle. Also, the paper shows the findings from a case study which was organized in order to evaluate the usability of the tool, its pedagogical flexibility and the usefulness of its innovative feature of deploying a LD into Moodle. CADMOS seems to be an easy-to-use tool, which offers guidance and flexibility during the design process.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Routledge"
        },
        {
            "Title": "An online 3d virtual learning environment for teaching children Mathematics",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-6262-9_22",
            "Abstract": "Structuring and organising an advanced online collaborative learning environment (CSCL) is the object of this research. The way it can be integrated in the classroom and the curriculum is related to the vision of every reform that aims at improving education. Most of the existing 3d virtual worlds do not combine learning benefits, development of advanced learning and communicative skills, as well as substantial involvement of both students and teachers in the learning process. At first, the theoretical background of the structure and organisation of our world is given. Then, a description is given of the general characteristics of Active Worlds software that was used, along with a brief description of the structure and characteristics of the 3d virtual environment that is being constructed to support the teaching of Mathematics in primary schools. The expected outcomes and proposals for future utilization follow.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Children with motor impairments play a kinect learning game: first findings from a pilot case in an authentic classroom environment",
            "Publication year": 2013,
            "Publication url": "https://core.ac.uk/download/pdf/26783208.pdf",
            "Abstract": "This paper presents the first very positive findings from an empirical study about the effectiveness of the use of a Kinect learning game for children with gross motor skills problems and motor impairments. This game follows the principles of a newly presented approach, called Kinems, which advocates that special educators and therapists should use learning games that via embodied touchless interaction–thanks to the Microsoft Kinect camera-children with dyspraxia and other related disorders such as autism, Asperger's Syndrome, and Attention Deficit Disorder, can improve related skills. Several Kinems games have been proposed (http://www. kinems. com). These games are innovative and are played with hand and body gestures. Kinems suggests that games should be highly configurable so that a teacher can modify the settings (eg difficult level, time settings, etc.) for the individual needs of each child. Also, a teacher should have access to kinetic and learning analytics of the child’s interaction progress and achievements should be safely stored and vividly presented.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "DEPTH: A Method and a Web-Based Tool for Designing and Executing Scenario-Based Usability Inspections of E-Systems",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/depth-method-web-based-tool/40505",
            "Abstract": "Scenario based inspection methods are currently widely used for evaluating the usability of web-based information systems (e-systems). However, it is neither easy nor cheap to find usability experts who possess the competencies for performing a usability inspection while at the same time have deep knowledge of the context for which each e-system has been developed. Moreover, the effectiveness of these methods depends on the quality of the inspection scenarios. These issues can be tackled by finding potential users of the e-systems under inspection who have basic knowledge about human-computer interaction and adequately support them to execute the appropriate scenarios. Towards this goal, a new usability evaluation method called DEPTH along with a web based tool that supports its application, have been created. This chapter describes DEPTH’s underlining philosophy which is the re-use of …",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "LEARNING OBJECT METADATA IN A WEB-BASED LEARNING ENVIRONMENT",
            "Publication year": 2000,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/25789",
            "Abstract": "LEARNING OBJECT METADATA IN A WEB-BASED LEARNING ENVIRONMENT Αρχική \nΣελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε \nπεριοδικά → Εμφάνιση Τεκμηρίου HEAL DSpace LEARNING OBJECT METADATA IN A \nWEB-BASED LEARNING ENVIRONMENT Αποθετήριο DSpace/Manakin LEARNING \nOBJECT METADATA IN A WEB-BASED LEARNING ENVIRONMENT Koutoumanos, A; \nRetalis, S; Papaspyrou, N URI: http://hdl.handle.net/123456789/25789 Ημερομηνία: 2000 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο \nΠροβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο \nεμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά Related \nitems Showing items related by title, author, creator and subject. Modeling learning \ntechnology systems as business systems ﻿ Retalis…",
            "Abstract entirety": 0,
            "Author pub id": "JUX2KJcAAAAJ:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Patterns for designing Learning Management systems",
            "Publication year": 2003,
            "Publication url": "https://core.ac.uk/download/pdf/232380874.pdf",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to ‘re-invent the wheel’. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems. The proposed design patterns are semantically organized and categorized, and form the basic core of a pattern language for Learning Management Systems.",
            "Abstract entirety": 1,
            "Author pub id": "JUX2KJcAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        }
    ]
}]