[{
    "name": "Σωτήρης Σκεβούλης",
    "romanize name": "Sotiris Skevoulis",
    "School-Department": "School of Computer Science and Information Systems",
    "University": "Pace University",
    "Rank": "Kαθηγητής",
    "Apella_id": 1723,
    "Scholar name": "Sotirios Skevoulis",
    "Scholar id": "xDLX2i0AAAAJ",
    "Affiliation": "Professor of Computer Science, Pace University",
    "Citedby": 91,
    "Interests": [
        "software engineering",
        "formal methods",
        "object oriented"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=xDLX2i0AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Integrating formal methods tools into undergraduate computer science curriculum",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4117185/",
            "Abstract": "This paper presents the results of a successfully completed funded project in the area of Computer Science and Formal Methods Education. The project was an effort to study the integration of formal methods software tools into an undergraduate curriculum. Our goals were to pioneer an innovative methodology that will increase the learning experience by introducing the use of mechanized approaches in teaching formal methods and to demonstrate the potential of undergraduate students for learning formal analysis techniques, by using these software tools. This methodology depends on the traditional teaching models and adds the use of automated software tools to enhance the student's learning experience. At the conclusion of this study we demonstrated increased student performance and understanding of difficult concepts in formal software analysis and design problems with the use of mechanized assistants …",
            "Abstract entirety": 0,
            "Author pub id": "xDLX2i0AAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generic invariant-based static analysis tool for detection of runtime errors in Java programs",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/891356/",
            "Abstract": "The paper presents an invariant-based generic tool to statically analyze Java programs in order to detect potential errors (bugs). We briefly discuss the supporting theoretical framework and highlight the results of the tool. It can automatically detect potential bugs such as illegal dereference and array bounds and report them before the program is executed. For a Java class, invariants related to the category of error under examination are automatically generated and used to assess the validity of variable usage in the implementation of this class. The tool provides a practical and extensible generic mechanism for error detection to help industry practitioners who work with an object oriented language such as Java. The presented mechanism is capable of addressing error detection for a variety of error categories that cannot be caught by flow-based static analysis tools.",
            "Abstract entirety": 1,
            "Author pub id": "xDLX2i0AAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating formal methods tools into undergraduate computer science curriculum",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/544414.544500",
            "Abstract": "In this paper we describe a recently NSF-funded project that is based on the power of an innovative teaching approach, which combines the traditional teaching models and adds the use of automated software tools to enhance the student's learning experience.",
            "Abstract entirety": 1,
            "Author pub id": "xDLX2i0AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Podcasts: Changing the Face of e-Learning.",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.632.2859&rep=rep1&type=pdf",
            "Abstract": "We are well into the twenty-first century, and our technology is advancing at blazing speeds. Yet our education methodologies suffer the fate of remaining largely antiquated. Students and educators alike have become more sophisticated; the tools of learning must reflect and compensate for this intellectual advancement. Podcasts have greatly contributed towards that need. Podcasts are simple, effective, dynamic tools that will change the way that students and educators interact in the classroom and in cyberspace. This paper explores the possibilities and potential impact podcasts will have in educating students in the 21st century.",
            "Abstract entirety": 1,
            "Author pub id": "xDLX2i0AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing tensorflow deep learning performance and experiences using cpus via local pcs and cloud solutions",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-12385-7_10",
            "Abstract": "Deep Learning is a multilevel learning tool that helps better understand information from various sources. For those who are newly entering the Deep Learning domain, the use of TensorFlow is an optimal way to enhance and learn about neural network designs and a way to deep dive into machine learning. Even though TensorFlow is early with its inception, it is however quickly becoming the direction in which many researchers are using for their open source machine-learning framework. The research, we take advantage of, is the capabilities of TensorFlow to enhance the processing of a substantial dataset that shows the growth and accuracy of cells of embryos in incubation. A typical approach to execute such a massive dataset, today’s researchers would first go to directly to the cloud to accomplish this output. From the experiments that ran in this paper, we concluded that an individual afresh to Deep …",
            "Abstract entirety": 0,
            "Author pub id": "xDLX2i0AAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A formal methods based static analysis approach for detecting runtime errors in java programs",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.134.3978&rep=rep1&type=pdf#page=84",
            "Abstract": "This paper discusses the foundation of a generic approach to statically analyze Java programs in order to detect potential errors (bugs). We discuss a framework that supports our approach and carries out the static analysis of Java code automatically. Our approach can automatically detect such potential bugs and report them before the program is executed. For a Java class, invariants related to the category of error under examination are automatically generated and used to assess the validity of variable usage in the implementation of this class. A research prototype is under development. It assists us in evaluating the feasibility and effectiveness of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "xDLX2i0AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engineering a Software Supported Health Risk Appraisal Method: A Joint Effort between Academia and Health Care Industry",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4812683/",
            "Abstract": "This paper describes a software engineering educational experience and collaboration between the Seidenberg School of Computer Science at Pace University (SCSIS) and Pfizer Incpsilas Clinical Applications Team. The goal of the project was to develop a Coronary Heart Disease Risk Factor Calculator (CHD-RFC) utilizing all the experience acquired during a software engineering seminar course . Developed with the patient in mind, the tool provides powerful features such as three CHD risk algorithm choices, a health report, and a progress chart. The project, the tool and the social implications of a software-assisted health risk appraisal method are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "xDLX2i0AAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Engineering a successful partnership between academia and the financial industry: A software engineering program for IT professionals",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5876105/",
            "Abstract": "This paper describes an ongoing partnership between the Seidenberg School of Computer Science and Information Systems at Pace University, a Registered Education Provider (REP) for IEEE and the Information Technology Division at Bank of New York Mellon. The goal of the project is to deliver at the bank's location, a high quality, customized, graduate program in software engineering as well as to reflect on its strong and weak points and improve it. More importantly, through intense interaction with the Bank's IT Management, to ensure that the academic program matches their actual needs. The technology transfer, the customized training and the challenges are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "xDLX2i0AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        }
    ]
}]