[{
    "name": "Τασούλα Γεωργάκη",
    "romanize name": "Tasoula Georgaki",
    "School-Department": "Μουσικών Σπουδών",
    "University": "uoa",
    "Rank": " Καθηγητής",
    "Apella_id": 18329,
    "Scholar name": "anastasia Georgaki",
    "Scholar id": "1Q9pOAIAAAAJ",
    "Affiliation": "Associate Professor in Music Technology, National and Kapodistrian University of Athens",
    "Citedby": 71,
    "Interests": [
        "singing voice technologies",
        "interactive music",
        "muisc technology  in education",
        "media technology and acoustic ecology"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=1Q9pOAIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "“VIRTUAL TETTIX”: CICADAS’SOUND ANALYSIS AND MODELING AT PLATO’S ACADEMY",
            "Publication year": 2015,
            "Publication url": "http://scholar.uoa.gr/sites/default/files/georgaki/files/62_2015_virtual_tettix_cicadas_sound_analysis_and_modeling_at_plato.pdf",
            "Abstract": "This paper deals with the acoustic analysis of timbral and rhythmic patterns of the Cicada Orni sound activity, collected at the Plato Academy archaeological site during the summer period of 2014, comprising the Tettix soundscape database.The main purpose here is to use sound analysis for understanding the basic patterns of cicada calls and shrilling sounds, and subsequently use the raw material provided by the Tettix database in a statistical modeling framework for creating virtual sounds of cicadas, allowing the control of synthesis parameters spanning micro, meso and macro temporal levels.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TOWARDS A SOMATOSENSORY TRAINING DIGITAL ENVIRONMENT FOR LYRIC SINGING PEDAGOGY",
            "Publication year": 2019,
            "Publication url": "https://www.torrossa.com/gs/resourceProxy?an=4584534&publisher=FF3888#page=51",
            "Abstract": "Lyric-voice quality level has been repeatedly reported as declining during the last few decades, both by scholars and distinguished opera professionals. Many believe that the current vocal pedagogy for this genre is to be blamed for this effect and have reported a need for vocal education reform. Meanwhile, scientific research of the vocal mechanism has provided knowledge on an interdisciplinary level, in fields such as Singing Acoustics and Cognition, while new real-time visual feedback technologies and software tools, that can be of immediate use to the vocal pedagogic system, are evolving constantly. In this paper we propose an assistive feedback environment for the pedagogy of lyric singers, which includes a multi-window interface for testing postural and breathing habits, diaphragm activity, glottal activity and formant tuning.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Firenze University Press"
        },
        {
            "Title": "The development of a dance-musification model with the use of machine learning techniques under COVID-19 restrictions",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3478384.3478407",
            "Abstract": "Interactive technologies enable dancers to control the music in real-time with their movement. This paper presents the design and development of a model which takes as input a dancer’s movement and outputs music, structurally related to dance, with the use of machine learning techniques. Both the technical and artistic aspects of the model development are described in detail. In particular, the paper compares the use of machine learning techniques to traditional coding, in interactive dance and music applications. Moreover, it describes the significant discrimination between movement sonification and dance musification and explains why the model presented here falls into the second category. Special focus is given to the implications of the COVID-19 restrictions regarding the established collaboration with the dancer.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aspects of musical structure and functionality of electroacoustic media in the performance of ancient Greek tragedy A composers’ point of view (P. Velianitis)",
            "Publication year": 2008,
            "Publication url": "http://scholar.uoa.gr/sites/default/files/georgaki/files/33_2008_georgaki-velianitis_aspects_of_musical_structure_and_functionality_of_electroacoustic_media_in_the_performance_of_ancient_greek_tragedy._a_composers.pdf",
            "Abstract": "AimsDistinguishing the recorded playback music from the e/a material we realize the second one gives the opportunity to keep an eye open closer to the “ethos” of the text. Independently of specified styles and techniques, the challenge transforming symbolism in abstract sound is risky and if stylized becomes guide to superficial performance so often in the (recent) past.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Music editors for visually-impaired persons: user interface specifications and system design",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/990174/",
            "Abstract": "The authors describe in detail the user interface specifications and system design of a software module that permits blind musicians to edit musical content in electronic form. First we take account of user requirements for this special-purpose software and, based on that, we provide a set of user interface specifications. Keyboard navigation and speech output are described in some detail. According to the specifications provided, we propose a system design in the context of WEDELMUSIC software.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fractal based curves in musical creativity: A critical annotation",
            "Publication year": 2011,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814350341_0019",
            "Abstract": "In this article we examine fractal curves and synthesis algorithms in musical composition and research. First we trace the evolution of different approaches for the use of fractals in music since the 80's by a literature review. Furthermore, we review representative fractal algorithms and platforms that implement them. Properties such as self-similarity (pink noise), correlation, memory (related to the notion of Brownian motion) or non correlation at multiple levels (white noise), can be used to develop hierarchy of criteria for analyzing different layers of musical structure. L-systems can be applied in the modelling of melody in different musical cultures as well as in the investigation of musical perception principles. Finally, we propose a critical investigation approach for the use of artificial or natural fractal curves in systematic musicology.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introducing Secondary Education Students to Programming through Sound Alerts",
            "Publication year": 2020,
            "Publication url": "https://www.ejers.org/index.php/ejers/article/view/2298",
            "Abstract": "It is considered hard to teach programming in secondary education while achieving the aims of curriculum. However, when teaching is supported by suitable methodologies, learning can be ameliorated. Under this premise, this paper discusses different teaching approaches to programming in secondary education and examines the potential benefit of sound-alerts as a complementary teaching tool. Such alerts were created by pairing different sound stimuli to specific programming actions and operations. Both the selection of the sound stimuli, as well as the potential impact of the use of sound alerts on programming are evaluated through subjective studies. Results showed that participants preferred synthesized to natural (pre-recorded) stimuli for all types of alerts. It was also revealed that users prefer sound-alerts associated to pending actions, errors, successful code execution, conditional statements and code looping over alerts highlighting the step-by-step execution of the code. Finally, the test results showed that students understand both the meaning and the use of code commands more clearly when they use a sound-enriched programming environment instead of a conventional one. These results were the motivation for the initial creation of an audio and voice messages’ data base and the initial design of a new comprehensive educational tool using sound.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bioacoustics and Shazam",
            "Publication year": 2018,
            "Publication url": "http://scholar.uoa.gr/georgaki/publications/bioacoustics-and-shazam",
            "Abstract": "Τα τελευταία χρόνια, διάφορες εταιρείες σε συνεργασία με ερευνητικά εργαστήρια στο χώρο της Βιοακουστικής έχουν αναπτύξει λογισμικά ακουστικής ανάλυσης των καλεσμάτων των πουλιών, μέσω αυτόματης αναγνώρισης προτύπων, που ταυτοποιούν τη ρυθμική και μελωδική δομή του ‘‘τραγουδιού’’τους σύμφωνα με τη βιολογική τους κατάταξη. Οι εφαρμογές αυτές ακολουθούν διαφορετική μεθοδολογία ως προς το κομμάτι της ανάλυσης και της αναγνώρισης, ωστόσο παρουσιάζουν κάποια κοινά μειονεκτήματα, όπως είναι η χαμηλή ακρίβεια, η έλλειψη μεθόδων επαγγελματικής ανάλυσης για μεγαλύτερο εύρος πουλιών, οι διάφορες τεχνικές δυσκολίες και η προϋπόθεση ύπαρξης εξειδικευμένου ανθρώπινου δυναμικού για την υλοποίησή τους. Στο πλαίσιο αυτής της ανακοίνωσης θα παρουσιάσουμε κάποιες από τις υπάρχουσες εφαρμογές και σημαντικές έρευνες πού έχουν πραγματοποιηθεί στο πεδίο αυτό, ενώ παράλληλα …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Turing Test for the Singing Voice as an Anthropological Tool: Epistemological and Technical Issues",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=2116260435688982999&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Ann Arbor, MI: Michigan Publishing, University of Michigan Library"
        },
        {
            "Title": "\" Match Your Own Voice!\": An Educational Tool for Vocal Training",
            "Publication year": 2017,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv2=143&ebrief=372",
            "Abstract": "In this paper, we discuss the development and preliminary evaluation of a new educational tool, intended for novice and advanced vocal students. The software, written in Max/MSP, aims to assist singing practice by providing users with a visual substitute to their subjective auditory feedback. Under the guidance of their professional vocal instructor, students can store in the software spectral representations of accurately produced sounds, creating personalized Reference Sound Banks (RSBs). When students practice on their own, the software can be put into practice, assisting them to match their current Voice Spectrum Harmonic Content to the stored RSBs one note at a time. Results of a preliminary evaluation showed that, when using this software, students achieve a larger number of accurately produced sounds in a smaller amount of time.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "From Digital ‘Echos’ to virtual ‘ethos’: Ethical aspects of Music Technology",
            "Publication year": 2014,
            "Publication url": "http://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_1/0193.pdf",
            "Abstract": "In the present paper we aim to examine Music Technology through the lens of the ethical issues typically raised in the field of Philosophy of Technology regarding technological practices other than music composition, performance, reproduction and distribution. With this analysis we will try not only to highlight several ethical facts about the practice of developing and using digital tools for music but also to stress on the fact that Music Technology can be a platform for vigorous philosophical meditation.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time Control of Greek Chant Synthesis",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03013690/",
            "Abstract": "This paper we report on an interdisciplinary project for modeling Greek chant with real-time vocal synthesis. Building on previous research, we employ a hybrid musical instrument: Phonodeon (Georgaki et al. 2005), consisting of a MIDI-accordeon coupled to a real-time algorithmic interaction and vocal synthesis engine. The synthesis is based on data provided by the AOIDOS program developed in the Department of the Computer science of the University of Athens, investigating Greek liturgical chant compared to bel canto singing. Phonodeon controls expressive vocal synthesis models based on formant synthesis and concatenated filtered samples. Its bellows serve as hardware control device that is physically analogous to the human breathing mechanism [georgaki, 1998a], while the buttons of the right hand can serve multiple functions. On the level of pitch structure, this paper focuses on a particular aspect of control, namely that of playing in the traditional non-tempered and flexible interval structure of Greek modes (ήχοι: echoi) while using the 12-semitone piano-type keyboard of the left hand. This enables the musical exploration of the relationship between the spectral structure of the vocal timbre of Greek chant and characteristic intervals occuring in the modal structure of the chant. To implement that, we developed techniques for superimposing interval patterns of the modes on the keyboard of the phonodeon. The work is the first comprehensive interactive model of antique, medieval and modern near-eastern tunings. The techniques developed can be combined with techniques for other control aspects, such as timbre and vocal expression …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Effectiveness of visual feedback singing vocal technology in Greek Elementary School",
            "Publication year": 2014,
            "Publication url": "https://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_2/1786.pdf",
            "Abstract": "The main scope of this research is to investigate children’s singing voice pitch accuracy and quality. The investigation was led in two elementary schools, mainly on children aging between 6 and 9. We have used common freeware1 for visual feedback, in order to find out its degree of effectiveness on the improvement of the children’s pitch accuracy. The results indicated that through the use of visual feedback singing software and the teacher’s help, children are more motivated to sing in tune, to understand the vowel quality, and to learn how to improve their singing.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A score-to-singing voice synthesis system for the greek language",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/61942578/ICMC07.pdf",
            "Abstract": "In this paper, we examine the possibility of generating Greek singing voice with the MBROLA synthesizer, by making use of an already existing diphone database. Our goal is to implement a score-to-singing synthesis system, where the score is written in a score editor and saved in the midi format. However, MBROLA accepts phonetic files as input rather than midi ones and because of this, we construct a midi-file to phonetic-file converter, which applies irrespective of the underlying language. The evaluation of the Greek singing voice synthesis system is achieved through a psycho acoustic experiment. The thirty participants are given two samples and are asked to evaluate them according to vocalness, naturalness, intelligibility and expressivity, in a 1-5 scale MOS test. The results are encouraging, with naturalness and expressivity being ranked above 2.5 in average. Thereafter, we create a new diphone database …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "HERON: a zournas digital virtual musical instrument",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1413634.1413698",
            "Abstract": "The Virtual Zournas, a digital Virtual Musical Instrument (VMI) developed under the project HERON, following a physical modeling approach, is presented, along with a classification scheme of real double-reed woodwind zournas and their characteristic acoustic analysis. Use-case scenarios of VMI zournas are also given regarding different user groups, including composers, performers, music teachers and musical instrument craftsmen. Aesthetical issues, limitations of the current version and thoughts on the anthropological and technological character of such tools are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Prosody Model of Attic Tragic Poetry: From Logos to Mousiké",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.583.7559&rep=rep1&type=pdf",
            "Abstract": "Recently there has been increasing interest of scientists for the performance of singing or reciting voices of the past in utilising analysis-synthesis methods. In the domain of Ancient Greek musicology indeed, where we find the roots of the occidental music, the main research has been done mostly by scholars of classical Greek literature. However, there is still a vast territory for research in audio performances to be carried out with the help of new digital technologies.In this paper, we will present an attempt to decode a recited text of Ancient Greek tragedy and render it into sound. At the first paragraph of this article we underline the origin of music arising from the melodicity of speech in Ancient Greek tragedy. In the second paragraph, we describe the methodology we have used in order to analyse the voice of S. Psaroudaks, himself professor of Ancient Greek music, by an open source prosodic feature extraction tool based on Praat. We give a description of the prosodic analysis, implementation details and discuss its feature extension capabilities as well. Last, we refer to the difference between the Ancient and Modern Greek phonological system, the application of this research in music and further development.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "«Match Your Own Voice!» A software tool to assist singing practice on the somatosensory motivation",
            "Publication year": 2017,
            "Publication url": "http://www.pevoc.org/pevoc12/abstracts/FP072.pdf",
            "Abstract": "Many students report that after a successful voice lesson with their teacher/coach they experience a tremendous difficulty repeating the same technique when they practice on their own. They claim that they cannot recall the exact position of the respiration, vocal tract or muscle activities taught, and thus base their practice solely on the subjective basis of their auditory perception of their own voice.Recent fMRI studies have confirmed that Opera singers tend to control their voice by depending largely on their somatosensory, rather than auditory feedback of their voice. They have learned how to control their bodies in order to achieve their optimum sound. But how can everyone achieve this? Is there a way to quantify and repeat, what our teacher suggests as our current best result?",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multisensory biofeedback: Promoting the recessive somatosensory control in operatic singing pedagogy",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1746809420305061",
            "Abstract": "The quality level in Operatic Singing has been repeatedly reported as declining by a number of academic scholars, music critics, and distinguished opera professionals and teachers, during the last few decades. This narrative review attempts to combine scientific research results from Physiology, Acoustics, Psychoacoustics, Sociology, and Cognitive Sciences, in order to find possible causes for such a change and suggest applicable solutions. The opera singing profession has been widely regarded as an extremely demanding specialty, requiring high levels of cognitive awareness and muscular motor control. The stagnant empiric vocal pedagogy system in conjunction with other aspects of the modern way of life are possible factors impeding the achievement of such an elite level. Today, we have the technological resources and scientific data available, but they have not necessarily been widely used toward the …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:HDshCWvjkbEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Exploring Singing Vocal Pedagogy in the Greek Elementary School through Interactive Technologies",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/chapter/exploring-singing-vocal-pedagogy-in-the-greek-elementary-school-through-interactive-technologies/154593",
            "Abstract": "A growing body of interdisciplinary research suggests that children's structured engagement in musical activities may have a positive impact on social inclusion by means of offering opportunities for social bonding, developing interpersonal relationships and empowering self-expression, health and well-being. In this paper we investigate the amelioration of children's voice accuracy and quality in signing through a visual feedback software. The research took place in two public elementary schools in Athens in a total of sixty children aged 6-9 years old and with a different cultural background. The statistical analysis on the effectiveness of the software has proved the amelioration of the children's voice quality before and after its use.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Physical Modeling of the Ancient Greek Wind Musical Instrument Aulos: A Double-Reed Exciter Linked to an Acoustic Resonator",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9477590/",
            "Abstract": "We present a simulation method for the auralization of the ancient Greek double-reed wind instrument Aulos. The implementation is based on Digital Signal Processing and physical modeling techniques for the instrument’s two parts: the excitation mechanism and the acoustic resonator with toneholes. Single-reeded instruments are in-depth studied firstly because their excitation mechanism is the one used in a great amount of modern wind-reed instruments and secondly because the physics governing the phenomena is less complicated than the double-reeded instruments. We here provide a detailed model of a system comprised of a double-reed linked to an acoustic resonator with toneholes to sonify Aulos. We validate our results by comparing our method’s synthesized signal with recordings from a replica of Aulos of Poseidonia built in our lab. The comparison showed that the fundamental frequencies and the …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Virtual voices on hands: Prominent applications on the synthesis and control of the singing voice",
            "Publication year": 2004,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03354297/document",
            "Abstract": "The on-going research of the last thirty years on the synthesis of the singing voice highlights different aspects of this implicative field which involves the interdisciplinary area of musical acoustics, signal processing, linguistics, artificial intelligence, music perception and cognition, music information retrieval and performance systems. Recent work shows that the musical and natural quality of singing voice synthesis has evolved enough for high fidelity commercial applications to be realistically envisioned. In the first paragraph of this paper we are going to highlight briefly the different aspects of the on-going research (synthesis models, performance by rules, textto-speech synthesis, controllers) through a taxonomy of these approaches. In the second part we are going to emphasize on the utility and the different applications of this research area (including the recent commercial ones) as a tool for the music creativity by presenting audio and video excerpts of various approaches through a MIDI accordion. Finally, we are going to present future and related work on Greek singing, outlining a new research project named ΑOIDOS/Virtual Greek singer which is under development at the University of Athens. By this article we want to highlight the prominent applications of this research domain in the field of musicology and music creation and music education.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "THE GRAIN OF XENAKIS’TECHNOLOGICAL THOUGHT IN THE COMPUTER MUSIC RESEARCH OF OUR DAYS",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/61942598/THE_GRAIN_OF_XENAKIS_TECHNOLOGICAL_THOU20200130-31027-479skk.pdf",
            "Abstract": "The scope of this article is to present the diachronic value of Xenakis’ technological thought in computer music research and creation of our days within a comparative and critical approach. On the one hand, we will refer to the main domains of Xenakis’ contributions to Music Technology: the conquest of the computer as a tool for logical transformations of symbols into music and a laboratory of automation for certain compositional tasks on meta-musical and compositional design issues; his pedagogical and compositional approach by the sound-design system UPIC as an interface between musician and machine; his granular approaches of sound synthesis as a link between algorithms and the creation of new sounds; the multi-sensoring approach of the conception of Polytopes where he combines various technological tools in order to achieve a kind of a total art work. On the other hand, we will exalt the impact of his research in current music technology (use of the granular model in modern synthesizers, the marriage between sound and light in modern interactive performances, the design of new userfriendly tools for the music education, etc).",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reinventing Greek electroacoustic music: from tradition to multidisciplinarity",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Anastasia-Georgaki/publication/230735590_EMSElectroacoustic_Music_Studies_Network-Montreal_2005_Reinventing_Greek_electroacoustic_music_from_tradition_to_multidisciplinarity/links/0912f503b95870743d000000/EMSElectroacoustic-Music-Studies-Network-Montreal-2005-Reinventing-Greek-electroacoustic-music-from-tradition-to-multidisciplinarity.pdf",
            "Abstract": "Greek electroacoustic music, born in the New Music environment of the sixties and developed among fruitful and critical periods, seems to be in expansion in our days. In this article we present a brief overview of the genesis and evolution of the electroacoustic music in Greece since 1967 until today, exposing three crucial periods. In the second section we present the works, the means and aesthetics of representative composers of the most recent period (1990-2005). In the last section we focus on the pedagogical and institutional development of the Greek electroacoustic music during the last fifteen years, as well as on the diversity of styles and techniques of works presented in various events in Athens and other places in Greece. We also stress the lack of an official institute for the archiving, creation and expansion of the electroacoustic music, and the indifference of the cultural authorities to cultivate such kind of music.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SMC'07: 4th Sound and Music Computing Conference, 11-13 July 2007, Lefkada, Greece: Proceedings",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=5854271669515186726&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:L8Ckcad2t8MC",
            "Publisher": "National and Kapodistrian University of Athens"
        },
        {
            "Title": "Development and Evaluation of an Audio Signal Processing Educational Tool to Support Somatosensory Singing Control",
            "Publication year": 2018,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=19842",
            "Abstract": "This paper discusses a newly designed educational tool called «Match Your Own Voice!», which aims at complementing modern vocal pedagogy. The software addresses the perceptual challenges faced by aspiring singers, and the need for more objective unsupervised practice methods and quantified reference points to guide students through their training course. The tool is a real-time visual feedback application, which uses lessons with a professional vocal coach as a reference for the students’ unassisted practice guidance. It is designed for use on portable computers. The conducted longitudinal study evaluating the tool’s effect on the students’ practice accuracy showed promising results.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Extended\" Drama Prosodic Tools\": Design And Aesthetics",
            "Publication year": 2019,
            "Publication url": "http://www.studiomusicatreviso.it/icnmc/library/Paper_53_2018.pdf",
            "Abstract": "In this article we present an interactive toolkit for the extended vocal performance of Attic tragic poetry in drama related to its prosodic aspects. We focus on the development of modules for the phonological articulation of the ancient text based on archeomusicological readings (related to music and language) in order to add aesthetic values to the modern performance of ancient Greek drama. These tools are based on prosodic elements (melodic, rhythmic) of the ancient text and are used to: a) detect the dynamic of the articulation, accent, pronunciation as well as the tonality/pitch of the actor’s voice (recited or sung), b) track the movements and gestures of the performer and c) combine the data which is collected by the abovementioned processes (a and b) to trigger interactive sound and speech processing during the performance in order to reintroduce the prosodic aspects of voice in ancient drama.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "FONASKEIN: An Interactive Software Application for the Practice of the Singing Voice",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/308031033_FONASKEIN_An_interactive_application_software_for_the_practice_of_the_singing_voice/links/57d79fb208ae6399a395b2d9/FONASKEIN-An-interactive-application-software-for-the-practice-of-the-singing-voice.pdf",
            "Abstract": "A number of software applications for the practice of the singing voice have been introduced in the last decades, but all of them are limited to equal tempered scales. In this work, we present the design and development of FONASKEIN, a novel modular interactive software application for the practice of singing voice in real time and with visual feedback for both equal and non-equal tempered scales. Details of the Graphical User Interface of FONASKEIN are given, along with its architecture. The evaluation results of FONASKEIN in a pilot experiment with eight participants and four songs in various musical scales showed its positive effect in practice of the singing voice in all cases.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "“JAZZ MAPPING” AN ANALYTICAL AND COMPUTATIONAL APPROACH TO JAZZ IMPROVISATION",
            "Publication year": 2019,
            "Publication url": "http://smc2019.uma.es/articles/P3/P3_10_SMC2019_paper.pdf",
            "Abstract": "“Jazz mapping\" is a multi-layered analytical approach to jazz improvisation. It is based on hierarchical segmentation and categorization of segments, or constituents, according to their function in the overall improvisation. The approach aims at identifying higher-level semantics of transcribed and recorded jazz solos. At these initial stages, analytical decisions are rather exploratory and rely on the input of one of the authors and experienced jazz performer. We apply the method to two well-known solos, by Sonny Rollins and Charlie Parker, and discuss how improvisations resemble story-telling, employing a broad range of structural, expressive and technical tools, usually associated with linguistic production, experience, and meaning. We elucidate the implicit choices of experienced jazz improvisers, who have developed a strong command over the language and can communicate expressive intent, elicit emotional responses, and unfold musical “stories” that are memorable and enjoyable to fellow musicians and listeners. We also comment on potential artificial intelligence applications of this work to music research and performance.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:dhFuZR0502QC",
            "Publisher": "Malaga University"
        },
        {
            "Title": "NIKANDROS PROJECT: INITIATION TO ANCIENT GREEK MUSIC IN PRIMARY SCHOOL THROUGH THE MOODLE LEARNING PLATFORM",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Marianos/publication/232168408_Using_IEEE_LOM_Standard_for_the_Provisioning_of_Training_Services_on_the_Egovernment_Paradigm_to_Rural_SME/links/546cbcca0cf2193b94c57418/Using-IEEE-LOM-Standard-for-the-Provisioning-of-Training-Services-on-the-Egovernment-Paradigm-to-Rural-SME.pdf#page=207",
            "Abstract": "This demonstration deals with the creation of an online course on Αncient Greek music (AGM). The course entitled Nikandros is an introduction to the theory, instruments, remained fragments, music interpretations and social issues of the Ancient Greek music (AGM) at the classical period. It has been designed on the Moodle learning platform and has been presented to fifteen students of the fourth grade in Primary School of Lampsakos (Evia) during the spring of 2011. Students had the opportunity to work at the school’s computer laboratory on AGM via new technologies (Moodle LMS). The outcome of this experimental teaching and learning experience was most encouraging towards further research and development of the project.Elements of ancient Greek music (history, musical instruments, theory, social operation, esthetics) are not included in the analytic program of the Ministry of Education neither for the primary nor for the secondary music education. Nevertheless, by this experiment we try to support that elements of Ancient Greek music should be included (under conditions) in the frame of the primary musical education of Greek students because it is directly related to their cultural heritage and the educational aspects of museology (visiting museums and archeological sites), in order to learn better the rich culture and history of the place where they are born and live.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Recursive Mapping System for Motion and Sound in a Robot between Human Interaction Design.",
            "Publication year": 2014,
            "Publication url": "https://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_2/1649.pdf",
            "Abstract": "We present in this article an artistic human-robot interaction form, which allows us to engage and evolve new experiences through to use of artificial animate behavior, kinesis and generated sound in a feedback communication medium. This meta system, which could be regarded also as one total composed instrument, is a recursive interaction process between its agents; a robot arm, human body and a sound space being rendered artificially. The computational modeling of this embodied approach is explained and a proto-type of the experiment is shown as a real tool to test empirically this artistic concept.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ENCODING BYZANTINE MUSIC NOTATION (ca. 1600-1814)",
            "Publication year": 2018,
            "Publication url": "http://scholar.uoa.gr/sites/default/files/georgaki/files/74_encodingbyzantinemusicnotation_2018_bourischaldeakesgeorgaki.pdf",
            "Abstract": "This paper discusses a new method for encoding Byzantine Music Neumatic Notation (especially the one developed during the ‘transitory’period 1670-1814). The Notation of this period is characterized by difficulties and peculiarities. The difficult access to Byzantine manuscripts and their deteriorated condition, complicate reading. In addition, our incomplete knowledge of the interpretation of signs impedes the comprehension of the musical text leading in results that are often in dispute. The fact that sign unions are complex enough together with their presence in various places in a composition make electronic transcriptions the ultimate challenge. Moreover, there does not exist a framework for data encoding and analysis. This work presents a proposal for the development of such a model for the old Byzantine Neumatic Notation in Python. The implementation of this project is still at an initial stage, and focuses, mostly, on the efficient digitization of old manuscripts. The system, even though fully functional, has certain limitations. Some signs are missing, and the musical text is created using microphotographies. Future developments of the program will focus on resolving these deficiencies and adding more features to the system.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Allégories et mutations vocales au sein de la tragédie grecque moderne a travers les œuvres de Yannis Christou (1 2-1 1) et Michael Adamis (1 2)",
            "Publication year": 2008,
            "Publication url": "http://scholar.uoa.gr/sites/default/files/georgaki/files/42_2008_georgaki_allegories_vocales.tragedie_grecque.pdf",
            "Abstract": "Depuis son apparition à Athènes, à la fin du vie siècle avant notre ère, la tragédie grecque1 n’a cessé d’être l’objet de débats récurrents. À la suite de Platon et d’Aristote, de nombreux spécialistes, qu’ils soient philologues, philosophes, anthropologues, historiens, voire psychanalystes, se sont inlassablement interrogés sur la naissance et la nature de cette création profondément originale qui fut l’origine du théâtre et de l’opéra, et lui ont conféré un sens et une portée à chaque fois différents: aux analyses contrastées (pour ne pas dire profondément antithétiques) de F. Nietzsche et de U. Von Wilamowitz2, ont succédé les lectures proposées par les «Ritualistes de l’École de Cambridge», les «Philologues de l’École de Lille»,«les Anthropologues de l’École de Paris», etc.1. À propos de la naissance de la tragédie grecque nous savons seulement que le premier concours tragique se déroule en 524 av. J.-C. La première tragédie qui nous soit conservée est les Perses d’Eschyle, représentée en 472 av. J.-C. Aristote définit la tragédie comme «l’imitation d’une action noble [...] faite par des personnages en action et non par le moyen d’une narration, et qui, par l’entremise de la pitié et de la crainte, accomplit la purgation (catharsis) des émotions de ce genre»",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Music Interface for Visually Impaired People in the WEDELMUSIC Environment. Design and Architecture.",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/61942591/georgaki.pdf",
            "Abstract": "In this poster we present the architecture of a new music interface for blind musicians, integrated in the WEDELMUSIC 1 environment which is under development at ILSP 2. Our scope is to facilitate the access of visually impaired persons to musical databases (scores, audio and MIDI files) via Internet and give them the possibility to edit and create musical scores.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Biomusic: The carrier",
            "Publication year": 2012,
            "Publication url": "https://www.ingentaconnect.com/content/intellect/ta/2012/00000009/F0020002/art00016",
            "Abstract": "This article investigates the concept of sound, in relation to the new means and sciences from different perspectives, ultimately providing an analysis of the newborn artistic movement of bioart. It is divided into two parts. The first part of the study is based upon reference, investigating the interconnection between art and science. This mechanism is characterized by transformation processes in the interdisciplinary practices that are applied mainly by various artists and movements of the post-Second World War period. The expressive element seeks an unworldly explanation through audio and visual conjunctions. This nature is obvious in Paul Klee’s reflections of musical elements in his paintings, and Rimmington’s attempts to marry audio-visual influences in his ‘colour organs’. The experimentations of composers such as Xenakis and Stockhausen at various locations with light and colour illustrate the continuous …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:4TOpqqG69KYC",
            "Publisher": "Intellect"
        },
        {
            "Title": "iSound Pedagogy Through Polyagogy: Initiation to Xenakis' World in Primary School Through the HighC Interactive Whiteboard",
            "Publication year": 2015,
            "Publication url": "https://www.torrossa.com/gs/resourceProxy?an=4888260&publisher=FZ2990#page=242",
            "Abstract": "The innovative invention of Xenakis’ UPIC or POLYAGOGY (1977) has opened many discussions on its pedagogical value as a tool for the exploration and creation of the sound. This environment exalts Xenakis’ pedagogical and compositional approach, but also opens new directions in the conception of virtual music instruments, and especially on interface design as a medium between performer and computer and the interaction between image and sound.In this presentation we will present visionary Xenakis’ scientific thought on the conception of “polyagogy”(1977) through the dual interactive morphogenesis of the sound to image and the impact that this tool has in the age of “cyberagogy” and education communities. We discuss Polyagogy as a technological tool and product of a scientific research which has been a paradigmatic inspiration platform for developers of sound design graphic software. We discuss …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Two Ecstasies: Before and Beyond Formalisation",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=17348813618075765363&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "National and Kapodistrian University"
        },
        {
            "Title": "SMC’07",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Anastasia-Georgaki/publication/230735474_S_M_C_'_0_7_4th_Sound_and_Music_Computing_Conference/links/09e41503b900f9fc9a000000/S-M-C-0-7-4th-Sound-and-Music-Computing-Conference.pdf",
            "Abstract": "SMC’07 Page 1 SMC’07 4th Sound and Music Computing Conference 11-13 July 2007, \nLefkada, Greece PROCEEDINGS Edited by: Charalampos Spyridis, Anastasia Georgaki, \nGeorgios Kouroupetroglou and Christina Anagnostopoulou Organised by: National and \nKapodistrian University of Athens Laboratory of Music Technology & Acoustics, Department \nof Music Studies Signal Processing Laboratory, Department of Informatics and \nTelecommunications in collaboration with the: Ionian University Department of Music \nStudies Page 2 II PROCEEDINGS 4th Sound and Music Computing Conference Title: \nProceedings of the 4th Sound and Music Computing Conference Editors: C. Spyridis, A. \nGeorgaki, G. Kouroupetroglou, C. Anagnostopoulou Edited at: Laboratory of Music \nTechnology & Acoustics, Department of Music Studies Signal Processing Laboratory, \nDepartment of Informatics and Telecommunications National …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reviewing the transformation of sound to image in new computer music software",
            "Publication year": 2007,
            "Publication url": "http://smc.afim-asso.org/smc07/SMC07%20Proceedings/SMC07%20Paper%209.pdf",
            "Abstract": "In the following essay we are going to analyse the relationship between sound and image in computer music. We will be examining sound visualisation software, and its evolution over the thirty-five year timespan in which it has existed. How we judge software, is based on aesthetic criteria, the way they were handed down to us from theories of abstract painting (20th century avant-garde), the theory of montage by Sergei Eisenstein, of neurophysiology (synesthesia, muscular images) and of the successful correspondence of the two media (pixel and music) in the works and theory of James Whitney.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trends on the synthesis of the singing voice: technical problems and perspectives.",
            "Publication year": 2004,
            "Publication url": "http://scholar.uoa.gr/sites/default/files/georgaki/files/19_2004-trends_on_the_synthesis_of_the_singing_voice_icmc.pdf",
            "Abstract": "In this paper we will discuss current research on the synthesis of the singing voice, its technical problems and esthetic issues, and the perspective of creating a vocal synthesizer which could be accessible to composers, musicians and musicologists, as a creative tool for composing, performing, and interpreting forgotten voice techniques of various cultures and bygone times.",
            "Abstract entirety": 1,
            "Author pub id": "1Q9pOAIAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the vocal characteristics of elementary school students: basic assessment tools and methodology",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3459990.3460720",
            "Abstract": "Singing is a very common activity among people and especially children. It is of particular importance in young ages, as it has been suggested to promote the children’s social integration. While singing is a key component of elementary music classes, proper vocal training of young individuals has not been implemented into the current Greek elementary school curriculum. In addition, oftentimes music teachers are not trained to provide proper vocal instruction to young individuals. This work is part of the ASMA research project, which focuses on the social and aesthetic importance of student vocal training and the development of interactive applications supporting its instruction in elementary schools. The main hypothesis is that new technologies informing modern teaching methodologies can support proper vocal practice, by offering teachers individualized feedback on each student’s needs. Within this framework …",
            "Abstract entirety": 0,
            "Author pub id": "1Q9pOAIAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        }
    ]
}]