[{
    "name": "Τραιανός Γιούλτσης",
    "romanize name": "Traianos Gioultsis",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 18133,
    "Scholar name": "Traianos Yioultsis",
    "Scholar id": "PvzNtsQAAAAJ",
    "Affiliation": "Dept. of Electrical and Computer Engineering, Aristotle University of Thessaloniki",
    "Citedby": 1914,
    "Interests": [
        "Antennas and Propagation",
        "Computational Electromagnetics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=PvzNtsQAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Reconfigurable bowtie electromagnetic bandgap‐based microwave filters",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.26316",
            "Abstract": "A controllable bowtie‐like electromagnetic bandgap (EBG)‐based microwave filter is proposed in this article. The device exploits EBG properties to form the desired stopband, whereas tunability is used by means of switching elements. Numerical analysis is performed by a finite element scheme revealing the DC‐extending bandstop behavior of the structure. In addition, a prototype of the proposed filter is constructed and measured. Experimental data demonstrate the robustness of the conducted simulations, while an adequate tuning range is observed. The simple, yet efficient and easily fabricated, design promises operational reconfigurability combined with amplitude tunability. © 2011 Wiley Periodicals, Inc. Microwave Opt Technol Lett 53:2472–2474, 2011; View this article online at wileyonlinelibrary.com. DOI 10.1002/mop.26316",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "An efficient pole extraction technique for the computation of Green's functions in stratified media using a sine transformation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4052630/",
            "Abstract": "An efficient and automatic algorithm for the extraction of surface wave poles of the multilayered spectral-domain Green's function is presented. With the sine transformation, we have managed to locate any pole, no matter how close to the branch point singularity lies, something that has not been feasible with techniques proposed till now. The aforementioned transformation maps the k rho -plane to the w-plane, where the branch point is removed, thus enabling the application of a fast numerical contour integration technique proposed, which is inaccurate when dealing with poles very close to the branch point",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convergence enhancement for the vector finite element modeling of microwaves and antennas via differential evolution",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S143484110500138X",
            "Abstract": "A global optimization technique, based on the differential evolution algorithm is introduced to trace the optimal higher-order Whitney element, with respect to convergence, among a very wide class of parameter-dependent finite elements. Any tetrahedral element of this class provides exactly the same solution, but the convergence of the iterative solution method may significantly vary. Through the proposed comprehensive optimization procedure, the existence of optimal vector finite elements is revealed. The proposed method has been applied to obtain second-order elements utilized in three-dimensional microwave and antenna simulations.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Electromagnetic absorption, reflection and interference shielding in X-band frequency range of low cost ceramic building bricks and sandwich type ceramic tiles using mill scale waste as an admixture",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0272884211005505",
            "Abstract": "General concern for potential health effects of 24 h electromagnetic fields (EMF) exposure has increased over the recent years. This has led to the necessity of developing low cost electromagnetic interference (EMI) shielding and especially absorbing building materials. In the present study the utilization of steel mill scale waste in ceramic bricks for this purpose was investigated, while the development of an improved, regarding mainly absorption performance, building material also occurred. Both ceramic bricks and sandwich type ceramic tiles were found to have good shielding efficiency and absorption performances in the same X-band frequency range (8–12 GHz) while technological and environmental requirements as building materials were also established.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:4DMP91E08xMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Quarter-wave plate metasurfaces on electromagnetically thin polyimide substrates",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5132716",
            "Abstract": "We experimentally demonstrate that electromagnetically thin polyimide substrates can mitigate substrate-induced detrimental effects to the performance of metallic metasurfaces. A planar quarter-wave plate for the microwave K-band is fabricated on a polyimide substrate of deep subwavelength thickness by means of standard photolithography. By properly selecting the combination of the polyimide thickness and the aluminum layer thickness of the metasurface, conversion from linear to circular polarization is achieved at the design frequency. The proposed approach is generic, and it can be applied to the fabrication of mechanically robust, flexible metallic metasurfaces, which are primarily designed to work in a free-standing configuration.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:wbdj-CoPYUoC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Low-Cost Dual-Band E-shaped Patch Antenna for Energy Harvesting Applications Using Grey Wolf Optimizer",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8739560/",
            "Abstract": "Radio frequency energy harvesting is a well promising technique for proactive energy replenishment in next-generation wireless networks. To meet the challenging requirements of power consumption in future wireless networks, new antennas must be designed. In this paper, we refer to the antenna design problem for energy harvesting applications, by introducing a low-cost dual-band E-shaped patch antenna that operates at LoRaWAN and mobile communication frequency bands. The designed antenna is tuned at two different frequencies (866 MHz, 937 MHz) with a satisfactory bandwidth for both frequency bands.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Explicit finite-difference vector beam propagation method based on the iterated Crank-Nicolson scheme",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-26-10-2183",
            "Abstract": "We introduce and develop a new explicit vector beam propagation method, based on the iterated Crank-Nicolson scheme, which is an established numerical method in the area of computational relativity. The proposed approach results in a fast and robust method, characterized by simplicity, efficiency, and versatility. It is free of limitations inherent in implicit beam propagation methods, which are associated with poor convergence or uneconomical use of memory in the solution of large sparse linear systems, and thus it can tackle problems of considerable size and complexity. The advantages offered by this approach are demonstrated by analyzing a multimode interference coupler and a twin-core photonic crystal fiber. A possible wide-angle generalization is also provided.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:dhFuZR0502QC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Analysis and design of fully planar CSRR-enhanced substrate-integrated waveguides and slot antennas for 5G communications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376614/",
            "Abstract": "We present fully planar, low-cost and easy to fabricate Substrate-Integrated Waveguides (SIWs) and Slot Antennas which operate at 5G Communication Bands. The SIW is entirely planar since it is designed using series of side-by-side broadside-coupled complementary split-ring resonators (BC-CSRRs) etched on top and bottom metal ground surfaces of a dielectric substrate. This metamaterial-inspired structure replaces the vias of a classical SIW by providing a negative dielectric effective material parameter behavior which results to the block of the wave propagation to the direction perpendicular to the axis of propagation. Using this structure as a waveguide, slot antennas are consequently designed, by the proper opening of slots on the substrate and the utilization of matching circuits.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mutual coupling reduction in MIMO antennas at 5.6 GHz (WiMAX) based on an proposed uniplanar easily fabricated structure",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6396681/",
            "Abstract": "In this paper a new technique for mutual coupling reduction of uniplanar MIMO antennas is presented. The only necessary information needed, is the transmission coefficient of a plane wave which is propagating over a specific structure, of a new proposed geometry.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computational investigation and design of planar EBG structures for coupling reduction in antenna applications",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6136770/",
            "Abstract": "The uniplanar cross-like compact EBG structure is thoroughly assessed by means of a computational FEM-based eigenvalue analysis. A careful inspection of the dispersion diagram reveals the existence of a nearly-TEM mode that compromises the bandgap behavior, a fact that is also confirmed in coupling performance investigations. The structure is then modified and optimized to maximize the resulting bandgap zone, for mutual coupling reduction in WiMAX MIMO arrays.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast analysis of photonic crystal structures with mixed-order prism macroelements",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-26-13-2002",
            "Abstract": "In this paper, a new concept of a mixed-order prism macroelement is introduced for the analysis of photonic crystal slabs and waveguiding structures. The mixed-order concept used here implies arbitrary orders of variation towards different directions and it differs essentially from the well-known mixed-order approximation that is an integral part of every Whitney element. The reduction of degrees of freedom, achieved by the employment of such elements, facilitates the solution of the resulting eigenvalue equation. Thus, an efficient 3-D finite-element analysis tool is developed to calculate the band structure of both symmetric and asymmetric photonic crystal slabs. Dispersion relation results for two different types of photonic crystal waveguides are also presented, to further verify the method.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An effective modification of conventional beamforming methods suitable for realistic linear antenna arrays",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9036063/",
            "Abstract": "Antenna array beamforming (BF) refers to a real-time procedure that aims at calculating the proper feeding weights applied to the array elements in order to create a main lobe and a number of nulls toward respective preassigned directions. Most of the research performed on BF has been based on a simplified mathematical model, which ignores the nonisotropic radiation pattern of the array elements and the element mutual coupling. This article introduces an innovative way to incorporate the actual radiation pattern of the array elements and the element coupling into two popular deterministic BF methods, thus making these methods applicable to realistic antenna arrays. These two modified methods are applied in several scenarios, where a desired signal and several interference signals with various directions of arrival are received by a realistic microstrip linear antenna array. The statistical analysis performed in …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Beam Propagation Method Based on the Iterated Crank–Nicolson Scheme for Solving Large-Scale Wave Propagation Problems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7093608/",
            "Abstract": "An explicit vectorial beam propagation method, based on the iterated Crank-Nicolson scheme is developed and utilized to solve electromagnetic wave propagation problems in large-scale structures. A full wide-angle extension is studied, based on a direct calculation of the one-way differential operator only in the first propagation step, together with a fast modification along the propagation axis, to account for material and structure variations.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Real-time 3D localization of RFID-tagged products by ground robots and drones with commercial off-the-shelf RFID equipment: Challenges and solutions",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9244904/",
            "Abstract": "In this paper we investigate the problem of localizing passive RFID tags by ground robots and drones. We focus on autonomous robots, capable of entering a previously unknown environment, creating a 3D map of it, navigating safely in it, localizing themselves while moving, then localizing all RFID tagged objects and pinpointing their locations in the 3D map with cm accuracy. To the best of our knowledge, this is the first paper that presents the complex joint problem, including challenges from the field of robotics - i) sensors utilization, ii) local and global path planners, iii) navigation, iv) simultaneous localization of the robot and mapping - and from the field of RFIDs - vi) localization of the tags. We restrict our analysis to solutions, involving commercial UHF EPC Gen2 RFID tags, commercial off-the-self RFID readers and 3D real-time-only methods for tag-localization. We briefly present a new method, suitable for real …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementation of antenna array beamforming by using a novel neural network structure",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551914/",
            "Abstract": "The present study introduces the implementation of antenna array beamforming based on a new neural network (NN) structure. The NN comprises two hidden layers, which use different interconnectivity patterns. The first one is divided in sublayers, which are equal in number to the inputs of the NN. Each sublayer communicates only with the respective input but is fully interconnected with the second hidden layer. The NN training is performed by using data sets derived by a well-known beamforming technique called minimum variance distortionless response. The trained NN is capable of serving as adaptive beamformer that makes a linear antenna array steer the main lobe towards a desired signal and place nulls towards respective interference signals in the presence of additive zero-mean Gaussian noise. The performance of the trained NN is tested by estimating the mean absolute deviation of main lobe and …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Higher order approaches of FDTD and TVFE methods for the accurate analysis of fractal antenna arrays",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1198441/",
            "Abstract": "In this paper, higher order renditions of two popular numerical methods are proposed for the precise modeling of fractal antenna array structures. Particularly, a higher order finite difference time domain (FDTD) method, which introduces nonstandard differential operators, and second-order curl-conforming vector finite elements with optimized convergence behavior are considered. These techniques attain sufficient accuracy and reduced dispersion errors, even when coarse discretizations are utilized and, therefore, are more preferable compared to lower order approaches, especially in the case of large computational domains. Their enhanced performance is exploited for the rigorous investigation of the radiation properties of several fractal arrays with complex geometrical features.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal synthesis of finite difference models for multiconductor transmission lines via Gaussian spectral rules",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1008234/",
            "Abstract": "We present an algorithm for the generation of optimal, nonuniform finite difference grids for the analysis of multiconductor transmission lines (MTL). Such MTL segments are the basic constitutive elements of large interconnect networks used for broadband signal transmission in state-of-the-art, GHz processor-based, computing systems. The algorithm is based on a Pade-Chebyshev approximation of the input impedance, implemented via the Lanczos procedure, and results in compact, multi-port, frequency-dependent representations of MTLs. A dramatic reduction of computational time is possible, using just over two points per wavelength to achieve superexponential convergence in the response at the input of the line. Moreover, the generated models have the advantage to be passive by construction, which enables their efficient incorporation into SPICE-based simulation tools for circuit design.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Consistent study of graphene structures through the direct incorporation of surface conductivity",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6749110/",
            "Abstract": "An efficient 3-D FDTD formulation for the precise analysis of electromagnetic phenomena in graphene structures is presented in this paper. The new concept considers the surface nature of graphene's conductivity and encompasses it directly into the integral form of Maxwell's equations, avoiding the necessity to discretize the material's transverse dimension via a subcell process. Hence, the proposed technique is much easier to implement and combined with existing FDTD codes, as it requires less computational time. Numerical verification involving comparisons with closed-form solutions and the results of other schemes, exhibits the high accuracy of the algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Localization of RFID tags by a moving robot, via phase unwrapping and non-linear optimization",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8813050/",
            "Abstract": "In this paper, we propose a new method for the localization of RFID tags, by deploying off-the-shelf RFID equipment on a robotic platform. The constructed robot is capable to perform Simultaneous Localization (of its own position) and Mapping (SLAM) of the environment and then locate the RFID tags around its path. The proposed method is based on properly treating the measured phase of the backscattered signal by each tag at the reader's antenna, located on top of the robot. More specifically, the measured phase samples are reconstructed, such that the 2π discontinuities are eliminated (phase-unwrapping). This allows for the formation of an optimization problem, which can be solved rapidly by standard methods. The proposed method is experimentally compared against the SAR/imaging methods, which represent the accuracy benchmark in prior-art, deploying off-the-shelf equipment. It is shown that the …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Real-Time, Robot-Based, 3D Localization of RFID Tags, by Transforming Phase Measurements to a Linear Optimization Problem",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9509296/",
            "Abstract": "In this paper, we propose a prototype method for fast and accurate 3D localization of RFID-tagged items by a mobile robot. The robot performs Simultaneous Localization of its own pose and Mapping of the surrounding environment (SLAM). It is equipped with RFID readers and antennas placed at different heights, collecting phase-measurements by all tags. Thanks to the self-localization property of the robot, a synthetic aperture is created for each tag. In this paper, we have manipulated the set of phase-measurements, combined with the known poses of the robot to craft an overdetermined system of linear equations which pinpoints the location of the tag. The linearity of the system preserves that localization is achieved rapidly. The problem is solved for any arbitrary movement of the robot and extended in three dimensions. The proposed method is experimentally compared against the state-of-the-art in SAR-based …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation of EMC in High-Speed on-Chip Transmission Lines by a New Hybrid Quasi-Static Finite Difference–FEM Technique",
            "Publication year": 2005,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10340",
            "Abstract": "In this paper we present a new computational technique to investigate wave phenomena and EMC/EMI interactions in high speed transmission lines and interconnects on the chip level. The proposed time-domain method is based on the very different nature of the electromagnetic problem in the conductors and semiconductors, compared to the insulating media that separate conducting regions and fill the intermediate volume. Therefore, the purely static problem in the regions filled with silicon oxide is totally separated from the diffusion problem in the conducting regions. The latter one is solved by means of a simple and efficient DuFort-Frankel technique using finite differences, while the static problem is dealt with by means of a finite element method with coarse meshing, since outside the conductors the field variations are much less intense. In each time step, the problems in the two regions are appropriately coupled by means of proper interface conditions.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A nonorthogonal higher-order wavelet-oriented FDTD technique for 3-D waveguide structures on generalized curvilinear grids",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/952591/",
            "Abstract": "A generalized higher-order FDTD rendition of the covariant and contravariant vector component theory for the accurate modeling of complex waveguides in 3-D nonorthogonal curvilinear coordinates, is presented in this paper. The novel algorithm, which postulates conventional and nonstandard concepts, embodies a spatially-localized wavelet-Galerkin formulation in order to efficiently deal with fast field variations in the vicinity of arbitrarily-angled wedges. The proposed method is combined with a pulsed excitation and enhanced unsplit-field PMLs thus, achieving significant accuracy and suppression of all discretization errors with a simultaneous diminishment of computational resources, as indicated by various numerical results.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Miniaturized directivity-adjustable antennas for enhanced vehicular wireless communications and EMC-optimized automotive electronics",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7297584/",
            "Abstract": "A family of compact-size wideband antennas with controllable traits and directivity is introduced in this paper for efficient wireless communications in the automotive regime. The proposed radiators are optimized in terms of unhindered EMC function, even when other vehicle electronic systems are involved. Moreover, to attain reliable designs, a generalized explicit method of scalable accuracy is developed. The featured technique combines a finite-volume time-domain and a pseudo-spectral time-domain approach which divide the domain into manageable regions. This concept leads to very accurate and economical discrete models, free of lattice artifacts. Results, compared with reference or measurement data, reveal the benefits of the miniaturized antennas and substantiate their potential applicability.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-chip interconnects modeling in time-domain using the explicit DuFort-Frankel algorithm",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4264249/",
            "Abstract": "In this paper, a tractable time domain scheme is proposed for the effective modeling of microwave planar structures. Our study relies on the DuFort-Frankel algorithm (DF) which is in principle an alternative of the conventional finite-difference time-domain (FDTD) technique but yields unconditionally stable estimates and is more accurate. We focus on the integrated stripline circuits since they are less susceptible to radiation and dispersion effects compared to microstrips. A quasi-static approximation was adopted and a comprehensive field characterization is achieved by discretizing the time and space into cells and thereafter applying the Maxwell's equations and boundary conditions. Finally, the frequency dependent circuit parameters, namely the per-unit length (p.u.l) resistance and conductance, were estimated using the fundamental laws of electromagnetism.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Asymmetric Si-slot Coupler with Nonreciprocal Response Based on Graphene Saturable Absorption",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9395480/",
            "Abstract": "We present the study of a proof-of-concept integrated device that can be used as a nonlinear broadband isolator. The device is based on the asymmetric loading of a highly-confining silicon-slot photonic coupler with graphene layers, whose ultrafast and low-threshold saturable absorption can be exploited for nonreciprocal transmission between the cross-ports of the coupler. The structure is essentially a non-Hermitian system, whose exceptional points are briefly discussed. The nonlinear device is modeled with a coupled Schrödinger equation system whose validity is checked by full-vector finite element-based beam-propagation method simulations in CW. The numerically computed performance reveals a nonreciprocal intensity range (NRIR) in the vicinity of 100 mW peak power with a bandwidth spanning tens of nanometers, from CW down to ps-long pulses. Finally, the combination of saturable absorption and …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast numerical computation of Green's functions for unbounded planar stratified media with a finite-difference technique and Gaussian spectral rules",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4061061/",
            "Abstract": "A computational methodology for the calculation of Green's functions for unbounded planar stratified media is proposed in this paper. Unlike several techniques that are based on analytical calculations in the spectral domain, this one is based on a previously proposed finite-difference discretization of the corresponding one-dimensional differential equation and the resulting spectral matrix problem. A smart approximation of the radiation boundary condition, based on the mathematical methodology of Gaussian spectral rules and the associated construction of an optimal nonuniform grid in the unbounded space, succeeds in maintaining the tridiagonal nature of the matrix spectral problem, providing a highly efficient means of computing the desired multilayer Green's function",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A semi-automated approach towards generating three-dimensional mesh of the heart using a hybrid MRI/histology database",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10255842.2010.481286",
            "Abstract": "Both the forward and inverse problems of electrocardiography rely on the precise modelling of the anatomic and electrical properties of the thoracic tissues. This, in turn, requires good knowledge of the electrical anisotropy as well as conductivity inhomogeneity of the heart, lungs and the rest of the thorax. Cardiac electrical anisotropy is related to its microstructure (fibre length, density and orientation). We hereby present detailed three-dimensional (3D) meshes of the thorax and heart, using image data from contiguous 2D magnetic resonance (MR) imaging slices as well as a realistic 3D cardiac fibre orientation model that derives its data from high-resolution ex vivo human heart MR images and from histology specimens of heart tissue. Using specific software, we integrated the 3D thorax and heart meshes in one that addresses the related modelling requirements for the solution of the forward and inverse problems …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:r0BpntZqJG4C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "An integrated computational and experimental approach oflow power microwave pulse-modulated nonthermal biological effects on prenatal development.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=2772461634086519764&hl=en&oi=scholarr",
            "Abstract": "An integrated study of pulse-modulated very low power density microwave radiation biological effects is presented. It employs a combination of a computational model of the rat and extensive in vivo experiments on rat embryos, during embryogenesis and organogenesis. The whole investigation is further enhanced via an immunological and histochemical investigation of the rats' organs. A simulation concerning similar conditions of exposure for human beings has been also performed, based on a realisticcase of a far field GSM-like base station environment. Hence, an attempt is performed to project the results to a human-oriented case, under conditions of continuous exposure. The whole study is one of the first to combine results obtained by the computational, the experimental and the biomolecular investigations, and attempts a discussion on existing standards for protection from low power density, long-term …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dual-core photonic crystal fibers for tunable polarization mode dispersion compensation",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-22-21680",
            "Abstract": "A novel type of dual concentric core photonic crystal fiber (PCF) is proposed and theoretically analyzed, aiming at the design of tunable dispersive fiber elements for polarization-mode-dispersion (PMD) compensation. The adjustment of the fiber’s geometrical birefringence through the proper selection of structural parameters leads to very high values of differential group-delay (DGD). Moreover, the value of DGD can be dynamically tuned by infiltrating the outer core capillaries of the PCF with an optical liquid, which allows for the thermal control of its refractive index. Such fibers are envisaged as tunable dispersive fiber elements for PMD compensation or emulation modules.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:Se3iqnhoufwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Evaluation of the electromagnetic fields exposure produced by WiMAX signals",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294714/",
            "Abstract": "Wireless networking technologies in recent years have witnessed important developments since the advantages benefit both data transmission service providers, and individuals or ordinary users. Ease of installation of a wireless network, led to the development of millions of Wi-Fi networks throughout the world. Nevertheless, Wi-Fi has certain drawbacks that inspired the implementation of a new technology called WiMAX. In 2003, the IEEE 802.16™ standard, also known as WiMAX (Worldwide Interoperability for Microwave Access) was adopted, in order to meet the requirements for broadband wireless access. The purpose of this paper is to study how the electromagnetic fields generated by WiMAX base stations can be evaluated in terms of exposure.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive beamforming with sidelobe suppression by placing extra radiation pattern nulls",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8668532/",
            "Abstract": "A new iterative adaptive beamforming (ABF) algorithm based on conventional beamformers is proposed in order not only to steer the main lobe toward the desired signal and place radiation pattern nulls toward respective interference signals but also to achieve the desired sidelobe level (SLL). Thus, the algorithm becomes less susceptible to unpredicted interference signals than conventional beamformers. In each iteration, the algorithm finds the direction of the peak of the greatest sidelobe, which is considered as direction of arrival (DoA) of a hypothetical interference signal, and the conventional beamformer is then employed to find proper antenna array weights that produce an extra null toward this direction. The iterative procedure stops when the desired SLL is obtained. The algorithm is applied on three conventional beamformers and is tested for various signal DoA, while the direction deviation of the main lobe …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fully Planar CSRR-SIW Slot Antennas of Optimized Gain and Enhanced Bandwidth for Millimeter Wave and 5G Communications",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8730632/",
            "Abstract": "We present fully planar, low-cost and easy to fabricate slot antennas which operate at two different frequency bands. The designs are based on the CSRR-SIW concept, which is a strong alternative for cost-effective implementation for millimeter circuits and antennas. The proposed antennas exhibit very competitive characteristics in terms of their bandwidth and gain.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hybrid parabolic equation—Integral equation technique for wave propagation modeling of indoor communications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4787475/",
            "Abstract": "We present a 3D hybrid technique for the simulation of wave propagation in complex indoor communication environments. The hybrid method employs a wide-angle parabolic equation to estimate the electromagnetic field within walls and obstacles, whereas a correction based on a Green's function approach provides clearly improved field approximations. The proposed method is applied in 3D using simple validation models, whereas an approximate 2D analysis is attempted for a much more realistic office space. The simulation is compared with measurements and a particularly enhanced accuracy is observed. The hybrid technique is more systematic and automated, compared to ray-tracing methods and has moderate computational requirements.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low cost wide band and circularly polarized modified half E-shaped patch antenna for 5G mobile communications",
            "Publication year": 2018,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp.2018.1200",
            "Abstract": "The upcoming fifth generation (5G) technology for mobile communications will offer multi-Gbps data rates for each user. Such data rates require wide spectrum, which is available at millimeter wave frequencies. In order to meet the challenging 5G requirements new antennas have to be designed. In this paper, we address the antenna design problem for 5G mobile communications by designing a low cost half-E-shaped patch antenna that operates at 25GHz. The designed antenna is circularly polarized at a satisfactory bandwidth and also exhibits wide band behavior.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:u9iWguZQMMsC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Computational Analysis of Graphene-Based Periodic Structures via a Three-Dimensional Field-Flux Eigenmode Finite Element Formulation",
            "Publication year": 2020,
            "Publication url": "https://www.jpier.org/PIERM/pier.php?paper=20010302",
            "Abstract": "We present a three-dimensional finite element (FEM) field-flux eigenmode formulation, able to provide accurate modeling of the propagation characteristics of periodic structures featuring graphene. The proposed formulation leads to a linear eigenmode problem, where the effective refractive index is an unknown eigenvalue; the electric field intensity and magnetic flux density are the state variables; and graphene's contribution is efficiently incorporated via a finite conductivity boundary condition. The FEM formulation is spurious-mode free and capable of providing accurate dispersion diagrams and field distributions for arbitrary propagation directions, as opposed toother analytical or numerical approaches, while also efficiently dealing with graphene's dispersive nature. The novelty of the presented approximation is substantiated by computational results for structures incorporating graphene of random periodicity …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:Mojj43d5GZwC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Design and optimization of wideband log-periodic dipole arrays under requirements for high gain, high frontto-back ratio, optimal gain flatness, and low side lobe level: The application of invasive weed optimization",
            "Publication year": 2015,
            "Publication url": "https://pure.unic.ac.cy/en/publications/design-and-optimization-of-wideband-log-periodic-dipole-arrays-un",
            "Abstract": "The design and optimization of wideband log-periodic dipole arrays (LPDAs) are presented in this chapter. The LPDAs are expected to simultaneously satisfy several requirements inside a wide operating frequency range. In particular, the optimized LPDA has to provide standing wave ratio (SWR) below a predefined value, gain values as high as possible, gain flatness (GF) below a desired value, both side lobe level (SLL) and front-to-back ratio (FBR) below a desired value, and all these requirements must be satisfied at the same time inside the entire frequency range of operation. Since the design problem is nonlinear and inherently multiobjective, the simultaneous realization of all the above requirements can only be achieved by applying global optimization algorithms. These algorithms are usually based on evolutionary optimization methods and have been proved to be capable of solving complex nonlinear problems with great success. Such an evolutionary method with high potential in antenna design is presented in this chapter. The method is called invasive weed optimization (IWO) and is applied in conjunction with the method of moments (MoM) to optimize LPDAs under the above-mentioned requirements. The MoM is a well-known full-wave analysis method and is utilized here to extract the radiation characteristics of the LPDA required by the IWO algorithm. Several design cases are studied concerning the LPDA geometry and the operating bandwidth. The derived LPDA geometries exhibit a behavior close to the desired one and therefore are able to enhance the performance of a wireless network in practical applications.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:SP6oXDckpogC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Interfacing dielectric-loaded plasmonic and silicon photonic waveguides: theoretical analysis and experimental demonstration",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6164209/",
            "Abstract": "A comprehensive theoretical analysis of end-fire coupling between dielectric-loaded surface plasmon polariton and rib/wire silicon-on-insulator (SOI) waveguides is presented. Simulations are based on the 3-D vector finite element method. The geometrical parameters of the interface are varied in order to identify the ones leading to optimum performance, i.e., maximum coupling efficiency. Fabrication tolerances about the optimum parameter values are also assessed. In addition, the effect of a longitudinal metallic stripe gap on coupling efficiency is quantified, since such gaps have been observed in fabricated structures. Finally, theoretical results are compared against insertion loss measurements, carried out for two distinct sets of samples comprising rib and wire SOI waveguides, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gradient-based adjoint-variable optimization of broadband microstrip antennas with mixed-order prism macroelements",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1434841107001240",
            "Abstract": "This paper describes a new finite element method (FEM)-based adjoint-variable approach to design and optimization of planar microwave circuits using sensitivity analysis, with respect to small variations of their design parameters. The implementation is based on a specially developed class of mixed-order prismatic macroelements, suitable for an efficient analysis of planar microwave structures. Their use, combined with a simple probe feed model, not only reduces the overall computational effort but also facilitates a straightforward derivation of port parameter sensitivities. Explicit expressions are given for the adjoint solution and S-parameter sensitivity and the process is verified through the design and optimization of two slotted broadband microstrip patch antennas.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:aqlVkmm33-oC",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Use Ultra-Wideband Discone Rectenna for Broadband RF Energy Harvesting Applications",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/698976",
            "Abstract": "In this study, a broadband Radio Frequency (RF) energy harvester implementation is presented. The system uses a broadband discone antenna, which can operate efficiently in a broad frequency spectrum, including LTE, DCS 1800 and UMTS 2100 cellular frequency bands. The system is able to harvest energy from various electromagnetic field sources, thus has the potential to efficiently charge a storage energy element in a short time. The prototype broadband RF energy harvester was tested in the laboratory and also in a typical urban environment. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:t6usbXjVLHcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Modal analysis of graphene microtubes utilizing a two-dimensional vectorial finite element method",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00339-016-9862-8.pdf",
            "Abstract": "The propagation properties of surface plasmon polariton waves on graphene microtubes were investigated in this paper. A precise vectorial finite element modal solver that models graphene as a surface boundary condition is devised for the graphene microribbon case. The solver extracts the dispersion curves through the effective index of various supported modes, while its propagation length, compared to the microstrip’s one, unveils a notable behavior of surface waves. Also, radial and axial electric field components are evaluated at different frequencies, indicating the strong confinement at the surface of graphene and the impact of the microtubes’ diameter on the propagating modes.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Breaking reciprocity in a non-Hermitian photonic coupler with saturable absorption",
            "Publication year": 2021,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.103.053503",
            "Abstract": "We study the breaking of reciprocity in non-Hermitian coupled photonic waveguides by the simultaneous action of the nonlinear effect of saturable absorption and the presence of exceptional points. The nonlinear response of such a system is studied in depth, giving physical insight into the operational principles and fundamental limitations while producing analytical and semianalytical results for the transmission and nonreciprocal intensity range. We numerically validate the theoretical results and assess important performance metrics for the nonreciprocal operation of such a device. This class of passive nonresonant devices can offer broadband on-chip nonreciprocal operation, with significant potential for high-speed applications.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:9vf0nzSNQJEC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Vasileios M. Kapinas",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=7759205460573871846&hl=en&oi=scholarr",
            "Abstract": "Όπως και την πρώτη φορά, απαιτήθηκε πολύμηνη προσπάθεια μέχρι να εξαχθούν τα αποτελέσματα και συμπεράσματα που παρουσιάζονται στο τέλος της εργασίας. Το διάστημα όμως αυτό ήταν απαραίτητο, έτσι ώστε να μελετηθούν και τελικά να αξιολογηθούν οι διάφορες μεθοδολογίες που εφαρμόστηκαν για την αντιμετώπιση του προβλήματος.Νιώθω την υποχρέωση να ευχαριστήσω θερμά τον κ. Θεόδωρο Τσιμπούκη για τη δυνατότητα που μου έδωσε να συνεργαστώ μαζί του για δεύτερη φορά, όπως επίσης και τον κ. Τραϊανό Γιούλτση για την ανεκτίμητη και πάντα προθυμότατη βοήθεια του, χωρίς την οποία η παρούσα εργασία θα ήταν αδύνατο να πραγματοποιηθεί.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ηigher Οrder Vector Finite Elements–An Elegant Theoretical Development and Construction",
            "Publication year": 2007,
            "Publication url": "https://www.topo.auth.gr/greek/ORG_DOMI/EMERITUS/TOMOS_TZIMOPOULOS/papers/Yioultsis_Tsiboukis.pdf",
            "Abstract": "We present here a generalized theory of higher order vector finite elements. This theory aims at generating tetrahedral Whitney elements with tangential continuity and deals with some fundamental theoretical issues. The proper definition of degrees of freedom and correct modeling of irrotational fields are specifically dealt with, based on principles from topology and differential geometry. The whole set of properties is enforced to the shape functions, in order to produce their explicit expressions. Second and third order vector finite elements are produced and implemented in threedimensional electromagnetic prapagation, radiation and scattering problems, thus providing a promising tool for electromagnetic analysis.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient parabolic equation- finite element model for the analysis of wave propagation in highly complex indoor communication environments.",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=861314654178343773&hl=en&oi=scholarr",
            "Abstract": "In this paper we propose an efficient computational technique to investigate the distribution of the electromagnetic field in complex cases of indoor communication problems, taking into account the exact geometric configuration of the environment under consideration, including walls, metallic structures and other objects. In particular, we consider the highly interesting case of theso-called interface modeling, i.e. when aplane wave propagates to the interior ofa building. The methodology presented herein, is based on a parabolic wave equation in three dimensions, while the cross section of the computational domain, as the wave propagates,is modeled by means of a finite element technique, terminated by highly absorbing PML boundaries. This formulation enables a robust computational modeling of obstacles of complex shape in a fully automated way. On the other hand, the formulation does not make any …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approximation of Grünwald–Letnikov fractional derivative for FDTD modeling of Cole–Cole media",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6749142/",
            "Abstract": "A finite-difference time-domain (FDTD) method for modeling wave propagation in dispersive Cole-Cole media is proposed. The main difficulty in time-domain modeling of a Cole-Cole medium is that the polarization relation that describes its electromagnetic behavior is a differential equation of fractional order. By definition, the fractional derivative of a function is a nonlocal operator and its computation at a time instant involves all previous function values. Thus, the memory demands of a typical FDTD scheme for Cole-Cole media would be high. However, by an appropriate approximation of the Grünwald-Letnikov definition of the fractional derivative, we can implement an FDTD scheme with reasonable memory demands. This is achieved by means of sums of decaying exponentials used to approximate the coefficients that appear in the Grünwald-Letnikov definition. As a result, the FDTD scheme requires the …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convergence-optimized, higher order vector finite elements for microwave simulations",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/959316/",
            "Abstract": "We introduce a general class of higher order parameter-dependent Whitney elements, unlike previous approaches that resulted in specific element definitions. All elements of this kind provide the same solution, but their convergence properties may be significantly different. The most essential fact, though, is the introduction of an optimization procedure, which reveals the existence of an optimal, with respect to convergence, element. The produced second order elements are tested in both two-dimensional (2-D) and three-dimensional (3-D) microwave simulations.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measurements on Modern Wireless Communication Technologies and Estimation of Human Exposure",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-06704-9_5",
            "Abstract": "The evolution of wireless networking technologies in recent years leads to a faster, safer and more efficient knowledge transfer with the demand of growing up the volume of information handled. The ultimate aim of improving the living standards of citizens, requires a new foundation to evaluate and improve the existing to the present relevant measurement techniques and possibly the introduction of new ones. Also, new wireless information propagation models have to be proposed in the future and the old models have to be evaluated and modified for their improvement. This will be achieved by conducting reliable measurements and experimental tests. A key element of such measurements is the estimation of the present uncertainty. In this context, the purpose of this chapter is to study how the electromagnetic fields generated by modern wireless communication base stations can be measured and …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Fingerprinting Localization of RFID tags with Real-Time Performance-Assessment, using a Moving Robot",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8739486/",
            "Abstract": "This work is focused on unmanned inventorying and localization, by deploying an RFID-equipped autonomous robot. The robot is able to perform Simultaneous Localization and Mapping (SLAM), thanks to its optical sensors. As the robot moves inside the target area, it continuously interrogates all RFID tags within range. Passive RFID tags, placed at known locations, are used for the estimation of the locations of the target tags, by properly manipulating the measured backscattered power. The proposed method does not depend on the location of the reader, but only on the locations of the reference tags. Hence, positioning-errors related to SLAM are not accumulated. Mobility of the robot ensures rich collection of measurements. We propose a method for dynamic, real-time configuration of the parameters of the fingerprinting algorithm and real-time evaluation of the localization error of the unknown tags. This is …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A comparative study of the biological effects of various mobile phone wireless LAN antennas",
            "Publication year": 2002,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10330",
            "Abstract": "This paper presents a comprehensive electromagnetic and thermal analysis of radiation and its impact on human beings, due to the use of various types of commonly used mobile phones and communication antennas. This is one of the first studies that deals with a wide-range comparative investigation of modern cell phones, unlike the majority of existing work, which do not extend beyond the obsolete generic phone case. The rather severe, although overlooked, case of wireless local area network antennas is also considered, due to their increasing use and the large times of exposure associated with them. Index Terms Biological application of electromagnetic radiation, electromagnetic radiation effects, FDTD methods, mobile antennas",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Combined Computational and Experimental Investigation of Nonthermal Biological Effects on Prenatal Development due to Radiation from Low Power Microwave Antennas",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Theodoros-Zygiridis/publication/234758521_Combined_computational_and_experimental_investigation_of_nonthermal_biological_effects_on_prenatal_development_due_to_radiation_from_low_power_microwave_antennas/links/00463517d3759bca9b000000/Combined-computational-and-experimental-investigation-of-nonthermal-biological-effects-on-prenatal-development-due-to-radiation-from-low-power-microwave-antennas.pdf",
            "Abstract": "This is an integrated study of the biological effects of pulse-modulated very low power density microwave radiation. It employs a combination of a computational model of the rat and extensive in vivo experiments on rat embryos, during embryogenesis and organogenesis. The whole investigation is further enhanced via an immunological and chemical investigation of the rats' organs. The whole study is one of the first to combine results obtained by the computational, the experimental and the biomolecular investigations and attempts a discussion on existing standards for protection from low power density, long-term electromagnetic field exposure.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ceramic building materials for electromagnetic interference shielding using metallurgical slags",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1179/1743676111Y.0000000009",
            "Abstract": "The technological properties and the electromagnetic shielding efficiency of clay based ceramic building products prepared by using electric arc furnace slag (EAFS) and ladle furnace slag (LFS) as admixtures and fired at various temperatures were investigated. Chemical and mineralogical analyses were performed to characterise EAFS and LFS. The results showed that the ceramic specimens prepared by the addition of EAFS to the clayey material presented better shielding efficiency than the relevant of LFS, both tested in the same X-band frequency range (8–12 GHz). The prepared specimens showed water absorption, flexural and compressive strengths and firing shrinkage within accepted limits. Modulus of rupture and compressive strength values were slightly decreased by increasing the addition of EAFS and LFS. The technological characteristics were found to be affected by both the percentage of EAFS …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "A Real-Time Multi-Antenna SAR-based method for 3D localization of RFID Tags by a Moving Robot",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9393455/",
            "Abstract": "In this paper, we present a prototype method for 3D localization of UHF RFID tags by a moving robot. The proposed method represents an extension of Phase ReLock, PhaseReLockJournal, in 3D space. Phase measurements are collected by at least two antennas, thus a multi-antenna synthetic aperture is created. We propose a new optimization problem, which involves measurements from all different antennas. Thanks to phase-unwrapping, the new multi-antenna optimization problem preserves its convex-like properties. Consequently, it is solved rapidly by standard optimization techniques. Furthermore, we introduce a confidence metric that can identify measured data, which deteriorate the accuracy of the estimations. These can be removed from the measurements’ dataset. We have conducted extensive measurements, employing four antennas on top of a SLAM-enabled robot; i.e. the robot is able to create a …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Explicit scheme for indoor propagation modeling based on the hybrid parabolic-integral equation method",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6206158/",
            "Abstract": "An explicit scheme for wave propagation modeling of indoor environments is presented. The technique is based on the hybrid parabolic-integral equation method, which provides a correction to the parabolic equation method through a Green's function formulation. A modification of the hybrid method is proposed by the introduction of a transmission coefficient at the interfaces between different media. The iterated Crank-Nicolson scheme is used for the numerical implementation. Results confirm the superiority of the proposed technique over the existing one.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EMC analysis of high-speed on-chip interconnects via a mixed quasi-static finite difference—FEM technique",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4137834/",
            "Abstract": "We present a new technique to investigate electromagnetic compatibility/electromagnetic interference (EMC/EMI) interactions in high-speed transmission lines on the chip level. The time-domain method is based on the different nature of the problem in conductors and semiconductors, compared to the insulating media that separate them. Therefore, the static problem in the silicon oxide is separated from the diffusion problem in conductors. The latter one is solved by an efficient DuFort-Frankel technique, while the static problem is solved in a coarse finite element method (FEM) mesh. In each step, the two problems are appropriately coupled by means of the interface conditions. The time-domain nature of this method permits the use of proper fast Fourier transform (FFT)-based postprocessing procedures to calculate the per unit length parameters in a fast and efficient manner",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dielectric and magnetic properties of new rare-earth substituted Ba-hexaferrites in the 2–18 GHz frequency range",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304885309007963",
            "Abstract": "Rare-earth substituted M-type barium hexaferrites with nominal formula (Ba1−xREx)O·5.25(Fe2O3), with RE=Dy or Gd (x=0–0.20), were prepared by the chemical coprecipitation method. Complex permittivity ε*r and permeability μ*r of HDPE–ferrite composites were measured with the coaxial line method in the 2–18 GHz frequency range. The electromagnetic behavior of the composites was correlated to dielectric polarization and magnetic interactions mechanisms, on the basis of the ferrite's physical and structural characteristics. The results show dissimilar effects on the microwave properties of the composites, that may be ascribed to different structural and physical configurations of the Dy- and Gd-substituted hexaferrites.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:Y0pCki6q_DkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Radio environment maps for 5G cognitive radio network",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8741554/",
            "Abstract": "Radio Environment Maps (REMs) have been introduced as a powerful tool in Cognitive Radio Networks to manage inter-transmitter interference. In the evolution of 5G heterogeneous ecosystem REMs are forced to be transformed to a more powerful tool hosting the diverse needs of an immense network. This paper reviews REMs and proposes an enhanced REM architecture for integration in the 5G network.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "General multiple order prism vector finite macroelements for planar microwave circuits and EBGs",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4787474/",
            "Abstract": "We present a class of mixed order prism macroelements, appropriate for an efficient analysis of 3-D planar microwave circuits and electromagnetic bandgaps (EBGs). The multiple order concept used in this context implies arbitrary orders of variation toward different directions and is substantially different, compared to the well-known mixed order property, associated to any tangentially continuous vector element. Prism elements of first order in the planar directions and arbitrary high orders along the prism axis are developed by this approach.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis and Design of Hybrid and Graphene-Based Plasmonic Waveguide Components",
            "Publication year": 2015,
            "Publication url": "https://www.scitepress.org/papers/2015/58889/58889.pdf",
            "Abstract": "We present an efficient finite element formulation for the eigenmode analysis of graphene-based plasmonic waveguides with switching functionalities. The formulation is full-vectorial and addresses graphene as a surface conductivity, as opposed to bulky material considerations, thus eliminating the need for fine discretizations inside thin graphene models. Based on this technique, several graphene-enhanced plasmonic waveguides and components with promising characteristics are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design of fully-planar CSRR-based substrate integrated waveguide circuits",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8879123/",
            "Abstract": "We present here a fully planar, low-cost and easy to fabricate power divider and a slot array antenna operating at 5G communication bands, based on a new version of the substrate integrated waveguide (SIW). The proposed SIW is synthesized by replacing each via row, with two rows of broadside-coupled complementary split ring resonators (BC-CSRRs), etched on the top and bottom metal ground surfaces of the dielectric substrate. Such resonators provide a negative effective permittivity and are capable of perfectly confining the wave within the propagating channel. The proposed waveguide exhibits excellent propagation characteristics, with losses close to those of the conventional SIW, providing a highly promising platform to implement low-cost planar components for 5G applications.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:q3oQSFYPqjQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fully planar slow-wave substrate integrated waveguide based on broadside-coupled complementary split ring resonators for mmWave and 5G components",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/document/9161214/",
            "Abstract": "The authors propose a new metamaterial-inspired substrate integrated waveguide (SIW) that utilises broadside-coupled complementary split ring resonators (BC-CSRRs) instead of metalised via holes, to confine propagation within the guiding channel. Due to the resonant behaviour of the BC-CSRRs, blocking of in-plane propagation is achieved in a straightforward and efficient manner. The final waveguide is synthesised by employing two rows of CSRRs instead of each via row, resulting in a fully-planar, easy to fabricate, cost-effective solution. This new waveguide exhibits outstanding propagation characteristics, with losses close to those of the conventional SIW, providing a highly promising platform to implement low-cost planar components for millimetre-wave applications. To further confirm the potential of implementing CSRR-based SIW components, they provide designs of leaky-wave antennas in the X- and …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IET"
        },
        {
            "Title": "Efficient analysis of planar microwave circuits with mixed‐order prism vector finite macroelements",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jnm.683",
            "Abstract": "This paper introduces a new concept of a mixed‐order prism macroelement, suitable for an efficient analysis of three‐dimensional planar microwave circuits, using two‐dimensional meshes and preprocessors. The mixed‐order concept used here implies arbitrary orders of variation in different directions and differs essentially from the well‐known mixed‐order approximation that is an integral part of every Whitney element. It is the existence of a related systematic theory of higher‐order vector finite elements, previously documented, that facilitates the introduction of such a concept. The second‐ and third‐order elements, derived by this approach, are successfully applied in the analysis of planar microwave circuits, rendering the application of finite element method in such problems still a favorable option. Copyright © 2008 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:KlAtU1dfN6UC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Exponential log-periodic antenna design using improved particle swarm optimization with velocity mutation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7835106/",
            "Abstract": "An improved particle swarm optimization (PSO) method applied to the design of a new wideband log-periodic antenna (LPA) geometry is introduced. This new PSO variant, called PSO with velocity mutation (PSOvm), induces mutation on the velocities of those particles that cannot improve their position. The proposed LPA consists of wire dipoles with lengths and distances varied according to an exponential rule, which is defined by two specific parameters called length factor and spacing factor. The LPA is optimized for operation in 790-6000 MHz frequency range, in order to cover the most usual wireless services in practice, and also to provide in this range the highest possible forward gain, gain flatness below 2 dB, secondary lobe level below -20 dB with respect to the main lobe peak, and standing wave ratio below 2. To demonstrate its superiority in terms of performance, PSOvm is compared with well-known …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An inverse scattering approach based on the differential E-formulation",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1315829/",
            "Abstract": "An inverse scattering technique based on the differential E-formulation in the frequency domain is proposed. The inversion is achieved by minimizing a cost functional, taking into account the discrepancy between measured and estimated field values, while the Helmholtz wave equation is set as constraint. The Fre/spl acute/chet derivatives of the cost functional with respect to the scatterer properties are derived analytically by means of the calculus of variations. Edge elements are used for the numerical treatment of the problem.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Synthesis of porous iron oxide ceramics using Greek wooden templates and mill scale waste for EMI applications",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0272884211007061",
            "Abstract": "The scope of this study is the synthesis of low cost iron oxide ceramics with porous structure for lightweight Electromagnetic Interference (EMI) shielding applications, using mill scale waste as the initial material, utilizing Greek wood templates. These wood-templated iron oxide (Fe2O3) ceramics were prepared by impregnation of inorganic precursor solution, derivated from mill scale waste, into four different kinds of Greek native wood templates; pine, fir, poplar and beech, followed by thermal treatment.Scanning Electron Microscopy (SEM) was used to investigate the microstructure of the prepared wood-templated iron oxide specimens. Their iron and oxygen contents were validated by Scanning Electron Microscopy–Energy-Dispersive X-ray Spectroscopy (SEM–EDX) and their mineralogical composition by X-ray Powder Diffractometry (XRD). The wooden substances were found to be completely removed and the …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:UebtZRa9Y70C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fast analysis of metasurfaces through temporal coupled-mode theory",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8957663/",
            "Abstract": "In this article, a rigorous temporal coupled-mode theory (CMT) formalism is developed, to analyze metasurface (MTS)-based structures. Such MTSs are generally rather complex, requiring extensive, full-wave simulations. To facilitate their design and minimize the associated computational demand, the CMT solves a small linear system of equations, fed by the results of certain much simpler and less time- and memory-consuming eigenvalue problems. The proposed method is versatile and offers an initial, valuable estimation of the structure's frequency response, which may be used as a guideline for the final MTS fine tuning. As proof of concept, split-ring resonator (SRR) MTSs coupled to microstrip lines are analyzed, and their response is compared with the full-wave finite-element method (FEM) results.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EMC Analysis of High-Speed On-Chip Interconnects via a Mixed Quasi-Static Finite Difference—FEM Technique",
            "Publication year": 2007,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10346",
            "Abstract": "We present a new technique to investigate electromagnetic compatibility/electromagnetic interference (EMC/EMI) interactions in high-speed transmission lines on the chip level. The time-domain method is based on the different nature of the problem in conductors and semiconductors, compared to the insulating media that separate them. Therefore, the static problem in the silicon oxide is separated from the diffusion problem in conductors. The latter one is solved by an efficient DuFort-Frankel technique, while the static problem is solved in a coarse finite element method (FEM) mesh. In each step, the two problems are appropriately coupled by means of the interface conditions. The time-domain nature of this method permits the use of proper fast Fourier transform (FFT)-based postprocessing procedures to calculate the per unit length parameters in a fast and efficient manner.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Uniplanar Substrate Integrated Waveguide based on Edge-coupled Complementary Split-ring Resonators for Millimeter-wave Components",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9411140/",
            "Abstract": "We propose a novel uniplanar substrate integrated waveguide (SIW), based on edge-coupled complementary split-ring resonators (EC-CSRRs) for designing mm-Wave components. A different metamaterial-inspired SIW, utilizing broadside-coupled CSRRs (BC-CSRRs), has already been presented in our previous work, exhibiting low losses, comparable to those of the SIW, a fully-planar form and a relatively simple fabrication process. Our new version of the SIW, the EC-CSRR SIW, is accompanied by a significantly simpler manufacturing process, as the EC-CSRRs are etched only on the top plane of the substrate, avoiding possible misalignments of the upper and lower CSRRs. The EC-CSRR SIW is uniplanar, with losses comparable to those of the BC-CSRR SIW and conventional SIW, provides the potential of using thicker substrates, and yields a promising platform for realizing mmWave components, such as …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:ye4kPcJQO24C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation of Optimization Techniques for the Convergence Improvement of Higher-Order Whitney Element FEM in RF and Microwave Analysis",
            "Publication year": 2003,
            "Publication url": "http://faraday.ee.auth.gr/papers/yioultsis2003.pdf",
            "Abstract": "A new concept based on optimization of convergence for higher order FEM is presented in this paper. The key feature is the existence of a multidimensional family of higher order vector finite elements which allows infinitely many choices of different basis functions providing the same accuracy but being different with respect to convergence properties. Several optimization schemes are investigated and proposed to trace the optimal element.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Near optimal synthesis of exponential log-periodic dipole array geometry by applying invasive weed optimization",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551911/",
            "Abstract": "A new geometry of log-periodic dipole array (LPDA) is presented in this work. Unlike the traditional LPDA geometry, where all dipoles are considered to be inside the same angular sector, the proposed LPDA adopts an exponential geometry, described by two parameters called exponential scale factor and exponential relative spacing. By properly adjusting these two parameters, the exponential LPDA (ELPDA) geometry obtains wideband behavior with excellent radiation characteristics. A near optimal ELPDA geometry that achieves the desired radiation characteristics inside the required bandwidth is found in the present work by applying a recently developed method called invasive weed optimization (IWO). In particular, the ELPDA is required to operate in the 800-3300MHz frequency range under specific constraints concerning standing wave ratio, forward gain, gain flatness, front-to-back ratio and side lobe …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Metamaterial-based design of planar compact MIMO monopoles",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6423800/",
            "Abstract": "A systematic design of planar MIMO monopole antennas with significantly reduced mutual coupling is presented, based on the concept of metamaterials. The design is performed by means of individual rectangular loop resonators, placed in the space between the antenna elements. The underlying principle is that resonators act like small metamaterial samples, thus providing an effective means of controlling electromagnetic wave propagation. The proposed design achieves considerably high levels of isolation between antenna elements, without essentially affecting the simplicity and planarity of the MIMO antenna.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robotic inventorying and localization of rfid tags, exploiting phase-fingerprinting",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8892183/",
            "Abstract": "In this paper we investigate the performance of phase-based fingerprinting for the localization of RFID-tagged items in warehouses and large retail stores, by deploying ground and aerial RFID-equipped robots. The measured phases of the target RFID tags, collected along a given robot's trajectory, are compared to the corresponding phase-measurements of reference RFID tags; i.e. tags placed at known locations. The advantage of the method is that it doesn't need to estimate the robot's trajectory, since estimation is carried out by comparing phase measurements collected at neighboring time-intervals. This is of paramount importance for an RFID equipped drone, destined to fly indoors, since its weight should be kept as low as possible, in order to constrain its diameter correspondingly small. The phase measurements are initially unwrapped and then fingerprinting is applied. We compare the phase-fingerprinting …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Absorbing surfaces using EBG structures",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6748927/",
            "Abstract": "The scope of this paper is to present a systematic and versatile method, with minimal computational requirements, that incorporates the use of new electromagnetic bandgap (EBG) structures in stealth technology. Grounded structures are used to ensure zero transmittance resulting to angle independence of the incident radiation. A possible future realistic scenario is simulated and experimentally examined where a metallic plane is fully covered by EBG structures and the monostatic radar cross section is measured. Varying the angle of incidence from 0  °  to 90  ° , it is observed that for the worst case scenario the reduction of the monostatic radar cross section (RCS) is almost 19 dB. Finally, to verify our idea, the RCS of a metallic cube also fully covered by EBG structures was examined. The assets of the proposed concept, applied to the design of different patterns, appear to be potentially beneficial for various …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computational techniques for the analysis and design of dielectric-loaded plasmonic circuitry",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-011-9440-4",
            "Abstract": "The finite element and the beam propagation method, two widely used methods in photonics, are utilized for the analysis of plasmonic components based on the dielectric-loaded plasmonic waveguide. Two components are chosen as examples and are subsequently numerically investigated by employing the aforementioned methods, in order to demonstrate their applicability in plasmonics. Specifically, a microring resonator add-drop filter and a Mach–Zehnder interferometric switch are analyzed by means of the finite element and the beam propagation method, respectively. The formulation adopted is clearly presented in both cases and the case-dependent implementation details are thoroughly discussed.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Application of a differential evolution algorithm with strategy adaptation to the design of multi-band microwave filters for wireless communications",
            "Publication year": 2010,
            "Publication url": "https://www.jpier.org/PIER/pier.php?paper=10081704",
            "Abstract": "In this paper we present a new method for the design of multi-band microstrip filters. The proposed design method is based on Differential Evolution (DE) with strategy adaptation. This self-adaptive DE (SaDE) uses previous experience in both trial vector generation strategies and control parameter tuning. We apply this algorithm to two design cases of dual and tri-band filters for WiFi and WiMax applications. We select the Open Loop Ring Resonator (OLRR) filters, which are comprised of two uniform microstrip lines and pairs of open loops between them. The results indicate the advantages of this approach and the applicability of this design method.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:eQOLeE2rZwMC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Static and Quasi-Static Fields-A Nonorthogonal Higher-Order Wavelet-Oriented FDTD Technique for 3-D Waveguide Structures on Generalized Curvilinear Grids",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=1124361907600718093&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:blknAaTinKkC",
            "Publisher": "New York, NY: Published by the Institute of Electrical and Electronics Engineers for the Magnetics Group, c1965-"
        },
        {
            "Title": "Particle filter object tracking by a handheld UHF RFID reader",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8892060/",
            "Abstract": "A method for target tracking is developed using principles of particle filters. Based on this method we propose the design and functions of a human operated device used to track desired items in a warehouse. More specifically, the items of the warehouse are equipped with Radio Frequency Identification (RFID) tags. The device consists of a handheld RFID reader and an antenna. While the human-user moves in the warehouse, the device measures the backscattered phase from the tracked item's RFID tag. Using these measurements and the principles of particle filters, the device guides the user step-by-step, until reaching the tag. The proposed method demonstrates 100% successful identification in the experiments and simulations presented herein.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient modeling of the wave propagation through the ionosphere using the finite element method",
            "Publication year": 2006,
            "Publication url": "http://www.wseas.us/e-library/conferences/2006elounda1/papers/537-214.pdf",
            "Abstract": "Aristotle University of Thessaloniki Department of Electrical and Computer Engineering 54006 Thessaloniki, Greece Abstract-In this work, an HF ionospheric wave propagation model, below and above MUF is developed and analyzed using the one-dimensional finite element method. The purpose is to find numerical solutions of the one-dimensional wave equation and study the way that the wave propagates through the ionosphere. The ionospheric medium at heights between 65 to 400 Km, is modeled by its refractive index profile, which is calculated using electron density data from the International Reference Ionosphere model (IRI-95). The frequencies used in this work, in order to illustrate the model are below and above MUF and two slightly different ionospheric profiles have been used in order to evaluate the model response with small variations of the medium characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:g5m5HwL7SMYC",
            "Publisher": "WSEAS PRESS"
        },
        {
            "Title": "Design of a Fully Planar BC-CSRR SIW-based H-plane Sectoral Horn with a Printed Transition",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8739823/",
            "Abstract": "The Broadside Coupled Complementary Split Ring Resonator Substrate Integrated Waveguide (BC-CSRR SIW) is a fully planar platform for the implementation of millimeter-wave components at a minimal fabrication cost. We present here a new design H-plane sectoral horn Antenna based on the BC-CSRR SIW. A transition of parallel plate strips etched on the same substrate is also designed using parametric finite element simulations, in order to improve matching and radiation characteristics. The composite antenna comprising of the BC-CSRR SIW horn and the matching transition exhibits good return loss performance and directive end fire radiation, while the back radiation is kept small.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The finite-difference time-domain technique with perfectly matched layers for transient nonlinear eddy-current problems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996162/",
            "Abstract": "This paper presents a general explicit finite-difference time-domain scheme for transient nonlinear electromagnetic eddy-current problems. Some existing methods are discussed, while the DuFort-Frankel algorithm is chosen for its simplicity and efficiency. The problem of domain termination is efficiently treated by means of a perfectly matched layer for eddy currents. The proposed algorithm isolates the exterior static problem from the interior explicit algorithm, thus involving only a reduced and easier system matrix solution.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "All‐Dielectric Toroidal Metasurfaces for Angular‐Dependent Resonant Polarization Beam Splitting",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adom.202002143",
            "Abstract": "An all‐dielectric metasurface exhibiting a strong toroidal resonance is theoretically designed and experimentally demonstrated as an angular‐dependent resonant polarization beam‐splitter in the microwave K‐band. The metasurface is fabricated by embedding a square periodic array of high‐permittivity ceramic cuboid resonators in a 3D‐printed substrate of polylactic acid. It is demonstrated that by properly selecting the resonator geometry and by tuning the angle of incidence through mechanical rotation, the metasurface can switch between a polarization beam splitting and bandpass or bandstop operation. Such performance is achieved by exploiting the highly asymmetric Fano spectral profile of the toroidal resonance and the very low (high) dispersion of the associated p‐(s‐) polarized mode resulting from the resonant toroidal dipole mode's field profile, as evidenced by both full‐wave and band structure …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Theoretical analysis of microring resonator filters made of plasmonic waveguides",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5185251/",
            "Abstract": "Microring resonator filters which are made of dielectric-loaded surface plasmon polariton waveguides and operate in the telecommunication range are thoroughly analyzed by means of 3D-FEM simulations. The filters' functional characteristics, such as the resonant frequencies, the free spectral range, the transmission bandwidth and the extinction ratio, are investigated for different values of the key structural parameters, namely the ring radius and the gap separating the bus waveguide from the ring. In addition, the shift in the operating wavelength is quantified when the ring's refractive index is controlled as a result of thermal tuning.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nonreciprocal Silicon Photonic Coupler Exploiting Graphene Saturable Absorption",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=NP-2020-NpW1E.2",
            "Abstract": "We present a broadband half-duplex high-power photonic isolator using the exceptional point in a non-Hermitian nonlinear silicon slot coupler. The concept relies on spatially asymmetric saturable losses, by overlaying one waveguide with graphene.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Computational analysis of power frequency devices by a novel hybrid quasi-static finite difference–finite element technique",
            "Publication year": 2007,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10313",
            "Abstract": "A hybrid explicit numerical methodology for the analysis of power frequency devices, characterized by large differences in permeability and conductivity values, is presented. It is based on the separation of the physical problem into two distinct ones according to the properties of the materials comprising the structure under investigation. A finite difference time-advancing scheme, specially modified for eddy-current analysis, is implemented in magnetic/conducting media, whereas in non-magnetic/non-conducting regions, like air, a finite element procedure is utilized. The two techniques are separately implemented and combined via appropriate interface boundary conditions into an efficient, systematic time domain procedure. The derived hybrid scheme is proved to be ideal for 2D power frequency problems.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:1qzjygNMrQYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Metamaterial-enhanced MIMO Antennas",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/N-Bourgis/publication/267244073_Metamaterial-enhanced_MIMO_Antennas/links/54bcf8160cf253b50e2da58d/Metamaterial-enhanced-MIMO-Antennas.pdf",
            "Abstract": "A systematic design of planar MIMO antennas with significantly reduced mutual coupling, based on the concept of metamaterials is presented. Individual rectangular loop resonators, placed in the space between the antenna elements provide high levels of isolation without essentially affecting the simplicity and planarity of the MIMO antennas.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient hybrid parabolic equation–integral equation method for the analysis of wave propagation in highly complex indoor communication environments",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-007-9246-7.pdf",
            "Abstract": "An efficient, full-wave computational technique to investigate the electromagnetic wave propagation within a complex building environment, resulting from contemporary indoor communication systems, is proposed. Unlike a standard ray-tracing technique, this new methodology is based on the parabolic wave equation (PE), appropriately modified to deal with the extremely wide-angle propagation cases, encountered in a typical wireless system of this kind. It is also successfully applied to model the field in the presence of walls, doors or other penetrable structures, taking into account the exact geometric configuration of the environment under consideration. Next, the PE technique is significantly enhanced by an integral equation formulation, in which the computed field in the interior of the walls and other obstacles is used as a secondary equivalent current source and a corrected version of the …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A comparative study of the biological effects of various mobile phone and wireless LAN antennas",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996201/",
            "Abstract": "This paper presents a comprehensive electromagnetic and thermal analysis of radiation and its impact on human beings, due to the use of various types of commonly used mobile phones and communication antennas. This is one of the first studies that deals with a wide-range comparative investigation of modern cell phones, unlike the majority of existing work, which do not extend beyond the obsolete generic phone case. The rather severe, although overlooked, case of wireless local area network antennas is also considered, due to their increasing use and the large times of exposure associated with them.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the efficient computation of closed‐form Green's functions in planar stratified media",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mmce.20270",
            "Abstract": "The spatial‐domain Green's functions for the vector and scalar potentials in planar stratified media are cast into closed forms via a two‐level approximation of their spectral‐domain counterparts. The proposed methodology begins with the approximation of the spectral‐domain Green's functions over large values of the spectral variable by complex exponentials, and continues with the approximation of the remainder by rational functions. Finally, the closed‐form Green's functions in terms of spherical and cylindrical waves are derived, making use of some well‐known integral identities. A key‐feature of the proposed approach is that although it does not call for an analytical extraction of the quasistatic terms and the surface wave poles, it provides the means for the accurate description of both the near‐field and far‐field physics. Moreover, the rational function spectrum fitting proposed here overcomes the problem of …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Passive synthesis of compact frequency-dependent interconnect models via quadrature spectral rules",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1257904/",
            "Abstract": "In this paper, we present a reduced order modeling methodology, based on the utilization of optimal non-uniform grids generated by Gaussian spectral rules, for the direct passive synthesis of SPICE-compatible modeling of multi-conductor interconnect structures. The algorithm is based on a Pade-Chebyshev approximation of the frequency-dependent input impedance matrix of the passive interconnect system. The synthesized circuit is represented as the concatenation of a number of non-uniform sections of passive lumped coupled circuits. However, contrary to the popular uniform segmentation-based distributed circuit models for interconnects, where 10 to 15 segments per minimum wavelength are needed for multi-GHz accuracy, the proposed model is \"optimal\" in the sense that highly-accurate responses can be obtained with a number of segments per minimum wavelength barely exceeding the Nyquist limit of …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis and design of a CSRR-based fully planar substrate-integrated waveguide for millimeter-wave circuits and antennas",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7928832/",
            "Abstract": "We present here a new design of a substrate-integrated waveguide (SIW), which is based on the use of a metamaterial-inspired periodic structure of coupled complementary split-ring resonators (CSRR). The resonators are etched on the metal surfaces that cover both sides of the dielectric substrate. The strong interaction between two side-by-side placed CSRRs provides the necessary means to block propagation through the ring structure and completely replace the series of via posts that is characteristic of a conventional SIW. The proposed transmission line has excellent propagation characteristics, since propagation losses are kept at levels comparable to those of the classic SIW, while the fully planar structure and the associated ease of implementation render the proposed SIW a strong alternative for a cost-effective implementation of millimeter-wave circuits and antennas.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mode propagation analysis of magnetically biased curved graphene microstrips",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7481783/",
            "Abstract": "The propagating modes on a magnetically biased curved graphene microstrip are thoroughly examined in the present work by means of an efficient finite element modal solver. The influence of the anisotropic surface conductivity due to the magnetic bias is carefully addressed and investigated through a multitude of numerical results, including the effective index and the electric field distribution of the dominant modes.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparison of Split-Ring Resonator Composite Periodic Media based on Numerical Eigensolutions",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9411200/",
            "Abstract": "In this work we study the behavior of composite periodic media consisting of split-ring resonators by means of the solution of eigenvalue problems. Initially, we compare the dispersion diagrams of Edge-Coupled Split-Ring Resonator (EC-SRR) and Broadside-Coupled Split-Ring Resonator (BC-SRR) media for the case of in plane propagation. Subsequently, we present the comparison results between the BC-SRR and its complementary counterpart which exhibit magnetic and electric resonances, respectively, at the same frequency zones. Field distributions of the returned modes are illustrated and their characteristics are studied with respect to their expected behavior extracted from analytical models in literature.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electrical Drivetrains for Recumbent Tricycles: Tad-pole and Delta Electrically Assisted Human Powered Vehicles",
            "Publication year": 2015,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10319",
            "Abstract": "Eureka! Institutional Repository: Electrical Drivetrains for Recumbent Tricycles: Tad-pole and \nDelta Electrically Assisted Human Powered Vehicles Skip navigation Home Browse Communities \n& Collections Browse Items by: Issue Date Author Title Subject Item Type Advanced Search \nUseful Links Information Sign on to: My DSpace Receive email updates Edit Profile Saved \nSearches Favorites Eureka! Institutional Repository 1.Eureka! Institutional Repository 2.Σχολή \nΤεχνολογικών Εφαρμογών 3.Τμήμα Μηχανολόγων Οχημάτων 4.Δημοσιεύσεις ΕΠ 5.Δημοσιεύσεις \nσε Περιοδικά Ελληνικά English Electrical Drivetrains for Recumbent Tricycles: Tad-pole and \nDelta Electrically Assisted Human Powered Vehicles Yioultsis, Traianos/ Kosmanis, \nTheodoros/ Γιούλτσης, Τραϊανός/ Κοσμάνης, Θεόδωρος Institution and School/Department of \nsubmitter: ΤΕΙ Θεσσαλονίκης Issue Date: 13-Jul-2015 Description: Δημοσιεύσεις μελών----,: :/…",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal design of aperiodic reconfigurable antenna array suitable for broadcasting applications",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/717910",
            "Abstract": "An aperiodic reconfigurable microstrip antenna array is designed to serve as a DVB-T base station antenna operating in a single broadcasting channel. The antenna array is optimized at 698 MHz (center frequency of DVB-T channel 49) to concurrently achieve a particular radiation pattern shaping with high forward gain, main lobe tilting and null filling inside the service area, as well as low sidelobe level outside the service area, and low standing wave ratio at the inputs of all the array elements. To concurrently satisfy all the above requirements, both the geometry dimensions and the array feeding weights (amplitudes and phases) are optimized, thus leading to a complex multi-variable and multi-objective problem. The problem is solved by applying a recently developed particle swarm optimization (PSO) improved variant, called PSO with velocity mutation, in conjunction with the CST software package, which is employed by the PSOvm every time a full-wave analysis is required. Furthermore, all the optimization methods found in the CST environment are compared with the PSOvm. The results show that the PSOvm is capable of producing an antenna array geometry, which is closer to the predefined requirements than the geometries derived by the rest of the optimizers, in the least amount of computational time. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Efficient isolation between electrically small metamaterial-inspired monopole antennas",
            "Publication year": 2014,
            "Publication url": "https://www.jpier.org/PIERB/pier.php?paper=14051304",
            "Abstract": "In this paper, a new electrically small metamaterial-inspired monopole antenna is presented. The antenna consists of a simple square-shaped coplanar waveguide (CPW-fed) monopole with an embedded complementary split ring resonator (CSRR). It operates at three distinct frequency ranges with central frequencies around 2.45, 4.2, and 5.8 GHz, exhibiting low return loss and uniform radiation patterns, making it a perfect candidate for modern wireless applications. Furthermore, using this antenna as a primary unit to construct two different 2× 2 MIMO system configurations, we achieve systematic minimization of mutual coupling between the radiation elements around 2.45 GHz, using additional single negative (SNG) metamaterial inspired resonators. Mutual coupling is reduced by as much as 27 dB at the aforementioned frequency. The simulated and measured results of all the fabricated antennas are in good …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:NaGl4SEjCO4C",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Application of boolean PSO with adaptive velocity mutation to the design of optimal linear antenna arrays excited by uniformamplitude current distribution",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1163/156939311796351632",
            "Abstract": "    This paper presents a new optimization technique for the design of linear antenna arrays. The proposed technique is based on a novel variant of PSO called Boolean PSO with Adaptive Velocity Mutation. The antenna arrays are optimized under requirements for maximizing the power gain at  a desired direction and minimizing the side lobe level of the radiation pattern. The impedance-matching condition of all the array elements is also required by the algorithm. The optimization technique has been developed considering that the array elements are excited by uniform-amplitude  current distribution. The radiation characteristics of the antenna array are extracted by using the method of moments. The technique has been applied in several broadside and non-broadside cases of collinear wire-dipole antenna arrays and seems to be capable of improving the radiation characteristics  of the antenna arrays in practice.   ",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Comparison of low cost shielding-absorbing cement paste building materials in X-band frequency range using a variety of wastes",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0272884212000132",
            "Abstract": "General concern for potential health effects of 24 h electromagnetic fields (EMF) exposure has increased over the last few years. This has led to the necessity of developing low cost electromagnetic interference (EMI) shielding and especially absorbing building materials. In the present study, the utilization of metallurgical slags and scrap tire wastes in cement paste for this purpose was investigated. Chemical and mineralogical analyses were performed to characterize all materials examined in this work. The results showed that cement paste specimens prepared by the addition of slags exhibited better shielding efficiency than similar ones based on tires waste, while absorption performance was increased and reached 80–85% for one admixture containing each waste respectively, all tested in the same X-band frequency range (8–12 GHz). Finally, the technological and environmental requirements for these cement …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimal synthesis of feeding network for implementation of Dolph–Chebyshev current distribution on microstrip antenna arrays",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8753697/",
            "Abstract": "A microstrip feeding network (MFN) that implements a Dolph-Chebyshev (D-Ch) current distribution is designed to feed a microstrip antenna array (MAA) operating in B2 LTE band. The study consists of three phases. In the first phase, the elements of MAA are directly excited by equi-phase current sources complying with a D-Ch amplitude distribution to ensure a sidelobe level (SLL) of -20 dB. Then, MAA is optimized for maximum forward gain. Finally, the input impedances of the elements of the optimized MAA and the element spacing are recorded. In the second phase, the MFN is considered to terminate at lumped loads with values equal to the input impedances of the respective elements of the optimized MAA and is then optimized to achieve low standing wave ratio, high power efficiency, and output currents equal to those applied in the first phase by the current sources. All optimizations are performed with an …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Theoretical analysis of thermally tunable microring resonator filters made of dielectric-loaded plasmonic waveguides",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3256139",
            "Abstract": "Microring resonator filters, which are made of dielectric-loaded surface plasmon polariton waveguides and operate in the telecom spectral range, are thoroughly analyzed by means of vectorial three dimensional (3D) finite element method (FEM) simulations. The filters’ functional characteristics, such as the resonant frequencies where the transmission minima occur, the free spectral range, the extinction ratio, and the minima linewidth associated with the quality factor of the resonances, are investigated for different values of the key structural parameters, namely, the ring radius and the gap separating the bus waveguide from the ring. The rigorous 3D-FEM simulations are qualitatively complemented by a simplified model. Apart from the harmonic propagation simulations, the uncoupled microring is treated as an eigenvalue problem, and the frequencies of the resonances are compared with those of the transmission …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:u-x6o8ySG0sC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Phase ReLock-localization of RFID tags by a moving robot",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8739423/",
            "Abstract": "In this work, we propose a prototype method for the localization of RFID tags, by deploying RFID equipment on a robotic platform. The constructed robot is capable to perform Simultaneous Localization (of its own position) and Mapping of the environment and then locate the RFID tags around its path. The proposed method is based on properly treating the measured phase of the backscattered signal by each tag at the reader's antenna, located on top of the robot. More specifically, the measured phase samples are reconstructed, such that the 2π discontinuities are eliminated. This allows for the formation of an optimization problem, which can be solved rapidly by standard methods. The proposed method is experimentally compared against the most accurate reported method in prior-art and the same accuracy is preserved. However, the problem is solved more than one order of magnitude faster, allowing for the …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nondiagonally anisotropic PML: a generalized unsplit wide-angle absorber for the treatment of the near-grazing effect in FDTD meshes",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/877590/",
            "Abstract": "A new generalization of the PML with wide-angle absorption is presented, for the efficient truncation of FDTD lattices. The proposed unsplit-field layer uses a nondiagonal symmetric tensor anisotropy and via an appropriate parameter selection achieves notable attenuation rates in the case of near-grazing angles. Hence, it can be placed much closer to large structures. Improved accuracy and lower dispersion errors are attained via higher-order FDTD schemes with regular and non-Cartesian lattices constructed by hexagonal or tetradecahedral cells. Finally, Ramahi ABC's are invoked for the absorber's termination. Numerical results, addressing wave attenuation at grazing incidence, prove the efficiency of the proposed PML.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Characterization of Edge-Coupled Broadside-Coupled and Complementary Split-Ring Resonator Periodic Media Based on Numerical Solutions of Eigenvalue Problems",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9563052/",
            "Abstract": "We study the behavior of 3-D periodic composite media consisting of several types of split-ring resonators. By initially introducing the H-D periodic eigenmode finite element method (FEM) formulation, the dual counterpart of our formerly proposed E-B formulation, we are able to extract accurate dispersion diagrams and field distributions of electromagnetically complex structures and compare the returned characteristics of the supported modes. Using Babinet's principle, we design the corresponding complementary resonators and evaluate their dual characteristics. Particular attention is given to the explanation of the behavior of these composite media under wave incidence perpendicular to the scatterers' plane. Additionally, we perform a cross-check with excitation problem results, to interpret the response predicted by analytical models existing in literature and confirmed by the eigen-analysis of the structures …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compact split‐ring resonator‐loaded multiple‐input–multiple‐output antenna with electrically small elements and reduced mutual coupling",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/pdf/10.1049/iet-map.2012.0688",
            "Abstract": "The authors present a compact four‐element multiple‐input–multiple‐output antenna with the potential to operate in WiMAX frequency bands, with its elements being not only closely spaced but also electrically small. Split‐ring resonators or metal stipes are utilised to achieve both goals, that is element miniaturisation and reduction of mutual coupling. The design process is systematic, as it deals with both issues quite separately. Very low values of the envelope correlation coefficient and overall good performance are obtained, without compromising planarity and simplicity.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:HDshCWvjkbEC",
            "Publisher": "The Institution of Engineering and Technology"
        },
        {
            "Title": "Investigation of EMC in high-speed on-chip transmission lines by a new hybrid quasi-static finite difference-FEM technique",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1513093/",
            "Abstract": "In this paper we present a new computational technique to investigate wave phenomena and EMC/EMI interactions in high speed transmission lines and interconnects on the chip level. The proposed time-domain method is based on the very different nature of the electromagnetic problem in the conductors and semiconductors, compared to the insulating media that separate conducting regions and fill the intermediate volume. Therefore, the purely static problem in the regions filled with silicon oxide is totally separated from the diffusion problem in the conducting regions. The latter one is solved by means of a simple and efficient DuFort-Frankel technique using finite differences, while the static problem is dealt with by means of a finite element method with coarse meshing, since outside the conductors the field variations are much less intense. In each time step, the problems in the two regions are appropriately …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Genetic Optimization With Mixed-Order Prism Macroelements for 3-D Metamaterial Multilayered Structures",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8675513/",
            "Abstract": "The optimal performance of 3-D planar metamaterial wideband devices is attained by maximizing their frequency bandgap. This, in turn, requires a design optimization procedure and iterative calculations of dispersion diagram points. To this aim, an efficient technique, blending a new mixed-order prism macroelement with an adjustable genetic algorithm (GA), is introduced in this paper for the rapid computation of dispersion diagrams. The developed scheme can launch diverse alternation orders along possible directions, whereas it is significantly more enhanced than existing approximations. In this way, the reduced degrees of freedom (DoF) facilitate the treatment of the derived eigenvalue problem and lead to a rigorous tool for the dispersion diagram of electromagnetic bandgap (EBG) structures, whose performance is intuitively optimized via the GA. For its validation, the featured method is thoroughly applied to …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "One Heart, Two Bodies: A Simulation Study of Body Surface Potential Differences between Donor and Recipient of Heart Transplantation",
            "Publication year": 2009,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-58603-964-6-389",
            "Abstract": "In cardiac transplantation has been recognized some “abnormalities” in recipient ECG. We investigated the influence of heart geometrical position within the chest cavity as well as somatometric parameters on body surface torso potentials. Two control patients with different Body Mass Index (BMI) were undergone a chest MRI scan. Using specific software we created two tetrahedral meshes that could be applied in our study. A post-mortem human heart was undergone a MRI scan and we also created its tetrahedral mesh. Using second software we extracted the heart mesh of control's torsos and we replaced them with the mesh of the post-mortem heart. The last program also assessed the influence of heart (re) positioning within the thorax, on the body surface potentials. The Finite Elements Method (FEM) was used to solve the forward electrocardiographic problem for both torsos, under the assumption that all the …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "An asymptotic FEM analysis for the electromagnetic modeling of interconnects and integrated RF passives for SiP and SoC designs",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1185677/",
            "Abstract": "A finite element methodology is proposed for the efficient full-wave computational analysis of interconnects and integrated passives for system-on-chip (SoC) and system-in-package (SiP) applications. These structures are characterized by drastic variations in feature size along different directions in space, that result in severe ill-conditioning of conventional finite element solution approaches for their electromagnetic characterization. The proposed methodology overcomes this problem by decomposing the solution into an asymptotic frequency expansion which reduces the electrodynamic problem into a series of coupled static field problems. The approach is more complicated in the case of a lossy conductor and a proper modification is introduced to take the frequency dependent losses of the system into account. Finally, an asymptotic technique that fits perfectly into the framework of the asymptotic solution, is …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Metamaterial-based electrically small multiband planar monopole antennas",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6022743/",
            "Abstract": "We present electrically small multiband planar antennas for wireless applications, enhanced by negative permeability metamaterial rings. The presence of the rings results in a significant reduction of the operation frequency. Two different feeding methods (microstrip and coplanar) are considered, resulting in efficient, entirely planar structures.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental validation of a hybrid wide-angle parabolic equation-Integral equation technique for modeling wave propagation in indoor wireless communications",
            "Publication year": 2008,
            "Publication url": "https://www.jpier.org/PIER/pier.php?paper=08031903",
            "Abstract": "A new full-wave Parabolic---Integral Equation Method (PE-IEM) for the simulation of wave propagation in realistic, highly complex indoor communication environments is proposed, together with an extensive validation via measurements. The method is based on a wide-angle parabolic equation, further enhanced by an integral equation correction and is capable of providing good approximations of the electromagnetic fields and the received power, incorp orating all fundamental propagation mechanisms in a single simulation. For a rigorous validation, it has been applied in a complex twelve-room office space and compared with measurements at the two different frequencies of 1 GHz and 2.5 GHz. The accuracy of the approximation is within reasonably expected margins, while the method retains all the advantages of full wave methods and it also has moderate requirements of computational resources.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:bEWYMUwI8FkC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Nonreciprocal propagation in a non-Hermitian silicon photonic coupler employing graphene saturable absorption",
            "Publication year": 2020,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2020/14/epjconf_eosam2020_11006/epjconf_eosam2020_11006.html",
            "Abstract": "We present the concept, analysis and design of a nonreciprocal system of coupled nonlinear waveguides, operating at the near infrared. We exploit the spatial asymmetry induced by the exceptional points of a non-Hermitian coupler which, combined with saturable absorption in the nonlinear regime, can break Lorentz reciprocity. In this work, we introduce asymmetric losses in a pair of coupled silicon waveguides by overlaying only one of them with unbiased graphene, subject to saturable absorption. The device can be used as a broadband half-duplex isolator: a two-port component offering unidirectional transmission of high-power signals.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:Y5dfb0dijaUC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Explicit finite-difference time-domain method with perfectly matched layers for transient low-frequency eddy-current analysis",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1041960/",
            "Abstract": "The finite-difference time-domain (FDTD) method is a robust algorithm for the solution of high-frequency electromagnetic problems, but, unfortunately, the method has no counterpart in eddy-current analysis. Hence, the extension of FDTD to power frequencies is an attractive theoretical problem that could give rise to an entirely new methodology for low-frequency electromagnetics. In this paper, we introduce a general explicit FDTD algorithm for transient eddy-current problems. We perform a theoretical investigation of a nonstandard difference scheme, including the issues of stability and consistency. The study provides a class of explicit methods with varying properties and computational complexity. From these, we chose the DuFort-Frankel algorithm for its simplicity and efficiency. However, the most intricate issue for the application of an explicit scheme is the solution of the open boundary problem. Unlike …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and optimization of uniplanar EBG structures",
            "Publication year": 2012,
            "Publication url": "https://content.iospress.com/articles/international-journal-of-applied-electromagnetics-and-mechanics/jae01519",
            "Abstract": "Electromagnetic bandgaps (EBG) are periodic formations, inspired by photonic crystals, exhibiting prohibited frequency bands for electromagnetic wave propagation. The uniplanar EBG is particularly assessed, due to its fabrication simplicity and is found to exhibit a propagation mode that cancels the desired bandgap behaviour. Two new planar EBG structures, without such modes are presented, retaining the distinct feature of easy fabrication, since the metallic structures are exclusively on the interface layers, with no vertical connections. The EBGs are optimized to maximize the bandgap, making them suitable for the design of wideband microwave circuits and antennas.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A combined computational and experimental investigation of nonthermal biological effects on prenatal development due to radiation from low power microwave antennas",
            "Publication year": 2015,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10342",
            "Abstract": "This is an integrated study of the biological effects of pulse-modulated very low power density microwave radiation. It employs a combination of a computational model of the rat and extensive in vivo experiments on rat embryos, during embryogenesis and organogenesis. The whole investigation is further enhanced via an immunological and chemical investigation of the rats' organs. The whole study is one of the first to combine results obtained by the computational, the experimental and the biomolecular investigations and attempts a discussion on existing standards for protection from low power density, long-term electromagnetic field exposure.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MIMO Antenna Design for 5G Communication Systems Using Salp Swarm Algorithm",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9083886/",
            "Abstract": "Multiple Input Multiple Output (MIMO) antennas will be a part of every new user device in 5G networks. In this paper, we design a MIMO antenna for 5G networks using a nature-inspired algorithm, namely the Salp Swarm Algorithm (SSA). We select a bow tie antenna as the element of the MIMO operating in n257 frequency band (center frequency at 28GHz). Firstly, we design and optimize the antenna element using the SSA algorithm. Secondly, a MIMO antenna is designed using the optimal dimensions of the antenna element. Numerical results demonstrate that the proposed MIMO antenna has a small size and exhibits wideband operation in the desired frequency band.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:HE397vMXCloC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Field Analysis and Guided Waves-Fast Numerical Computation of Green's Functions for Unbounded Planar Stratified Media With a Finite-Difference Technique and Gaussian Spectral Rules",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=7668625448838147782&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:35N4QoGY0k4C",
            "Publisher": "New York, NY: Professional Technical Group on Microwave Theory and Techniques, Institute of Electrical and Electronics Engineers, c1963-"
        },
        {
            "Title": "EB eigenmode formulation for the analysis of lossy and evanescent modes in periodic structures and metamaterials",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7879805/",
            "Abstract": "We present here a 3-D E-B linear eigenmode formulation for the analysis of periodic structures, including lossy periodic waveguides, photonic crystals, and metamaterials. The proposed finite-element formulation utilizes proper H (curl) vector basis functions for the electric field and H (div) vector basis functions for magnetic flux density. The resulting eigenmode problem is linear, and it enforces periodic boundary conditions in a simple manner via appropriate field transformations and does not exhibit spurious modes. Moreover, it can provide accurate complex-k dispersion diagrams, in terms of both propagation and attenuation constant, while it is also able to deal with either propagating or evanescent modes, including those with oblique propagation directions.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of new hybrid Jaya grey wolf optimizer to antenna design for 5G communications systems",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8723127/",
            "Abstract": "The new expected fifth generation (5G) communication systems will serve users with data rates of several Gbps and will allow running new applications in mobile devices. In order to do so, several design challenges have to be met. One of these is the antenna design and fabrication for the 5G mobile devices, especially in the millimeter wave frequencies. In this paper, we address the above issue by designing two different antennas for 3.7 and 26 GHz. We apply a design procedure based on a new proposed evolutionary algorithm, the Grey Wolf Optimizer-Jaya (GWO-Jaya), which combines features from both GWO and Jaya. We evaluate the new algorithm on a set of widely exploited benchmark functions. We design both antennas using the new proposed algorithm. Moreover, we evaluate their performance characteristics through fabrication and measurements. Both antennas are circularly polarized at an …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:vRqMK49ujn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computational analysis of power frequency devices by a novel hybrid quasi-static finite difference–finite element technique",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0924013606001543",
            "Abstract": "A hybrid explicit numerical methodology for the analysis of power frequency devices, characterized by large differences in permeability and conductivity values, is presented. It is based on the separation of the physical problem into two distinct ones according to the properties of the materials comprising the structure under investigation. A finite difference time-advancing scheme, specially modified for eddy-current analysis, is implemented in magnetic/conducting media, whereas in non-magnetic/non-conducting regions, like air, a finite element procedure is utilized. The two techniques are separately implemented and combined via appropriate interface boundary conditions into an efficient, systematic time domain procedure. The derived hybrid scheme is proved to be ideal for 2D power frequency problems.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Noise reduction for accurate power measurements of low level signals",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917754/",
            "Abstract": "As a result of the rapid evolution of mobile communications in the last decade many propagation models have been developed for radio planning purposes. To verify the various propagation models, accurate measurements of the received signals have to be performed especially at the edges of mobile communication cells, where the received power is at very low level and signal to noise ratio is degraded. In these cases narrowband receivers such as spectrum analyzers have to be employed. The settings of the receivers have to be examined carefully, since they are of crucial importance, in order to discriminate the measured signals from the noise. On the other hand, noise has to be removed from the measurements and uncertainty has to be estimated correctly; thus the “clean” levels will be suitable for verifying the propagation models and optimize the radio planning. In this paper a method of noise reduction for …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of graphene plasmonic waveguides and switching components via a finite element formulation with surface conductivity",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=195001841418717608&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boundary condition for the efficient excitation and absorption of hybrid waveguide modes in finite element formulations",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.26364",
            "Abstract": "A boundary condition capable of efficiently exciting and absorbing hybrid waveguide modes is derived for use in the context of the finite element method.Its performance is assessed in two cases, that is, a silicon and a plasmonic waveguide, and compared with that of the standard absorbing boundary condition. © 2011 Wiley Periodicals, Inc. Microwave Opt Technol Lett 53:2626–2631, 2011; View this article online at wileyonlinelibrary.com. DOI 10.1002/mop.26364",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:IWHjjKOFINEC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "BestFit: a SPICE-compatible model for efficient, passive, broadband transmission-line analysis of dispersive interconnects",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1250044/",
            "Abstract": "\"BestFit\" refers to a mathematical methodology used for the direct passive synthesis of SPICE-compatible models of multi-conductor interconnect structures. Given the bandwidth of simulation, the length of the interconnect system, and its per-unit-length, frequency-dependent resistance, inductance, capacitance and conductance matrices, the proposed algorithm synthesizes a compact, multi-port, dispersive, SPICE-compatible model for the interconnect. The resulting model is in terms of a concatenation of a number of non-uniform segments of lumped passive circuit representations of the per-unit-length series impedance and shunt admittance matrices, the lengths of which are obtained as a result of a Pade-Chebyshev approximation of the frequency-dependent input impedance matrix of the multiconductor transmission line system. The synthesized circuit is \"optimal\" in the sense that highly-accurate responses can …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Coupled-Mode Theory for Graphene-Based Metasurfaces",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9380706/",
            "Abstract": "In this article, a temporal coupled-mode theory (CMT) formalism is proposed to design graphene-based metasurface (MTS) structures. Such structures may be nonuniform and synthesized by numerous graphene resonators. To obtain a desired functionality, such MTSs may be designed, by performing multiple parametric analyses of the structure’s geometric parameters. An accurate calculation of their response may be attained by a full-wave vectorial finite-element method (VFEM), by modeling graphene as a surface boundary condition; however, it requires high computational resources, especially for larger configurations. CMT offers an appealing time- and memory-efficient alternative, by solving a sparse system of equations, of particularly small size, fed by the results of simpler and smaller simulations, with the ability to take into account graphene dispersion. CMT may be used to design more complex MTS …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electromagnetically induced transparency with hybrid silicon-plasmonic traveling-wave resonators",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4821796",
            "Abstract": "Spectral filtering and electromagnetically induced transparency (EIT) with hybrid silicon-plasmonic traveling-wave resonators are theoretically investigated. The rigorous three-dimensional vector finite element method simulations are complemented with temporal coupled mode theory. We show that ring and disk resonators with sub-micron radii can efficiently filter the lightwave with minimal insertion loss and high quality factors (Q). It is shown that disk resonators feature reduced radiation losses and are thus advantageous. They exhibit unloaded quality factors as high as 1000 in the telecom spectral range, resulting in all-pass filtering components with sharp resonances. By cascading two slightly detuned resonators and providing an additional route for resonator interaction (i.e., a second bus waveguide), a response reminiscent of EIT is observed. The EIT transmission peak can be shaped by means of resonator …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:_kc_bZDykSQC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Full-Wave Analysis of Indoor Communication Problems, based on a Parabolic Equation–Finite Element Technique",
            "Publication year": 2005,
            "Publication url": "http://www.wseas.us/e-library/conferences/2005athens/cscc/papers/497-385.pdf",
            "Abstract": "This paper presents a new methodology to compute the electromagnetic field in practical cases of indoor communications. In particular, we consider the highly interesting case of the so-called interface modeling, ie when a plane wave propagates to the interior of a building. The proposed technique is based on a parabolic wave equation in three dimensions, while the cross section of the computational domain, as the wave propagates, is modeled by means of a finite element technique, terminated by highly absorbing PML boundaries. This formulation enables a robust computational modeling of obstacles of complex shape in a fully automated way. Unlike standard ray-tracing techniques, the proposed scheme makes it possible to solve a series of complex geometries and structures that would require vast computational resources with existing approaches.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Autonomous Robots, Drones and Repeaters for Fast, Reliable, Low-Cost RFID Inventorying & Localization",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9566425/",
            "Abstract": "This paper presents our latest results of our prototype robots and drones, aiming continuous inventorying and accurate real-time 3D localization of RFID tagged items. We have designed and constructed two ground robots, capable of autonomous inventorying in unknown regions, exploiting state-of-the-art methods from the field of robotics and RF-localization. Furthermore, we present our prototype drone, also capable of 3D inventorying and localization. In addition, we demonstrate the performance of our prototype RFID repeater, which also boosts the read-range of traditional RFID technology. The results of measurements campaigns conducted in different environments for the above prototypes are presented herein.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Acceleration of convergence for the higher-order Whitney element FEM analysis of antennas and electromagnetic scattering",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1017079/",
            "Abstract": "Several higher order generalizations of edge-based Whitney elements can be found in the literature. Their performance with respect to the convergence of the iterative solver exhibits significant deviations. However, we have shown that the majority of such elements actually belong to the same class and are related to each other by an affine transformation. Hence, an optimal, with respect to convergence element can be derived, if the transformation is defined such that the eigenvalues of the element matrix are as clustered as possible. We provide a general explicit formula for the 3-D transformation of degrees of freedom (DoF) and basis functions (BF) and investigate its effects on the convergence rate. The results, based on a 2-D scattering problem and a 3-D patch antenna analysis, demonstrate a remarkable improvement of convergence, especially in the case of severely ill-conditioned matrices that arise due to …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Microwave imaging of two-dimensional scatterers by inverting scattered near-field measurements",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/894756/",
            "Abstract": "A spatial domain technique for the reconstruction of the electromagnetic properties of unknown scatterers is presented. The new methodology combines the finite element method (FEM) and the Polak-Ribiere nonlinear conjugate gradient optimization algorithm. The forward scattering problem is treated via the FEM, while inversion is implemented by minimizing a cost function, consisting of a standard error term and a regularization term. The first one is related to the scattered near-field measurements, obtained by illuminating the scatterer with plane waves from various directions. A sensitivity analysis, performed by an elaborate finite element procedure, provides the direction required for correcting the scatterer profile. Significant reduction of the computation time is obtained by introducing the adjoint state vector methodology.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical Calculation of Dispersion Diagrams and Field Distributions of Waves in 3-D Periodic Split-Ring Resonator Media",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8902252/",
            "Abstract": "We present here a fully computational method for obtaining the dispersion diagrams and the field distributions of electromagnetic waves existing in periodic metamaterial structures. Using a finite-element E-B eigenmode formulation, we solve both for the complex propagation constants (eigenvalues) and the field distributions (eigenvectors) of the periodic structure at each given frequency of interest. As a result, we obtain information about the characteristics of the waves inside passbands and stopbands as well. By these means, the mechanisms of interaction of the electromagnetic waves with the eigenmodes of the metamaterials are revealed.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the direct evaluation of weakly singular integrals in Galerkin mixed potential integral equation formulations",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4618709/",
            "Abstract": "Weakly singular integrals over coincident triangles, arising in the Galerkin discretization of mixed potential integral equation formulations, are calculated using a direct evaluation method. The proposed method utilizes a series of coordinate transformations, together with a re-ordering of the integrations, in order to reduce the dimensionality of the original four-dimensional (4D) weakly singular integrals into 1D numerical integrations of smooth functions. The final formulas can be easily evaluated with a standard Gaussian quadrature rule, resulting in a scheme with great accuracy and efficiency properties. Numerical results for the comparison of the proposed method with both singularity subtraction and singularity cancellation methods, often used for the evaluation of multidimensional singular integrals, are presented, indicating the superior overall performance of the direct evaluation scheme.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and Fabrication of a Compact, Low-Cost UHF-RFID Repeater, Exploiting Circular Cross-Polarization",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9270281/",
            "Abstract": "In this article we aim to increase the range of commercial passive UHF RFID technology. We propose a prototype forward-link repeater, which consists of a pair of antennas, a band pass filter, an RF power limiter and a low-noise amplifier (LNA). Initially, we focus on the design of the two antennas with inverse direction of circular polarization (CP), so that sufficient decoupling is ensured, while adhering to the following constraints:  i ) the input antenna is circularly polarized to maximize the gain towards the reader’s antenna,  ii ) the output antenna is circularly polarized to improve the probability of successful tag reception, given the expected randomness in the tag’s orientation,  iii ) the volume of the entire structure is kept small. Then, we present the achieved range improvement of the proposed repeater in two applications:    ) a fixed installation, where the reader successfully identified passive RFID tags from 60m and …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FDTD method with oblique incidence for ionospheric wave propagation problems-application to an HF one-hop radio-link study",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996176/",
            "Abstract": "This paper introduces a new finite-difference time-domain (FDTD) approach for electrically very large wave-propagation problems and especially for high-frequency (HF) ionospheric radio-link studies. An appropriate modification of the FDTD technique is presented, which reduces the problem's dimension by the appropriate introduction of an effective magnetic permeability for the ionospheric layers. The proposed approach gives an answer to the demand for accurate radio-link design, taking into account the characteristics of ionosphere all over the path of propagation, unlike existing simplified analytical methods. The methodology is successfully applied to a practical HF one-hop ionospheric radio-link study.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel adaptive beamforming technique applied on linear antenna arrays using adaptive mutated boolean PSO",
            "Publication year": 2011,
            "Publication url": "https://www.jpier.org/pier/pier.php?paper=11041904",
            "Abstract": "The present work introduces a new optimization technique suitable for adaptive beamforming of linear antenna arrays. The proposed technique is a new PSO variant called Adaptive Mutated Boolean PSO (AMBPSO) where the update formulae are implemented exclusively in Boolean form by using an efficiently adaptive mutation process. The AMBPSO aims at estimating the excitation weights applied on the array elements considering that a desired signal and several interference signals are received by the array at respective directions of arrival. In order to exhibit the robustness of the technique, the optimization process does not take into account the interference correlation matrix. A certain power level of additive Gaussian noise is also considered by the technique. The AMBPSO has been applied in several cases of uniform linear antenna arrays with different spacing between adjacent elements and different …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:d1gkVwhDpl0C",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "A fully planar antenna for millimeter-wave and 5G communications based on a new CSRR-enhanced substrate-integrated waveguide",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7915353/",
            "Abstract": "We present a fully planar, easy to fabricate antenna for millimeter-wave communications, based on a new substrate-integrated waveguide (SIW). The SIW itself is entirely planar, since it is designed using series of side-by-side complementary split-ring resonators (CSRR), instead of vias, with the CSRR being etched on top and bottom metal ground surfaces that cover the dielectric substrate. This metamaterial-inspired structure provides a single-negative effective material parameter behavior that blocks wave propagation to the perpendicular direction. Hence, two parallel structures of this kind can be used to design an SIW, with propagation losses comparable to the conventional one. The antenna structure is consequently designed, by the use of proper cavities within the substrate and radiating slots on the ground structure and provides an easy to fabricate alternative for millimeter-wave and 5G communications.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A robust method for the computation of Green's functions in stratified media",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4267923/",
            "Abstract": "Closed-form Green's functions for unbounded planar stratified media are derived in terms of cylindrical and spherical waves. The methodology is based on a two-level approximation of the spectral-domain representation of Green's functions. This robust, efficient, and fully numerical approach does not call for an analytical extraction of ldquoproblematicrdquo behaviors, such as the quasi-static terms and the surface wave poles, prior to the spectrum fitting. Instead, the spatial-domain Green's functions derived in this paper provide an accurate description of both the near-field singularity in the vicinity of the source and the far-field dominant behavior of the surface waves.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and optimization of uniplanar EBG structures for low profile antenna applications and mutual coupling reduction",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6248171/",
            "Abstract": "We present a series of designs for uniplanar electromagnetic bandgap structures for antennas and microwave circuits. The proposed, easy to fabricate configurations, are based solely on metallic surfaces on layer interfaces, without the use of vias or other kinds of vertical connections. Their use in low profile antenna applications and mutual coupling reduction of planar radiating elements is investigated through an efficient and versatile technique, since the only information needed is the reflection phase and the dispersion diagram of the unit cell.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Trajectory planning of a moving robot empowers 3D localization of RFID tags with a single antenna",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9109328/",
            "Abstract": "In this work, we present a method for 3D localization of RFID tags by a reader-equipped robot with a single antenna. The robot carries a set of sensors, which enable it to create a map of the environment and locate itself in it (Simultaneous Localization and Mapping - SLAM). Then we exploit the collected phase measurements to localize large tag populations in real-time. We show that by forcing the robot to move along non-straight trajectories, thus creating non-linear synthetic apertures, the circular ambiguity of the possible tag's locations is eliminated and 3D localization is accomplished. A reliability metric is introduced, suitable for real-time assessment of the localization error. We investigate how the curvature of the robot's trajectory affects the accuracy under varying multipath conditions. It is found that increasing the trajectory's slope and number of turns improves the accuracy of the method. We introduce a phase …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced graph-theoretic channel model for performance evaluation of MIMO antennas and millimeter wave communications",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7228967/",
            "Abstract": "An enhanced multi-antenna channel model is presented, based on the concept of propagation graphs. It employs propagation mechanisms such as reflection, diffraction or scattering in a physically meaningful manner, while it can also be used as a semi-deterministic channel model with randomly distributed scatterers. It is an extension of a recently proposed graph-theoretic channel model by considering realistic scattering coefficients and antenna mutual coupling and can efficiently serve as an evaluation tool for the design of capacity-optimized MIMO antennas and millimeter-wave communication links.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automation in electromagnetic field measurements",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.456.290&rep=rep1&type=pdf",
            "Abstract": "Carrying out measurements in the vicinity of equipment inducing or transmitting electromagnetic fields (extremely low frequency electric and magnetic fields (ELF), radiowaves (RF) or microwaves (mW)) is one of the main activities of the Electromagnetic Radiation Measurements Laboratory (ERML) of the Department of Applied Informatics and Multimedia of the Technological Educational Institute (TEI) of Crete. These measurements require a measurement protocol [1] in order to comply with the Greek Legislation [2],[3],[4] and other national and international recommendations and standards [5],[6],[7],[8],[9],[10],[11]. Therefore, the ERML has developed special purpose software in order to automate the measurement procedures. This software is used on the one hand to facilitate the measurement procedure; on the other hand it certifies that the measurements follow the necessary protocol. This software operates combined with a Spectrum Analyzer to measure, record, and process electromagnetic fields at various frequency bands of interest. In this work the developed software is described.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A finite difference time domain scheme for transient eddy current problems",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/952563/",
            "Abstract": "In this paper, we present a general explicit finite difference time domain (FDTD) algorithm for transient electromagnetic problems at low frequencies. A detailed theoretical analysis is given, based on a nonstandard finite difference scheme, which is studied in terms of stability and consistency. The study reveals a whole class of finite difference diffusion schemes with different properties. Some of the existing methods are special cases of this general framework and an optimal algorithm is proposed. The application of finite difference methods to eddy current problems requires the introduction of a hybrid methodology, which combines the explicit differencing scheme for the diffusion equation with a boundary element method (BEM) for the open regions. The resulting algorithm involves a simple time stepping iteration, without any system solution, thus being remarkably robust.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D Localization of RFID Tags with a Single Antenna by a Moving Robot and” Phase ReLock”",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8892256/",
            "Abstract": "In this paper, we propose a novel method for the three dimensional (3D) localization of RFID tags, by deploying a single RFID antenna on a robotic platform. The constructed robot is capable of performing Simultaneous Localization (of its own position) and Mapping (SLAM) of the environment and then locating the tags around its path. The proposed method exploits the unwrapped measured phase of the backscattered signal, in such manner that the localization problem can be solved rapidly by standard optimization methods. Three dimensional solution is accomplished with a single antenna on top of the robot, by forcing the robot to traverse non-straight paths (e.g. s-shaped) along the environment. It is proven theoretically and experimentally that any non-straight path reduces the locus of possible solutions to only two points along the 3D space, instead of the circle that represents the corresponding locus for typical …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electrical drivetrains for tad-pole and delta type recumbent tricycles",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7297662/",
            "Abstract": "The drivetrain characteristics of electrically assisted, tricycle human powered vehicles are the subject of this paper. The two configurations of the vehicle that appear commercially, delta and tad-pole, are studied regarding to the impact of the electrical drivetrain to their steering behavior. For this purpose, two corresponding tricycles, constructed at the premises of the Alexander Technological Educational Institute of Thessaloniki are utilized. The electronic differential system implemented in the delta human powered vehicle is theoretically analyzed and experimentally tested. Measurements on the system during specific vehicle routes and discussion on its connection to the vehicle's steering behavior validate the system's efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "PvzNtsQAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Three-Dimensional Edge-Based Vector Finite Elements",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-59629-2_10",
            "Abstract": "The use of conventional nodal finite elements in the analysis of vector three-dimensional electromagnetic field problems has a series of major difficulties and drawbacks. When vector electromagnetic fields with tangential continuity on interface boundaries, such as the electric or magnetic field intensity are interpolated by nodal field values, the resulting expression is continuous over the entire domain of computation. Hence, normal continuity is also imposed and large errors are produced in the vicinity of a material discontinuity. Another serious difficulty is related to the imposition of boundary conditions on edges and corners of the boundary surfaces. This is because normal vectors are not well defined on geometric singularities and as a result, boundary conditions are not well approximated. However, there is a much more severe consequence when nodal elements are used to discretize vector fields, the …",
            "Abstract entirety": 0,
            "Author pub id": "PvzNtsQAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]