[{
    "name": "Φωτεινή Παρασκευά",
    "romanize name": "Foteini Paraskeva",
    "School-Department": "Ψηφιακών Συστημάτων",
    "University": "unipi",
    "Rank": "Καθηγητής",
    "Apella_id": 5159,
    "Scholar name": "Foteini Paraskeva (Fotini)",
    "Scholar id": "IeaP7wIAAAAJ",
    "Affiliation": "Professor",
    "Citedby": 1553,
    "Interests": [
        "Applied Learning Psychology on Teaching and Technology"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=IeaP7wIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Digital games: Developing the issues of socio-cognitive learning theory in an attempt to shift an entertainment gadget to an educational tool",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4148846/",
            "Abstract": "Over the years, digital games have become one of adolescents' main interests and a controversial issue among researchers all over the world. However, it is claimed that digital games can be a promising educational tool utilizing both the attributes that make them effective in the learning process and the students' predisposition to deal with them. The present study explores the background of digital game use in a group of Greek adolescents (N=125) (12 to 16 years old) and the potential of using digital games as an educational tool, on a socio-cognitive learning theory basis. Gender differences were revealed; concerning the time spent playing digital games, the game preferences, and the identification with the hero of the game. There was no correlation of frequent digital game use with low academic performance, though frequent game use was partially correlated with low self-esteem and high computer self-efficacy.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Strengthening collaboration and communication skills in an online TPD program for 21st-century educators",
            "Publication year": 2016,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLT.2016.081710",
            "Abstract": "The profile of the 21st-century teacher should reflect the philosophy of lifelong and adaptive learners who never stop enriching their knowledge, upgrading their skills and re-calibrating their career paths. To achieve such goals, many academic institutions implement teacher professional development (TPD) programs to support the professional development of the educational community. The goal of our research is to design an online TPD program which allocates roles and activities to learners and manages their progression through both in order to maximise the learning benefits. To this end, a PBLJii script orchestrated in line with the principles of a PBL model and the Jigsaw II collaborative strategy in a CSCL environment (Moodle) was designed and implemented to bolster collaboration and communication skills among teachers. Case study research (examination of one group) was conducted in a number of …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:Se3iqnhoufwC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Developing Self-Regulation Skills in Virtual Worlds: An Educational Scenario Applied in Second Life",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/article/content/65739",
            "Abstract": "In order to succeed in today’s life and work environments, people require more than thinking skills and content knowledge. Initiative and self-direction skills are needed, including the ability to manage goals and time, to work independently, and be self-directed learners. On the other hand, e-learning has brought changes in every field of formal and informal education, such as training programs, basic education, and life-long learning. However, e-learning is not inherently motivating and can even be demotivating due to technological, intrapersonal, and interpersonal hurdles. A hallmark of e-learning is its reliance on learner autonomy, also called independent or self-directed learning. In view of the need for the design of e-learning environments that would provide self-regulation strategies for the maximization of learners’ engagement to an e-learning course and the development self-regulation as an important life skill …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Designing a Conceptual Framework to Enhance Teacher Professional Development in a 3D VLE",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95522-3_18",
            "Abstract": "As the increasing interaction of people, countries and cultures unfolds today’s teachers must raise standards and manage dealing issues based on cultural differences. The discourse concerning cultural interactivity should be major in Teacher Professional Development (TPD). It is widely accepted that Virtual Learning Environments (VLE) and especially 3D platforms as Second Life (SL) could enhance Social and Cross cultural skills as Information and Media Literacy. In this paper we emphasize the importance of TPD by presenting a well-designed conceptual framework and the 3D VLE affordances that were utilized and exploited in the context of an educational experiment in SL environment. This framework is using Cognitive Apprenticeship and Problem Based Learning as background theories and CSCL strategies as well a script built on ancient Greek myth of Jason and the Argonauts. This study reveals …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Gamified Project based learning environment for motivation improvement",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Jox5DwAAQBAJ&oi=fnd&pg=PA10&dq=info:vW3hbWM84MsJ:scholar.google.com&ots=hc6h9kBZYa&sig=zZqX8_twGZB9Os-_rzh-J3l9ASY",
            "Abstract": "Gamification constitutes a new methodology in instructional design that gains more and more attention in education field. Many systems utilize gamification techniques for the purposes of different fields, such as marketing, education and computer science (Werbach & Hunter, 2012). Gamification increases the levels of engagement of users (Lamprinou, 2015; Alafouzou, 2017). Consequently, gamified learning systems promote motivation improvement both in learning and training. However, developing a gamified learning system requires a background of a theory of Motivation, based on which the levels of engagement and motivation can be measured. This theoretical research proposes an enhancement of ARCS model (Keller, 1979) in a gamified learning environment using the characteristics of Project Based Learning. The ARCS model of motivation combines four theories; Bandura’s Theory of Self-Efficacy, Berlyne’s Theory of Curiosity and Arousal, Maslow’s Needs Hierarchy and Rotter’s Locus of Control and consists of four core components; Attention, Relevance, Confidence and Satisfaction (Keller, 1983). The approach of Project Based Learning is very strong match with the ARCS Model, as this model can be used with many models of instructional design (Keller, 1987a, 1999, 2000a; Keller & Suzuki, 2004). Project based learning is a teaching methodology that promotes authentic learning experiences through real world problem solving and investigation. Having learners create projects allows them to engage in more active learning rather than absorbing material in an isolated learning environment. Besides, the eight characteristics of …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:maZDTaKrznsC",
            "Publisher": "Academic Conferences and publishing limited"
        },
        {
            "Title": "Implementing a Self-Regulated Oriented ePortfolio: The Design of an Affective Goal-Setting Plugin",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901515/",
            "Abstract": "Goal setting is an important process of self-regulation, affecting motivation, self-efficacy beliefs and learning. There is a need to examine the way individuals can engage in effective goal setting, enhance self-regulated learning and promote academic and professional development. To deliver such a solution, a self-regulated oriented ePortfolio (MySelf ePortfolio) was designed as a dynamic social networking tool and orchestrated along the principles of Self-Regulated Learning (SRL). Based on the findings of the ePortfolio implementation, the design of an affective goal-setting Plug in for self-regulated learners is proposed to enable the latter to feel self-efficient since they have set hierarchical specific goals for themselves, selected appropriate strategies, achieved a desirable state and felt satisfied with their effort.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teaching role-playing instruction in Second Life: An exploratory study.",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/34320883/JIITOv5p025-050Vasileiou431.pdf",
            "Abstract": "Web-based and Internet technologies are constantly being developed, evolving new ways of working, teaching, and learning for a broader range of professional and social groups. In a landscape of technology innovations, teacher professional development should try to capitalize on modern internet-based tools and services, better known as Web 2.0 and virtual worlds, in an effort to meet the increasing lifelong learning needs of pre-and in-service teachers. In this paper we suggest using the Second Life MUVE for teaching role-playing instruction to practitioners. After designing and implementing a 3D virtual learning environment in Second Life according to cognitive apprenticeship methods, we taught role-playing instruction to fifteen primary and secondary school teacher educators, using as a case scenario a rhapsody from Homer’s Odyssey. We applied qualitative research methods to investigate the effect of role-playing on affective, behavioral and cognitive engagement of our participants. Our exploratory study indicated that learning role-playing instruction in a virtual learning environment has positive impact on learning engagement.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Create a'Wonderful'Virtual World: The Case of Arigatou in Second Life",
            "Publication year": 2014,
            "Publication url": "https://search.proquest.com/openview/cd8aef52ee619c9e59bc31187d1886a7/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "Educational games, simulations and 3D virtual worlds are effective training and motivational tools for simulating real world experiences. Towards this, the integration of game elements, mechanics, and frameworks into Teachers' Professional Development (TPD) training programs is important in order to support hard (knowledge domain) and soft skills (creativity, problem solving, intercultural skills, communication, critical thinking). Furthermore, TPD programs should guide individuals to develop a global identity, to be open and flexible to other cultures and to interact in multicultural contexts. The purpose of the study is the design and configuration of a virtual TPD training program based on the 3D world of Second Life (SL) for in-service teachers. For the needs of the research, the TPD training program is designed as a game-based learning environment and each participant is represented as a player that creates and …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:mB3voiENLucC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Ne (x) t Generation Skills and E-learning: A Self-Regulation script applied in Second Life",
            "Publication year": 2009,
            "Publication url": "http://learningideasconf.s3.amazonaws.com/Docs/Past/2009/Papers/Paraskeva_Mysirlaki.pdf",
            "Abstract": "Acknowledging the need for designing e-learning environments that would enhance the development of ne (x) t generation skills, we propose the use of Virtual worlds, such as Second Life, as more than an emerging trend in elearning training programs. We suggest that Virtual Learning Environments (VLEs) could be interesting instructional tools that would meet the needs of modern training for the ne (x) t generation, delivering and reflecting in action the new learning experiences of professional knowledge, skills and values in the workplace. Extending previous research on ne (x) t generation skills and the impact of personal factors in enhancing human performance, such as Self-Regulation (SR) skills, and acknowledging the lack of theoretical foundations based on interdisciplinary perspectives of computer science, instructional design and learning psychology for training, we design e-learning courses based on Self-Regulation learning theory using the virtual environment of Second Life to enhance situated experience in professional and career development. As a result, we present an educational script and its components, in order to describe the structures of interaction that we use to design learning activities that would enhance selfregulation skills in a VLE. This script is used as a tool for conducting experiments in e-learning courses, studying the design, development and evaluation of the collaborative learning process in Second Life.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An online 3d virtual learning environment for teaching children Mathematics",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-6262-9_22",
            "Abstract": "Structuring and organising an advanced online collaborative learning environment (CSCL) is the object of this research. The way it can be integrated in the classroom and the curriculum is related to the vision of every reform that aims at improving education. Most of the existing 3d virtual worlds do not combine learning benefits, development of advanced learning and communicative skills, as well as substantial involvement of both students and teachers in the learning process. At first, the theoretical background of the structure and organisation of our world is given. Then, a description is given of the general characteristics of Active Worlds software that was used, along with a brief description of the structure and characteristics of the 3d virtual environment that is being constructed to support the teaching of Mathematics in primary schools. The expected outcomes and proposals for future utilization follow.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Designing a Framework Based on Problem-Based Learning for CSCL Environments in Order to Enhance 21st Century Skills",
            "Publication year": 2013,
            "Publication url": "http://www.ijiet.org/papers/250-T30012.pdf",
            "Abstract": "Due to the complexity of the knowledge society and the technology integration, teachers need support in developing their capacity to effectively teach in 21st century classrooms. In the present study, we advocate the use of a Computer Supported Collaborative Learning Environment orchestrated with the instructional method, Problem-based Learning in order to support collaboration, self-directed learning, critical thinking and problem solving. Aquasiexperimental research was conducted in an academic university department. Qualitative and quantitative data analysis indicate that the integration of the fundamental principles of PBL method in a CSCL context provide an effective framework to enhance 21st century skills.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IACSIT Press"
        },
        {
            "Title": "The Transitory Phase to the Attainment of Self-Regulatory Skill in Mathematical Problem Solving.",
            "Publication year": 2007,
            "Publication url": "https://eric.ed.gov/?id=EJ841661",
            "Abstract": "A productive and independent learner tends to be one of the first priorities of a contemporary educational system almost all over the world. It is recognised that the capability of self-regulation exists in all human beings and this enables us to survive, evolve and improve ourselves. Researchers have indicated that self-regulation can be taught, but the period of the attainment is often long. However, a start must be made and the earlier the better. While problem solving is placed in the heart of mathematics (NCTM, 2000), it is considered to contribute to the whole thinking processes. Nevertheless, differences in mathematical problem solving ability begin to appear in Grade 1 and increase gradually throughout the formal years of schooling. These differences have already been recorded and are known as ‘novice’compared to ‘expert’differences. However, there is a period of unknown duration which raises some questions in which novices are transformed into experts. Students who pass through this period in mathematics are called ‘medium’solvers by their teacher. The present pilot study examines this period in three different environments in an effort to describe under what conditions the transformation is achieved more effectively. Additionally, the study explores the main characteristics of this category of students.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:4DMP91E08xMC",
            "Publisher": "Australian and New Zealand Comparative and International Education Society. ANZCIES Secretariat, Curtin University, Box U1987, Perth, WA Australia"
        },
        {
            "Title": "Developing personalised e-courses: tailoring students' learning preferences to a model of self-regulated learning",
            "Publication year": 2015,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLT.2015.072357",
            "Abstract": "The systematic design of personalised e-learning courses so as to place emphasis on preferred ways of studying and to motivate learners to manage their own learning process poses a major challenge. To meet this challenge, the design and implementation of the 'SR-INSPIREus-Learning Framework' applying aspects of self-regulated learning (SRL) theory for modelling learning strategies that match various learning preferences and exploit the adaptive functionalities of INSPIREus, is proposed. A preliminary quasi-experimental study with comparison groups in pre/post tests and experimental and control groups was conducted in order to examine aspects of SRL (cognitive and affective domain) and learners' performance. The findings provide evidence about the potential of the framework in increasing specific aspects of SRL and students' performance.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:dhFuZR0502QC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "A Computer Simulation: Before or After the Instruction?",
            "Publication year": 2005,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=14479494&AN=25169959&h=THGNGJfTqp%2FdQGYACUze4cAia0r0tNEPxKmDrJ04O3ARWQDLaj9i83f%2F5nTIuTK16RfxYRNMZy1nUSLHiH%2BWAw%3D%3D&crl=c",
            "Abstract": "The present work is an attempt to examine the influence of computer simulations in teaching and learning of phase change of matter. For this purpose we have developed a web-based simulation program, which represents the macro state and microstate of matter as it changes phase. Java programming language has been used, as it is suitable for simulating complex phenomena while tutorial help to students is also provided. The survey has used three categories of students, according to their exposure to the simulation. The first two of them included those who were exposed to the simulation before or after the traditional instruction, while the third one was not exposed to the simulation at all. Students' responses were grouped into three classes: particle-related responses, macroscopic responses and naive responses, while the relation between those and the demonstration of the simulation was investigated and …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "In a Q-quest to learn: A collaborative game that supports evaluation",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/fb0f6c468d2757b157e6f0e0d227dc9f/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "On the field of serious games and Role-Playing Games (RPGs) for educational purposes, great structural and literary progress has been made. They cover interdisciplinary areas, from mathematics and science, to art and poetry and are used both in the academic and the industrial learning process. However, in any learning process, evaluation has an important role in order to ensure adequate knowledge and learning. This article proposes an evaluation system that consists of the progress in serious games and RPGs in the educational process. Cooperation and collaboration are the main principles for the development of the game that uses the Questions and Answers (QAs) system of evaluation. Based on the learning strategies of role-playing and STAD, along with Bandura's motivation theory in social learning, and Vygotsky's theory in social constructivism, a role-playing game has been developed, with the …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "A MUVE in service of Teacher Professional Development: How engaging is teaching role-playing instruction in Second Life",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=12562379615738369723&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing motivating online games for the ne (x) t generation of workers",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=5252948907407944809&hl=en&oi=scholarr",
            "Abstract": "It is common ground that the generation entering the workforce, also known as the “Next Generation”, the “Net Generation”,“digital natives”, the “millennials” or the “Google generation”, has a different set of needs and expectations as to learning and training. This new generation of people, such as the MMOGs (Massive Multiplayer Online Games) users, has amassed thousands of hours of rapidly analyzing new situations, interacting with characters they don’t really know, and solving problems quickly and independently. Moreover, it is claimed that MMOGs are popular mainly because they motivate players to create communities and interact with each other. On the contrary, the high dropout rate of e-learning is linked with low rates of self-motivation and self-direction in e-Learning. According to these thoughts, there is a need to find new elearning environments that would ensure the learners’ greater motivation and …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emotional intelligence and transformational leadership in virtual teams: Lessons from MMOGs",
            "Publication year": 2020,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/LODJ-01-2019-0035/full/html",
            "Abstract": "As business is becoming more global, virtual teams are getting increasingly prevalent. The purpose of this paper is to examine virtual team effectiveness by taking a deeper look at the Virtual World Teams (VWTs) of Massively Multiplayer Online Games (MMOGs).The paper investigates the effects of leaders’ emotional intelligence and transformational leadership on virtual team effectiveness, including three sub-factors of team effectiveness: team performance, viability and team member satisfaction. In addition, the indirect effect of emotional intelligence on team effectiveness via transformational leadership was examined. In total, 500 MMOG players that belonged in virtual world teams participated in the study. Hypotheses were tested through a series of multiple linear regression analyses, and one-way ANOVA tests were used to explore the impact of gender on the key factors …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:GnPB-g6toBAC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Enhance Learning Based on Psychological Indexes and Individual Preferences for a Physics Course Using An Adaptive Hypermedia Learning Environment.",
            "Publication year": 2007,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=14479494&AN=28652102&h=jrs1eFjQqalPqMRfz0KfunkhhYomSZRMf4FUJi6%2B9z2JBeCBeEuj7w2aEPnQexeJighRLVja7injEskfeN9vPw%3D%3D&crl=c",
            "Abstract": "This study was designed to examine the effects of the students' preferences and metacognitive learning-in connection with self esteem and cognitive variables-using an Adaptive Hypermedia Learning Environment (AHLE). Participants were 20 undergraduate students in a physics course, who were randomly assigned to participate in the 3 different modutes. Results indicated that the AHLE had a strong impact on students' perception of physics and metacognitive components of learning. Analysis of the results reveals a strong shift of students towards developing metacognitive strategies (conceptual change) and this is primarily true for students with a high self-esteem and FI as cognitive parameter. A web tool de-signed by the authors to count the number of trials of students indicates that students with a high degree of meta-learning have a low number of trials. The results on perception and metacognitive outcomes …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative Creativity and Six-Thinking-Hats Virtually Enhance 21st-Century Skills",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the personality characteristics in information and digital age expertise",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810024936",
            "Abstract": "The widespread use of new technologies and, more specifically, of computers has created a new global financial and social setting. In today's society of knowledge and information, the ‘digitally literate citizen’ is not just a necessity but a social demand. Information and Communication Technologies (ICT) are essential in enterprises and organizations, creating new perspectives in human intelligence and transforming alternative ways and solutions, in which we cooperate and communicate with each other. Therefore, the relationship among the personalization characteristics in the use of Information Technologies attracts the interest of social and psychological research. This study explores the net of relationships between self-concept, locus of control, global/computer self-efficacy and occupational values, using the constructive equation models on a sample of 207 freshmen and senior students specializing in the field …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Virtual team effectiveness: insights from the virtual world teams of massively multiplayer online games",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jls.21608",
            "Abstract": "Over the years, an explosive growth in the use of virtual teams in organizations has been noticed. However, the individual and team factors that result in the team effectiveness of a virtual team still remain unclear. The purpose of the paper is to try to comprehend how virtual teams work better, by shedding light on the Virtual World Teams of Massively Multiplayer Online Games. A framework based on the input‐process‐output model was used to test the relationships between leader emotional intelligence, task interdependence, cooperative group norms, social capital, team cohesion, transformational leadership, and team effectiveness in virtual teams, from a multilevel perspective. Structural equations modeling (N = 500) revealed that leader emotional intelligence is positively related to transformational leadership, which in turn is associated with virtual team effectiveness. Moreover, a significant relation between …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Wiley Subscription Services, Inc."
        },
        {
            "Title": "Gamification design framework based on SDT for student motivation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359631/",
            "Abstract": "Gamification is a new technique in instructional design that gains more and more attention in the elearning field. The implementation of gamification systems varies on different fields, such as sales, web design, marketing, education etc. There are many examples of applied gamification, such as international companies that use game elements in their applications in order to increase the users' motivation through a gamified process. In this paper we outline the design of a gamified scenario with the use of structural and content gamification to increase student intrinsic motivation based on the Self-Determination Theory. Besides, the use of game elements, thus game-design techniques, make the learning process more “fun” and maintain the realistic purpose of its situation. However, the process of increasing motivation has a level of complexity, since rewards and other game elements trigger extrinsic motivation. As …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ubiquitous game-based learning in higher education: A framework towards the effective integration of game-based learning in higher education using emerging ubiquitous technologies",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/ubiquitous-game-based-learning-in-higher-education/126102",
            "Abstract": "The rise of mobile broadband devices and services has significantly changed the role of mobile devices in people's daily lives by enabling the provision of innovative applications and services anywhere, anytime. Despite the fact that new ideas and innovation mainly occur within Higher Education Institutions (HEIs), the adoption of mobile and ubiquitous technologies by HEIs is still in its early stages. This chapter attempts to provide a framework to support Higher Education Institutions towards implementing mobile and ubiquitous, game-based learning activities. Aligned with the objective of this book, this chapter presents some examples and best practices of implementing this framework towards achieving the learning goals of future professionals in the fields of electronic and ubiquitous commerce.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Skills in computer use, self-efficacy and self-concept",
            "Publication year": 2004,
            "Publication url": "https://www.witpress.com/elibrary/wit-transactions-on-information-and-communication-technologies/31/14090",
            "Abstract": "In today’s information society knowing information technology is a critical factor for academic and professional education. The judgments of the individual about his/her competence in computer use can influence their goals and future plans concerning professional career and success. The continuously increasing rates of change in all aspects of contemporary life (technological, economic and social), as well as the production, distribution, exchange and diffusion of an enormous volume of information, facilitate collaborations while, at the same time, they increase competition and the standards set by the individual for him/herself making it hard to maintain a positive perception for hi",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:qUcmZB5y_30C",
            "Publisher": "WIT Press"
        },
        {
            "Title": "Problem-based learning in language instruction: A collaboration and language learning skills framework in a CSCL environment",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-62743-4_12",
            "Abstract": "Research has shown problem-based learning (PBL) to be an effective learning method in many ways. Although PBL learning has been studied extensively and a number of papers have discussed the merits of implementing PBL in educational environments, greater emphasis should be given on how it can be adapted to teach language effectively in secondary education. To make language learning skills more effective, an educational scenario was prepared based on the principles of a PBL model and the Jigsaw II collaborative strategy in a Computer Supported Collaborative Learning (CSCL) environment (Moodle). This educational scenario was designed and implemented so as to bolster collaboration and to enhance the language learning skills for high school students. There was both a quantitative and a qualitative analysis of wiki texts as well as chat and forum messages exchanged by the students …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "MMORPGs in the educational Process: Using a CSCL script to assess learning",
            "Publication year": 2015,
            "Publication url": "https://search.proquest.com/openview/fc33eae2c750cfcd14f3caee00258e64/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "Since the research in video gaming has given the first long-term results, new research fields emerged to exploit video games in the educational process. With a considerable fan crowd and the game industry spending more and more every year in Massive Multiplayer Online Role Playing Games (MMORPGs) development, the exploitation of MMORPGs in the educational process became a promising prospect. This study is an attempt to bridge MMOPRGs and the educational process, taking into account social, emotional and cognitional aspects. Based on a composite educational model combining collaborative learning, role-playing and problem solving, a Computer-Supported Collaborative Learning (CSCL) script was designed, converting an educational curriculum from the 6th grade of elementary school, into a Problem Based Learning (PBL) scenario embedded in a quest in a MMORPG called\" Neverwinter\". In …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Massively multiplayer online games as activity systems: The relationship between motivation, performance and community",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=pK8HBAAAQBAJ&oi=fnd&pg=PA412&dq=info:f-QACQBC0psJ:scholar.google.com&ots=117BDli5Q2&sig=wIg8zK_2WJmD-42QOhX1uCxrZnU",
            "Abstract": "This paper presents the results of a recently conducted research that explores Massively Multiplayer Online Games (MMOG) form a psychosocial perspective. More specifically, this paper includes the empirical findings of the research which used quantitative analysis techniques to investigate the relationship between physiological factors in MMOGs, such as sense community, performance and intrinsic motivation. In order to understand the reason why MMOGs are so popular to people, and especially to students, a research was conducted in a population of students who play a popular MMOG, called World of Warcraft (WoW). The findings of this research revealed that the ability to create groups and develop a sense of community in a game is motivating for the players. Moreover, the sense of belonging in a community was positive correlated with the players’ performance, implying that the performance of a player can be enhanced when the sense of community in a game is strong. These findings suggest that the development of groups of players in a game is possible to increase intrinsic motivation of players and enhance their performance in the game. Therefore, the contribution of this paper to games-based learning research is that it provides empirical results for the reason why MMOGs, such as WoW, are so popular to people: it seems that the players’ ability to form groups and develop a sense of belonging in them intrinsically motivates the players to play and perform well in these games. These results dignify the need for creating educational multiplayer online games and propose a conceptual framework based on the theoretical framework of …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A motivational design of a flipped classroom on collaborative programming and STEAM",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95522-3_19",
            "Abstract": "The purpose of this study was to design a blended learning environment, specifically a flipped classroom in order to provide capabilities for motivation to primary school students, to familiarize them with programming principles and encourage them to get involved with the STEAM (Science, Technology, Engineering, Arts, Mathematics) fields. The blended learning environment provides on-line distance learning programming activities integrated into Moodle through which asynchronous collaboration and problem solving skills are cultivated. It also provides face-to-face active learning through STEAM programming activities. The instructional design is based on the ARCS motivational model, for each of its key components (Attention - Relevance - Confidence - Satisfaction) different strategies and techniques were incorporated and combined with collaborative learning techniques, using various technological …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Introducing new digital challenges for reading comprehension: A case study with dedicated e-Readers",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901500/",
            "Abstract": "This case study was conducted to explore the metacognitive awareness of reading comprehension strategies of students while they used a dedicated e-Reader (Amazon Kindle) for reading an e-text. Fifteen high school students were assigned to complete a reading task which included reading two chapters of an e-book in a foreign language using a dedicated e-reading device. The findings revealed that students used a repertoire of effective metacognitive strategies while they read with the digital medium. They also took advantage of several features of the device to introduce new strategies to interact within the new context.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Users' Experience in a Gamified Online Educational Environment",
            "Publication year": 2018,
            "Publication url": "https://search.proquest.com/openview/f505b5951fc7dbb7c5175e0bd551da01/1?pq-origsite=gscholar&cbl=1796419",
            "Abstract": "With digital systems being a stable technology and e-gaming being the norm of playing in the new generation, digital learning environments emerge to frame the synthesis of an educational model that supports both Game-Based Learning (GBL) and e-Learning. Among the most promising gaming environments, with high engagement but also ambiguous learning outcomes, are Massive Multiplayer Online Role-Playing Games (MMORPGs). On the other hand, most learning environments with high learning frameworks seem to have low engagement marked with high dropout rates. The main objective of this research is to create a gamified learning strategy that would implement MMORPGs in a learning environment, developing a gamified e-course that is both engaging and educative. The instructional design framework was employed to construct an experiential MMORPG e-course model answering to this problem …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Online games for the next generation of workers",
            "Publication year": 2010,
            "Publication url": "https://www.learntechlib.org/p/45683/",
            "Abstract": "The “Next Generation”,“Net Generation”,“digital natives”,“millennials” or the “Google generation”, are some of the names used to describe the new generation entering to the workforce, growing up in a networked world and having a different set of needs and expectations as to learning and training. Thus, there is a need to find new elearning environments that would ensure the learners’ greater motivation and engagement to e-learning courses, in order to avoid high rates of drop-out. The current research in e-learning is focusing its attention in using innovative environments, such as MMOGs (Massive Multiplayer Online Games) and virtual worlds as training tools. This paper dignifies the need for creating collaborative educational online games, by presenting the findings of a research which revealed that the strong sense of community that the players build in the game, in a popular commercial called World of …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Kassel University Press GmbH"
        },
        {
            "Title": "Individual characteristics and computer self-efficacy in secondary education teachers to integrate technology in educational practice",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131506001643",
            "Abstract": "The development of modern technologies and their extension to every domain of our daily life nowadays is an indisputable fact. The widespread use of computers renders training in these technologies necessary. Consequently, computers were soon introduced into the Greek educational system. Factors related to the nature of the teacher’s personality, such as computer self-efficacy, self-concept, attitudes, motivation and needs are considered crucial to the integration and development of modern technologies in education. This study examines the relationship between individual characteristics of secondary school teachers and computer self-efficacy as well as teacher prospects with regard to modern technologies.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:IWHjjKOFINEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Psychological and pedagogical issues in ICT teachers' training and development",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKL.2007.015560",
            "Abstract": "The integration of Information and Communication Technologies (ICT) in educational practice has been the focus of scientific research in a number of studies. Some researchers have argued that this integration will make ICT an additional educational tool ('traditional research'), while some others have begun to explore individual beliefs that teachers hold about this subject ('more recent research'). Drawing on psychological issues, the present study is based on the findings of extensive research into the individual and psychological factors that may affect teachers' performance in the implementation of an 'in-service programme on ICT' in education. The study explores the relationships between Computer Self-Efficacy (CSE), Locus of Control (LoC) and professional development of secondary education teachers. Using data from 271 in-service secondary education teachers' undergoing training, the findings indicate …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "The cognitive apprenticeship theory for the teaching of mathematics in an online 3D virtual environment",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0020739X.2012.703334",
            "Abstract": "Research spanning two decades shows that there is a continuing development of 3D virtual worlds and investment in such environments for educational purposes. Research stresses the need for these environments to be well-designed and for suitable pedagogies to be implemented in the teaching practice in order for these worlds to be fully effective. To this end, we propose a pedagogical framework based on the cognitive apprenticeship for deriving principles and guidelines to inform the design, development and use of a 3D virtual environment. This study examines how the use of a 3D virtual world facilitates the teaching of mathematics in primary education by combining design principles and guidelines based on the Cognitive Apprenticeship Theory and the teaching methods that this theory introduces. We focus specifically on 5th and 6th grade students’ engagement (behavioral, affective and cognitive) while …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:qjMakFHDy7sC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Multiplayer online games as educational tools: Facing new challenges in learning",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131509002413",
            "Abstract": "This paper outlines a proposal for the development of educational multiplayer online games based on the activity theory, as an alternative to the current trend in multiplayer gaming and a means of promoting collaboration among students. In order to examine whether online games are engaging for learners, we consider multiple factors regarding game play – such as frequency of game use, gender differences, identification with the characters, and game preferences – as well as some psychosocial factors that may influence learning – such as academic performance, self-esteem, and computer self-efficacy. This paper suggests that online multiplayer educational games should be approached as a complex learning system, based on the principles of activity theory, where the Subjects would interact with other Subjects, Objects and Tools of the game, under specified Rules and create Communities through division of …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Applying PBL and SRL to Enhance Learning Strategies and Collaboration in a Blended Learning Environment",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-62743-4_8",
            "Abstract": "Studies are needed to investigate the features of e-learning environments in Higher education (HE) and highlight important issues, such as good practices, instructional design and techniques employed so that meaningful learning experiences can emerge. To this end, the design of an intuitive learning platform that integrates online and F2F learning following a well-established theoretical framework is proposed. Hence, the aim of the present study is the design and implementation of an instructional design workflow based on the combination of Problem-Based Learning (PBL) and Self-Regulated Learning (SRL), through a blended learning environment (apT2CLE Environment) in an attempt to enhance students’ learning strategies and collaborative skills. We conducted a quasi-experimental research within a computer science department of a university, throughout a university course. Participants …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Arguing to learn and learning to argue in second life",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6653669/",
            "Abstract": "Toulmin's argumentation ontology is revisited and seen in a new light with a view to developing Higher Education students' argumentation skills in a Multi-User Virtual Environment (MUVE), Second Life. The methodology applied takes Toulmin's focus on the micro-structure of the argument (the intra-relationship of argument components) as its starting point and extends it to reach the argument macro-structure (inter-relationship of chain of arguments). The vehicle to argue forward combining inter and intra-argument relationships is De Bono's Six Thinking Hats strategy. The added value of the resultant framework is a flexible, non tool-bound, domain-independent framework that addresses all stakeholders either wishing to teach their target audience argumentation skills or be taught and transfer those skills and framework to new real-life academic or business settings.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Managing time through a self-regulated oriented eportfolio for undergraduate students",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24258-3_56",
            "Abstract": "A self-regulated oriented ePortfolio as a dynamic social networking tool, orchestrated along the processes of Self-Regulated Learning (SRL) with career management skills was designed. The aim of this study is to examine how time management can be positively influenced through the implementation of the ePortfolio. We conducted a quasi-experimental research with comparison groups in pre/post-tests in order to examine time management as a behavioral self-regulatory process for academic performance. The findings revealed that students tend to manage time effectively, make schedules and allocate time after the completion of the ePortfolio. Further research should measure students’ SRL and the relations among cognitive, affective, behavior and context processes.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Moving From the Virtual to the Real World: Is Leadership in MMOGS a Transferable Skill?",
            "Publication year": 2017,
            "Publication url": "https://search.proquest.com/openview/fb0f6c468d2757b1baf7ba177aa75af3/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "In an ever-increasing networked world, where companies are becoming more and more distributed, leading a team can be challenging. These teams are often virtual and the role of the leader is changing rapidly from\" directing/controlling\" a system, to\" disturbing/facilitating\" the network. This new type of leader must facilitate the creation of highly adaptive and regularly changing organization structures, teams, and communications via a Transformational Leadership (TL) behaviour, by which change is introduced to individuals and/or organizations. For all these reasons, organizations are increasingly searching for leadership training programs that can help leaders adapt to their new role and enhance their performance. However, most trainings are based on lectures, causing participants' lack of engagement and motivation toward the training program and leading to low percentage of skill transfer. On the other hand …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Blending e-learning technologies and practices in University Pedagogy: Between theory and praxis",
            "Publication year": 2005,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/31382",
            "Abstract": "The principle and dominant model of integrating e-learning in traditional teaching in the Anglophone academic world is 'blended learning'. Blended learning also is used to describe learning that mixes various event-based activities, including face-to-face classrooms, live e-learning, and self-paced learning. Blended learning's role is to go beyond online course delivery and actually transform the educational experience. To that end, including educational technology that supports a full range of teaching and learning styles and optimises intellectual and technical resources along with traditional pedagogic forms in University teaching appears to become a necessity in a technological ever-changing world.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Being a student in the social media era: exploring educational affordances of an ePortfolio for managing academic performance",
            "Publication year": 2020,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/IJILT-12-2019-0120/full/html",
            "Abstract": "Undergraduate students often find it difficult to organize their learning activities and manage their learning. Also, teachers need dynamic pedagogical frameworks and learning technologies for supporting learners to advance their academic performance. The purpose of this paper is to investigate the effect of an ePortfolio intervention on self-regulated learning (SRL cognitive, affective, behavioral and contextual processes) and academic achievement.For the purposes of this study, an ePortfolio was designed and implemented based on SRL. The ePortfolio-based self-regulated learning approach (ePSRL) system encompasses the merits of a social networking platform and the functionalities of a learning management system. The participants were 123 university students (38 females and 85 males) at a computer science department. Students were randomly divided into two …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Training emotionally intelligent leaders: the case of massively multiplayer online games",
            "Publication year": 2015,
            "Publication url": "https://search.proquest.com/openview/15e084a1c52fdda1a9bd1a6a1df94105/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "Over the last decades, digital games have evolved to complex, social environments like Massively Multiplayer Online Games (MMOGs) which are a practice arena for 21st century skills, such as leadership. This paper outlines the conceptual framework behind a doctoral project currently in progress, which examines emotional intelligence (EI) as a leadership skill that can be developed in MMOGs. The main statement of this PhD is that the skills learned in the game settings can help people to become more emotionally intelligent in real life and workplace. The hypotheses of this study that leaders in MMOGs with high emotional intelligence can become transformational leaders, inspiring team members and enhancing team cohesion which can lead to team effectiveness. In order to address this issue, a preliminary study using qualitative and quantitative data from interviews and a survey, will examine the elements of …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Intrinsic Motivation and the Sense of Community in Multiplayer Games: An extended framework for educational game design",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600435/",
            "Abstract": "Over the years, digital games have become complex, often social environments, sometimes involving large distributed communities. This new generation of games, such as the MMOGs (Massive Multiplayer Online Games), have become very popular and their users spend thousands of hours analyzing in a fast pace new situations, interacting with multiple characters, and solving problems quickly and independently. It is claimed that MMOGs are popular mainly because they motivate players to create communities and interact with each other. On the contrary, the high dropout rate of e-learning is linked with low rates of self-motivation and self-direction in e-Learning. According to these thoughts, there is a need to find new educational technologies that would ensure the learners' greater motivation and persistence to e-learning courses. Thus, the current research in the e-learning field is focusing its attention in using …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Examining self-regulated learning through a social networking ePortfolio in higher education",
            "Publication year": 2019,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLT.2019.101849",
            "Abstract": "The use of social media applications can have negative effects on performance and as a result the need for interventions supporting learners to self-monitor, manage technology use and academic performance is pressing. The main focus of this research is the implementation of an ePortfolio through a course in higher education for empowering students to manage their academic path. An ePortfolio, as a dynamic social networking tool, was developed along the lines of self-regulated learning (SRL) with the aim of influencing student's self-regulatory capacity. To satisfy the purpose of the study a paired-samples t-test and correlations were employed to explore statistical differences on the levels of SRL processes. The findings reveal that there is a significant increase on the means across SRL processes. Future research needs to explore SRL effects on learning in the context of an ePortfolio using a set of assessment …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Designing collaborative learning environments using educational scenarios based on SR",
            "Publication year": 2009,
            "Publication url": "https://www.learntechlib.org/p/45590/",
            "Abstract": "As more and more studies acknowledge that students are basic contributors to the learning process, factors such as self concept,(computer) self-efficacy and self-regulation are important in enhancing human performance. Nevertheless, these learner characteristics have received little attention in the e-learning environment. This paper presents the results of a study indicating significant positive relationships between learner characteristics, such as self-concept (academic achievement and job achievement), Computer Self Efficacy (CSE) and Self-Regulation (SR) constructs. Acknowledging the requirement for a strong shift of students towards developing self-regulated scenarios and strategies, we suggest that collaborative e-learning environments should be designed according to the self-regulated theory and self-beliefs. As a result, in this study we present a model examining how we can design educational …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Kassel University Press GmbH"
        },
        {
            "Title": "Management architecture for the provision of e-services in cognitive environments",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-6262-9_72",
            "Abstract": "—The following paper discusses on the evolution of cognitive networks in conjunction with the development of advanced e-services, making a brief description of their role in modern society. E-services are delivered through a specific model, which is described in detail, and find several applications in peoples’ everyday activities. E-learning has proven to be a very important application of e-services, since the number of users that adopt it in their lives increases everyday. Thus, this paper presents the architecture of an e-learning platform, as well as the principles of the learning theories that influence the content’s structure. In this work, the e-learning content is formed for use by adult learners. Finally, the need for adaptation to each user’s specific demands and preferences, concerning both the content and the technical features of the platform, is discussed, providing further information on the way this …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Utilising a collaborative macro-script to enhance student engagement: A mixed method study in a 3D virtual environment",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131511002090",
            "Abstract": "This study examines the effect of using an online 3D virtual environment in teaching Mathematics in Primary Education. In particular, it explores the extent to which student engagement - behavioral, affective and cognitive - is fostered by such tools in order to enhance collaborative learning.For the study we used a purpose-created 3D virtual environment and a macro-script incorporating learning tasks related to basic fractions. The study itself took place during four teaching sessions in a primary school classroom. The data collected and analyzed included chat logs, classroom observation notes and the results of pre- and post-tests.The findings indicate that the 3D virtual environment actively engages the students’ interest and leads to richer interaction between them. This in turn results in a higher level of student engagement in the collaborative learning process.We believe that 3D virtual environments provide novel …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:WF5omc3nYNoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Exploring Students’ Reading Self-Efficacy Beliefs within Digital Environments: A Case Study with Amazon Kindles.",
            "Publication year": 2015,
            "Publication url": "https://www.learntechlib.org/p/152100/",
            "Abstract": "An e-reader is a mobile device especially designed to display digital forms of written materials. Factors related to students’ personality, like self-efficacy beliefs may be strongly connected to the adoption of modern technologies in educational practice. This paper presents the findings of a case study which aimed to explore the reading self-efficacy beliefs of high-school students who used a dedicated e-reading device (Amazon Kindle DX) to accomplish a reading task. Findings revealed a high level of students’ perceived self-efficacy to operate the device efficiently and a strong sense of faith in their ability to perform challenging reading tasks with the e-reader. On the other hand, no issues of hypothetical comparison with the traditional reading environment were emerged. Students believed that they can use the device supportively to the classic book but not instead of it.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Inspiring key competencies through the implementation of an ePortfolio for undergraduate students",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042815043086",
            "Abstract": "Undergraduate students find it difficult to understand the necessity of transforming key competencies into meaningful knowledge with regard to self, academia and career development. Higher Education should deliver learner-centered experiences like ePortfolios so as to support students into taking responsibility for their own learning processes during multiple formal coursework. On this basis, we designed Apt2iMySelf ePortfolio so as to strengthen and transform key competencies into meaningful learning, promote academic and career development. In detail, the Apt2iMySelf ePortfolio as open source social software aligning the aspects (cognitive, affective, behavior and context) of self-regulated learning (SRL) with career management skills was developed. We conducted a quasi-experimental research with comparison groups in pre/post-tests in order to examine key competencies and students’ performance. The …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Evaluating New Teaching Methods in Computer Learning Environments: The Role of Self Efficacy",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/39531247/Papapetrou_Savvas_2004_Evaluating_New_Teaching_Methods_in_Computer_Learning.pdf",
            "Abstract": "This research investigates how new teaching methods can promote teaching computer skills, in order to explore how to make full use of computer abilities in the most effective ways. It suggests that teaching computer skills through the application of new methods is a critical factor that can enhance the learning procedure in a classroom environment. At the same time the research focuses on the wider environment, as this is shaped in the school class (classroom environment), but also on the more special conditions-parameters (task orientation, student support etc), which contribute to the growth of learning in the school. The role of computer self-efficacy is been acknowledged as one of the enhancing procedures in learning and this role is systematically explored.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Educating the Future Workforce",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=11501511608985425742&hl=en&oi=scholarr",
            "Abstract": "The future workforce is a generation that was brought up in a technology immersed world, participating in communities, such as social networks and MMOGs and learning via e-learning platforms. These experiences have enabled them with a numerous set of needs and skills. Hard skills, such as computational thinking and problem solving, are thought to be crucial for the future labor marker, highlighting the importance of STEM education. Moreover, soft skills, such as collaboration and leadership, are considered to be essential for a person’s both career and well-being. These skills and needs of today’s learners can be utilized in order to engage students in technology based learning environments that meet students’ needs and develop the needed skills for the future. However, education is often subjectoriented and focuses on the development of hard skills rather than soft skills. This chapter highlights the importance of these skills and provides a framework, based on Challenge-Based Learning and Activity Theory, for designing educational experiences for developing hard and soft skills.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Training the 21st century workforce of early childhood teachers in STEM education through an e-learning environment",
            "Publication year": 2014,
            "Publication url": "http://learningideasconf.s3.amazonaws.com/Docs/Past/2014/papers/Akritidou_Paraskeva_Alexiou.pdf",
            "Abstract": "It is a compelling need for early childhood teachers to be trained to implement more challenging and technology-oriented methods at teaching including interdisciplinary learning approaches. Towards this end, an eLearning training program is proposed to be implemented for supporting teachers in exploring new ideas and enhancing skills related to Science, Technology, Engineering, and Mathematics (STEM Education). Based on the fact that children's interests, desires and abilities are formulated during the early years, STEM education aims to enrich their education. For this reason, STEM education should begin in the early years. The aim of the research is the implementation of the STEM methodology(Science, Technology, Engineering and Mathematics) supported by the model of Cognitive Apprenticeship in an eLearning Environment providing a means to enhance collaboration among early childhood teachers. An autonomous electronic environment named ‘ap²TSTEM,’was designed following the principles of Cognitive Apprenticeship as a constructivist learning model, combined with the Jigsaw collaborative strategy. The proposed environment is more than a continuing training program; it is also aimed at supporting teachers to integrate technology and engineering with science and mathematics in everyday practice. This also improves the quality of work offered to students and enhances their thinking processes through providing crucial brain-building interactions early in life. An experimental research was conducted in order to examine collaborative skills and how teachers improved their teaching skills, developing new approaches of …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting motivation and self-efficacy through the implementation of self-regulated oriented ePortfolio",
            "Publication year": 2013,
            "Publication url": "http://learningideasconf.s3.amazonaws.com/Docs/Past/2013/papers/Alexiou_Paraskeva.pdf",
            "Abstract": "Critical affective factors like motivation and self-beliefs promote persistence in changes; they affect the learning processes and direct individuals toward certain goals. On these grounds, it is explored if the extent motivation and self-efficacy can be positively impacted through the implementation of a self-regulated oriented ePortfolio. An ePortfolio, constituting an innovative elearning tool, supported by the self-regulated learning (SRL) theory is being developed. Based on the findings of the proposed ePortfolio implementation, a conceptual framework aligning aspects (cognitive, motivational, affective and social) of the cyclical SRL model with 21st century life and career competences is proposed. In the context of the present study, quasi-experimental research with comparison groups in pre/post-tests is conducted in order to examine motivational and self-efficacy beliefs. The findings reveal that students’ motivational and self-efficacy beliefs tend to increase upon completion of the experimental procedure. Furthermore, the potential of the development of ePortfolios should be further studied to empower students to become active learners and enhance their competences.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-regulated learning strategies and computer self-efficacy in IT courses",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=J0XQCwAAQBAJ&oi=fnd&pg=PA235&dq=info:cNOGzp7b3ZEJ:scholar.google.com&ots=CjxNaEY6ZK&sig=fKI0i8h84DBkTresr9avtRL0-9I",
            "Abstract": "Today, the ability to learn is considered a critical factor for an individual’s academic and career performance. Educational programs and courses can contribute to this by enabling individuals to develop specific skills and strategies so as to attain specific goals. Academic research has noted that the goal of tertiary education is to foster individuals to become capable, independent, self-regulated and efficient learners. Thus self-efficacy beliefs and self-regulatory practices can be powerful predictors of success in academic and social life. The purpose of this study on 188 students of an Information Technology Department was to determine the relationship of self-regulated strategies and computer self-efficacy in IT courses, as these strategies are considered critical for the individual’s development. The effects of the variables such as the year of studies (at the beginning and at the end of studies) in correlation with self-regulated learning strategies and self-efficacy were examined. The results illustrate that there is a correlation between self-regulated strategies (cognitive and meta-cognitive strategies) and computer self-efficacy (beginning, advanced, file and software management skills). These findings are significant in that they may facilitate the construction of efficient academic courses that will enhance the student’s strategies and skills.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:UebtZRa9Y70C",
            "Publisher": "WIT Press"
        },
        {
            "Title": "A Computational Experiment to Describe Opinion Formation Using a Master Equation and Monte Carlo Simulations",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87781-3_53",
            "Abstract": "We propose a computer simulation model aiming to describe the interaction of students in a learning environment composed of the teacher, the students in a collaborative project and the educational material. Our aim is to investigate the change of the opinion of students when they interact with an agent with different opinion. This model can apply to all levels of education in order to explore the reconciliation or not of different opinions during the teaching and learning sequence as well as to examine the resistance of students to new challenges and concepts. The idea is based on the social impact theory and uses methods of Computational Physics, mainly the Monte Carlo techniques and the notion of master equation. Results from simulations indicate that opinion formation is established for different values of the populations when the temperature is below the critical temperature.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A case of emotional intelligence for teachers’ professional development: emotions and connections are ubiquitous in second life",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-42147-6_4",
            "Abstract": " Success in teaching requires teachers’ strong social and emotional competences to effectively manage and develop students’ emotional development in every day practice. Having identified the important role of these competencies in schools, virtual learning environments (VLEs) and specifically environments like Second Life (SL) could be selected in order to enhance teachers’ and students’ social and emotional intelligence. Teachers could reflect, practice and improve their use of social and emotional competences in the classrooms by using Teachers’ Professional Development programs (TPD), thereby making further improvements to their teaching. These training programs could support teachers by using suitable frameworks aligned with social and emotional learning (SEL). In this paper, we highlight the significance of TPD programs by presenting a SEL workshop on SL in order to better understand …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Enhancing self-regulated learning skills through the implementation of an e-portfolio tool",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042810005033",
            "Abstract": "This paper outlines the process of integrating an e-portfolio tool in tertiary education for students’ personal and professional development. During 2009 spring semester, we implemented an e-portfolio tool for students of a computer science university department.We explored the potential of e-portfolio to support self-regulated learning. The evaluation of the research is based on quantitative and qualitative statistical analysis. The paper brings out new ideas and possibilities: the implementation of an e-portfolio so as to promote student self-regulation and as a consequence to enhance academic and professional skills.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Designing a PBLJii script in a CSCL environment for bolstering collaboration and communication skills",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-22629-3_7",
            "Abstract": "Teachers’ training programs should focus on practical experiences and reflective practices through technology enhanced learning environments in order to foster their collaboration and communication skills. The aim of this research is the design and implementation of a collaboration PBLJii script (Problem-based learning & Jigsaw II Script), which is orchestrated along the principles of a Problem-based Learning model and the Jigsaw II collaborative strategy in a CSCL environment so as to bolster collaboration and communication skills among teachers. An experimental design research (one group only research) was conducted in a number of primary schools in Greece. The participants (in-service teachers) engaged in the training process through the PBLJii Script in History. There was both a quantitative and a qualitative analysis of the chat and forum messages exchanged by the in-service teachers in the …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Learning styles and instructional design as inputs for adaptive educational hypermedia material design",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Aimilia-Tzanavari/publication/237081238_Learning_Styles_and_Instructional_Design_as_Inputs_for_Adaptive_Educational_Hypermedia_Material_Design/links/00b7d51b629927bd29000000/Learning-Styles-and-Instructional-Design-as-Inputs-for-Adaptive-Educational-Hypermedia-Material-Design.pdf",
            "Abstract": "In education, instructors adopt different instructional modes that correspond to their preferred teaching style: some focus on principles and others on applications; some present the material in a logical progression of small incremental steps, others proceed from the big picture to the detail and so on. On the other side, students are characterized by different learning styles: preferences or predispositions to behave in a particular way when engaged in a learning process. In the elearning area, adaptive educational hypermedia applications are designed in order to offer personalised learning experience based on the personal learning style. It has been proven that the good match between learning style and instructional design drives to effective learning. This paper proposes a systematic approach for designing leaning tasks for educational hypermedia applications that suit the individual learning style. In particular, we show how the design patterns approach can be used as a design model tool.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating e-learning technologies and practices within university teaching: challenges and perspectives",
            "Publication year": 2005,
            "Publication url": "http://www.wseas.us/e-library/conferences/2005malta/papers/499-387.pdf",
            "Abstract": "This paper examines the challenges and perspectives University teaching is facing in the context of technology innovations. It argues that University teaching by including e-learning potentials can be facilitating and broadening participation, but points out that pedagogy must be considered.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Educating the future workforce: Bridging the gap between learners' needs and skills in need",
            "Publication year": 2018,
            "Publication url": "https://www.igi-global.com/chapter/educating-the-future-workforce/195268",
            "Abstract": "The future workforce is a generation that was brought up in a technology immersed world, participating in communities, such as social networks and MMOGs and learning via e-learning platforms. These experiences have enabled them with a numerous set of needs and skills. Hard skills, such as computational thinking and problem solving, are thought to be crucial for the future labor marker, highlighting the importance of STEM education. Moreover, soft skills, such as collaboration and leadership, are considered to be essential for a person's both career and well-being. These skills and needs of today's learners can be utilized in order to engage students in technology based learning environments that meet students' needs and develop the needed skills for the future. However, education is often subject-oriented and focuses on the development of hard skills rather than soft skills. This chapter highlights the …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:r0BpntZqJG4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Workplace e-learning: exploring factors affecting perceived transfer of training",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600437/",
            "Abstract": "This study aims to explore and test empirically the relationships between variables such as self-efficacy, motivation, content validity, ease of use, communication with trainer, supervisor support and transfer of training. The research was carried out in a large financial organization located in Greece. Research data were collected using an instrument with 19 items which distributed to 480 employees who attended an e-learning course. The findings of the study indicate that three of the six independent variables (motivation, validity of content and supervisor support) were statistically significant related to transfer of training.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Leveraging the 1: 1 iPad approach for enhanced learning in the classroom",
            "Publication year": 2018,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2018.1512463",
            "Abstract": "Mobile technologies are integrated parts of our lives, and their use in educational settings could provide new, exciting opportunities for teaching and learning. The integration of the iPad in education, in particular, is thought to bring a paradigm shift and transform the twenty-first century classroom. However, as it is relatively new and experiences from pilot projects are just now beginning to surface, little concrete research on how it can be effectively adopted in the classroom and in other pedagogical activities exists. This raises the question of how to support students and teachers to realize the full potential of the 1:1 iPad approach. We followed the principles of action research in order to explore students’, teachers’ and parents perception of 1:1 iPad approach in the classroom. Towards this, we conducted a mixed-method research and combined quantitative and qualitative data. For the needs of this research, we …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:isC4tDSrTZIC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Teaching in the computer lab: A new challenge for primaryschool teachers.",
            "Publication year": 2004,
            "Publication url": "http://www.wseas.us/e-library/conferences/crete2004/papers/476-360.rtf",
            "Abstract": "As more and more schools achieve computer capabilities, implementing information technology in teaching practically any school subject is expected to transform both the teachers' way of instruction and the students' way of learning as well as the lessons themselves. This paper aims at presenting a proposition for new teaching experiences in the computer lab as an alternative to the regular classroom. Examples of teaching English as a foreign language and Geography in Greek primary schools are presented. Brief lesson plans with specific activities are described. It is assumed that computer literacy is enhanced while these or other subjects are being taught.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Authentic assessment in computer supported collaborative learning environments in higher education",
            "Publication year": 2009,
            "Publication url": "https://www.learntechlib.org/p/32898/",
            "Abstract": "This paper is a report on findings of a study conducted on higher education level. Correlation analysis was used to examine the connection between the perceptions of learners on authentic assessment and study approach (deep/surface), reflective thinking, motivation and dimensions of authentic assessment in a web based collaborative learning environment. Findings indicate that authentic assessment promotes deep study approach, reflection and intrinsic goal orientation. Learners strongly connect web based authentic assessment with overall authenticity, task, physical context, results, criteria and criterion transparency. Educators and constructors of CSCL environments could use authentic assessment as an alternative and more efficient way of assessment and learning. Well organized and understandable to learners standards, authentic tasks, criteria and rubrics enhance authenticity in assessment.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:roLk4NBRz8UC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Using Cognitive Flexibility Theory as an instructional and collaborative model for teaching students in higher education",
            "Publication year": 2011,
            "Publication url": "https://www.learntechlib.org/p/38224/",
            "Abstract": "This paper explores how the Cognitive Flexibility Theory (CFT) as a collaborative model has promoted student learning in a university course for engineers as teachers. More specifically this paper presents the application of CFT as an instructional and collaborative model to teach how to apply Microsoft packages in/through authentic problems, fostering multiple cases and different perspectives of learning, in the mode of situated applications in higher education students. Research results revealed that CFT may be valuable for the teaching of principles and applications. According to the findings from the experiments, the learning concepts seemed easier when students tried to apply them to real problems of/in everyday life, because of the link between theory and practice.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:blknAaTinKkC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Leadership in MMOGs: A field of research on virtual teams",
            "Publication year": 2012,
            "Publication url": "https://www.academic-publishing.org/index.php/ejel/article/view/1628",
            "Abstract": "As our need for collaboration constantly grows, new tools have emerged to connect us in social networks, supporting the development of online communities, such as online games and virtual worlds. MMOGs (Massively Multiplayer Online Games) and MMORPGs (Massively Multiplayer Online Role‑Playing Games) are complex systems, in which players are self‑organized and collaborate in guilds; constantly improve to remain competitive, visioning the enemys and guilds reaction. Nevertheless, these are considered to be important leadership skills for the real world, revealing multiple similarities that link the gaming world and the real world. However, despite the significant amount of educational research and the growing interest of the scientific community in MMOGs, there is a lack of empirical research considering the cognitive and social aspects of these games. This paper outlines the theoretical rationale behind a doctoral research project which is currently in progress and examines the leadership skills that can be developed in a self‑organized community of MMOGs. The main questions that this project attempts to address are: What characteristics related to the social nature of MMOGs activate leadership skills? What MMOGs can teach us about the design of successful online social spaces and activities for teaching leadership skills in virtual teams? In order to address these issues, this paper presents a theoretical framework for analyzing the social interactions in multiplayer games, within the context of community of practice, connectivism, self‑organization and activity theory. This framework aims at examining the creation of communities and …",
            "Abstract entirety": 0,
            "Author pub id": "IeaP7wIAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ubiquitous Game-Based Learning in Higher Education",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=4073145164167183874&hl=en&oi=scholarr",
            "Abstract": "The rise of mobile broadband devices and services has significantly changed the role of mobile devices in people’s daily lives by enabling the provision of innovative applications and services anywhere, anytime. Despite the fact that new ideas and innovation mainly occur within Higher Education Institutions (HEIs), the adoption of mobile and ubiquitous technologies by HEIs is still in its early stages. This chapter attempts to provide a framework to support Higher Education Institutions towards implementing mobile and ubiquitous, game-based learning activities. Aligned with the objective of this book, this chapter presents some examples and best practices of implementing this framework towards achieving the learning goals of future professionals in the fields of electronic and ubiquitous commerce.",
            "Abstract entirety": 1,
            "Author pub id": "IeaP7wIAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        }
    ]
}]