[{
    "name": "Χαράλαμπος Σκιάνης",
    "romanize name": "Charalampos Skianis",
    "School-Department": "Μηχανικων  Πληροφοριακων Και Επικοινωνιακων Συστηματων",
    "University": "aegean",
    "Rank": " Καθηγητής",
    "Apella_id": 18470,
    "Scholar name": "Charalabos Skianis",
    "Scholar id": "DEdnDtgAAAAJ",
    "Affiliation": "University of the Aegean",
    "Citedby": 2031,
    "Interests": [
        "Networking",
        "Communication Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=DEdnDtgAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On the energy requirements of vertical handover operations: Measurement-based results for the IEEE 802.21 framework",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6335316/",
            "Abstract": "The availability of multiple collocated wireless networks and the multi-radio capabilities of contemporary wireless terminals open the potential for optimized wireless connectivity over the heterogeneous wireless environment. Vertical Handover (VHO) operations play a central role in such a setting, enabling the dynamic association of wireless users with the most appropriate wireless networks among those available, towards improved effectiveness according to a host of relevant criteria. At the same time, the efficiency of executing the VHO operations themselves is also a factor affecting the overall system effectiveness. Although several aspects of VHO operations have been investigated in the literature, energy efficiency has not received so much attention yet. Towards closing this gap, the paper investigates the energy requirements associated with the execution of the VHO, by expressing the relevant operations as a …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance analysis of M2M communication networks for QoS-differentiated smart grid applications",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7414116/",
            "Abstract": "We study the performance of Machine-to-Machine (M2M) communications in Long Term Evolution Advanced (LTE-A) networks. The proposed analysis is applied to the random access procedure within LTE-A for the calculation of the average overall delay, by considering multiple classes of M2M devices with diverse Quality-of-Service (QoS) requirements. The QoS differentiation is expressed through different Access Class Barring (ACB) parameters and backoff times for the various QoS classes. For the packet arrival process of M2M devices we consider an ON-OFF arrival process, which is a realistic approach, especially for M2M communications in Smart Grid environments. Furthermore, the proposed analysis is suitable for smart grid communication networks, where multiple M2M gateways are installed in different points of the network. The comparison of analytical results with simulations reveals the high accuracy …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A quantitative method for graphical representation of H. 264 video content dynamics",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917732/",
            "Abstract": "This paper presents a method for graphical representation of H.264 video content dynamics, based on the extraction of motion information from the video signal in order to define the content's spatiotemporal dynamics levels. For this purpose, the paper introduces a motion compensation and content residual grid, where each video signal is represented as a point with coordinates that are defined by its motion dynamics and content residual, respectively. The proposed method can be effectively integrated as part of the decision process in video adaptation systems, which perform spatial or temporal (or both) adaptation actions, like MPEG-DASH, in order to optimize the video service delivery.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Provisioning of end to end QoS in diverse environments: the ENTHRONE view.",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/George-Xilouris/publication/228095383_Provisioning_of_end_to_end_QoS_in_diverse_environments_the_ENTHRONE_view/links/5f560cf6299bf13a31a7d8ac/Provisioning-of-end-to-end-QoS-in-diverse-environments-the-ENTHRONE-view.pdf",
            "Abstract": "Present and Future networks are highly diverse environments bringing together in a synergy different technologies such as IP, WLAN, DVB, UMTS. End-to-End delivery of services over heterogeneous environments with quality of service guarantees is a major challenge for research community with no apparent unified solution. In this paper, the perspective for End-to-End (E2E) QoS is outlined in the view of ENTHRONE (End-to-End QoS through Integrated Management of Content, Networks and Terminals) project. The aim is to develop an integrated network management solution that will handle in a homogeneous manner a number of network segments, including wired (IP based core network) and wireless (DVB, WLAN, UMTS), segments. Apart from implementing the management functions, enforcing policies and making provisioning decisions for optimising the usage of network resources, the solution will also provide service level monitoring functions for in-service verification of offered services by verifying whether the committed QoS performance guarantees are in fact being met. The overall network architecture, certain operational scenarios alongside remedial actions to QoS degradation are focal points of this paper.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Networks with Server Vacations and Blocking'",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=2cgFCAAAQBAJ&oi=fnd&pg=PA111&dq=info:d33p2ZpNffYJ:scholar.google.com&ots=uevXAql8n7&sig=fxokOpV-OqxAgYDn9tfzNbpEkRo",
            "Abstract": "Queueing network models (QNMs) are widely recognised as powerful evaluation tools for representing computer and communication systems and predicting their performance. This paper focuses on arbitrary open exponential QNMs with server vacations and repetitive-service blocking with random destination (RS-RD). A finite capacity M/M/1/N queue with exponential server vacation periods-solved via the principle of minimum relative entropy (MRE) and classical queueing theory-plays the role of an efficient building block in the solution process. A cost-effective algorithm for the analysis of such QNMs is step-wise described and numerical results against simulation are included to demonstrate the credibility of the MRE approach.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:vRqMK49ujn8C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Cyber Threats to Industrial IoT: A Survey on Attacks and Countermeasures",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1024380",
            "Abstract": "In today’s Industrial Internet of Things (IIoT) environment, where different systems interact with the physical world, the state proposed by the Industry 4.0 standards can lead to escalating vulnerabilities, especially when these systems receive data streams from multiple intermediaries, requiring multilevel security approaches, in addition to link encryption. At the same time taking into account the heterogeneity of the systems included in the IIoT ecosystem and the non-institutionalized interoperability in terms of hardware and software, serious issues arise as to how to secure these systems. In this framework, given that the protection of industrial equipment is a requirement inextricably linked to technological developments and the use of the IoT, it is important to identify the major vulnerabilities and the associated risks and threats and to suggest the most appropriate countermeasures. In this context, this study provides a description of the attacks against IIoT systems, as well as a thorough analysis of the solutions for these attacks, as they have been proposed in the most recent literature.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Real-time TVWS trading based on a centralized CR network architecture",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6162600/",
            "Abstract": "This paper discusses the design and prototyping of a cognitive radio system architecture that enables for TVWS exploitation under the real time secondary spectrum market policy. It describes a centralized infrastructure-based network, where TVWS allocation among unlicensed systems is administrated by a spectrum broker, carrying out radio-resource management and spectrum trading in real time. For optimum system performance as a matter of maximum-possible radio resource exploitation and trading revenue, the paper studies and implements a prototype mechanism at the spectrum broker side, which exploits backtracking algorithm for obtaining the best-matching solution. Performance evaluation experiments carried-out under controlled conditions verified the validity of the proposed architecture, besides establishing its capacity for maximum spectrum utilisation and minimum fragmentation under a fixed-price …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoE fairness, HTTP adaptive streaming and IDVB-T: The AWM approach",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917731/",
            "Abstract": "In this paper, we show how Active Window Management (AWM) technique can be exploited for providing QoE fairness to the HTTP Adaptive Streaming users of an interactive digital broadcasting network. Furthermore, we test AWM's efficiency against another QoE fairness provision solution, presented in other research efforts, namely the Traffic Shaping. Towards these, we firstly describe the deployment of AWM and Traffic Shaping software modules in each intermediate node (Cell Main Node-CMN) of the broadcasting network and secondly we proceed with the experimental evaluation. The experimental results showed not only AWM's efficiency to achieve the set fairness goal but also revealed AWM's capacity, when compared to Traffic Shaping, to provide for much lower TCP Round Trip Times (88% less) and zero retransmissions; a result which could, in principle, lead to less TCP rate variations and thus less …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey on context-aware mobile and wireless networking: On networking and computing environments' integration",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6182559/",
            "Abstract": "During the last years, a continuous convergence and fusion of computing and networking systems is stressed in the ICT research community. Context awareness appears to be a major research \"glue-point\" of such kind of heterogeneous environments' integration. In this survey paper, we aim to assemble all the \"puzzle-pieces\" of the emerging research area of Context Aware Mobile and Wireless Networking (CAMoWiN) in order to provide the reader a holistic representation of the work having been done in the past emphasizing in recent research efforts. A precise definition of abstract Context Aware (CA) functionalities together with a clear classification of related state-of-the-art proposals are provided in the form of a proposed taxonomy scheme per CA functionality. Each taxonomy scheme can also serve as a sufficiently general framework permitting the easy classification of novel CAMoWiN solutions emerging in …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A context-aware framework for the efficient integration of femtocells in IP and cellular infrastructures",
            "Publication year": 2013,
            "Publication url": "https://jwcn-eurasipjournals.springeropen.com/articles/10.1186/1687-1499-2013-62",
            "Abstract": "In today’s heterogeneous networking (HetNet) environments, where end users are provided with universal connectivity opportunities, femtocell deployments can become key players in the enhancement of critical performance indicators such as capacity, coverage, QoS, etc. In order to confront the up-to-date LTE femtocell challenges, we propose a context-aware framework that provides a controlled environment from the femtocell point of view, which is required for applicable functionality. More specifically, we aim to (a) control the local environment where the femtocell is placed within, by efficiently managing the total incoming traffic load and by continuously adjusting the distribution of the backhaul capacity among the coexisting networks and (b) control the macro–femto interference caused by macrocell users transmitting close to the femtocell by investigating the “femtocell as a relay” concept. Finally, the performance of the proposed framework is evaluated via simulation results showing that the overall performance of a HetNet environment can be leveraged in terms of QoS requirements, energy saving and data rate enhancement.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Provision of Active Services through Next Generation Networking Middleware.",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Kouis/publication/221289658_Provision_of_Active_Services_through_Next_Generation_Networking_Middleware/links/57fea53a08ae6b2da3c895ac/Provision-of-Active-Services-through-Next-Generation-Networking-Middleware.pdf",
            "Abstract": "The evolution of Next Generation Networking Middleware (NGNM) will yield to the provision of personalized next-generation active services, each one with different traffic characteristics and networking requirements for security, billing, QoS (Quality of Service), mobility, etc. in an efficient and economical usage of network resources. The introduction and well establishment of the active services concept, which will be services capable of dynamically adapting themselves to various underlying networking environment conditions according to the instructions of NGNM and the requirements posed by the end user, constitutes the major goal of this paper. In order to avoid proprietary and custom implementation solutions, an initial and generic active services reference architecture that can be followed by potential active services developers is presented. Finally, an implemented prototype that follows the proposed reference architecture provides a first quick validation of the discussed active service concept.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Joint relay‐pair selection for buffer‐aided successive opportunistic relaying",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.2718",
            "Abstract": "In this work, we present a buffer‐aided successive opportunistic relaying scheme that aims at improving the average capacity of the network when inter‐relay interference arises between relays that are selected for simultaneous transmission and reception. We propose a relay selection policy that, by exploiting the benefits of buffering at the relays, decouples the receiving relay at the previous time slot to be the transmitting relay at the next slot. Furthermore, we impose an interference cancellation threshold allowing the relay that is selected for reception to decode and subtract the inter‐relay interference. The proposed relaying scheme selects the relaying pair that maximises the average capacity of the relay network. Its performance is evaluated through simulations and comparisons with other state‐of‐the‐art half‐duplex and full‐duplex relay selection schemes, in terms of outage probability, average capacity and …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of Single Hop Ad-hoc Networks.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=7150341026051139520&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trust establishment in sensor networks: behaviour-based, certificate-based and a combinational approach",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSSE.2008.018135",
            "Abstract": "Sensor networks highly depend on the distributed cooperation among network nodes. Trust establishment frameworks provide the means for representing, evaluating, maintaining and distributing trust within the network, and serve as the basis for higher level security services. This paper provides a state-of-the art review of trust establishment frameworks for ad hoc and sensor networks. Certain types of frameworks are identified, such as behaviour-based and certificate-based, according to their scope, purpose and admissible types of evidence. The review is complemented by a comparative study built both on criteria specific to each category and on common criteria, grouped into three distinct classes: supported trust characteristics, complexity and requirements and deployment complexity and flexibility. We then present a trust establishment framework targeted for sensor networks that combines aspects from the two …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Efficiency study of the information flow mechanism enabling interworking of heterogeneous wireless systems",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121206002834",
            "Abstract": "The efficient co-operation of heterogeneous wireless technologies is directly relevant to the 4G wireless systems. Key building block of such an environment is the signaling protocol that allows the bidirectional flow of information between network and user devices. This provides the motivation behind this paper that initially presents key aspects of such a signalling protocol in a ‘Beyond 3G system’ (B3G) or otherwise known as a composite radio network. On the basis of the described architecture of the B3G system, simple simulation models for capturing the dynamics of the message exchanges are discussed. The simulation study allows the derivation of both qualitative and quantitative results, that provide insight on key characteristics of the composite environment.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:WF5omc3nYNoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "IP Operations and Management: 8th IEEE International Workshop, IPOM 2008, Samos Island, Greece, September 22-26, 2008, Proceedings",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=nHRqCQAAQBAJ&oi=fnd&pg=PP2&dq=info:bj0Ft6LaaYoJ:scholar.google.com&ots=nJ3bVDjQKJ&sig=WI89HDYdkxSiZ1cPxeAEudDvOdw",
            "Abstract": "This book constitutes the refereed proceedings of the 8th IEEE Workshop on IP Operations and Management, IPOM 2008, held on Samos Island, Greece, on September 22-26, 2008, as part of the 4th International Week on Management of Networks and Services, Manweek 2008. The 12 revised full papers presented in this volume were carefully reviewed and selected from 30 submissions. The papers are organized in topical sections on network anomaly detection; traffic engineering, protection, and recovery; network measurements and applications; and network management and security.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer"
        },
        {
            "Title": "Preface: special issue on performance modeling and simulation in healthcare information systems",
            "Publication year": 2007,
            "Publication url": "https://journals.sagepub.com/doi/pdf/10.1177/0037549707083110",
            "Abstract": "The guest editors wish to thank all the authors for their contributions. We hope that the papers included in this special issue will be of value to the audience of the Simulation: Transactions of the Society for Modeling and Simulation International and that the readers will find them interesting.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Trust and reputation systems for wireless sensor networks",
            "Publication year": 2009,
            "Publication url": "https://www.nics.uma.es/biblio/citekey/roman2009b",
            "Abstract": "The concept of trust has become very relevant in the late years as a consequence of the growth of fields such as internet transactions or electronic commerce. In general, trust has become of paramount importance for any kind of distributed networks, such as wireless sensor networks (WSN in the following). In this chapter of the book, we try to give a general overview of the state of the art on trust management systems for WSN and also try to identify the main features of the architectures of these trust management systems.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimized fusion of heterogeneous wireless networks based on media-independent handover operations [accepted from open call]",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5547925/",
            "Abstract": "In recent years a plethora of wireless technologies has become available. Users may efficiently utilize heterogeneous network infrastructures while moving among different access networks in order to attain better services, everywhere and at any time, following the always best connected concept. In this article enhanced handover functionality is described for integrated Wi-Fi/WiMAX networks, based on the recently established IEEE 802.21 standard that serves to glue together heterogeneous wireless access technologies. Moreover, alternative implementation choices are introduced with an emphasis on the mapping of primitives between the IEEE 802.21 standard and the various underlying access network technologies. As a result, optimized media-independent handover operations are provided alongside highlighted possible improvements to the related standards.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Serious games in K-12 education: Benefits and impacts on students with attention, memory and developmental disabilities",
            "Publication year": 2017,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/PROG-02-2016-0020/full/html?journalCode=prog&utm_source=TrendMD&utm_medium=cpc&utm_campaign=Emerald_TrendMD_1&WT.mc_id=Emerald_TrendMD_1",
            "Abstract": "PurposeThe purpose of this paper is to explore the integration of serious games (SGs) in the area of special educational needs in the last ten years (2007-2017).",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Success: A 9 Layered-based Model of Giftedness",
            "Publication year": 2017,
            "Publication url": "https://elibrary.ru/item.asp?id=32714147",
            "Abstract": "The current hierarchical structure of human cognition proposedis indicative of the multi-factorial and multi-layered construct of giftednessand intelligence. All individuals are intellectually endowed, but giftedness isperceived as an achievement in academic and practical intelligence as well as inthe manipulation of wisdom-related skills and attitudes, taking into accountnonintellective personal characteristics and contextual, sociocultural variables.Therefore, any attempt to measure intelligence should include multiple and diverseassessments comprising various psychological processes taking place in aspecific time and place. Metacognitive processes are at the top of the hierarchyof cognition as their significance for one's quality of life and social progress isimmense and their existence signals for a successful person. Moreover, metacognitionrequires handling for a confluence of knowledge, feelings and skillsin a …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network coding-based medium access control protocol for cooperative wireless networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6364119/",
            "Abstract": "In this paper we introduce a novel Medium Access Control (MAC) protocol for Automatic Repeat reQuest-based (ARQ-based) cooperative wireless networks. Our protocol coordinates the channel access among a set of relays that use network coding techniques to minimize the number of total transmissions, thus enhancing the performance of the network in terms of Quality of Service (QoS) metrics. The proposed solution is compared to other cooperative schemes, while analytical and simulation results are provided to evaluate our protocol.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile Applications to Improve Emotional Intelligence in Autism-A Review.",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Athanasios-Drigas/publication/328590656_Mobile_Applications_to_Improve_Emotional_Intelligence_in_Autism_-_A_Review/links/5bd8425ca6fdcc3a8db13a9c/Mobile-Applications-to-Improve-Emotional-Intelligence-in-Autism-A-Review.pdf",
            "Abstract": "The ability to understand and regulate emotions in ourselves and others is essential for the healthy development of all human beings. It helps people comprehend themselves and other people, it guides response and decision making and enhances the capacity to develop social relationships. People with Autistic Spectrum Disorders have deficiencies in Emotional Intelligence skills and that leads to difficulties in understanding themselves and the people in their social environments in relation to emotions, feelings and thoughts. The usability of mobile applications developed for children and adolescents with ASD is important because it gives the opportunity to practice in an accessible and creative way to enhance their emotional intelligence. The current article aims to carry out a systematic review of mobile applications on improving emotional intelligence in children and adolescents with Autistic Spectrum Disorders.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards adaptive security for convergent wireless sensor networks in beyond 3G environments",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.678",
            "Abstract": "The integration of wireless sensor networks with different network systems gives rise to many research challenges to ensure security, privacy and trust in the overall architecture. The main contribution of this paper is a generic security, privacy and trust framework providing context‐aware adaptability, flexibility and scalability which allows customisation of wireless sensor networks to a diverse set of application spaces. Suitable protocols and mechanisms are identified, which when combined according to the framework form a complete toolbox solution which fits the architecture of Beyond 3G environments. Performance evaluation results demonstrate the feasibility and estimate the benefits of the security framework for a variety of scenarios. Copyright © 2008 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:4TOpqqG69KYC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Trust establishment in ad hoc and sensor networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11962977_15",
            "Abstract": "Ad hoc and sensor networks highly depend on the distributed cooperation among network nodes. Trust establishment frameworks provide the means for representing, evaluating, maintaining and distributing trust within the network, and serve as the basis for higher level security services. This paper provides a state-of-the-art review of trust establishment frameworks for ad hoc and sensor networks. Certain types of frameworks are identified, such as behavior-based and certificate-based, according to their scope, purpose and admissible types of evidence. Moreover, hierarchical and distributed frameworks are discussed, based on the type of ad hoc and sensor networks they are designed for. The review is complemented by a comparative study built both on criteria specific to each category and on common criteria, grouped into three distinct classes: supported trust characteristics, complexity and requirements …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Virtual and augmented reality effects on K-12, higher and tertiary education students’ twenty-first century skills",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10055-018-0363-2",
            "Abstract": "The purpose of this review article is to present state-of-the-art approaches and examples of virtual reality/augmented reality (VR/AR) systems, applications and experiences which improve student learning and the generalization of skills to the real world. Thus, we provide a brief, representative and non-exhaustive review of the current research studies, in order to examine the effects, as well as the impact of VR/AR technologies on K-12, higher and tertiary education students’ twenty-first century skills and their overall learning. According to the literature, there are promising results indicating that VR/AR environments improve learning outcomes and present numerous advantages of investing time and financial resources in K-12, higher and tertiary educational settings. Technological tools such as VR/AR improve digital-age literacy, creative thinking, communication, collaboration and problem solving ability …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:PELIpwtuRlgC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Angle-based time fingerprint positioning technique for indoor UWB systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7249310/",
            "Abstract": "The knowledge of direction information of the transmitted signals requires angle-based position estimation techniques, as well as the orientation of the individual nodes of the system. When using omnidirectional antennas, this information is difficult to be calculated in order to find the Blind Node's (BLN or BN) position. Also, the combination of Ultra Wide-Band (UWB) systems with angle-based techniques is not the best option when tracking down an unknown target, especially indoors, due to the large bandwidth of the UWB signals and the huge number of paths. This paper proposes a geometrical angle-based positioning approach for UWB omnidirectional systems which also combines Fingerprint (FP) and Time-of-Flight (ToF), aiming to calculate the BN's position with the minimum positioning error. The efficiency of the proposed positioning scheme is demonstrated through simulation results in terms of error …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PASSIVE: Policy-Assessed System-Level Security of Sensitive Information Processing in Virtualised Environments",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-32287-7_25.pdf",
            "Abstract": "PASSIVE is an EU funded ICT STREP project that aims to develop a framework for the secure deployment of virtualisation technology in e-Government scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Energy efficient network coding-based MAC for cooperative ARQ wireless networks",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870512000893",
            "Abstract": "In this paper we introduce a network coding-aided energy efficient Medium Access Control (MAC) protocol that coordinates the transmissions among a set of relay nodes which act as helpers in cooperative Automatic Repeat reQuest-based (ARQ-based) wireless networks. Applying network coding techniques, we achieve to increase the energy efficiency of the network without compromising the system performance in terms of Quality of Service. Our proposed solution is evaluated by both analytical and simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:r0BpntZqJG4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A testbed environment for validation of end-to-end QoS provision for the content delivery chain over heterogeneous systems",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/37657694/P89.pdf",
            "Abstract": "The content delivery chain encompasses content creation, delivery and consumption. To support this, the content has to be identified, described, generated, delivered, managed and protected. Furthermore, content/services of different format will be distributed over heterogeneous networks and delivered on a variety of user terminals. The scarce resource of bandwidth needs to be dynamically managed and the QoS should remain within predefined limits, accepted by the end users. This will enable the provision of network and terminal resources on demand to form user communities, where the content can be created, protected and shared, always with the agreed/contracted quality, reliability and flexibility. It is therefore imperative to develop an integrated solution that is able to manage the functionality of various entities in the digital information distribution chain, from content/service generation to user terminals, using heterogeneous networks, comprised of wired (IP based core network) and wireless (DVB, WLAN, UMTS) segments, and based on the end-to-end QoS approach. The aim of this work is to propose and to build a suitable testbed environment where such a solution, namely the approach of ENTHRONE (End-to-End QoS through Integrated Management of Content, Networks and Terminals), can be tested and demonstrated. In this respect, an operational networking infrastructure is outlined which can be used as a test bed to demonstrate, in real conditions, the functionalities and the performance of ENTHRONE approach to E2E QoS provisioning.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Case study of a dimmable outdoor lighting system with intelligent management and remote control",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294730/",
            "Abstract": "The following paper introduces the experimental development of an energy-efficient, intelligent outdoor lighting management and monitoring system with remote control. The data communication system is based on wireless personal area networks that support IP technology for connecting all nodes and network entities with a sink node which is the gateway to the remote management and monitoring service. The proposed system maintains lighting at a low level until vehicle or pedestrian motion is detected by a set of proximity sensors. In this case, the level of lighting is increased in order to provide better visibility while the area is occupied and dims to a lower level when the area is clear again. At the same time, data regarding lamp parameters like status and operation dimming level are transferred to the management system via a bidirectional channel that may receive feedback based on a certain system operation …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "NETp1-08: requirements and challenges in the design of privacy-aware sensor networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4150864/",
            "Abstract": "Sensor networks are set to become a truly ubiquitous technology that will affect the lives of the people in their application environment. While providing the opportunity for sophisticated, context-aware services, at the same time sensor networks impose great privacy risks. This paper discusses privacy issues in sensor networks, by identifying the requirements for privacy preserving deployments, analysing the challenges faced when designing them, and discussing the main solutions that have been proposed.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tools and Practices for Measurement-based Network Performance Evaluation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394164/",
            "Abstract": "As networks and applications running on them become more complex, there is a need for an efficient framework supporting experimental performance evaluation based on real measurements. Towards this end, this paper presents: a) an advanced architecture for a traffic generation tool capable of producing complex traffic profiles, b) the architecture of a traffic analysis tool, and c) methods that allow for efficient monitoring and measurements of delay and loss-oriented metrics in packet networks. The effectiveness of these tools and the applicability of the measurement methodology are illustrated through experiments that evaluate the performance of vertical handovers between GPRS and WLAN networks.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Darknet traffic big-data analysis and network management for real-time automating of the malicious intent detection process by a weight agnostic neural networks framework",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2079-9292/10/7/781",
            "Abstract": "Attackers are perpetually modifying their tactics to avoid detection and frequently leverage legitimate credentials with trusted tools already deployed in a network environment, making it difficult for organizations to proactively identify critical security risks. Network traffic analysis products have emerged in response to attackers’ relentless innovation, offering organizations a realistic path forward for combatting creative attackers. Additionally, thanks to the widespread adoption of cloud computing, Device Operators (DevOps) processes, and the Internet of Things (IoT), maintaining effective network visibility has become a highly complex and overwhelming process. What makes network traffic analysis technology particularly meaningful is its ability to combine its core capabilities to deliver malicious intent detection. In this paper, we propose a novel darknet traffic analysis and network management framework to real-time automating the malicious intent detection process, using a weight agnostic neural networks architecture. It is an effective and accurate computational intelligent forensics tool for network traffic analysis, the demystification of malware traffic, and encrypted traffic identification in real time. Based on a weight agnostic neural networks (WANNs) methodology, we propose an automated searching neural net architecture strategy that can perform various tasks such as identifying zero-day attacks. By automating the malicious intent detection process from the darknet, the advanced proposed solution is reducing the skills and effort barrier that prevents many organizations from effectively protecting their most critical assets. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:UHK10RUVsp4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Traffic-aware connection admission control scheme for broadband mobile systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5683667/",
            "Abstract": "In this paper we introduce a connection admission control (CAC) mechanism for IEEE 802.16 broadband wireless access standard. Our scheme is based on the bandwidth reservation concept and has been developed considering the problem of \"busy hour\" in communications traffic variation during a typical day. The proposed solution, which is compatible to the IEEE 802.16 Standard, provides higher priority to VoIP calls compared to other types of traffic in the network. The performance of the proposed mechanism is evaluated by means of computer simulations and compared to simple traditional admission control schemes, while we provide an analytical solution as well.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vertical handover (VHO) framework for future collaborative wireless networks",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/nem.786",
            "Abstract": "The paper focuses on the concept of the vertical handover (VHO) among collaborative wireless networks, which is the necessary driver for seamless mobility and thus for the ability of the user to be always best connected. The paper discusses the required enabling architecture for distributed VHO decision making that is based on the principles of the IEEE 1900.4 standard and on the key media‐independent signaling procedure related to the IEEE 802.21 standard. The proposed framework combines the ‘lower‐layer’ and ‘higher layer’ intelligence in a unified and media‐independent way, to drive handover decisions based on rich terminal and network context information. The paper provides a detailed description of the VHO framework and of the key interactions between its key functional blocks. Additionally, the paper includes a series of validation results corresponding to an implementation of the presented …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:YFjsv_pBGBYC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Optimised network resource exploitation in interactive broadcasting environments via P2P constellations",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6167456/",
            "Abstract": "This paper proposes the utilisation of peer-to-peer (P2P) concept in interactive broadcasting environments, as an enabling technology for optimised network resource exploitation. Building upon a regenerative DVB-T platform, it presents a decentralised architecture that exploits the broadcasting stream as part of the core/backbone network, providing interactive IP services to rural/urban citizens. Towards enhancing the scalability as well as the performance of the entire network, the paper studies the realisation of IP overlays by exploiting P2P technology, and proposes a prototype configuration for optimum resource exploitation and increased Service/Bandwidth gain both at the core and access segments. Performance evaluation experiments carried-out under real transmission/reception conditions with a number of real users verified the validity of the proposed architecture, besides outlining fields for future research.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Attentional control and other executive functions.",
            "Publication year": 2017,
            "Publication url": "https://www.academia.edu/download/61455677/iJET_vol12_no03_2017_X20191208-82261-sjp7ah.pdf#page=219",
            "Abstract": "Current article aims to shed light on the reciprocal relation between attentional control and emotional regulation. More specifically, there is a verified relation between attention and cognitive, metacognitive and emotional processes, such as memory, perception, reasoning as well as inhibitory control, cognitive flexibility, self-monitoring and positive moods. In addition, positive mood has been already reciprocally related to a broad attentional scope as well as to an increased cognitive flexibility. Future research should focus on the effects of attentional control on cognitive control processes, thereby, on individuals’ emotional regulation, as a whole. Evidently, an advanced research in the relation of attentional control and emotional regulation could develop a comprehensive methodology for counterbalancing the difficulties facing individuals with ADHD, Autism Spectrum Disorder, Oppositional Defiant Disorder or even depression.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A context-aware backhaul management solution for combined H2H and M2M traffic",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6705719/",
            "Abstract": "Future Internet is expected to sustain a huge number of devices, many orders of magnitude higher than state-of-the-art network architectures and handle larger and unconventional information flows. Machine Type communications (MTC) will play a critical role in this evolution and thus both architectural and algorithmic enhancements to existing converged mobile and fixed network infrastructures are needed. In this paper, we focus on resource management issues for combined Human-to-Human (H2H) and Machine-to-Machine (M2M) traffic. The proposed Context-Aware Backhaul Management (CABM) scheme is applicable for M2M gateways, which can provide the interconnection between cellular and capillary networks both via wired and wireless backhaul alternatives. CABM scheme adopts efficient QoS provisioning procedures, by taking into consideration the diverse QoS requirements of novel MTC services …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity maximization through energy-aware multi-mode relaying",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-012-0899-5.pdf",
            "Abstract": "In future wireless mobile networks, data rate and quality of service are expected to be comparable to those of wired deployments. To achieve this target, novel architectures must be adopted, successfully countering the disadvantages of the wireless transmission. Inspired by that, cooperative relaying was proposed because of the various gains it introduces to the network. In this work we propose a scheme consisting of multi-mode decode and forward relays facilitating the communication between a base station and a user terminal (UT). By equipping the relays with two interfaces, we can exploit the plethora of the available wireless protocols. Also, instead of performing multi-relay transmissions, we adopt an opportunistic relaying scheme due to its simplicity and outage-optimality. Additionally, we incorporate successive transmissions to improve the spectral efficiency, thus recovering the half-duplex loss in …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A load and channel aware dynamic point selection algorithm for LTE-A CoMP networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551928/",
            "Abstract": "In this work, in order to exploit the benefits of the Coordinated MultiPoint Dynamic Point Selection technique (CoMP/DPS), we propose a LOad and CHannel aware (LOCH) DPS algorithm that avoids unnecessary Base Station (BS) switching and, therefore, it significantly reduces the ping-pong effect. The performance of the proposed scheme is evaluated via simulations and comparisons with another state-of-the-art DPS selection scheme, in terms of UE transitions between Transmission Points (TPs) and throughput. The results show that LOCH achieves significantly less transitions, while having the same or better throughput performance. Thus, the current work can be the base for other future works that will aim to the reduction of the CoMP signaling load, as well as to the reduction of the CoMP traffic load at the backhaul network.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis and modeling of H. 264 unconstrained VBR video traffic",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/article/analysis-modeling-264-unconstrained-vbr/37453",
            "Abstract": "In future communication networks, video is expected to represent a large portion of the total traffic, given thatespecially variable bit rate (VBR) coded video streams, are becoming increasingly popular. Consequently, traffic modeling and characterization of such video services is essential for the efficient traffic control and resource management. Besides, providing an insight of video coding mechanisms, traffic models can be used as a tool for the allocation of network resources, the design of efficient networks for streaming services and the reassurance of specific QoS characteristics to the end users. The new H. 264/AVC standard, proposed by the ITU-T Video Coding Expert Group (VCEG) and ISO/IEC Moving Pictures Expert Group (MPEG), is expected to dominate in upcoming multimedia services, due to the fact that it outperforms in many fields the previous encoded standards. This article presents both a frame and …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:p2g8aNsByqUC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Vulnerability assessment as a service for fog-centric ICT ecosystems: A healthcare use case",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s12083-019-0716-y",
            "Abstract": "Modern ICT ecosystems such as healthcare environments (hospitals, care-centers etc.), operate in different abstraction layers (cloud, fog, extreme-edge) and comprise large numbers of network entities such as terminals, devices, sensors or even specialized appliances (virtual or physical). It is common in such environments, that several network entities with intermittent connectivity, join and leave the network in an unstructured and unsupervised manner (Wi-Fi access-points, BYOD policies, IoT, etc.). Such devices of frivolous nature, or even trusted devices/terminals, are prone to security vulnerabilities, since they are operated by regular, non-expert users who are not aware of any security aspects whatsoever. To effectively manage and proactively protect such large, complex and multilayered networks, dedicated personnel (system administrators, security specialists etc.) must be employed and specialized …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:5awf1xo2G04C",
            "Publisher": "Springer US"
        },
        {
            "Title": "IP Operations and Management",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-540-87357-0.pdf",
            "Abstract": "On behalf of the IEEE Communications Society, Technical Committee on Network Operations and Management (CNOM), Manweek 2008 Organizing Committee, and members of the IPOM Technical Program Committee, it is our pleasure to present the proceedings of the 8th IEEE Workshop on IP Operations and Management (IPOM 2008), held as part of Manweek 2008 during September 22–26, 2008, on Samos, Greece.The current Internet is a large-scale distributed system whose sub-components such as addressing, protocols, algorithms, services, need to scale in time with the rapid growth of Internet traffic volumes. Moreover, there is a high level of interaction between different subcomponents of the Internet sometimes in undesired ways–for example, denial of service attacks can jeopardize the operation of a commercial network. With these challenges in place, operations and management of IP networks have …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Broadband multimedia on the move with DVB-H",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-006-0084-5",
            "Abstract": "DVB-H is the newly standardized extension to DVB-T, aiming at the provision of IP datacasting (IPDC) services to mobile terminals. This tutorial paper outlines the structure of an interactive DVB-H platform and presents in brief the technical advances of the new specification. It also discusses some interesting scenarios of interactive and non-interactive services which can be directly deployed with the use of the DVB-H technology either as a stand-alone broadcast network or as a complement to existing cellular (2G/3G/WLAN) infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Analysis of H. 264 video encoded traffic",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=t9zOAwAAQBAJ&oi=fnd&pg=PA441&dq=info:PQTfPyKrsT0J:scholar.google.com&ots=FdNlNHN1pg&sig=kViO_xUHSB3YTg_B2QZEdpN85gg",
            "Abstract": "In future wireless and wired communication networks, video is expected to represent a large portion of the total traffic, given that multimedia services, and especially variable bit rate (VBR) coded video streams, are becoming increasingly popular. Consequently, traffic modeling and characterization of such video services is very important for the efficient traffic control and resource management of complex networks. The new H. 264/AVC standard, proposed by the ITU-T Video Coding Expert Group (VCEG) and ISO/IEC Moving Pictures Expert Group (MPEG), is expected to dominate in upcoming multimedia services, due to the fact that it can achieve considerably higher coding efficiency compared to the already widely used standards. This paper presents both a frame and a layer (ie I, P and B frames) level analysis of H. 264 encoded sources. Analysis of the data suggests that the video traffic can be considered as a stationary stochastic process with an autocorrelation function of exponentially fast decay and a marginal frame size distribution of approximately Gamma form.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The impact of mobility patterns on the efficiency of data forwarding in MANETs",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7249284/",
            "Abstract": "One of the most challenging requirements in cutting-edge Mobile Ad hoc Networks is the need for adaptive and efficient routing. Networks capable of adapting their behavior based on current conditions are often characterized as self-organizing networks, which are lately considered very promising for future applications. This work examines the impact of the different mobility properties on the performance of self-organizing networks. For that purpose, a simulator was developed to model different mobility patterns and study the way they affect the effectiveness of the well-known AODV routing protocol. Particularly, this paper focuses on the effect of the different mobility schemes on network topology and consequently to the overall network performance. The results reveal the tight correlations between node mobility characteristics and network metrics.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Edge caching architecture for media delivery over P2P networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8514935/",
            "Abstract": "Peer to Peer (P2P) systems, have been identified as one of the main contributors to the exponential growth of internet traffic. File sharing applications such as BitTorrent clients, are the most popular among P2P systems and tend to consume great amounts of network resources, stretching infrastructure capabilities to their limits. This causes interdomain links to be overloaded with traffic, created from content traversing the network, which is most of the times redundant. Cloud computing has been an empowering force towards alleviating this issue and many research approaches have been proposed. With cloud orchestration frameworks and Software Defined Networks (SDN) as our empowering technologies, we propose a cross-layered edge-caching mechanism to alleviate content and service providers of link-saturation problems, caused by identical content requested and downloaded by multiple users in the same …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of single and multi-channel actor to actor communication for wireless sensor actor networks",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870505000259",
            "Abstract": "The paper discusses two distributed actor to actor communication schemes (a single channel one and a multi-channel one) for wireless sensor actor networks (WSANs). The performance of these two schemes is evaluated through analysis and simulation. The simulation results show that the whole analysis is fairly accurate. It is further proven that the multi-channel scheme has better performance than the single channel one. The key feature of the multi-channel scheme is the separation of the single hop from the multi-hop traffic.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Network coding-based cooperative ARQ scheme for VANETs",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804512000938",
            "Abstract": "In this paper we introduce a novel Network Coding-based Medium Access Control (MAC) protocol for Vehicular Ad Hoc Networks (VANETs) that use cooperative Automatic Repeat reQuest (ARQ) techniques. Our protocol coordinates the channel access among a set of relays capable of using network coding in order to minimize the number of the total transmissions, thus enhancing the performance of the network in terms of Quality of Service (QoS) metrics. The proposed solution is compared to other cooperative schemes, while analytical and simulation results are provided to evaluate our protocol.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:mB3voiENLucC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Content adaptation of IPTV services in Interactive DVB-T systems",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294699/",
            "Abstract": "This paper discusses how Content Adaptation of IPTV Services may enable decentralized Interactive DVB-T systems (IDVB-T) to optimize the utilization of their network resources, while offering End Users the higher possible QoE. The paper describes the design and overall architecture of a regenerative IDVB-T infrastructure, where content adaptation processes are performed following either a centralized or a distributed approach, setting the basis for a real time accommodation of IPTV services to the available network resources (i.e. bandwidth) and capabilities of End Users terminals (i.e. processing power, screen resolution, codec support). Validity of both Content Adaptation approaches is experimentally verified, with the initial test-results indicating similar performance.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced Media Independent Handover Procedure for Next Generation Networks",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Jose-Ribeiro-13/publication/230820005_Enhanced_Media_Independent_Handover_Procedure_for_Next_Generation_Networks/links/56f1216308aee94ad4de7a1f/Enhanced-Media-Independent-Handover-Procedure-for-Next-Generation-Networks.pdf",
            "Abstract": "Next generation networks are promising ubiquitous coverage and improved service provision to users. This is based on the abundance of available access technologies and the recent efforts on efficient interworking in heterogeneous environments. The IEEE 802.21 standard is one of these initiatives, which provides enhanced handover experience when moving among different access networks. However, current IEEE 802.21 specifications lack the definition of a handover signalling procedure that would drive to optimal handover performance. Therefore, in this paper, an enhanced media independent handover procedure is proposed that goes one step ahead by ensuring that IEEE 802.21 messages are compiled more efficiently. With the help of a simulation model, the performance of the system is evaluated for both the proposed handover sequence and the one described in the standard, while initial results verify the superiority of the proposed solution in terms of signalling load.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simulation study of a signalling protocol efficiency in a composite radio environment",
            "Publication year": 2004,
            "Publication url": "http://www.scs-europe.net/services/esm2004/pdf/hpc-02.pdf",
            "Abstract": "Key aspects of a signalling protocol governing the interactions between terminals and network entities within a composite radio environment are presented in this paper. On the basis of these aspects, simple simulation models for capturing the dynamics of the message exchanges are discussed. The simulation study allows the derivation of both qualitative and quantitative results, that provide insight on key characteristics of the environment.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue of Telecommunications Systems on security, privacy and trust for beyond-3G networks",
            "Publication year": 2007,
            "Publication url": "https://search.proquest.com/openview/d12b7d5963f7e12de1e7d1e20e9ffc32/1?pq-origsite=gscholar&cbl=45633",
            "Abstract": "It is in our days more clear than ever that the average user is a constant micro-or macro-traveller, a nomad moving around the Globe ever hungry for connectivity. To foster this need, present and future generation networks are offered as a combination of highly diversified technologies in the access, backhaul and core (eg, wireless, mobile, fixed lines) enabling provision of heterogeneous services. In certain cases to achieve interworking, popular standards (eg, IP) realise a unified environment that enables the convergence/synergy between traditional and emerging technologies offering ubiquitous services to a variety of end users. The recent advances in fixed, wireless and mobile telecommunication technologies allowed connectivity in a large variety of environments, such as at home, in business places, during travel (eg, cars, airplanes, trains, ships). Moreover, ad-hoc and sensor networks allowed infrastructure …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer Nature BV"
        },
        {
            "Title": "Unified platform for m2m virtual object interoperability",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-06704-9_23",
            "Abstract": "Sensor networks contribute to the interconnection of a large variety of devices (i.e. transducers, sensors, actuators) thus, enable monitoring and control processes. While new wireless technologies are emerging, a major issue of interoperability has to be addressed in terms of data communications, controlling and interfacing in order to confront the heterogeneity of networks and connected devices and enable end-to-end communication, as well as efficient resource management. A proposed solution to this problem is the provision of a unified service access architecture, which will support common interfaces for data communications, as well as device management and control that will be based on open standards. The concept of object virtualization and IP based networking is introduced for resolving interoperability issues. In this context, the architecture can serve applications that are in line with Machine-to …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "QoS provisioning and policy management in a broker-based CR network architecture",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6503383/",
            "Abstract": "The paper presents an infrastructure-based cognitive radio network architecture that enables for TV white spaces exploitation, QoS provisioning and policy management, under the real time secondary spectrum market policy. It describes the configuration of a spectrum broker that coordinates the radio resource management process (RRM) among LTE secondary systems as a matter of maximum possible TVWS utilisation and minimum frequency fragmentation, and also administrates the economics of such transactions towards maximum revenue following a fixed-price trading. The validity of the proposed architecture is verified via a number of tests carried under controlled experimental conditions (i.e. simulations) exploiting a decision-making algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Information Theoretic Approach for the Performance Modeling and Evaluation of Internet Traffic",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4024195/",
            "Abstract": "The information theoretic principles of Maximum Entropy (ME) and Minimum Relative Entropy (MRE) are employed, as least-biased methods of inference, towards the analysis of a Internet link carrying realistic TCP traffic, produced by a large number of connections. The analytic approximations are validated against exhaustive simulation experiments. Despite its simplicity, the methodology captures the behavior of the system under study both in the cases of finite and infinite buffers and finally suggests a more elaborate but still cost effective approach even for the analysis of networks of Internet links. This approach can easily be utilized for network management and design, capacity planning, and congestion control.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting peer-to-peer technology for network and resource management in interactive broadcasting environments",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5683893/",
            "Abstract": "This paper presents a novel DVB/IP infrastructure that exploits P2P technology for optimised resource exploitation in interactive services' provision. Building upon a prototype DVB-T regenerative platform, it presents a decentralised architecture that exploits the broadcasting stream as part of the core/backbone network, providing interactive IP services to rural/urban citizens. Users access the provided IP services via intermediate communication nodes (access network), which are responsible for managing/controlling both uplink and downlink flows. Towards enhancing the scalability as well as the performance of the entire network, the paper studies the realisation of IP overlays by exploiting P2P technology, and proposes a prototype configuration for optimum resource exploitation and increased Service/Bandwidth gain both at the core and access segments. Performance evaluation experiments carried-out under real …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hybrid lateration time-fingerprint position estimation technique for indoor UWB systems",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033264/",
            "Abstract": "This paper presents a hybrid position estimation technique that is based on the integration of Fingerprinting (FP), Time-of-flight (ToF), and Trilateration approach. When empirical channel models are used with Ultra Wideband (UWB) systems, there are plenty of challenges that must be taken into consideration due to their dependence on frequency. Thus, when the position of a Blind Node (BLN) is estimated using the aforementioned techniques and the values deriving from these models, positioning error occurs. In order to minimize the positioning error, the proposed hybrid technique, called Lateration Time-FingerPrint (LTPF), is developed. The efficiency of the proposed positioning scheme is demonstrated through simulation results in terms of error probability and comparisons with other state-of-the-art positioning schemes.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a Machine Learning Based Situational Awareness Framework for Cybersecurity: An SDN Implementation",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1424-8220/21/14/4939",
            "Abstract": "The ever-increasing number of internet-connected devices, along with the continuous evolution of cyber-attacks, in terms of volume and ingenuity, has led to a widened cyber-threat landscape, rendering infrastructures prone to malicious attacks. Towards addressing systems’ vulnerabilities and alleviating the impact of these threats, this paper presents a machine learning based situational awareness framework that detects existing and newly introduced network-enabled entities, utilizing the real-time awareness feature provided by the SDN paradigm, assesses them against known vulnerabilities, and assigns them to a connectivity-appropriate network slice. The assessed entities are continuously monitored by an ML-based IDS, which is trained with an enhanced dataset. Our endeavor aims to demonstrate that a neural network, trained with heterogeneous data stemming from the operational environment (common vulnerability enumeration IDs that correlate attacks with existing vulnerabilities), can achieve more accurate prediction rates than a conventional one, thus addressing some aspects of the situational awareness paradigm. The proposed framework was evaluated within a real-life environment and the results revealed an increase of more than 4% in the overall prediction accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:W5xh706n7nkC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A survey on buffer-aided relay selection",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7365416/",
            "Abstract": "Relays receive and retransmit signals between one or more sources and one or more destinations. Cooperative relaying is a novel technique for wireless communications that increases throughput and extends the coverage of networks. The task of relay selection serves as a building block to realize cooperative relaying. Recently, relays with buffers have been incorporated into cooperative relaying providing extra degrees of freedom in selection, thus improving various performance metrics, such as outage probability, power reduction, and throughput, at the expense of tolerating an increase in packet delay. In this survey, we review and classify various buffer-aided relay selection policies and discuss their importance through applications. The classification is mainly based on the following aspects: 1) duplexing capabilities, 2) channel state information (CSI), 3) transmission strategies, 4) relay mode, and 5 …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A spectral efficient multi-mode relaying technique",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6364835/",
            "Abstract": "Cooperative relaying with Distributed Space-Time Coding (DSTC) and cooperative Opportunistic Relaying (OR) are the two main relaying techniques that are typically employed in current wireless systems. However, OR is less complex and proven to be outage optimal compared to DSTC. Thus, in this paper we propose a Multi-Mode Relaying (MMR) technique that is based on OR and combined with the Successive Relaying (SR) technique in order to deal with the half-duplex constraint of the relay nodes. MMR, by employing Multi-Mode Decode-and-Forward (MMDF) relay nodes and incorporating two interference mitigation algorithms, not only combines the merits of OR and SR but also is able to alleviate the increased inter-relay interference caused by SR. The performance of MMR is evaluated through simulation and the results show that it is able to increase the average end-to-end capacity of the wireless path …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security and Privacy in Mobile and Wireless Networking",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=3989649099047486106&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Troubador Pub."
        },
        {
            "Title": "Emotional intelligence as an important asset for HR in organizations: Attitudes and working variables",
            "Publication year": 2019,
            "Publication url": "https://search.proquest.com/openview/d8d1e48a7ac3126d21c83439b9207173/1?pq-origsite=gscholar&cbl=4425142",
            "Abstract": "The contribution of emotional intelligence in a working environment has been studied in a good extent in the literature. The findings from empirical studies signify the importance of emotional intelligence in ensuring the good functioning of an organization. This paper aims at investigating the effect of emotional intelligence on workplaces by gathering the findings that show the positive correlations between EI, attitudes and working variables. More specifically, it presents the link between emotional intelligence and six variables, very significant for a better and more effective working environment. Furthermore, it can be a kind of help for managers and researchers to better realize the relationship between EI and the other factors, its effectiveness so to incorporate training programs in courses and in companies based on EI and empathy.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:N5tVd3kTz84C",
            "Publisher": "International Association of Online Engineering"
        },
        {
            "Title": "An NF V-powered emergency system for smart enhanced living environments",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8169872/",
            "Abstract": "The emergence of ubiquitous computing paradigms, and smart Ambient Intelligence environments, will play a crucial role, towards creating better living environments for activity-challenged individuals, such as disabled, or elderly people that require constant care. In addition, cloud computing has been an empowering force for that endeavour. In this paper, we propose a virtualized Cloud-based Ambient Assisted Living (AAL) system that enables caretakers and first responders to constantly monitor a patient's indoor/outdoor position and be notified in case of emergency. Positioning is made possible through an embedded device (carried by the patient) that performs proximity estimation (Wi-Fi) and cell identification(Cellular). The geolocation data are sent to a VNF (Virtual Network Function) for further processing and assessment. In case the patient drifts away from his/her premises, the VNF retrieves the closest-to-the …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "UbiXML: programmable management of ubiquitous computing resources",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/nem.649",
            "Abstract": "XML technologies provide proven benefits for the configuration management of complex heterogeneous multi‐vendor networks. These benefits have been recently manifested in numerous research, industrial and standardization efforts, including the XMLNET architecture. In this paper we present UbiXML, a system for programmable management of ubiquitous computing resources. UbiXML extends the benefits of XML technologies in the broader class of ubiquitous computing environments, which are inherently complex distributed heterogeneous and multi‐vendor. In UbiXML management applications are structured as XML documents that incorporate programming constructs. Thus, UbiXML allows administrators to build sophisticated management applications with little or no programming effort. While UbiXML builds on several XMLNET concepts, it significantly augments XMLNET to handle management of …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:YOwf2qJgpHMC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Optimized network coding efficiency under QoS constraints in two-way relay networks with timeouts",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7249304/",
            "Abstract": "The paper considers a two-way relay network with network coding capabilities and an additional mechanism based on timeouts, used to ensure stability and bound the mean delay experienced by packets through the relay. Modeling of this system leads to simple closed form expressions that illustrate clearly the impact of the timeout parameters on the performance and efficiency metrics associated with the network coding operation. These results are subsequently employed for optimally tuning the timeout parameters, towards achieving the greatest network coding efficiency (and the corresponding throughput and energy efficiency improvement) that is possible for the given traffic profile, subject to a delay-related QoS requirement. Again, simple closed form results are obtained that support intuition and provide additional insight on the involved tradeoffs.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Policy based management for security in cloud computing",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22365-5_16",
            "Abstract": "Cloud computing is one of the biggest trends in information technology, with individuals, companies and even governments moving towards their use to save costs and increase flexibility. Cloud infrastructures are typically based on virtualised environments, to allow physical infrastructure to be shared by multiple end users. These infrastructures can be very large and complex, with many end users, making their configuration difficult, error-prone and time-consuming. At the same time, the fact that diverse end users share the same physical infrastructure raises security concerns, and can lead to a significant impact from misconfiguration or being slow to react to attacks. In this paper, we focus on the use of Policy Based Management techniques to manage cloud infrastructure, identifying the requirements, surveying the state-of-the-art, identifying the challenges and proposing potential solutions.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Introducing automated procedures in 3G network planning and optimization",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121213000307",
            "Abstract": "Third generation (3G) networks have been launched for quite some time and cellular operators have already started to face the challenges when operating such kind of networks, compared to their 2G predecessors. In this paper, we give an overview of the network planning and optimization processes in 3G networks. Emphasis is given on the interdependence between coverage and capacity, which increases the complexity of operating 3G networks in a cost effective and quality assuring manner. We stretch out the importance of introducing automated procedures in these challenging tasks and describe main inputs and outputs of these procedures, such as initial network configuration and constraints, drive test data, and key performance indicators statistics and goals. We use two case studies from a operational 3G system to indicate the improvements on the network when these automated procedures are employed.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:rO6llkc54NcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Interactions between intelligent multimodal terminals and a network management system in a B3G context",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.334",
            "Abstract": "This work addresses aspects relevant to the optimal joint exploitation of heterogeneous wireless networks in an ‘all‐IP’ integrated infrastructure, frequently called ‘Beyond 3G Systems’ (B3G) or composite radio networks. After briefly reviewing general architectural aspects pertaining to such systems, the paper focuses to the management functionality possessed by B3G systems and highlights the benefits that stem from sharing intelligence among the hybrid network (through a network management system) and the multimodal wireless terminals. In particular, the paper discusses an appropriate signaling protocol for the exchange of information between management modules at the network and the wireless terminal, investigates associated performance aspects and correlates the relevant findings with measurement results obtained from experiments over a prototype B3G network testbed. Copyright © 2005 John …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:d1gkVwhDpl0C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Context-aware security management for wireless sensor networks",
            "Publication year": 2007,
            "Publication url": "https://vbn.aau.dk/en/publications/context-aware-security-management-for-wireless-sensor-networks",
            "Abstract": "CONTEXT-AWARE SECURITY MANAGEMENT FOR WIRELESS SENSOR NETWORKS — \nAalborg University's Research Portal Skip to main navigation Skip to search Skip to main content \nAalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications \nActivities Research Units Facilities Press / Media Prizes Datasets Impacts Search by \nkeywords, name or affiliation CONTEXT-AWARE SECURITY MANAGEMENT FOR WIRELESS \nSENSOR NETWORKS Efthimia Aivaloglou, Anelia Mitseva, Charalabos Skianis, Adrian \nWaller, Neeli R. Prasad, Stefanos Gritzalis Department of Electronic Systems Research output: \nContribution to conference without publisher/journal › Poster › Research Overview Original \nlanguage English Publication date 2007 Publication status Published - 2007 Event Workshop \non Context Awareness for Proactive Systems (CAPS 2007) - Guildford, United Kingdom : 18 : ('…",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Service-driven inter-domain QoS monitoring system for large-scale IP and DVB networks",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014036640500277X",
            "Abstract": "There is a growing synergy between well-established Service Providers (SP), Content Providers (CP), and Network Providers (NP), to propose new value-added services, and hence opening new markets to generate further revenues. Meanwhile, the explosive increasing amount of multimedia content to be offered in the Internet and the heterogeneity of the underlying networking technologies demand the provision of new QoS-enabled mechanisms and architecture to efficiently control, manage and monitor the networks. Quality of service monitoring is becoming crucial to SPs for providing quantified QoS-based services and service assurance and to NPs for managing network resources. This paper proposes a framework for large scale inter-domain QoS monitoring in heterogeneous networks including IP and DVB networks that has been developed in the IST-ENTHRONE project of European Commission. One of …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Distributed joint relay-pair selection for buffer-aided successive opportunistic relaying",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6708114/",
            "Abstract": "In this work, we propose a buffer-aided successive opportunistic relay scheme where each time a relay-pair is selected with the target of rate maximization. Due to overlapping transmissions by the source and the relay which transmits to the destination, inter-relay interference arises. The efficient mitigation of inter-relay interference either through cancellation or avoidance, requires increased channel state information. Thus, in order to reduce the implementation complexity induced by centralized selection, distributed switch-and-stay combining is combined with buffer-aided successive opportunistic relaying. In this way, by applying a rate threshold we can avoid increased relay-pair switching and channel state information acquisition. The efficiency of the proposed scheme is demonstrated through simulations and comparisons with other state-of-the-art relay selection policies.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "End-to-end QoS issues of MPEG-4 FGS video streaming traffic delivery in an IP/DVB/UMTS network",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221707006777",
            "Abstract": "The paper addresses the end-to-end QoS problem of MPEG-4 FGS video streaming traffic delivery over a heterogeneous IP/DVB/UMTS network. It proposes and validates an architecture that explores the joint use of packet prioritization and scalable video coding together with the appropriate mapping of UMTS traffic classes to the DiffServ traffic classes. A set of experimental scenarios, involving eight different video sequences, demonstrates the quality gains of both scalable video coding and prioritized packetization.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:Zph67rFs4hoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "An integrated approach to neuro-development, neuroplasticity and cognitive improvement",
            "Publication year": 2018,
            "Publication url": "https://www.academia.edu/download/62452988/9034-30123-1-PB20200323-70776-1hv031p.pdf",
            "Abstract": "Plasticity is a basic process that underlies neural and cognitive functioning, unraveling thus the former’s pervasive role in development and learning. Plasticity processes operate in both normal development and in the development following early injury. However, as the neural system matures, there is a gradual commitment of neural resources to, maturationally defined functions and a concomitant loss in flexibility and in the capacity of the system to reorganize. Brain plasticity has been intertwined with induced reorganization of local patterns of connectivity in the neural system, whose specification and stabilization relies on dynamic processes that are the product of the multidirectional interaction of genetic processes, contingencies of input and the demands of the learning environment. Moreover, bioenergetic challengesexercise, diet and activity in neuronal circuits-synaptic plasticity and neurogenesis, are innately connected to cognitive function, such as learning, memory, attention, emotion regulation and human behavior.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurement and statistical analysis of asymmetric multipoint videoconference traffic in IP networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1023620903222",
            "Abstract": "The paper contributes results on the modeling of videoconferencing traffic over IP networks. The study is based on extensive data, gathered by tracing the actual packet exchange during a comprehensive set of realistic teleconferencing sessions over an asymmetric platform, in which commercial H.261-compliant terminal clients were communicating through a Multipoint Control Unit (MCU) at ‘continuous presence’ mode. Analysis of the data suggests that the video traffic from the client terminals can always be represented at the frame level as a stationary stochastic process with an autocorrelation function of exponentially fast decay and a marginal frame size distribution of approximately Gamma form. The video traffic from the MCU to the clients is again stationary and with exponentially decaying correlations, while the corresponding marginal frame-size PDF has the form of an appropriately weighted sum of …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:qjMakFHDy7sC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Guest Editorial: Editorial for the special issue on synergy of telecommunication and broadcasting networks",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.comnet.2007.09.009",
            "Abstract": "Guest Editorial: Editorial for the special issue on synergy of telecommunication and broadcasting \nnetworks: Computer Networks: The International Journal of Computer and Telecommunications \nNetworking: Vol 52, No 1 ACM Digital Library home ACM home Google, Inc. (search) Advanced \nSearch Browse About Sign in Register Advanced Search Journals Magazines Proceedings \nBooks SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced \nSearch Computer Networks: The International Journal of Computer and Telecommunications \nNetworking Periodical Home Latest Issue Archive Authors Affiliations Award Winners More \nHomeBrowse by TitlePeriodicalsComputer Networks: The International Journal of Computer \nand Telecommunications NetworkingVol. , No. Guest Editorial: Editorial for the special \nissue on synergy of telecommunication and broadcasting networks article Guest : for on …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:35N4QoGY0k4C",
            "Publisher": "Elsevier North-Holland, Inc."
        },
        {
            "Title": "An information theoretic approach for systems with parallel distributions: Case studying Internet traffic",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11753810_62",
            "Abstract": "The principle of Minimum Relative Entropy (MRE) is applied to characterize a ‘proportionality’ relationship between the state probabilities of infinite and finite capacity queues at equilibrium and thus, establish an information theoretic interpretation for the exact global balance solution of some finite capacity queues with or without correlated arrival processes. This result serves to establish the utility of the MRE inference technique and encourage its applicability to the analysis of more complex, and thus more realistic, queuing systems. The principles of Maximum Entropy (ME) and MRE are then employed, as least-biased methods of inference, towards the analysis of a Internet link carrying realistic TCP traffic, that exhibit this ‘proportionality’ relationship between a finite and infinite buffer system, as produced by a large number of connections. The analytic approximations are validated against exhaustive …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "IMS-enabled interactive broadcasting network utilizing peer to peer constellations",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294703/",
            "Abstract": "This paper propose an overlay interoperability technology for introducing the concept of Peer to peer (P2P) communications in the context of IP Multimedia Subsystem (IMS) enabled interactive broadcasting networks (iDVB-T), bearing the following: a) user initiated conception of communication applications paradigms and deployment, b) access of users on P2P applications from any rural-access network, and c) creation of a new ecosystem of users, emerging different behaviour from the traditional consumers, gearing-up new business and revenue prospects. The overall assessment of the proposed P2P-IMS architecture is evaluated by Real transmission reception experiments justifying the interoperability and validity of the iDVB-T environment proposed.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoS performance in spatial cognitive systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5686974/",
            "Abstract": "Multiple Input Multiple Output (MIMO) delivers service simultaneously to more than one user which adds a new dimension, the spatial one, to be optimized in Cognitive Radio (CR). In this paper, statistical optimization techniques are carried out to assess the system performance where each type of users has different Quality of Service (QoS) demands. Closed form expressions are derived for different scenarios and are obtained regarding two QoS indicators: minimum guaranteed rate and maximum allowed scheduling delay. The primary users and secondary users performance within such scenarios are mathematically formulated and compared their results to simulations.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed point coordination function for IEEE 802.11 wireless ad hoc networks",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870511001958",
            "Abstract": "The Distributed Point Coordination Function (DPCF) is presented in this paper as a novel Medium Access Control Protocol (MAC) for wireless ad hoc networks. DPCF extends the operation of the Point Coordination Function (PCF) defined in the IEEE 802.11 Standard to operate over wireless networks without infrastructure. In PCF, a central point coordinator polls the users to get access to the channel and data collisions are completely avoided, thus yielding high performance. In order to extend its high performance to networks without infrastructure, the DPCF is proposed in this paper as a combination of the Distributed Coordination Function (DCF) and the PCF. The general idea is to combine a dynamic, temporary, and spontaneous clustering mechanism based on DCF with the execution of PCF within each cluster. The backwards compatibility of DPCF with legacy 802.11 networks is also assessed in this paper …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An accurate model for energy efficiency in IEEE 802.11 WLANs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033271/",
            "Abstract": "A critical restriction in using mobile electronic devices is the limited battery autonomy. This paper focuses on the energy efficiency of IEEE 802.11 network interface. It proposes an energy consumption model that reflects accurately the back off window dynamics under saturation conditions. In addition, all power state levels used by the IEEE 802.11 standard are considered in the analysis. Numerical and simulation results demonstrate that the proposed IEEE 802.11 energy model is more accurate than previous approaches, and it overcomes the modeling limitations of previous works which are becoming more significant in newer versions of IEEE 802.11 standard. Finally, by providing a clearer insight into the backoff factors, the proposed model lends itself to the use of arbitrary (generic) backoff window schemes, allowing the comparison of the energy efficiency of various alternatives for the backoff window growth.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of a distributed queuing medium access control protocol for cooperative ARQ",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5683302/",
            "Abstract": "In this paper we analyze the performance of a distributed queuing medium access control (MAC) protocol designed to execute cooperative ARQ (C-ARQ) schemes at the MAC layer. Due to the broadcast nature of the wireless channel, a user that receives a data packet with unrecoverable errors can request retransmission from any of the other users in the transmission range of the transmitter that overheard the original transmission. These users can act as spontaneous relays and provide the communication with cooperative diversity gains. Upon retransmission request, the relays have to contend for the access to the channel. The DQCOOP protocol has been proposed in the literature as a high-performance MAC protocol for this kind of scenario. In this paper we theoretically evaluate its performance. The analytical results are supported by computer-based simulation that show the accuracy of the analysis.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identifying Personalization Patterns using Intelligent Techniques in XML-based communication records",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5381701/",
            "Abstract": "This position paper presents some techniques for revealing personalization and users' calling behavioral patterns by using XML-based communication records from simulations. A short description of the most common methods applied is provided, along with a case study for potential application employing real telecommunication call detail records (CDRs). Finally, we describe an intelligent architecture which is embedded in mechanisms for performing seamless media independent handover in communications, while some first results are presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Relay selection for secure 5G green communications",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-014-9890-7",
            "Abstract": "In this article, we present relay selection policies in applications with secrecy requirements which are of interest in the fifth generation (5G) of wireless networks. More specifically, we provide a classification of relays based on their distinct communication attributes, such as processing, multiple antennas, storage, channel estimation, density and security level. In addition, we discuss the level of efficiency exhibited by each relay class, regarding their impact in delay-critical applications and green communications applications, while aiming at a specific security level at the physical layer. Then, relay selection policies are proposed taking into consideration the goals set by each application. Numerical evaluation of the proposed policies in terms of the average secrecy rate, average delay and power reduction show improved performance compared to other state-of-the-art solutions.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:XiSMed-E-HIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Mpeg-4 fgs video streaming traffic delivery experimentation in an ip/dvb network",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288778/",
            "Abstract": "The paper targets to demonstrate through a set of experimental studies that the common operation of IP DiffServ and DVB bandwidth management (BM) mechanisms can offer quality gains for prioritized MPEG-4 FGS media delivery across an heterogeneous IP/DVB setting. The experimental studies refer to the delivery of eight YUV QCIF 4:2:0 different video sequences across a heterogeneous IP/DVB testbed that includes two IP autonomous systems interconnected through a DVB MPEG-2 autonomous system acting as a trunk network.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed NQoS provision in interactive DVB-T systems",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6364091/",
            "Abstract": "This paper discusses a Distributed Network Quality of Service (NQoS) provision approach in decentralized interactive DVB-T systems (IDVB-T), enabling for scalable and fault tolerant operation. The paper describes the design and overall architecture of a regenerative IDVB-T infrastructure, where network resource allocation and service classification processes are performed at local level within each intermediate distribution node (Cell Main Node CMN), setting the basis for a CMN-to-CMN NQoS provision. Validity of the proposed approach is experimentally verified, and the test-results are compared against the aggregated and federated NQoS provision approaches, indicating similar performance but better scalability and fault-tolerant design.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radio versus backhaul bottlenecks: an integrated quality of service provisioning approach for small cell gateways",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.2541",
            "Abstract": "Small cell traffic is expected to experience a continuous increase during the upcoming years, and thus, backhauling challenges should be timely addressed. Regardless the fact that radio resource management continues to be a major research problem in coexisting heterogeneous wireless networks, a mentality shift is observed in the research community towards dealing with wired backhaul bottleneck situations, too. Hence, specific small cell network deployments such as the one considered in this paper have to adopt an integrated quality of service provisioning approach. A femtocell utilizing an existing internet protocol (IP) infrastructure has usually to share the backhaul capacity with several IP networks. As these networks do not provide an efficient admission control process, the capacity allocated to the femtocell can fluctuate unpredictably over time. As a remedy, we propose a scheme for small cells' efficient …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Communication Networks Standards for Smart Grid Infrastructures",
            "Publication year": 2021,
            "Publication url": "https://www.preprints.org/manuscript/202106.0510",
            "Abstract": "The upgrade of energy infrastructure to those of smart grids, necessarily goes through the provision of integrated technological solutions that ensure the interoperability of their business capabilities and reduce the risk of devaluation of the systems used. The heterogeneity of the infrastructures and the dynamics of their operating environment, requires the continuous reduction of the complexity, the faster execution of the processes and the easy addition of innovative counterparts. Also, the integrated management of the overall ecosystem demands the provision of end-to-end interconnection, quality assurance, the definition of strict security policies, collaborative integration and correlation of events. In this respect, every design detail can be critical to the success or failure of a costly and ambitious project, such as that of smart energy networks. This work presents communication operating standards specific to the smart electricity networks applications, which should be taken into account in the process of planning and implementation of new infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:uLbwQdceFCQC",
            "Publisher": "Preprints"
        },
        {
            "Title": "On the effectiveness of DVB-T for the support of IP-based services in heterogeneous wireless networks",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128604002798",
            "Abstract": "Heterogeneous radio networks employ multiple different wireless access technologies, which act jointly towards providing enhanced network access and service provision, as well as exhibiting an increased potential in terms of: network coverage/availability, QoS guarantees, delivery cost and compliance with users’ requirements. Such an environment can prove considerably beneficial for network and service providers, as well as the end (mobile) user. Taking into account that the need for broadband wireless access becomes all the more intense, especially in relation to multimedia services (e.g., video streaming), DVB-T (the terrestrial specification of the DVB family) appears as an attractive access technology to be investigated in the heterogeneous wireless context. In this direction, the paper employs a prototype heterogeneous radio platform where DVB-T acts as an alternative access network and plays a key …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Single-point model of MIMO-UWB indoor systems using time-reversal transmission",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7996470/",
            "Abstract": "Nowadays, various techniques and systems have been proposed for the implementation of wireless indoor localization systems. Recently, significant focus has been given to Multiple Input-Multiple Output (MIMO) implementations of Ultra-Wideband (UWB) systems, in order to enhance the localization precision while introducing high communication performance. The main disadvantages of such approaches are the high deployment cost and computational complexity, due to the increased data processing. These facts are compensated by adopting the Time Reversal (TR) transmission scheme, providing scaling capabilities and Spatial Focusing (SF) to the system, at the same time. In this paper, a 2 × 2 Multi-Antenna Time-Reversal Indoor Positioning (MATRIP) system model is proposed to track the mobile Blind Node (BN) in a harsh indoor environment, measuring its time-range from one fixed-position Anchor Node …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint radio resource management in cognitive networks: TV white spaces exploitation paradigm",
            "Publication year": 2013,
            "Publication url": "https://www.igi-global.com/chapter/joint-radio-resource-management-cognitive/77684",
            "Abstract": "In this chapter, Joint Radio Resource Management (JRRM) issues in cognitive networks are discussed presenting the TV White Spaces (TVWS) spectrum exploitation use case. TVWS are portions of UHF spectrum, which will be released and interleaved according to the geographical region due to the gradual switch-off of analogue TV and the adoption of digital TV. With the availability of TVWS and their temporary lease, traditional network planning and RRM design rationale points need to be enhanced. This chapter provides state-of-the-art work for existing cognitive radio network architectures, while a reference architecture for commons and secondary TVWS trading is proposed. Subsequently, JRRM concepts for heterogeneous Radio Access Technologies’ extension over TVWS aiming to continuously guarantee the QoS, the network key performance indicators, and at the same time targeting the overall highest …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:u_35RYKgDlwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Dynamic Knowledge-Based Analysis in Nonsecure 5G Green Environments Using Contextual Data",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7293607/",
            "Abstract": "The growing number of parameters in heterogeneous networks, as is the case of the fifth-generation (5G) Green networks, greatly complicates the analysis of the Security and Quality-of-Service Tradeoff (SQT). However, studying these types of relationships is crucial in Future Internet scenarios to prevent potential points of failure and to enhance the use of limited resources, increasing the user's experience. Therefore, it is fundamental to provide tools and models for training, so that the users understand these dependencies and solve them prior to deploying new solutions. In this paper, a Recommendation System for SQT (SQT-RS) is deployed in 5G Green systems, considering the particular case of relay networks and the impact of eavesdropping and jamming contexts on the models generated by the user, aided by SQT-RS. With this goal in mind, we provide a component for the user to automatically select specific …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-aware clustering of CoMP-DPS transmission points",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366418307928",
            "Abstract": "The main idea behind CoMP operation is to efficiently coordinate multiple transmission points to provide better transmission quality and QoS, while improving spectral efficiency. This concept can be extended to the heterogeneous networking environment of 5G systems and is expected to be one of the key technologies of the future. In this work, we focus on the CoMP transmission with Dynamic Point Selection (DPS) due to its low complexity and the gains it can offer to the reduction of the size of the clusters and to the network’s power consumption. Therefore, in this paper, we present an Energy-Aware Clustering (EnAC) scheme to be utilized with CoMP-DPS in LTE-A. The goal of the proposed scheme is to reduce, as much as possible, the power consumption at each BS of a cluster without compromising the CoMP operation. In other words, we incorporate energy-related parameters into the CoMP clustering …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "End-to-End QoS Provisioning Advances",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.comcom.2005.07.013",
            "Abstract": "Editorial: End-to-End QoS Provisioning Advances: Computer Communications: Vol 29, No 6 \nACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse \nAbout Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs \nConferences People More Search ACM Digital Library SearchSearch Advanced Search \nComputer Communications Periodical Home Latest Issue Archive Authors Affiliations Award \nWinners More HomeBrowse by TitlePeriodicalsComputer CommunicationsVol. , No. \nEditorial: End-to-End QoS Provisioning Advances article Editorial: End-to-End QoS \nProvisioning Advances Share on Author: Charalabos Skianis Institute of Informatics and \nTelecommunications, National Centre for Scientific Research 'Demokritos', 15310 Aghia \nParaskevi Attikis, PO Box 60228, Athens, Greece Institute of Informatics and \nTelecommunications, National Centre for Scientific '', , , , …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "A user-oriented, customizable infrastructure sharing approach for hybrid cloud computing environments",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6133173/",
            "Abstract": "It is widely accepted that cloud computing technologies will soon have substantial impact on a broad range of industrial and institutional sectors such as governance, health care, education, agriculture, logistics, manufacturing, media etc. Cloud infrastructures are typically based on virtualized environments to allow physical infrastructure to be shared by multiple and diverse end users. However, the efficient sharing of a cloud infrastructure can be performed only through user-centered service admission control procedure, which should also be flexible enough to adapt to the various real market cloud deployment scenarios. Several conflicting parameters such as the type of the hybrid cloud infrastructure being deployed, multiple user priority groups, security, energy efficiency and financial costs should also be taken into account. Thus, aiming to deal with all these emerging resource management trade-off problems, we …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated NAN architecture for smart energy grid",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8398753/",
            "Abstract": "The Legacy Energy Grid that has being serving the needs for electricity, nowadays is considered obsolete. Issues such as electric outages, its centralized architecture, the limited use of communications and computer systems cause the immediate need for upgrade. The advanced successor is the Smart Energy Grid which has as main characteristics a distributed architecture exploiting communication technologies, networking and computer infrastructure which are ubiquitous and bidirectional to provide robust coverage to power systems modules, thus achieving integration of energy and communication systems. Focusing on these issues, this paper proposes an architecture for Smart Grid Neighborhood Area Networks (SG NANs). The developed communication system is characterized by heterogeneity incorporating Ethernet bus network (IEEE 802.3) adopting Carrier Sense Multiple Access with Collision Avoidance …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service management enhancements to IMS architecture",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/nem.669",
            "Abstract": "Originally defined by the Third Generation Partnership Project (3GPP) as part of its standardization work for 3G mobile phone systems, the IMS model has been adopted as a baseline technology for network and service convergence by network (wireless, wireline and cable), service and content operators. Dealing with the same business actors, the ENTHRONE project (FP6‐IP‐507637) builds an MPEG‐21‐based service management system that enables distribution of audio‐visual content with dynamic end‐to‐end QoS guarantees over heterogeneous networks to various types of terminal devices. This system controls the access of users to the content and supervises the delivery of the content to ensure the level of QoS. The paper examines how the IMS model could be extended to include service management features offered by the ENTHRONE management system. These features could constitute a potential …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:bEWYMUwI8FkC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Multi-scenario based call admission control for coexisting heterogeneous wireless technologies",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4698056/",
            "Abstract": "It is widely recognized that next generation wireless networks will integrate heterogeneous wireless technologies. Nowadays, the borders among the different wireless network technologies are quickly disappearing. UMTS and WLAN, a popular and representative interworking paradigm, provides a plethora of multimedia services to mobile users with multimode access capability. In this paper, we propose an effective call admission control (CAC) scheme which is based on a multi- threshold bandwidth reservation scheme. Our primary goal is not to develop the optimum CAC algorithm; we want to investigate all the real future market parameters, so that the CAC mechanisms will be flexible enough to face all the possible upcoming scenarios in the next wireless generation era.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Architectures and tools enabling seamless mobility in future collaborative networks",
            "Publication year": 2012,
            "Publication url": "https://repositorium.sdum.uminho.pt/handle/1822/17743",
            "Abstract": "This paper focuses on the concept of the seamless mobility (provided by vertical handover mechanisms) in heterogeneous Future Internet Networks in the context of the HURRICANE project. We discuss future open collaborative network architectures and propose a set of entities that ensure seamless mobility and service continuity, from infrastructural/operational and business standpoints: an 802.21-like implementation of vertical handover, supported by an innovative business modelling software package, which replaces the traditional operations support stack with a more dynamic, marketplace-oriented system. We also discuss, an approach to distributed, policy-based, vertical handover management and a model for such policies, based on the monitorization and analysis of Call Detail Records that reveals users’ behavioural patterns and allows personalization.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Springer Verlag"
        },
        {
            "Title": "Enhancing the high speed downlink packet access operation of 3G WCDMA systems",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.1239",
            "Abstract": "In high‐speed downlink packet access (HSDPA), the combination of adaptive modulation and coding, hybrid automatic repeat request, and an extended multicode operation has replaced two fundamental aspects of wideband code division multiple access systems, namely, variable spreading factor and fast power control. Despite its enhanced characteristics, the HSDPA operation can be problematic when the majority of incoming traffic load consists of low data rate delay‐sensitive services such as mobile voice‐over‐Internet Protocol. To tackle this case, we propose an enhanced HSDPA operation that exploits multiple layers of the channelization code tree through a specifically designed packet scheduling and code allocation process. Enhanced HSDPA, when compared with the conventional HSDPA, provides a more flexible sharing of the available capacity and is able to increase the number of users that can be …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimized admission control scheme for coexisting femtocell, wireless and wireline networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-013-9703-4",
            "Abstract": "The most important challenge for the implementation of the Future Internet is to make the heterogeneity of access technologies transparent to the end user. Compared to the general case where the interworking networks are independent, the case of femtocells interworking with pre-existing wireless networks poses more challenges due to the sharing of the same backhaul capacity. Therefore, while a user is practically able to initiate the same service through multiple network interfaces, he is allocated capacity from the same capacity pool. However, while the femtocell inherits the QoS mechanisms of cellular networks and is able to provide a reliable CAC, this does not apply to the IP-based networks and that may drastically affect the performance of the femtocell. Hence, we propose an integrated Dynamic Service Admission Control (DSAC) framework for coexisting femtocell, wireless and wireline network …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A cooperation framework for LTE femtocells' efficient integration in cellular infrastructures based on femto relay concept",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6335358/",
            "Abstract": "The fast emerging technology of femtocells, through the utilization of existing IP infrastructures, promises to improve critical performance indicators in cellular networks, such as coverage and capacity, with minimum cost. However, the random placement of femtocells contrary to the structured deployment of the current cellular network raises challenges for interference management. In this context, we propose a Cooperation Framework for LTE Femtocells' Efficient Integration (COF-FEI) in cellular infrastructures in order to: 1) reduce interference in the forward link of femtocells caused by the macrocell Base Station (BS) and, 2) improve the Signal-to-Interference plus Noise ratio (SINR) of macrocell users located in the vicinity of femtocells. COF-FEI introduces a novel merging of relaying and femtocells (i.e. femto-relays) and sets the base for an efficient cooperation between macro BS and femtocells through wireless …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile Lightweight Wireless Systems: First International ICST Conference, MOBILIGHT 2009, Athens, Greece, May 18-20, 2009, Revised Selected Papers",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=HM9YF7TWetQC&oi=fnd&pg=PP2&dq=info:plW1Pe5qTjUJ:scholar.google.com&ots=pFx1UOPz6q&sig=_bcI9aNx4beFcmISneDVc-rAy8Q",
            "Abstract": "The First International Conference on Mobile Lightweight Systems (MOBILIGHT) was held in Athens during May 18–20, 2009. The decision to organize a scientific event on wireless communications, where competition is really enormous, was motivated by discussions with some colleagues about the current unprecedented request for lightweight, wireless communication devices with high usability and performance able to support added-value services in a highly mobile environment. Such devices follow the user everywhere he/she goes (at work, at home, while travelling, in a classroom, etc.), but also result in exciting-search, development and business opportunities. Such a scenario clearly demands significant upgrades to the existing communi-tion paradigm in terms of infrastructure, devices and services to support the anytime, anywhere, any device philosophy, introducing novel and fast-evolving requirements and expectations on research and development in the field of information and com-nication technologies. The core issue is to support the desire of wireless users to have 24/7 network availability and transparent access to\" their own\" services.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Exploiting Digital Switchover for Broadband Services Access in Rural Areas.",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.634.8066&rep=rep1&type=pdf",
            "Abstract": "The paper discuses how the imminent transition to the digital terrestrial television in UHF (Digital Switchover) could be employed towards enabling always-on connectivity and triple-play services access even from rural and dispersed locations, ie in areas where no termination/connection exists between the local PSTN exchanger and the optical fibre core backbone. Exploiting the European digital video broadcasting standard in regenerative configurations, the paper introduces an architecture that utilises the television stream as a common broadband infrastructure, capable to deliver not only custom digital television bouquets, but also and most predominant, to provide access to triple-play services. Utilising this television beam in backhaul (middle-mile) configurations it extends the core backbone to reach rural and dispersed locations, enabling therefore the immediate and cost-effective deployment (in these areas) of technologies that provide for always-on connectivity, such as WLAN, xDSL, etc.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating signalling efficiency in a composite radio environment",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=948933149554973115&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scalable security management for wireless sensor networks for medical scenarios",
            "Publication year": 2007,
            "Publication url": "https://vbn.aau.dk/en/publications/scalable-security-management-for-wireless-sensor-networks-for-med",
            "Abstract": "Scalable Security Management for Wireless Sensor Networks for Medical Scenarios — Aalborg \nUniversity's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg \nUniversity's Research Portal Logo Dansk English Home Profiles Projects Publications Activities \nResearch Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or \naffiliation Scalable Security Management for Wireless Sensor Networks for Medical Scenarios \nE. Aivaloglou, Anelia Mitseva, C. Skianis, S. Gritzalis, A. Waller, Neeli R. Prasad Department \nof Electronic Systems Research output: Contribution to book/anthology/report/conference \nproceeding › Article in proceeding › Research › peer-review Overview Original language \nEnglish Title of host publication Proceedings of The 10th International Symposium on \nWireless Personal Multimedia Communications (WPMC) 2007 Editors U. Desai Number of …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Power saving in multiuser adaptive modulation transmission",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5686964/",
            "Abstract": "A transmitter power saving mechanism is presented in this paper where an Adaptive Modulation (AM) strategy is performed by the system. The power saving is accomplished by fixing a predefined Quality of Service (QoS) indicator in the system through the demanded application Symbol Error Rate (SER). The obtained results are encouraging as they show a great decrease in the system power budget. The multiuser system capability is also exploited to achieve larger power saving values, by scheduling the user with the best channel characteristics at each time instant. The system saved power is then presented through a closed form expression and compared its results to computer simulations where a very tight performance is obtained.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A fuzzy logic-based AQM for real-time traffic over internet",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128607001648",
            "Abstract": "Autonomic networking has been proposed as an approach to reduce cost and complexity of managing communication functions. An autonomic system is self-configuring, self-optimizing, self-healing and self-protecting. Such a system requires the minimum of administration, primarily involving policy-level management and AI-cognitive models. On the other hand, numerous Active Queue Management (AQM) algorithms have been proposed in the literature to address the problem of congestion in the Internet. Their performance is highly dependent on parameters’ setting and tuning. Besides that, most of the AQM algorithms focus on throughput optimization and fail to provide bounded transmission delay while providing high link utilization to popular TCP-based radio/video streaming applications. Tackling the aforementioned concerns, in this paper we propose and evaluate a novel self-configuring AQM algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Impact of MIMO techniques on the interoperability between UMTS-HSDPA and WLAN wireless systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5581104/",
            "Abstract": "Next generation wireless communication networks integrate in a seamless manner existing technologies such as 3G wireless networks and WLANs in order to create a heterogeneous system with improved capacity and complementary coverage. Besides, they support more mobile users and a variety of services with variable bandwidth and QoS \"anytime anywhere\". In this paper, we first present a survey of the most recent methods that achieve interoperability between 3G and WLAN systems. Motivated by the above presented methods, we propose a mechanism that achieves interoperability between an HSDPA cellular system and a WLAN radio access network. The mechanism is based on the definition and calculation of a cost function which uses suitable metrics to trigger interoperability. The performance of the interoperability mechanism is evaluated by means of system level simulations, assuming that both …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ANGEL: analog network-coded game theoretic energy efficient layout for data dissemination",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6503381/",
            "Abstract": "In this paper we present an analog-network-coding-aided layout for data dissemination. We propose a game theoretic Medium Access Control (MAC) protocol that exploits the recent developments in network coding domain to enhance the system performance. In particular, random linear network coding is used to eliminate the need of exchanging control packets, while ZigZag decoding techniques are applied to resolve the data packet collisions. Our proposed protocol is proved to enhance both the provided Quality of Service and the energy efficiency of the system.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ENTHRONE perspective for E2E QoS",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/George-Xilouris/publication/228095398_ENTHRONE_Perspective_for_E2E_QoS/links/5f56093b299bf13a31a7d7d8/ENTHRONE-Perspective-for-E2E-QoS.pdf",
            "Abstract": "In this paper ENTHRONE (End-to-End QoS through Integrated Management of Content, Networks and Terminals) outlines its perspective for E2E QoS. The aim is to develop an integrated management solution that will handle in a homogeneous manner the considered types of network segments, comprised of wired (IP based core network) and wireless (DVB, WLAN, UMTS) segments. Apart from enforcing and proposing management policies the solution will also monitor and analyse performance and QoS levels as provided by the network segments. The network architecture, certain operational phases alongside remedial actions to QoS degradation are the focal points on this work.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MPEG-DASH users' QoE: The segment duration effect",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7148117/",
            "Abstract": "MPEG-DASH has become one of the mainstream methods for streaming video over un-managed networks, as it enables users to receive this video at the best possible QoE level the network capacity and the users' terminals capabilities allow. However, it has been observed that when MPEG-DASH users, sharing the same access network, request, in parallel, the offered video content, QoE unfairness occurs: some users receive video content that corresponds to a high QoE level whereas all others do not. As a reason for this result, literature points out the inter-dynamics between TCP's congestion avoidance mechanism and the on-off operational pattern of MPEG-DASH switching logic. In this paper, we try to shed some more light on this QoE unfairness issue by investigating how the segment duration of the video content can effect the MPEG-DASH users' QoE level. Towards this, we designed a number of …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless femto-relays: a new model for small cell deployments",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/article/wireless-femto-relays/125818",
            "Abstract": "The continuous increase in mobile data traffic creates the need for radical innovations in the mobile broadband system design. Heterogeneous networks (HetNets) deployment paradigm is an emerging research trend considered as the most significant aspect for meeting the mobile data challenge, mainly by proposing spectral efficiency enhancements and cell capacity gains from an overall system perspective. Two are the main challenges that dense small cell networks are facing: a) various types of interference mainly caused by unplanned deployments, and b) limited and Quality of Service (QoS)-unreliable wired backhaul links. In this paper, the authors propose a model where femtocells' and relays' complementary characteristics are effectively exploited into femto-relays. More specifically, the authors describe four main functionalities of this model: a) interference protection, b) two-fold backhaul alternatives (ie …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:08ZZubdj9fEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "The impact of cooperative physical layer network coding on multicast short range networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655101/",
            "Abstract": "In this paper, we exploit the characteristics of physical layer network coding (PNC) in multicast short range communication (SRC) networks. We present a scalable scenario of partially overlapping SRC networks, where collisions are resolved through indirect inter-group cooperation based on the features of PNC. Our scenario consists of a central network and several peripheral networks. In our previous work we proved that the central network presents significant gains in terms of throughput, delay and energy efficiency when applying the proposed scheme. Here we explore the impact of that scenario on the peripheral networks through a decomposition approach and we prove that they also present significant performance gains.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enabling wireless prosuming in 5G networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917759/",
            "Abstract": "In this article, we present a novel architecture which enables wireless prosuming in the forthcoming fifth-generation (5G) networks. More specifically, we introduce the concept of wireless prosumers i.e. network elements which consume wireless resources while at the same time facilitate the network's resource management. In addition, we propose a prosumers-based network architecture which is divided into two subsystems. The first subsystem provides timely spectrum data gathering through prosumers and dedicated infrastructure. The second subsystem takes as input the output of the data gathering subsystem and triggers optimization decisions on spectral resources. As open-source modular cloud networking and computing characteristics are adopted for both subsystems, on one-hand, data processing and decision-making is performed in distributed cloud controllers and additionally, software-defined …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Brain computer interface based applications for training and rehabilitation of students with neurodevelopmental disorders. A literature review",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S240584402031094X",
            "Abstract": "The aim of this article is to explore a paradigm shift on Brain Computer Interface (BCI) research, as well as on intervention best practices for training and rehabilitation of students with neurodevelopmental disorders. Recent studies indicate that BCI devices have positive impact on students' attention skills and working memory as well as on other skills, such as visuospatial, social, imaginative and emotional abilities. BCI applications aim to emulate humans' brain and address the appropriate understanding for each student's neurodevelopmental disorders. Studies conducted to provide knowledge about BCI-based intervention applications regarding memory, attention, visuospatial, learning, collaboration, and communication, social, creative and emotional skills are highlighted. Only non-invasive BCI type of applications are being investigated based upon representative, non-exhaustive and state-of-the-art studies …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A dynamic hybrid clustering scheme for LTE-A networks employing CoMP-DPS",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8031614/",
            "Abstract": "In this paper, we propose a low complexity Dynamic Hybrid Clustering (DHC) scheme for LTE-A networks employing Coordinated MultiPoint with Dynamic Point Selection (CoMP-DPS). Although CoMP-DPS is considered to be a simpler CoMP scheme, its simplicity allows us to define more efficient cell clustering procedures. Thus, DHC is able to provide backhaul load balancing for the eNBs while offering high quality wireless connections and high data rates to the users. DHC exploits the feedback from the mobile devices and takes into account the backhaul load conditions in order to adjust the backhaul latency to tolerable levels and maintain optimal channel quality. Numerical results and comparisons with other schemes are provided showing improved performance by the proposed solution.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cloud-Native Application Validation & Stress Testing Through a Framework for Auto-Cluster Deployment",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8858164/",
            "Abstract": "The proliferation of cloud-native applications (applications built specifically for the cloud) has taken cloud computing to another level, but it also revealed several issues such as the lack of automation and complexity of deployment. Extensive research on the subject, revealed many endeavors towards that end. Nonetheless, there are still issues to be solved, such as the cluster monitoring and the cluster deployment automation. Most of the existing solutions, are semi-automated or completely manual approaches, with some of them targeting specific cloud providers/vendors. Furthermore, there is also very limited research that tackles the validation of such applications. Untrusted developers, are able to develop and upload applications to marketplaces, without being audited and verified. Towards addressing the above-mentioned issues, this paper presents a novel, completely automated tool for deploying and …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cooperative mobile high-speed and personal area networks for the provision of pervasive e-health services",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962685/",
            "Abstract": "The present paper studies the performance of a high-speed third-generation (3.5G) networking technology (Enhanced Uplink), in collaboration with well known personal area networks (i.e. Zigbee and Bluetooth) and wireless local area network (WLAN) technology, for delivering pervasive healthcare applications. The association of personal and local area networks along with the 3.5G network is a critical factor for successful development of pervasive e-health services perceived by end-users. In this paper, we propose a methodology for performance assessment based on the joint uplink transmission of voice, real-time video and biomedical data, such us electrocardiogram, vital signals and heart sounds. Various scenarios were concerned for point of care applications in real-time and near-real-time modes and in random locations, where no other system but 3.5G is available. The accomplishment of quality of service …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "(Towards) Adaptive Security for Convergent Wireless Sensor Networks",
            "Publication year": 2006,
            "Publication url": "https://vbn.aau.dk/en/publications/towards-adaptive-security-for-convergent-wireless-sensor-networks-2",
            "Abstract": "(Towards) Adaptive Security for Convergent Wireless Sensor Networks — Aalborg \nUniversity's Research Portal Skip to main navigation Skip to search Skip to main content \nAalborg University's Research Portal Logo Dansk English Home Profiles Projects \nPublications Activities Research Units Facilities Press / Media Prizes Datasets Impacts \nSearch by keywords, name or affiliation (Towards) Adaptive Security for Convergent \nWireless Sensor Networks Anelia Mitseva, Maria-Antonietta Marchitti, Neeli R. Prasad, E. \nAivaloglou, C. Skianis, S. Gritzalis, E. Waller, A. Gluhak Department of Electronic Systems \nResearch output: Contribution to journal › Journal article › Research › peer-review Overview \nOriginal language English Journal IEEE Wireless Communications Number of pages 10 \nISSN 1536-1284 Publication status Published - 2006 Cite this APA Author BIBTEX Harvard \nStandard RIS Vancouver Mitseva, A., Marchitti, ., '…",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Saturation throughput analysis of a cluster-based medium access control protocol for single-hop ad hoc wireless networks",
            "Publication year": 2008,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0037549708099232",
            "Abstract": "This paper presents a novel analytical approach to calculate the saturation throughput of the Distributed Queuing Medium Access Control protocol for Ad Hoc Networks (DQMAN) in single-hop scenarios. DQMAN integrates a near-optimum MAC protocol into a passive clustering algorithm based on Carrier Sensing Multiple Access (CSMA). Therefore, based on models of both CSMA and centralized MAC protocols, a new model is presented to accurately calculate the saturation throughput of DQMAN in single-hop networks. In addition, the model presented can be extended to any MAC protocol based on the spontaneous clustering concept of DQMAN. The accuracy of the overall model has been assessed through link-level computer simulations. A performance evaluation of the protocol under different configurations is also presented together with a performance comparison with the IEEE 802.11 standard.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:Se3iqnhoufwC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Architectures and Tools Enabling Seamless Mobility in Future Collaborative Networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35155-6_29",
            "Abstract": "This paper focuses on the concept of the seamless mobility (provided by vertical handover mechanisms) in heterogeneous Future Internet Networks in the context of the HURRICANE project. We discuss future open collaborative network architectures and propose a set of entities that ensure seamless mobility and service continuity, from infrastructural/operational and business standpoints: an 802.21-like implementation of vertical handover, supported by an innovative business modelling software package, which replaces the traditional operations support stack with a more dynamic, marketplace-oriented system. We also discuss, an approach to distributed, policy-based, vertical handover management and a model for such policies, based on the monitorization and analysis of Call Detail Records that reveals users’ behavioural patterns and allows personalization.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "EXEGESIS: Extreme edge resource harvesting for a virtualized fog environment",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7981547/",
            "Abstract": "Currently there is an active debate about how the existing cloud paradigm can cope with the volume, variety, and velocity of the data generated by end devices (e.g., Internet of Things sensors). It is expected that there will be over 50 billion of these devices by 2020, which will create more than two Exabytes worth of data each day. Additionally, the vast number of edge devices create a huge ocean of digital resources close to the data source, which, however, remain so far unexploited to their full extent. EXEGESIS proposes to harness these unutilized resources via a three-layer architecture that encompasses the mist, fog, and cloud. The mist network is located at the very bottom, where interconnected objects (Internet of Things devices, small servers, etc.) create neighborhoods of objects. This arrangement is enhanced by a virtual fog layer, which allows for dynamic, ad hoc interconnections among the various …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Management solutions for QoS support over the entire audio‐visual service distribution chain",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/nem.666",
            "Abstract": "The great challenge of networks and services convergence has been faced for several years by service providers, network operators, equipment manufacturers and other telecom vendors. The explosion of broadband and simultaneously the launch of 3G mobile networks have accelerated this convergence, leading to an all-IP network, delivering voice, data, content, video communications, video broadcasting, in one world, a real IP multimedia world of services. 3GPP and 3GPP2 have produced a specification convergence framework, which enables real multimedia convergence on an all IP-based infrastructure. The core element of this specification framework is the IP Multimedia Subsystem (IMS), which provides a workable and coherent solution for both fixed and wireless networks for delivering a new generation of converged services. This opportunity is rising fast, and is largely contributing to the wide, although …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:hFOr9nPyWt4C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Guest editorial-Convergence of Internet and Broadcasting Systems",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/51213976/MNET.2007.33430520170105-13966-tj2fpx.pdf",
            "Abstract": "Internet and broadcasting sectors to support always-on connectivity and triple-play services provision. A distinction is made between rural and urban areas and how the approach is realized in each case, followed by a performance evaluation of the concept and a vision of how this may be implemented in future fused environments that encompass altenative communication technologies.The next article,“Requirements for an IMS-Based Quadruple Play Service Architecture” by A. Al-Hezmi et al., represents the current effort to utilize the promising IP multimedia subsystem (IMS) as a cooperative service delivery platform to support quadruple play services (voice, video, data, and mobility). The approach suggests using the IMS as an overlay control subsystem over heterogeneous access systems, enabling a convergence of fixed and mobile systems and supporting service mobility. Using a set of scenarios for quadruple play services, the authors propose a delivery platform based on TISPAN and the IMS, and outline the main building blocks (ie, access and core network, control layer, service enabler layer, and application layer). A prototype implementation is described, comprising a subset of these components and considering DVB-H and UMTS access systems. The last two articles focus on important applications delivered over a converged system. In particular,“Affordable Mobile TV Services in Hybrid Cellular and DVB-H Systems” by D. Gómez-Barquero et al. describes the provision of lowcost mobile TV services over hybrid DVB-H and third-generation (3G) infrastructures. The authors adopt IP datacast (IPDC) over DVB-H as an end-to-end …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a flexible trust establishment framework for sensor networks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-007-9049-x",
            "Abstract": " Wireless sensor networks highly depend on the distributed cooperation among network nodes. Trust establishment frameworks provide the means for representing, evaluating, maintaining and distributing trust within the network, and serve as the basis for higher level security services. In this paper, we propose a trust establishment framework targeted sensor networks that can uniformly support the needs of nodes with highly diverse network roles and capabilities, by exploiting the pre-deployment knowledge on the network topology and the information flows. The framework allows for flexibility by combining aspects from alternative approaches on trust establishment on common evaluation metrics, and enables controlled trust evolution based on the network pre-configuration. ",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "MPEG-DASH over IDVB-T: The QoE unfairness issue",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033208/",
            "Abstract": "MPEG-DASH is the first international standardisation effort in the area of HTTP Adaptive Streaming, but as its vendor counterparts suffers from the QoE unfairness issue: alike MPEG-DASH users, sharing the same net and requesting the same video service, receive segments from different Quality Profiles. Being interested to exploit MPEG-DASH paradigm for transferring video services over interactive digital broadcasting networks, we discuss, in this paper, how these broadcasting networks can provide QoE fairness to their MPEG-DASH users. In more detail, we propose the elevation of the broadcasting networks' edge routers to QoE fairness nodes able to enforce any QoE fairness policy to their MPEG-DASH users. Towards validating our approach, we integrated in each edge router a Traffic Shaper, to be used as a QoE fairness module, and run several experiments that verified the QoE unfairness issue, besides …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient spatial processing and resource allocation for amplify and forward two-way relaying",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=650651047349143545&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:JQOojiI6XY0C",
            "Publisher": "Troubador Publishing Ltd, Leicester, UK"
        },
        {
            "Title": "MRE: a robust method of inference for finite capacity queues",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/344018.344076",
            "Abstract": "MRE | System performance evaluation ACM Digital Library home ACM home Google, Inc. (search) \nAdvanced Search Browse About Sign in Register Advanced Search Journals Magazines \nProceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch \nAdvanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksSystem \nperformance evaluation: methodologies and applicationsMRE: a robust method of inference \nfor finite capacity queues chapter MRE: a robust method of inference for finite capacity \nqueues Share on Authors: Demetres D Kouvatsos profile image Demetres Kouvatsos View \nProfile , Rod J Fretwell profile image Rod Fretwell View Profile , Charalabos A Skianis profile \nimage Charalambos Skianis View Profile Authors Info & Affiliations Publication: System \nperformance evaluation: methodologies and applicationsJune 2000 Pages 249–260 1! .…",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Information Theoretic Approach for the Performance Evaluation of Multihop Wireless Ad Hoc Networks",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.95.4524&rep=rep1&type=pdf",
            "Abstract": "The information theoretic principles of Maximum Entropy (ME) and Minimum Relative Entropy (MRE) are employed, as leastbiased methods of inference, towards the analysis of a multihop ad hoc system with bursty arrivals and repetitive service (RS) blocking. The system consists of K MAC layer and R IP layer finite capacity links together with a shared medium which forwards from the MAC layer to higher layer (IP) links in a determined fashion.The traffic at each MAC layer link is assumed to be bursty and is modeled by a compound Poisson process (CPP) with geometrically distributed batches. The shared medium provides generalized exponential (GE) type of service whilst each output link forms a single GE-type server queue under a first-come-first-served (FCFS) rule. To this end, an approximate MRE decomposition algorithm is proposed for the partitioning of the shared medium with its associated MAC layer links into ordinary finite capacity virtual queues with or without server vacations, respectively and modified service times. Consequently, each queue is analysed in isolation by exploiting a stochastic relationship between polling time and server vacation. Moreover, the IP layer links are analysed separately as GE-type finite capacity queues. Finally, the individual sub-systems, as building block queues, are combined together via an iterative process which is based on a MRE solution for arbitrary open queueing network models (QNMs) with RS blocking and GE-type flow formulae.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On networking and computing environments' integration: A novel mobile cloud resources provisioning approach",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294735/",
            "Abstract": "Mobile/wireless networking and cloud computing are nowadays revolutionizing the ways of communication and computation and the newly founded Mobile Cloud Computing (MCC) research area is inspired by the notion of complete networking and computing environments' integration. As a result, efficient MCC resource management frameworks should simultaneously take into consideration both: a) wireless/radio access resources pool aiming at always-best connectivity contexts and b) computing resources pool for data processing/storage aiming at flexible virtualized infrastructure sharing solutions. In this paper, we propose a Mobile Cloud Resources Provisioning (MCRP) scheme, which is flexible enough to adapt to the various general MCC reference use cases being described. The main novelty feature of the employed MCC Service Admission Control algorithm lies in the fact that it jointly handles radio and …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Markov modified model of H. 264 VBR video traffic",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/39524175/A_Markov_Modified_Model_of_H.264_VBR_Video_Traffic.pdf",
            "Abstract": "Video is expected to posses a large portion of the total traffic in future wireless communication networks, given that multimedia services are becoming increasingly popular. Consequently, traffic characterization of such video services is essential for efficient traffic control and resource management via the adaptation of the video properties in the design of communication and transmission networks. The new H. 264/AVC standard, proposed by the ITU-T Video Coding Expert Group (VCEG) and ISO/IEC Moving Pictures Expert Group (MPEG), was designed satisfying two challenging tasks: Considerably higher coding efficiency and improved network adaptation compared to the already widely used standards. Hence, H. 264, featuring slice partitioning, Intra refreshing, separation of picture and sequence data from slice data, provides robustness during transmission, setting it the most appropriate video coding standard for error prone environments. This paper, based on a previously published frame and layer statistical analysis of H. 264 encoded sources, proposes a Markov modified model of H. 264 unconstraint VBR traffic.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cross Layer Designs in WLAN Systems",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=16496835441105452349&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:ldfaerwXgEUC",
            "Publisher": "Troubador Publishing Limited"
        },
        {
            "Title": "Peer-to-peer constellations in an IMS-enabled network architecture based on interactive broadcasting",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-06704-9_12",
            "Abstract": "This chapter elaborates on emerging advances and solutions to introduce the convergence of Peer-to-Peer (P2P) mechanisms into interactive broadcasting systems, enhanced with IP Multimedia Subsystem capabilities. The proposed solutions enable for the proper users’ access on P2P-based services from dispersed locations, as well as the deployment of a novel users’ ecosystem to gear-up new businesses and increase revenue prospects. The P2P-based network architecture is validated through several experimental tests, performed on an actual prototype providing real transmission and reception of data. The experimental results justify the effectiveness of the solution and indentify open issues for further investigation and experimentation.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Power Management in Multiuser Adaptive Modulation Transmission under QoS Requirements",
            "Publication year": 2013,
            "Publication url": "https://www.hindawi.com/journals/ijap/2013/730710/",
            "Abstract": "A transmitter power management mechanism is presented in this paper where Multiple-Input Multiple-Output (MIMO) Multiuser Random Beamforming with Adaptive Modulation strategy is performed by the system. The objective of the proposed mechanism is quality of service (QoS) satisfaction for the scheduled user. The QoS is represented by the application demanded data rate and symbol error rate. The power outage problem is considered and a practical method to minimize the outage probability is proposed. The obtained results are encouraging as they show a great decrease in the system power budget. The multiuser system capability is also exploited to achieve larger power saving values and smaller probability of power outage by scheduling the user with the best channel characteristics at each time instant. The amount of saved power and the power outage probability are both presented through closed-form expressions. These theoretical results are compared to computer simulations, which show very good agreement in performance.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Hybrid resource sharing for QoS preservation in virtual wireless networks",
            "Publication year": 2017,
            "Publication url": "http://ndl.ethernet.edu.et/bitstream/123456789/31456/1/Cloud%20and%20Fog%20Computing%20in%205G%20Mobile%20Networks%20Emerging%20advances%20and%20applications.pdf#page=318",
            "Abstract": "An enabling technology for the fifth generation (5G) of wireless communications is the virtualisation of network resources. 5G networks are expected to consist of dense deployments and efficient resource allocation is a top priority [1]. At present, there is a growing number of research projects, investigating network virtualisation at different levels. The virtualisation of core network functionalities is the topic of the T-NOVA project [2] where a virtualised cloud infrastructure is responsible to provide them, thus achieving elasticity and flexibility in network deployment. Moreover, various tools such as OpenFlow [3] have been developed allowing the dynamic and scalable adaptation of the core network regarding the routing of data. Also, open-source solutions such as OpenStack have been adopted for the management of public and private clouds as well as the well-timed creation and effective maintenance of virtual machines [4].",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:1qzjygNMrQYC",
            "Publisher": "IET"
        },
        {
            "Title": "Patient-centric ICTs based healthcare for students with learning, physical and/or sensory disabilities",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0736585316304919",
            "Abstract": "The purpose of this review article is to explore a new paradigm on healthcare assessment and intervention practices for students with learning, physical and/or sensory disabilities. The perspective presented here is regarded as patient centric and relies on ICTs, in order to address evidence–based treatment and care, meeting every individual’s health profile, with regard to his or her needs, preferences, goals and culture. Patient-centric ICTs based approach has an impact on healthcare systems, introducing a multi-disciplinary care planning that overcomes individual, professional and organizational barriers, reduces anxiety and establishes better understanding with the student at the center.Generally, results show the impact of the interoperability of healthcare information between patients’ healthcare record and information systems which facilitate healthcare systems to be lifesaving if available at the time of …",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:HE397vMXCloC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Lightweight mobile and wireless systems: technologies, architectures, and services",
            "Publication year": 2010,
            "Publication url": "https://www.hindawi.com/journals/jcnc/2010/420806/",
            "Abstract": "Wireless communications are becoming increasingly pervasive, as the number and diffusion of portable wireless equipped devices are exponentially increasing (ranging from cellular phones to handheld game consoles, from personal digital assistant and personal navigation devices to still and video cameras). This results in an unprecedented request for lightweight, wireless communication devices with high usability and performance able to support added-value services in a highly mobile environment. Such devices follow the users everywhere they go (at work, at home, while travelling, in a classroom, etc.) and result in exciting research, development, and business opportunities as evidenced from a plethora of currently undergoing European and national funded projects and consortiums (eg, ICARUS, NEWCOM++, MIMAX, OMEGA, MOBILIA, REWIND, and SELFNET).The above scenario clearly demands significant upgrades to the existing communication paradigm in terms of infrastructure, devices, and services to support the “anytime, anywhere, any device” philosophy, providing novel and fastevolving requirements and expectations on research and development in the field of information and communication technologies. The core issue is to support wireless users’ desire for 24/7 network availability and transparent access to “their own” services.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:maZDTaKrznsC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Performance evaluation of QoS-aware heterogeneous systems",
            "Publication year": 2008,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-e65cd5f1-7fa6-336e-8aaf-71184ae0b00d",
            "Abstract": "Performance evaluation of QoS-aware heterogeneous systems × Close The Infona portal \nuses cookies, ie strings of text saved by a browser on the user's device. The portal can access \nthose files and use them to remember the user's data, such as their chosen settings (screen \nview, interface language, etc.), or their login data. By using the Infona portal the user accepts \nautomatic saving and using this information for portal operation purposes. More information \non the subject can be found in the Privacy Policy and Terms of Service. By closing this window \nthe user confirms that they have read the information on cookie usage, and they accept the \nprivacy policy and the way cookies are used by the portal. You can change the cookie settings \nin your browser. I accept Polski English Login or register account remember me Password \nrecovery INFONA - science communication portal INFONA Search advanced search Browse -/…",
            "Abstract entirety": 0,
            "Author pub id": "DEdnDtgAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Serious Games in Preschool and Primary Education: Benefits And Impacts on Curriculum Course Syllabus.",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/George-Papanastasiou-2/publication/313115425_Serious_Games_in_Preschool_and_Primary_Education_Benefits_And_Impacts_on_Curriculum_Course_Syllabus/links/5890ba67aca272f9a556bd96/Serious-Games-in-Preschool-and-Primary-Education-Benefits-And-Impacts-on-Curriculum-Course-Syllabus.pdf",
            "Abstract": "Serious Games (SGs) indicate positive effects on Preschool and Primary school students and promote a multi sensory style of learning. This review paper explores the integration of Serious Games in the area of Preschool and Primary Education, in the last decade (2006-2016). The studies were carried out on Preschool and Primary school settings, respectively. Research showed that Serious Games are able to keep all students engaged in classroom facilities, scaffolding their learning through increased motivation, independence, autonomy and resultant self-esteem. Serious Games Based Learning (GBL) has proven its added value in almost every aspect of the curriculum.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scalable Video Streaming Traffic Delivery in IP/UMTS Networking Environments.",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/33658646/jmm02023746.pdf",
            "Abstract": "The paper discusses the end-to-end QoS provisioning for scalable video streaming traffic delivery over heterogeneous IP/UMTS networks. A prototype architecture is proposed, and is further validated, that explores the joint use of packet prioritization and scalable video coding (SVC) together with the appropriate mapping of UMTS traffic classes to the DiffServ traffic classes. A complete set of simulation scenarios, involving eight different video sequences and using two different scalable encoders, demonstrates the quality gains of both scalable video coding and prioritized packetization.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "End-to-End QoS issues of MPEG4-FGS video streaming traffic delivery in an IP/UMTS network",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11907381_24",
            "Abstract": "The paper addresses the end-to-end QoS problem of MPEG4-FGS video streaming traffic delivery over a heterogeneous IP/UMTS network. It proposes and validates an architecture that explores the joint use of packet prioritization and scalable video coding together with the appropriate mapping of UMTS traffic classes to the DiffServ traffic classes. A set of simulation scenarios, involving eight different video sequences, demonstrates the quality gains of both scalable video coding and prioritized packetization.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Compression performance and video quality comparison of HEVC and AVC",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033209/",
            "Abstract": "The main purpose of the paper is to perform a quantitative and qualitative performance evaluation of the emerging standard H.265/HEVC in comparison to its predecessor H.264/AVC. The paper focuses on both the encoding and compression efficiency by measuring the PSNR values, SSIM scores and bit rate values of reference and non-reference signals. For the needs of the paper, the HEVC and AVC reference encoders have been used. Based on the experimental results, it is deduced that the HEVC meets its primary objective, which is to double the compression efficiency of the bit stream without significant degradation of the encoded video quality. Finally, interesting findings are also reported for the very low bit rate area of the encoding rate for low spatial resolutions.",
            "Abstract entirety": 1,
            "Author pub id": "DEdnDtgAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        }
    ]
}]