[{
    "name": "Χαράλαμπος Κωνσταντόπουλος",
    "romanize name": "Charalampos Konstantopoulos",
    "School-Department": "Πληροφορικης",
    "University": "unipi",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 13839,
    "Scholar name": "Charalampos Konstantopoulos",
    "Scholar id": "Q0GeDawAAAAJ",
    "Affiliation": "University of Piraeus",
    "Citedby": 3228,
    "Scholar url": "https://scholar.google.com/citations?user=Q0GeDawAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "An efficient parallel algorithm for motion estimation in very low bit‐rate video coding systems",
            "Publication year": 2000,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/1096-9128(20000425)12:5%3C289::AID-CPE489%3E3.0.CO;2-F",
            "Abstract": "Motion estimation  is widely used in video coding schemes in order to reduce the inherent temporal redundancy among the frames of a video stream. In particular, low and very low bit rate video coding schemes need sophisticated motion models which usually require a large number of arithmetic operations. In this paper we present a parallel algorithm for the most practical of these models. Specifically we implement the affine motion model on a hypercube‐based multiprocessor. This model covers the most usual kinds of motion and requires only a modest number of arithmetic operations. Also, the hypercube network can efficiently handle the non‐regular data flow resulting from the parallel implementation of this model. In addition, we assume that our multiprocessor is fine grained, in contrast to most programmable architectures used in video coding, where processors usually have large local memory. Apart from …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:MXK_kJrjxJIC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Efficient event handling in Wireless Sensor and Actor Networks: An on-line computation approach",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S108480451630193X",
            "Abstract": "The real time response of actors to events occurring in a network area is of critical importance in Wireless Sensor and Actor Networks (WSANs). This in turn requires fast notification of actors from Sensor Nodes (SNs) about events as well as effective coordination of actors for prompt event handling. In this paper, we introduce an on-line distributed protocol for event handling in a WSAN. Existing techniques usually select actors nearby the current event for handling it. However, this greedy approach may eventually lead to a slow response to events because it does not consider the spatial distribution that future events might have. In contrast, in order to cater for future events, the proposed solution probabilistically selects actors for event handling, allowing distant actors to be selected as well. This randomized approach guarantees fast average responsiveness to events, a balanced energy consumption among actors …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:uoRD4RTSUPoC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A pervasive assistive environment for visually impaired people using wireless sensor network infrastructure",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804510001396",
            "Abstract": "Wireless sensor networks (WSNs) have been identified as a promising technology for supporting assistive environments. This article introduces PROTECT, a system that employs autonomous software objects referred to as mobile agents (MAs) able of locating and informing visually impaired persons for potential risks. PROTECT utilizes a 3-tier architecture where the first tier comprises a base station (BS), the second tier mobile sinks (MS) (carried by blind people on their sticks) and the third tier stationary sensor nodes. This WSN is deployed in an urban environment. In the event of an alarm issued by a sensor node, the BS launches a number of MAs supplied with a near-optimal itineraries that visit the nodes in the alarm's surrounding area and notifies, through Wi-Fi (IEEE 802.11), visually impaired people for potential hazards in their proximity. In the event of communication problems (e.g. failure of some sensor …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:qUcmZB5y_30C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "An evolutionary approach to multi-objective ship weather routing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388052/",
            "Abstract": "The paper presents a real time weather routing solution based on an Evolutionary Algorithm (EA). The objectives to be minimized are the mean total risk and fuel cost, where the route of a ship is optimized while taking into consideration the time-varying sea and weather conditions and there is also a constraint on the total passage time of the route. Safety is also taken into account by applying restrictions following the guidelines of the International Maritime Organization (IMO). The proposed EA implementation is tested on real life instances and compared with an exact algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:1xBWf43XMUgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-efficient multiple itinerary planning for mobile agents-based data aggregation in WSNs",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-016-0140-z",
            "Abstract": "Data aggregation is recognized as a key method for reducing the amount of network traffic and the energy consumption on wireless sensor network nodes. Mobile agent (MA) technology represents a distributed computing paradigm which has been proposed as a means for increasing the energy efficiency of data aggregation tasks and addressing the scalability problems of centralized methods. Nevertheless, the itineraries followed by travelling MAs largely determine the overall performance of the data aggregation applications. Along this line, this article introduces a novel algorithmic approach for energy-efficient itinerary planning of MAs engaged in data aggregation tasks. Our algorithm adopts an iterated local search approach in deriving the hop sequence of multiple travelling MAs over the deployed source nodes. Simulation results demonstrate the performance gain of our method against existing …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:Cvh0bltMcLgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Mobile agents-based data aggregation in WSNs: Benchmarking itinerary planning approaches",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-017-1460-y",
            "Abstract": "Data aggregation represents one of the most challenging and well-studied subjects in the Wireless Sensor Networks (WSN) literature. The energy constraints of sensor nodes call for energy-efficient data aggregation methods so as to prolong network lifetime. Among other approaches, Mobile Agents (MAs) have been proposed to improve the performance of data aggregation in WSNs. In such approaches, the itineraries followed by travelling agents largely determine the overall performance of the data aggregation tasks. Along this line, several heuristics have been proposed to perform efficient itinerary planning for MAs. However, a direct comparison of the proposed algorithms is not straightforward, as they are typically performed on the ground of different parameter instances and assumptions about the underlying network and nodes capabilities. This article provides a critical review and qualitative …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:L7vk9XBBNxgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Secure and trust-aware routing in wireless sensor networks",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3291533.3291544",
            "Abstract": "Wireless Sensors Networks (WSNs) are susceptible to many security threats, and because of communication, computation and delay constraints of WSNs, traditional security mechanisms cannot be used. As a consequence, several secure routing methods have been proposed during the last decade, whereas trust management models and corresponding routing protocols have also been recently suggested as an even more effective security mechanism for WSNs. In this paper, we present a detailed survey on such routing protocols along with a proper classification according to their basic features. We first distinguish between secure multipath protocols and trust evaluation based protocols. The former are then distinguished to share and non share-based ones, whereas the latter are categorized according to their cluster-based structure or not. A comprehensive analysis is presented, accompanied by proper …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:vofGIMt6cyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A method for incremental data fusion in distributed sensor networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_74",
            "Abstract": "The use of mobile agents for data fusion in wireless sensor networks has been recently proposed in the literature to answer the scalability problem of client/server model. In this article, we consider the problem of calculating a near-optimal route for a mobile agent that incrementally fuses the data as it vis-its the nodes in a distributed sensor network. The order of visited nodes affects not only the quality but also the overall cost of data fusion. Our proposed heu-ristic algorithm adapts methods usually applied in network design problems in the specific requirements of sensor networks. It suggests the optimal number of MAs that minimizes the overall data fusion cost and constructs near-optimal itineraries for each of them. The performance gain of our algorithm over alter-native approaches is demonstrated by a quantitative evaluation..",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Special issue",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.comcom.2013.04.001",
            "Abstract": "Special issue | Computer Communications ACM Digital Library home ACM home Google, Inc. \n(search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines \nProceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch \nAdvanced Search Computer Communications Periodical Home Latest Issue Archive Authors \nAffiliations Award Winners More HomeBrowse by TitlePeriodicalsComputer CommunicationsVol. \n, No. Special issue research-article Special issue Share on Authors: Charalampos \nKonstantopoulos Department of Informatics, University of Piraeus, Greece Department of \nInformatics, University of Piraeus, Greece View Profile , Paolo Bellavista Dipartimento di \nInformatica, Elettronica e Sistemistica Universita di Bologna, Italy Dipartimento di Informatica, \nElettronica e Sistemistica Universita di Bologna, Italy View Profile , Chi-Fu Huang of Science :…",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:r0BpntZqJG4C",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "A hypercube algorithm for sliding window compression",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129626400000305",
            "Abstract": "Dictionary compression belongs to the class of lossless compression methods and is mainly used for compressing text files. The most known examples of this technique are the algorithms of the LZ coding family whose common feature is the use of an adaptive dictionary which is dynamically adjusting during the algorithm execution. In this paper, we present a parallel algorithm for one of these coding algorithms, namely the LZ77 coding algorithm also known as a sliding-window coding algorithm. We also present a parallel algorithm for the corresponding LZ77 decoding algorithm. Although there exist PRAM algorithms for various dictionary compression methods, their rather irregular structure has discouraged their implementation on practical interconnection networks such as the mesh and hypercube. However in the case of LZ77 coding/decoding, we show how to exploit the specific properties of the algorithm in …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:Zph67rFs4hoC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "A scheme for on-site service provision in pervasive assistive environments",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1579114.1579138",
            "Abstract": "Remote healthcare monitoring and on demand provision of support attracts a lot of interest due to the ability to provide assistance to elderly and patients when needed; thus on one side the hospitals demand less personnel to be engaged in monitoring patients, whereas on the other side the patient does not need to remain hospitalized unless there is need to. Wireless and wearable devices enable the constant monitoring of vital parameters; with the aid of appropriate infrastructures they can be sent to the hospital and when it is needed help can be sent at home. As the number of remotely monitored patients grows, there is a need for efficient management of emergency messages originating from portable and wearable devices as well as a demand for an efficient management scheme for mobile units, which provide help at home or transfer patients to the hospital. We present an architecture that enables provision of …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deriving efficient mobile agent routes in wireless sensor networks with NOID algorithm",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394337/",
            "Abstract": "In this article, we consider the problem of calculating an appropriate number of near-optimal (subject to a certain routing objective) routes for mobile agents (MAs) that incrementally fuse the data as they visit the nodes in a distributed sensor network. We propose an improved heuristic algorithm which computes an approximate solution to the problem by suggesting an appropriate number of MAs and constructing near-optimal itineraries for each of them. The performance gain of our algorithm over alternative approaches both in terms of cost and task completion latency is demonstrated by a quantitative evaluation and also in simulated environments through a Java-based tool.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Efficient Heuristic for the Vacation Planning Problem",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8993068/",
            "Abstract": "In this paper we define the Vacation Planning Problem (VPP) as an optimization problem whose objective is to find a set of destinations in a specified region, the visiting order of the destinations in the set, and for each destination, a number of days of stay, a proposed hotel area and daily tours, i.e. ordered visits to points of interest, that maximize the satisfaction of the tourist while matching her preferences and respecting her constraints (e.g., the total number of days of stay, daily time budget). To the best of our knowledge, the VPP has not been studied so far in the literature. The problem is NP-hard and can be seen as an extension of the Tourist Trip Design Problem and its variants that focuses not only on suggesting personalized tourist routes but also optimal destinations and hotel areas as well as optimal distribution of the days of stay at different destinations, and as a variation of the Orienteering Problem with …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:RJNGbXJAtMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient cluster-based heuristics for the team orienteering problem with time windows",
            "Publication year": 2019,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0217595919500015",
            "Abstract": "In the Team Orienteering Problem with Time Windows (TOPTW), a variant of the Vehicle Routing Problem with Profits, a set of locations is given, each associated with a profit, a visiting time and a time window. The aim is to maximize the overall profit collected by a number of routes, while the duration of each route must not exceed a given time budget. TOPTW is NP-hard and is typically used to model the Tourist Trip Design Problem. The latter deals with deriving near optimal multiple-day tours for tourists visiting a destination with several points of interest (POIs). The most efficient known heuristic approach to TOPTW which yields the best solution quality versus execution time, is based on Iterated Local Search (ILS). However, the ILS algorithm treats each node separately, hence it tends to overlook highly profitable areas of nodes situated far from the current solution, considering them too time-expensive to visit. We …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:rzmi0EmCOGEC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Acknowledgement to Reviewers of Algorithms in 2013",
            "Publication year": 2014,
            "Publication url": "https://www.mdpi.com/1999-4893/7/1/60/pdf",
            "Abstract": "The statements, opinions and data contained in the journal Algorithms are solely those of the individual authors and contributors and not of the publisher and the editor (s). MDPI stays neutral with regard to jurisdictional claims in published maps and institutional affiliations.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:iKswqCX-FLkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CBID: a scalable method for distributed data aggregation in WSNs",
            "Publication year": 2010,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1155/2010/206517",
            "Abstract": "Mobile Agent (MA) technology has been recently proposed in Wireless Sensors Networks (WSNs) literature to answer the scalability problem of client/server model in data fusion applications. Herein we present CBID, a novel algorithm that calculates near-optimal routes for MAs that incrementally fuse the data as they visit the Sensor Nodes (SNs) while also enabling fast updates on the designed itineraries upon changes of network topology. CBID dispatches in parallel a number of MAs that sequentially visit sensor nodes arranged in tree structures and upon visiting an SN with two or more child SNs, the MAs (master MAs) clone of themselves with each clone (slave MA) visiting a tree branch. When all slave MAs return to that SN, they deliver their collected data to the master MA and are then disposed of. This results in a significant reduction of the overall energy expenditure and response time. Simulation results …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:0EnyYjriUFMC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Interactive cluster-based personalized retrieval on large document collections",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-68127-4_22",
            "Abstract": "Lately, many systems and websites add personalization functionalities among their provided services. However, for large document collections it is difficult for the user to direct effective queries from the beginning of his/her search, since accurate query terms may not be known in advance. In this paper we describe a system that applies a hybrid approach to assist a user identify the most relevant documents: at the beginning it applies dynamic personalization techniques based on user modeling to initiate the search on a large document and multimedia content collection; next the query is further refined using a clustering based approach which after processing a sub-collection of documents presents the user with more categories to select from a list of new keywords. We analyze the most prominent implementation choices for the modular components of the proposed architecture: a machine learning approach …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Enhancing shopping experiences in smart retailing",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s12652-020-02774-6",
            "Abstract": "The retailing market has undergone a paradigm-shift in the last decades, departing from its traditional form of shopping in brick-and-mortar stores towards online shopping and the establishment of shopping malls. As a result, “small” independent retailers operating in urban environments have suffered a substantial reduction of their turnover. This situation could be presumably reversed if retailers were to establish business “alliances” targeting economies of scale and engage themselves in providing innovative digital services. The SMARTBUY ecosystem realizes the concept of a “distributed shopping mall”, which allows retailers to join forces and unite in a large commercial coalition that generates added value for both retailers and customers. Along this line, the SMARTBUY ecosystem offers several novel features: (i) inventory management of centralized products and services, (ii) geo-located marketing of …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:Ei5r6KrKXVQC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "A composite algorithm for the team orienteering problem with time windows",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785423/",
            "Abstract": "In this paper we propose a new heuristic algorithm for the Team Orienteering Problem with Time Windows (TOPTW). This problem is applicable to several real life problems. The route planning of the vehicles which belong to a company or the tourist trip design problem, are some of them. In the first problem, each customer is associated with a profit which can be obtained after visiting them. The objective is to derive a constant number of routes visiting customers such that the profit obtained overall is the maximum possible given that some constraints are satisfied. Specifically, the total cost of transportation of each route must be less than or equal to a certain time budget. In addition, the visit to each customer must occur within a specific time interval. This time interval is termed time window and can be different for each customer. In this sort of problems, the budget may represent the available time for serving customers …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:2Q0AJrNhS-QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Heuristics for the time dependent team orienteering problem: Application to tourist route planning",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0305054815000817",
            "Abstract": "The Time Dependent Team Orienteering Problem with Time Windows (TDTOPTW) can be used to model several real life problems. Among them, the route planning problem for tourists interested in visiting multiple points of interest (POIs) using public transportation. The main objective of this problem is to select POIs that match tourist preferences, taking into account a multitude of parameters and constraints while respecting the time available for sightseeing in a daily basis and integrating public transportation to travel between POIs (Tourist Trip Design Problem, TTDP). TDTOPTW is NP-hard while almost the whole body of the related literature addresses the non-time dependent version of the problem. The only TDTOPTW heuristic proposed so far is based on the assumption of periodic transit service schedules. Herein, we propose efficient cluster-based heuristics for the TDTOPTW which yield high quality solutions …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:vD2iS2Kej30C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Clustering of mobile ad hoc networks: An adaptive broadcast period approach",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4025114/",
            "Abstract": "Organization, scalability and routing have been identified as key problems hindering viability and commercial success of mobile ad hoc networks. Clustering of mobile nodes among separate domains has been proposed as an efficient approach to address those issues. In this work, we introduce an efficient distributed clustering algorithm that uses both location and energy metrics for cluster formation. Our proposed solution mainly addresses cluster stability, manageability and energy efficiency issues. Also, unlike existing active clustering methods, our algorithm relieves the network from the unnecessary burden of control messages broadcasting, especially for relatively static network topologies. This is achieved through adapting broadcast period according to mobile nodes mobility pattern. The efficiency, scalability and competence of our algorithm against alternative approaches have been demonstrated through …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "JAID: An algorithm for data fusion and jamming avoidance on distributed sensor networks",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S157411920800062X",
            "Abstract": "Mobile Agent (MA) technology has been recently proposed in Wireless Sensor Networks (WSNs) literature to answer the scalability problem of client/server model in data fusion applications. In this paper, we describe the critical role MAs can play in the field of security and robustness of a WSN in addition to data fusion. The design objective of our Jamming Avoidance Itinerary Design (JAID) algorithm is twofold: (a) to calculate near-optimal routes for MAs that incrementally fuse the data as they visit the nodes; (b) in the face of jamming attacks against the WSN, to modify the itineraries of the MAs to bypass the jammed area(s) while not disrupting the efficient data dissemination from working sensors. If the number of jammed nodes is small, JAID only modifies the pre-jamming scheduled itineraries to increase the algorithm’s promptness. Otherwise, JAID re-constructs the agent itineraries excluding the jammed area(s …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multimodal route and tour planning in urban environments",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8024532/",
            "Abstract": "The environmental impact of the steadily increasing demand for mobility of people and goods, especially in urban environments, raises public concern and presents challenges that need to be addressed in the interest of long-term sustainability. Along this line, the inherently eco-friendly human mobility which involves the use of urban public transit networks must be encouraged and eased. This necessitates the development of context-aware services that hide the complexity of public transit networks while considering all available transportation modalities (e.g. bus, metro, tram, walking and cycling) in order to provide sophisticated route planning tailored to both residents and visitors of urban areas. The EU-funded eCOMPASS research project has addressed this challenge through establishing a methodological framework for route planning optimization. A core objective of the project has been to employ novel …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:GHsHDPAyICYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient BSP/CGM Algorithms for Text Retrieval.",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.98.7198&rep=rep1&type=pdf",
            "Abstract": "In this paper we present efficient, scalable and portable parallel algorithms written in the Coarse-Grained Multicomputer (CGM) and the Bulk Synchronous Parallel (BSP) models for the off-line clustering, the on-line retrieval and the update phases of the text retrieval problem based on the vector space model and using clustering to organize and handle a dynamic document collection. To the best of our knowledge, our parallel retrieval algorithms are the first ones analyzed under specific parallel models, which capture within a few parameters the characteristics of the parallel machine.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personalized routes for mobile tourism",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6085385/",
            "Abstract": "This paper deals with the problem of deriving personalized recommendations for daily sightseeing itineraries for tourists visiting any destination. Our approach considers selected places of interest that a traveler would potentially wish to visit and derives a near-optimal itinerary for each day of visit; the places of potential interest are selected based on stated or implied user preferences. Our method enables the planning of customized daily personalized tourist itineraries considering user preferences, time available for visiting sights in daily basis, opening days of sights and average visiting times for these sights. Herein, we propose a heuristic solution to this problem and discuss its implementation aspects.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient mobile sink-based data gathering in wireless sensor networks with guaranteed delay",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2642668.2642674",
            "Abstract": "In this paper, we present a rendezvous-based data gathering protocol for wireless sensor networks employing a mobile sink. For satisfying timely delivery of sensory data to the mobile sink, the mobile sink is forced to visit only an appropriate number of rendezvous nodes while the remaining nodes send their data through multi-hop communication toward the rendezvous nodes. The proposed technique achieves prolonged network lifetime by selecting energy rich paths for this multi-hop communication. Specifically, first the network is partitioned into a number of clusters and then the cluster heads of an appropriate number of energy rich clusters are selected as rendezvous nodes in such a way that (i) the rendezvous nodes are appropriately distributed across the network area to ensure energy efficient data gathering from the other sensor nodes to the rendezvous nodes and (ii) the length of the mobile sink trajectory …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:SWgZeABleR0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Session details: Cloud computing and internet of things (CCIoT)",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3305156",
            "Abstract": "Session details: Cloud computing and internet of things (CCIoT) | Proceedings of the 22nd \nPan-Hellenic Conference on Informatics ACM Digital Library Logo ACM Logo Google, Inc. (search) \nAdvanced Search Browse About Sign in Register Advanced Search Journals Magazines \nProceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch \nAdvanced Search Proceedings ACM Proceedings Conferences when & where ICPS \nProceedings More HomeICPS ProceedingsPCI '18Session details: Cloud computing and internet \nof things (CCIoT) section Session details: Cloud computing and internet of things (CCIoT) Share \non Editors: B Mamalis profile image B. Mamalis View Profile , Grammati E Pantziou profile image \nG. Pantziou View Profile , Charalampos G Konstantopoulos profile image C. Konstantopoulos \nView Profile Authors Info & Affiliations Publication: PCI '18: Proceedings of the -:/…",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:NnTm98qLMbgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A parallel algorithm for motion estimation in video coding using the bilinear transformation",
            "Publication year": 2015,
            "Publication url": "https://springerplus.springeropen.com/articles/10.1186/s40064-015-1038-z",
            "Abstract": "Accurate motion estimation between frames is important for drastically reducing data redundancy in video coding. However, advanced motion estimation methods are computationally intensive and their execution in real time usually requires a parallel implementation. In this paper, we investigate the parallel implementation of such a motion estimation technique. Specifically, we present a parallel algorithm for motion estimation based on the bilinear transformation on the well-known parallel model of the hypercube network and formally prove the time and the space complexity of the proposed algorithm. We also show that the parallel algorithm can also run on other hypercubic networks, such as butterfly, cube-connected-cycles, shuffle-exchange or de Bruijn network with only constant slowdown.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:urP0JZOBBUsC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Enhanced buying experiences in smart cities: the SMARTBUY approach",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-34255-5_8",
            "Abstract": "The establishment of shopping malls and the growth of online shopping increasingly diminishes the turnover of “small”, independent retailers in urban environments. However, retailers could reverse this trend through complementing the offline experiences they already offer with online offerings and establishing business “alliances” to achieve economies of scale and enable the provision of innovative digital services. The EU-funded project SMARTBUY aims at realizing the concept of a “distributed shopping mall” ecosystem which allows retailers to band together in a large commercial coalition which generates added-value for its retailers-members and customers: centralized products and services inventory management; geo-located marketing of products/services; location-based search for products offered by nearby retailers; personalized recommendations for purchasing products based on innovative …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:bCjgOgSFrM0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Incentivized vehicle relocation in vehicle sharing systems",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0968090X18315262",
            "Abstract": "The asymmetric demand-offer problem represents a major challenge for one-way vehicle sharing systems (VSS) affecting their economic viability as it necessitates the engagement of considerable human (and financial) resources in relocating vehicles to satisfy customer demand. In this paper, we propose a novel approach which involves user-based vehicle relocations to address supply-and-demand mismatches; in our approach, VSS users are offered price incentives so as to accept picking up their vehicle from an oversupplied station and/or to drop it off to an under-supplied station. The system incentivizes users based on the priorities of vehicle relocations among stations, taking into account the fluctuating demand for vehicles and parking places at different stations over time. A graph-theoretic approach is employed for modeling the problem of allocating vehicles to users in a way that maximizes the profit of the …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:x2hKVfJWtf0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Efficient active clustering of mobile ad-hoc networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_78",
            "Abstract": "Mobile ad hoc networks comprise a collection of wireless nodes that dynamically create a network among themselves without using any pre-existing infrastructure. Clustering of mobile nodes among separate domains has been proposed as an efficient approach to answer the organization, scalability and routing problems of mobile ad hoc networks. In this work, we propose an efficient distributed clustering algorithm that uses both location and energy metrics for stable cluster formation. Unlike existing active clustering methods, out algorithm relieves the network from the unnecessary burden of control messages broadcasting. This is achieved through adapting broadcast period according to mobile nodes mobility pattern. For relative static network topologies, broadcast period is lengthened. In contrast, broadcast period is shortened to meet the requirements of highly dynamic networks for consistent cluster …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Hazard monitoring for visually impaired people enabled by wireless sensor networking technology",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1389586.1389612",
            "Abstract": "Wireless Sensor Networks (WSNs) has been identified as a promising technology for supporting assistive environments. This article introduces PROTECT, a system that employs autonomous software objects referred to as Mobile Agents (MAs) able of locating and informing visually impaired persons for potential risks. PROTECT utilizes a 3-tier architecture where the first tier comprises a Base Station (BS), the second tier mobile sinks (carried by blinds on their sticks) and the third tier stationary sensor nodes. This WSN is deployed in an urban environment. In the event of an alarm issued by a sensor node, the BS launches a number of MAs supplied with a near-optimal itineraries that visit the nodes in the alarm's surrounding area and notify visually impaired people for potential hazards in their proximity. In the event of communication problems (eg failure of some sensor nodes) PROTECT modifies the itineraries of the …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scenic Athens: A personalized scenic route planner for tourists",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7543892/",
            "Abstract": "Several mobile guides for unknown destinations provide assistance to tourists (through personalized tour recommendations) in making feasible plans and visiting the most interesting POIs within their available time. However, existing tourist tour planners only regard available attractions as sites lacking physical dimensions (i.e. POIs are treated as points). Although this is adequate for scheduling visits at POIs with single entry/exit points, it fails to capture practical properties of typical tourist visiting styles in urban destinations (e.g. tourists typically enjoy walking on pedestrian zones, market areas and scenic neighborhoods). Herein, we introduce Scenic Athens, a context-aware mobile city guide for Athens (Greece) which delivers personalized tour planning services to tourists deriving near-optimal sequencing of POIs along recommended tours. Scenic Athens takes into account a multitude of travel restrictions and POI …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:DGzKIA18-3YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sliding-window compression on the hypercube",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44520-X_115",
            "Abstract": "Dictionary compression belongs to the class of lossless com- pression methods and is mainly used for compressing text files [1, 2, 3]. In this paper, we present a parallel algorithm for one of these coding methods, namely the LZ77 coding algorithm also known as a sliding- window coding algorithm. Although there exist PRAM algorithms [4, 5] for various dictionary compression methods, their rather irregular struc- ture has discouraged their implementation on practical interconnection networks such as the mesh and hypercube. However in the case of LZ77 coding, we show how to exploit the specific properties of the algorithm in order to achieve an efficient implementation on the hypercube.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Web application for recommending personalised mobile tourist routes",
            "Publication year": 2012,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-sen.2011.0156",
            "Abstract": "This study deals with the problem of deriving personalised recommendations for daily sightseeing itineraries for tourists visiting any destination. The authors’ approach considers selected places of interest that a traveller would potentially wish to visit and derives a near-optimal itinerary for each day of visit; the places of potential interest are selected based on stated or implied user preferences. The authors’ method enables the planning of customised daily personalised tourist itineraries considering user preferences, time available for visiting sights on a daily basis, opening days of sights and average visiting times for these sights. Herein, the authors propose a heuristic solution to this problem addressed to both web and mobile web users. Evaluation and simulation results verify the competence of the authors’ approach against an alternative method.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Near-optimal personalized daily itineraries for a mobile tourist guide",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5546761/",
            "Abstract": "This short paper deals with the problem of deriving personalized recommendations for daily sightseeing itineraries for tourists visiting any destination. Our approach considers selected places of interest that a traveller would potentially wish to visit and derives a near-optimal itinerary for each day of visit; the places of potential interest are selected based on stated or implied user preferences. Herein, we propose a heuristic solution to this problem and discuss its implementation aspects.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Renewable mobility in smart cities: Cloud-based services",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8538479/",
            "Abstract": "Providing efficient, sustainable and personalized mobility services in urban environments that combine a spectrum of transport modes (e.g., public transport, electric vehicles, vehicle sharing, low energy and/or emission routes) constitutes a great challenge. In this work, we present MOVESMART, a holistic approach (and integrated platform) for the provision of renewable personal mobility services, leveraging crowd-sourcing data, tools for collecting real-time information by multimodal travelers, and traffic prediction mechanisms. MOVESMART guarantees real-time responses to renewable (on-demand) mobility queries for efficient multi-modal route planning that are time-dependent as well as sensitive to aperiodic incidents and traffic prediction forecasts. This paper focuses on the cloudbased (backend) services of the MOVESMART platform.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:XeErXHja3Z8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile agent middleware for autonomic data fusion in wireless sensor networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-89828-5_3",
            "Abstract": "Mobile agents (MAs) are referred to as autonomous application programs with the inherent ability to move from node to node towards a goal completion. In the context of wireless sensor networks (WSNs), MAs may be used by network administrators in the process of combining data and knowledge from different sources aiming at maximizing the useful information content. MAs have been initially developed to replace the client/server model which exhibits many disadvantages, particularly in WSN environments (e.g.heavy bandwidth usage and excessive energy expenditure). The most promising advantages of MAs in WSN environments include decreased usage of the wireless spectrum (large volumes of raw sensory data are filtered at the source) and energy consumption, increased reliability due to their inherent support for disconnected operations, their ability of cloning themselves to enable parallel …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Time-Dependent Bi-Objective Itinerary Planning Algorithm: Application in Sea Transportation",
            "Publication year": 2016,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2016/6535/",
            "Abstract": "A special case of the Time-Dependent Shortest Path Problem (TDSPP) is the itinerary planning problem where the objective is to find the shortest path between a source and a destination node which passes through a fixed sequence of intermediate nodes. In this paper, we deviate from the common approach for solving this problem, that is, finding first the shortest paths between successive nodes in the above sequence and then synthesizing the final solution from the solutions of these sub-problems. We propose a more direct approach and solve the problem by a label-setting approach which is able to early prune a lot of partial paths that cannot be part of the optimal solution. In addition, we study a different version of the main problem where it is only required that the solution path should pass through a set of specific nodes irrespectively of the particular order in which these nodes are included in the path. As a case study, we have applied the proposed techniques for solving the itinerary planning of a ship with respect to two conflicting criteria, in the area of the Aegean Sea, Greece. Moreover, the algorithm handles the case that the ship speed is not constant throughout the whole voyage. Specifically, it can be set at a different level each time the ship departs from an intermediate port in order to obtain low cost solutions for the itinerary planning. The experimental results confirm the high performance of the proposed algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:5rMqqAh47xYC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik"
        },
        {
            "Title": "eCOMPASS–TR–010",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/42176902/ECOMPASS-TR-010.pdf",
            "Abstract": "The tourist trip design problem (TTDP) refers to a route-planning problem for tourists interested in visiting multiple points of interest (POIs). TTDP solvers derive daily tourist tours ie, ordered visits to POIs, which respect tourist constraints and POIs attributes. The main objective of the problem discussed is to select POIs that match tourist preferences, thereby maximizing tourist satisfaction, while taking into account a multitude of parameters and constraints (eg, distances among POIs, visiting time required for each POI, POIs visiting days/hours, entrance fees, weather conditions) and respecting the time available for sightseeing in daily basis. The aim of this work is to survey models, algorithmic approaches and methodologies concerning tourist trip design problems. Recent approaches are examined, focusing on problem models that best capture a multitude of realistic POIs attrbutes and user constraints; further, several interesting TTDP variants are investigated. Open issues and promising prospects in tourist trip planning research are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A location history-aware recommender system for smart retail environments",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00779-020-01374-7.pdf",
            "Abstract": "Recommender systems (RSs) represent integral parts of e-commerce platforms for almost two decades now. The recent emergence of mobile context-aware RSs (CARS) contributed in improving the relevance of recommendations derived by “traditional” RSs through adapting them to the situational user context. This article presents the design and implementation aspects of a collaborative filtering-based mobile CARS, which has been integrated in a smart retailing platform that enables location-based search for retail products and services. In addition to user location, the introduced CARS considers several context parameters like time, season, demographic data, consumer behavior, and location history of the user in order to derive more meaningful product recommendations. Our RS has undergone field trials as well as formal laboratory evaluation tests demonstrating higher accuracy and relevance of …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:pxXbYLTb8EgC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Lowest-ID with adaptive ID reassignment: a novel mobile ad-hoc networks clustering algorithm",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1613559/",
            "Abstract": "Clustering is a promising approach for building hierarchies and simplifying the routing process in mobile ad-hoc network environments. The main objective of clustering is to identify suitable node representatives, i.e. cluster heads (CHs), to store routing and topology information and maximize clusters stability. Traditional clustering algorithms suggest CH election exclusively based on node IDs or location information and involve frequent broadcasting of control packets, even when network topology remains unchanged. More recent works take into account additional metrics (such as energy and mobility) and optimize initial clustering. However, in many situations (e.g. in relatively static topologies) re-clustering procedure is hardly ever invoked; hence initially elected CHs soon reach battery exhaustion. Herein, we introduce an efficient distributed clustering algorithm that uses both mobility and energy metrics to …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "LIDAR: a protocol for stable and energy-efficient clustering of ad-hoc multihop networks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-007-9053-1",
            "Abstract": " Clustering has been proposed as a promising method for simplifying the routing process in mobile ad hoc networks (MANETs). The main objective in clustering is to identify suitable node representatives, i.e. cluster heads (CHs) to store routing and topology information; CHs should be elected so as to maximize clusters stability, that is to prevent frequent cluster re-structuring. Since CHs are engaged on packet forwarding they are prone to rapidly drop their energy supplies, hence, another important objective of clustering is to prevent such node failures. Recently proposed clustering algorithms either suggest CH election based on node IDs (nodes with locally lowest ID value become CHs) or take into account additional metrics (such as energy and mobility) and optimize initial clustering. Yet, the former method is biased against nodes with low IDs (which are likely to serve as CHs for long periods and …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Efficient binary and grey level morphological operations on a massively parallel processor",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/1063719042000208845",
            "Abstract": "One of the most important features in image analysis and understanding is shape. Mathematical morphology is the image processing branch that deals with shape analysis. The definition of all morphological transformations is based on two primitive operations, i.e. dilation and erosion. Since many applications require the solution of morphological problems in real time, researching time efficient algorithms for these two operations is crucial.  In this paper, efficient algorithms for the binary as well as the grey level dilation and erosion are presented and evaluated for an advanced associative processor. It is shown through simulation results that the above architecture is near optimal in the binary case and is also as efficient as the array processor with a 2D-mesh interconnection in the grey level case. Finally, it is proven that the implementation of this image processing machine is economically feasible.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Taylor & Francis GroupAbingdon, UK"
        },
        {
            "Title": "eCOMPASS–TR–047",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=12739787765330849521&hl=en&oi=scholarr",
            "Abstract": "In this paper we study the Arc Orienteering Problem in directed and undirected graphs. To the best of our knowledge, we give the fist approximation algorithms for both the undirected and the directed versions of the problem. Our main results are the following:(i) We give an O (log2 (m) log log (m))− approximation algorithm for the AOP in directed graphs, where m is the number of arcs of the graph of the problem, using the O (log2 (n) log log (n))− approximation for the OP in directed graphs found in [13].(ii) Using the (2+ ϵ)− approximation algorithm for the unweighted version of the OP in [6], we obtain a (6+ ϵ+ o (1))− approximation algorithm for the AOP in undirected graphs and a (4+ ϵ)− approximation algorithm for the unweighted version of the AOP in undirected graphs. Moreover, we prove that the Mixed Orienteering Problem (MOP) can be reduced to AOP and that any approximation algorithm for the AOP yields an approximation algorithm for the MOP.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:j8pvxH-kN2QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hands-on experiences in deploying cost-effective ambient-assisted living systems",
            "Publication year": 2015,
            "Publication url": "https://www.mdpi.com/102714",
            "Abstract": "Older adults’ preferences to remain independent in their own homes along with the high costs of nursing home care have motivated the development of Ambient Assisted Living (AAL) technologies which aim at improving the safety, health conditions and wellness of the elderly. This paper reports hands-on experiences in designing, implementing and operating UbiCare, an AAL based prototype system for elderly home care monitoring. The monitoring is based on the recording of environmental parameters like temperature and light intensity as well as micro-level incidents which allows one to infer daily activities like moving, sitting, sleeping, usage of electrical appliances and plumbing components. The prototype is built upon inexpensive, off-the-shelf hardware (eg, various sensors, Arduino microcontrollers, ZigBee-compatible wireless communication modules) and license-free software, thereby ensuring low system deployment costs. The network comprises nodes placed in a house’s main rooms or mounted on furniture, one wearable node, one actuator node and a centralized processing element (coordinator). Upon detecting significant deviations from the ordinary activity patterns of individuals and/or sudden falls, the system issues automated alarms which may be forwarded to authorized caregivers via a variety of communication channels. Furthermore, measured environmental parameters and activity incidents may be monitored through standard web interfaces. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:ZysSsiWj_g4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Eco-aware vehicle routing in urban environments",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8024531/",
            "Abstract": "Mobility of people and goods in urban environments raises several quality and sustainability concerns. While ICTs have established the ground for developing intelligent transport services, their effective use for supporting cleaner urban mobility still represents a major research challenge. The eCOMPASS research project addressed this challenge through introducing new mobility concepts and establishing a methodological framework for route planning optimization, delivering a comprehensive set of innovative tools and services for end-users to enable eco-awareness in urban transport. eCOMPASS innovative tools are based on new algorithmic technology concerning tools and methods for vehicle routing (cars and vehicle fleets) and multimodal human mobility for city dwellers and tourists. eCOMPASS involved a generic architecture that considered all types and scenarios of human and goods mobility in urban …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:feST4K8J0scC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobility in Wireless Sensor Networks",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Damianos-Gavalas/publication/262154777_Mobility_in_Wireless_Sensor_Networks/links/572c556d08aef5d48d334135/Mobility-in-Wireless-Sensor-Networks.pdf",
            "Abstract": "Wireless Sensor Networks (WSNs) offer unprecedented capabilities for integrating sensing with computing and communication as well as for distributed sensing, coordination and control. While WSNs have been a subject of intensive research for about a decade, most research activities to date focus on sensor nodes that are deployed in static, pre‐determined locations with sensor readings taken at regular intervals and with packet forwarding that take place in multiple hops to sinks where storage and analysis takes place. The next step for sensor networks is to handle mobility in all possible forms. Thus we need to consider the mobility of sinks, mobility of sensors and of actuators as well as the mobility of software.This extension towards mobility‐enhanced WSNs represents an emerging subject in sensor networking research that opens up a new opportunities and challenges, and significantly expands the types and broadness of WSN applications. In particular, mobility has brought a series of research topics into the spotlight, such as: sink mobility; mobile sensor‐actuator networks; code mobility and remote sensors programmability; mobile agent‐based data aggregation; mobility‐assisted communication; topology coverage and connectivity maintenance through mobile elements; mobility management; mobility models for sinks and actuators; MAC and routing protocols for WSNs incorporating mobile elements; data aggregation, fusion, dissemination and synchronization techniques in WSNs with mobile elements; security, privacy and trust issues; applications, testbeds and deployment experiences.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scenic route planning for tourists",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00779-016-0971-3.pdf",
            "Abstract": "Tourists visiting unknown destinations become increasingly dependent on mobile city guides to locate tourist services and retrieve informative content about nearby points of interest (POIs). Several mobile guides already support the provision of personalized tour recommendations to assist tourists in making feasible plans and visiting the most interesting POIs within their available time. However, existing tourist tour planners only regard available attractions as sites lacking physical dimensions (i.e., POIs are treated as ‘points’). This restricts the modeling of POIs as attractions that may be entered/exited from a certain location (e.g., the main entrance). Although this is adequate for scheduling visits at museums, galleries, small squares or parks with single entry points, it fails to capture practical properties of typical tourist visiting styles in urban destinations. Tourists commonly appreciate strolling through …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:e3CVSTJ63dQC",
            "Publisher": "Springer London"
        },
        {
            "Title": "An image processing inspired mobile sink solution for energy efficient data gathering in wireless sensor networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-014-0779-x",
            "Abstract": "This paper presents a gradient-based multi-hop clustering protocol combined with a mobile sink (MS) solution for efficient data gathering in wireless sensor networks. The main insight for the clustering algorithm is drawn from image processing field and namely from the watershed transform, widely used for image segmentation. The proposed algorithm creates multi-hop clusters whose cluster heads (CHs) as well as cluster members near the CHs have high energy reserves. Specifically, the energy of the sensors in a cluster increases progressively as getting closer to the CH. As the nodes closer to the CH are most burdened with relaying of data from other cluster members, the higher levels of available energy at these nodes prolong the network lifetime eventually. After cluster formation, a MS periodically visits each CH and collects the data from cluster members already gathered at the CH. Simulation …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:oAywNP-vUhwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "CBID: A Scalable Method for Distributed Data Aggregation in WSNs",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=16785735516225592109&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:_IsBomjs8bsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey on jamming attacks and countermeasures in WSNs",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5343062/",
            "Abstract": "Jamming represents the most serious security threat in the field of wireless sensor networks (WSNs), as it can easily put out of order even WSNs that utilize strong highlayer security mechanisms, simply because it is often ignored in the initial WSN design. The objective of this article is to provide a general overview of the critical issue of jamming in WSNs and cover all the relevant work, providing the interested researcher pointers for open research issues in this field. We provide a brief overview of the communication protocols typically used in WSN deployments and highlight the characteristics of contemporary WSNs, that make them susceptible to jamming attacks, along with the various types of jamming which can be exercised against WSNs. Common jamming techniques and an overview of various types of jammers are reviewed and typical countermeasures against jamming are also analyzed. The key ideas of …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A location history-aware retail product recommender system",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8923403/",
            "Abstract": "Mobile Context-Aware Recommender Systems (CARS) have recently emerged aiming at generating recommendations relevant to the specific environmental and situational usage context. This article reports on the design and implementation of a collaborative filtering-based mobile CARS, developed as part of an e-platform that supports location-based search for retail products and services sold by nearby physical retailer shops. In addition to the current user location, our RS considers a multitude of contextual factors like time, season, demographic data, consumer behavior, and location history of the user in order to derive more meaningful product recommendations. The RS has been tested on real operational environments as well as on lab evaluation trials demonstrating higher accuracy and relevance of recommendations against two baseline approaches.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:TiIbgCYny7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polyvalent Parallelizations for Hierarchical Block Matching Motion Estimation",
            "Publication year": 2000,
            "Publication url": "https://hrcak.srce.hr/index.php?show=clanak&id_clanak_jezik=69478",
            "Abstract": "Block matching motion estimation algorithms are widely used in video coding schemes. In this paper, we design an efficient hierarchical block matching motion estimation (HBMME) algorithm on a hypercube multiprocessor. Unlike systolic array designs, this solution is not tied down to specific values of algorithm parameters and thus offers increased flexibility. Moreover, the hypercube network can efficiently handle the non regular data flow of the HBMME algorithm. Our techniques nearly eliminate the occurrence of “difficult” communication patterns, namely many-to-many personalized communication, by replacing them with simple shift operations. These operations have an efficient implementation on most of interconnection networks and thus our techniques can be adapted to other networks as well. With regard to the employed multiprocessor we make no specific assumption about the amount of local memory residing in each processor. Instead, we introduce a free parameter S and assume that each processor has O (S) local memory. By doing so, we handle all the cases of modern multiprocessors, that is fine-grained, medium-grained and coarse-grained multiprocessors and thus our design is quite general.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:M3ejUd6NZC8C",
            "Publisher": "SRCE-Sveučilišni računski centar"
        },
        {
            "Title": "A personalized multimodal tourist tour planner",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2677972.2677977",
            "Abstract": "Tourists become increasingly dependent on mobile city guides to locate tourist services and retrieve information about nearby points of interest (POIs) when visiting unknown destinations. Although several city guides support the provision of personalized tour recommendations to assist tourists visiting the most interesting attractions, existing tour planners only consider walking tours. Herein, we introduce eCOMPASS, a context-aware mobile application which also considers the option of using public transit for moving around. Far beyond than just providing navigational aid, eCOMPASS incorporates multimodality (ie time dependency) within its routing logic aiming at deriving near-optimal sequencing of POIs along recommended tours so as to best utilize time available for sightseeing and minimize waiting time at transit stops. Further advancing the state of the art, eCOMPASS allows users to define arbitrary start/end …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:eAUscmXIlQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Efficient and Scalable Clustering Algorithm for Wireless Ad Hoc Networks.",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/49799782/An_Efficient_and_Scalable_Clustering_Alg20161022-18472-n8569y.pdf",
            "Abstract": "Organization, scalability and routing have been identified as key problems hindering viability and commercial success of mobile ad hoc networks. Clustering of mobile nodes among separate domains has been proposed as an efficient approach to address those issues. In this work, we introduce an efficient distributed clustering algorithm that uses both location and energy metrics for stable cluster formation. Unlike existing active clustering methods, out algorithm relieves the network from the unnecessary burden of control messages broadcasting. This is achieved through adapting broadcast period according to mobile nodes mobility pattern. For relative static network topologies, broadcast period is lengthened. In contrast, broadcast period is shortened to meet the requirements of highly dynamic networks for consistent cluster configurations.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling, Computing and Data Handling Methodologies for Maritime Transportation",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-61801-2.pdf",
            "Abstract": "Maritime transportation is a major conduit of international trade. In terms of cost, maritime transport is very competitive against land and airborne transport, increasing only by a few percent the total product cost. On the other hand, it takes longer and may cause harbor congestion which may further increase the voyage time. Furthermore, there are difficulties in integrating this transportation mode efficiently with other transport or distribution options. On top of these, the safety and the environmental impact of maritime transportation, in particular in the case of sea accidents, are always two challenging issues. Recent advances on maritime transportation require the synergy of both computer and maritime science. Computational intelligence, data mining and knowledge discovery/representation, risk assessment methodologies, as well as combinatorial optimization are the IT fields that have gained significant interest in …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:ehoypfNsBj8C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "An iterated local search approach for multiple itinerary planning in mobile agent-based sensor fusion",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7420918/",
            "Abstract": "The investigation of mobile agent (MA) middleware as a technology for implementing efficient data fusion schemes on wireless sensor networks (WSN) has been a subject of intense research in the past few years. Nevertheless, the itineraries followed by travelling MAs largely determine the overall performance of the data fusion applications. Along this line, this article introduces a novel algorithmic approach for efficient itinerary planning of MA objects engaged in data fusion tasks. Our algorithm adopts an iterated local search (ILS) approach in deriving the hop sequence of multiple travelling MAs over the deployed source nodes. Simulation results demonstrate the performance gain of our method against existing multiple MA itinerary planning methods.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:tgTmbKTkO1IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An optimization model for the strategic design of a bicycle sharing system: A case study in the city of Athens",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003784",
            "Abstract": "Bicycle sharing systems comprise fleets of bicycles made available for shared use at low cost. Bicycles are distributed in stations spread within an urban area and may be picked up and dropped off at any station under flexible short-term rental schemes. The design of bicycle sharing systems raises several optimization problems as it involves the determination of the number, capacity and location of bicycle station facilities as well as the bicycle fleet size along with the allocation of bicycles among stations. These design decisions are subject to several variables, restrictions and dependencies, such as the predicted user demand patterns, the synergies among the bicycle sharing system and the public transportation network, the budget available for setting up the system, etc. In this paper we investigate the problem of the strategic design of bicycle sharing systems. We develop and solve a mathematical model for …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:E8ajGqO0XoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile sinks for information retrieval from cluster-based wsn islands",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04383-3_16",
            "Abstract": "Mobile sinks (MS) mounted upon urban vehicles with fixed trajectories (e.g. buses) provide the ideal infrastructure to effectively retrieve sensory data from isolated Wireless Sensor Network (WSN) fields. Existing approaches involve either single-hop transfer of data from sensors that lie within the MS’s range or heavy involvement of network periphery nodes in data retrieval, processing, buffering and delivering tasks. These nodes run the risk of rapid energy exhaustion resulting in loss of network connectivity. Our proposed protocol aims at minimizing the overall network overhead and energy expenditure associated with the multi-hop data retrieval process while also ensuring balanced energy consumption among network nodes and prolonged network lifetime. This is achieved through building cluster structures consisted of member nodes that route their measured data to their assigned cluster head (CH …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Employing mobile elements for delay-constrained data gathering in WSNs",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128618300732",
            "Abstract": "In this paper, we present rendezvous-based data gathering protocols for wireless sensor networks employing multiple mobile elements. For satisfying timely delivery of sensory data to the base station, the mobile elements are forced to visit only an appropriate number of rendezvous nodes while the remaining sensor nodes send their data through multi-hop communication toward these nodes. The proposed techniques achieve prolonged network lifetime by (i) selecting as rendezvous nodes sensor nodes from energy rich network neighborhoods that are appropriately distributed across the network, especially in regions where increased energy consumption has been observed and (ii) building energy efficient routes for all sensor nodes of the network toward the trajectories of the mobile elements. We also conducted simulation tests which confirm the effectiveness of the proposed protocols.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:BCdnXsLIVDwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "User-Directed, Cluster-Based Retrieval for Large Document Collections in Highly Parallel Environments.",
            "Publication year": 2012,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=10765204&AN=74260833&h=vsH7AnI1HeBnNyySTh1lHDnMSzrMXeDqiWQPqFlYyU3bIjWQ7o%2Fezm902PLCUn3zSP6wOddxC3eYWGqhK01dlQ%3D%3D&crl=c",
            "Abstract": "Advances in personalization technology have resulted in the integration of personalization features in a lot of environments; among else, websites and document management systems consider the integration of personalization features as indispensable functionality. However, for large document collections it is difficult for the user to direct effective queries from the beginning of his/her search, since accurate query terms may not be known in advance. Therefore, we propose a hybrid approach that focuses on two directions toward the identification of most related information to the user's demands: at the initiation of the user-system interaction the system applies personalization techniques based on user modeling to initiate the search on a large document and multimedia content collection; next the query is further refined using a clustering based approach which after processing a subcollection of documents presents …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:HqhvjgTjE9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The eCOMPASS multimodal tourist tour planner",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417415003826",
            "Abstract": "Tour planning represents a challenging task for individuals visiting unfamiliar tourist destinations, mainly due to the availability of numerous attractions (points of interest, POIs) and the complexity of metropolitan public transit networks. Several web and mobile tourist city guides already support personalized tour recommendations. However, they exclusively consider walking tours; namely, they fail in motivating tourists to use public transportation for reaching far located important POIs, thereby compromising the perceived overall attractiveness of recommended tours. In this paper, we introduce eCOMPASS, a context-aware web/mobile application which derives personalized multimodal tours via selected urban attractions. eCOMPASS is the only available research or commercial tour planner that assists the way arounds of tourists through public transit. Far beyond than just providing navigational aid, eCOMPASS …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:oynPyU19kbsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Optimizing Relocation Cost in Free-Floating Car-Sharing Systems",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9113338/",
            "Abstract": "This paper addresses the problem of operator-based vehicle repositioning in free-floating electric car-sharing systems (FFCSs). New algorithmic techniques are developed which derive cost-effective relocation tours by primarily minimizing relocation drivers’ walking time. Car repositioning takes place overnight and aims at complete rebalancing of the system i.e., at achieving an optimal, based on user demand, cars distribution among non-overlapping cells of the FFCS’s operating area. The battery level of the electric cars is also taken into account when deciding if and where each car will be relocated. If     is the number of employees handling car relocations from oversupplied to undersupplied regions, when     i.e., there exists a single employee carrying out a relocation tour comprising alternating phases of a car relocation followed by walking to the next to be relocated car, we define and solve the Minimum Walking …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:WM2K3OHRCGMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey on mobile tourism recommender systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6579536/",
            "Abstract": "Recommender Systems (RS) have been increasingly common in web applications seeking to predict content items of potential interest to users. Among others, RSs have been successfully applied in e-tourism applications, offering travel recommendations. The emerging mobile RSs are tailored to mobile users and promise to substantially enrich tourist experiences. New developments in mobile and pervasive computing technologies leverage massive opportunities to provide accurate personalized tourist recommendations that capture several contextual parameters. This article presents a state-of-the-art in the field, proposing a classification of mobile tourism RSs and providing insights on their offered services. It also highlights promising research opportunities with respect to mobile RSs employed in tourism.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting the cloning capability of Mobile Agents for cost-effective data fusion in wireless sensor networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4625721/",
            "Abstract": "Mobile agents (MAs) have been initially developed to replace the client/server model which shows many disadvantages in WSN environments (e.g. very high bandwidth and energy utilization). Herein, we present CBID (Clone-Based Itinerary Design), a novel algorithm that calculates near-optimal routes for MAs that incrementally fuse the data as they visit the nodes while enabling a fast update of designed itineraries which is especially important for highly dynamic topologies. The order of visited nodes highly affects the quality and the overall cost of data fusion. The key MAs characteristic exploited by CBID to reduce energy consumption and response time is their cloning capability. Parallel dispatched MAs sequentially visit sensor nodes arranged in tree structures and upon visiting a node with two or more child nodes, the MAs (master MAs) clone of themselves with each clone (slave MA) visiting a tree branch …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and management of vehicle-sharing systems: a survey of algorithmic approaches",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128034545000134",
            "Abstract": "Vehicle (bike or car) sharing represents an emerging transportation scheme which may comprise an important link in the green mobility chain of smart city environments. This chapter offers a comprehensive review of algorithmic approaches for the design and management of vehicle-sharing systems. Our focus is on one-way vehicle-sharing systems (wherein customers are allowed to pick-up a vehicle at any location and return it to any other station) which best suit typical urban journey requirements. Along this line, we present methods dealing with the so-called asymmetric demand–offer problem (ie, the unbalanced offer and demand of vehicles) typically experienced in one-way sharing systems which severely affects their economic viability as it implies that considerable human (and financial) resources should be engaged in relocating vehicles to satisfy customer demand. The chapter covers all planning aspects …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:nU66GSXDKhoC",
            "Publisher": "Morgan Kaufmann"
        },
        {
            "Title": "A mobility aware technique for clustering on mobile ad-hoc networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11947950_45",
            "Abstract": "Clustering for mobile ad-hoc networks (MANETs) has attracted the interest of many researchers as it offers enhanced scalability and performance improvement. The main challenge of the clustering algorithms is the formation of stable clusters despite the topological changes due to the host mobility. In this paper, we present a novel clustering algorithm, which first predicts the future host mobility and then uses this information to build a stable clustering structure over hosts that will probably exhibit low mobility in the future. In this way, long lifetime for the clustering structure is guaranteed, thereby eliminating the need for frequent reclustering. For predicting the future host mobility, we use provably good information theoretic techniques, which allow on-line learning of a reliable probabilistic model for future mobility.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Approximation algorithms for the arc orienteering problem",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002001901400218X",
            "Abstract": "In this article we present approximation algorithms for the Arc Orienteering Problem (AOP). We propose a polylogarithmic approximation algorithm in directed graphs, while in undirected graphs we give a (6+ ϵ+ o (1)) and a (4+ ϵ)-approximation algorithm for arbitrary instances and instances of unit profit, respectively. Also, an inapproximability result for the AOP is obtained as well as approximation algorithms for the Mixed Orienteering Problem.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:8p8iYwVyaVcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "New techniques for incremental data fusion in distributed sensor networks",
            "Publication year": 2007,
            "Publication url": "http://pci2007.upatras.gr/proceedings/PCI2007_volB/B_599-608_Gavalas.pdf",
            "Abstract": "The use of mobile agents for data fusion in wireless sensor networks has been recently proposed in the literature to answer the scalability problem of client/server model. In this article, we consider the problem of calculating a near-optimal route for a mobile agent that incrementally fuses the data as it visits the nodes in a distributed sensor network. The order of visited nodes affects not only the quality but also the overall cost of data fusion. We propose two heuristic algorithms that adapt methods usually applied in network design problems in the specific requirements of sensor networks. They suggest the proper number of MAs that minimizes the overall data fusion cost and construct near-optimal itineraries for each of them.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient primitive binary morphological algorithms on a massively parallel processor",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Journal-of-Electronic-Imaging/volume-10/issue-2/0000/Efficient-primitive-binary-morphological-algorithms-on-a-massively-parallel-processor/10.1117/1.1344185.short",
            "Abstract": "One of the most important features in image analysis and understanding is shape. Mathematical morphology is the image processing branch that deals with shape analysis. The definition of all morphological transformations is based on two primitive operations, ie, dilation and erosion. Since many applications require the solution of morphological problems in real time, researching time efficient algorithms for these two operations is crucial. In this paper, efficient algorithms for the binary dilation and erosion are presented and evaluated for an advanced associative processor. Simulation results show that the proposed algorithms for this advanced architecture reach a near optimal speedup compared to the serial algorithm. Additionally, it is proven that the implementation of this image processor is economically feasible.© 2001 SPIE and IS&T.[DOI: 10.1117/1.1344185]",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:dhFuZR0502QC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Watershed-based clustering for energy efficient data gathering in wireless sensor networks with mobile collector",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-32820-6_75",
            "Abstract": "This paper presents a clustering protocol combined with a mobile sink (MS) solution for efficient data gathering in wireless sensor networks (WSNs). The main insight for the cluster creation method is drawn from image processing field and namely from the watershed transformation which is widely used for image segmentation. The proposed algorithm creates multi-hop clusters whose clusterheads (CHs) as well as all cluster members near the CHs have high energy reserves. As these are exactly the nodes most burdened with relaying of data from other cluster members, the higher levels of available energy at these nodes prolong the network lifetime eventually. After cluster creation, a MS periodically visits each CH and collects the data from cluster members already gathered at the CH. Simulation results show the higher performance of the proposed scheme in comparison to other competent approaches …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An approach for near-optimal distributed data fusion in wireless sensor networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-009-0211-0",
            "Abstract": "In wireless sensor networks (WSNs), a lot of sensory traffic with redundancy is produced due to massive node density and their diverse placement. This causes the decline of scarce network resources such as bandwidth and energy, thus decreasing the lifetime of sensor network. Recently, the mobile agent (MA) paradigm has been proposed as a solution to overcome these problems. The MA approach accounts for performing data processing and making data aggregation decisions at nodes rather than bring data back to a central processor (sink). Using this approach, redundant sensory data is eliminated. In this article, we consider the problem of calculating near-optimal routes for MAs that incrementally fuse the data as they visit the nodes in a WSN. The order of visited nodes (the agent’s itinerary) affects not only the quality but also the overall cost of data fusion. Our proposed heuristic algorithm adapts …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The Effect of Interword Connectivity in Associative Processing",
            "Publication year": 2000,
            "Publication url": "https://scpe.org/index.php/scpe/article/view/190",
            "Abstract": "Technology advances enable the design of powerful associative processors. Conventional approaches have resulted in architectures, which can store multiple numbers (fields) in a single memory word and can perform arithmetic operations within each word in parallel. Currently, interword communication for parallel processing is performed over a simple interconnect such as a star network with the comparand register as the hub. We follow an alternative approach and we focus on improved interword connectivity rather than highly sophisticated memory word structures. We introduce an associative processor with a single-stage hypercube interconnection among memory words, and with the word-network interface providing routing function and small buffering (two field-size memory buffers, one for transmission and one for reception). This leads to an efficient, low-cost system that allows parallel data transfers and …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Benchmarking mobile agent itinerary planning algorithms for data aggregation on WSNs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6876759/",
            "Abstract": "Mobile agents (MAs) have been proposed as a distributed middleware approach suitable for autonomic data aggregation operations in Wireless Sensor Networks (WSN). Determining optimal itineraries for MAs traveling through WSN nodes is a non-trivial problem. Thus, several heuristics have been proposed to perform efficient itinerary planning for MAs. However, the evaluation of these heuristics is typically performed on the ground of different parameter spaces and assumptions about the underlying network and the capabilities of nodes. Herein, we implement, simulate and compare the most prominent itinerary planning algorithms upon a common parameter space, making realistic network-level assumptions.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:ufKn5pxu7C0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient delay-constrained data collection in wireless sensor networks using mobile sinks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7396674/",
            "Abstract": "In this paper, we present a data collection protocol for wireless sensor networks employing a number of mobile sinks. For satisfying timely delivery of sensory data to mobile sinks, sinks are forced to visit only an appropriate number of rendezvous nodes while the remaining nodes send their data through multi-hop communication toward these nodes. The proposed approach achieves prolonged network lifetime by selecting energy rich paths for this multi-hop communication while the sink tours are not longer than a certain limit. Experimental results also validate the effectiveness of our approach compared with other competitive approaches from the literature.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:GtqhT-R7ZnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Clustering in wireless sensor networks",
            "Publication year": 2009,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420077780-18/clustering-wireless-sensor-networks-basilis-mamalis-damianos-gavalas-charalampos-konstantopoulos-grammati-pantziou",
            "Abstract": "The use of wireless sensor networks (WSNs) has grown enormously in the last decade, pointing out the crucial need for scalable and energy-efficient routing and data gathering and aggregation protocols in corresponding large-scale environments. Hierarchical clustering protocols (as opposed to direct single-tier communication schemes) have extensively been used toward the above directions. Moreover, they can greatly contribute to overall system scalability, lifetime, and energy efficiency. In this chapter the state of the art in corresponding hierarchical clustering approaches for large-scale WSN environments is presented. The need for clustering in WSNs is first motivated and a brief description of the implied hierarchical network pattern is given. The basic advantages, objectives, and design challenges are also briefly explored. A set of appropriate taxonomy parameters as well as a global classification scheme is …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:5nxA0vEk-isC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Optimal embedding of the hypercube on partitioned optical passive stars networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11549468_104",
            "Abstract": "Partitioned Optimal Passive Stars network, POPS(d,g), is an optical interconnection network of N processors (N=dg) which uses g 2 optical passive star couplers. The processors of this network are partitioned into g groups of d processors each and the g 2 couplers are used for connecting each group with each of the groups, including itself. In this paper, we present an optimal embedding of the hypercube on this network for all combinations of values of d and g. Specifically, we show how to optimally simulate the most common hypercube communication pattern where each hypercube node sends a packet along the same dimension. Optimal simulation of this communication on the POPS(d,g) network has already been presented for d ≤ g in the literature, but for the case d> g, the optimality remained an open problem. Now, we show that an optimal simulation is feasible in this case …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Clustering in mobile ad hoc networks through neighborhood stability-based mobility prediction",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128608000923",
            "Abstract": "Clustering for mobile ad hoc networks (MANETs) offers a kind of hierarchical organization by partitioning mobile hosts into disjoint groups of hosts (clusters). However, the problem of changing topology is recurring and the main challenge in this technique is to build stable clusters despite the host mobility. In this paper, we present a novel clustering algorithm, which guarantees longer lifetime of the clustering structure in comparison to other techniques proposed in the literature. The basis of our algorithm is a scheme that accurately predicts the mobility of each mobile host based on the stability of its neighborhood (i.e., how different is its neighborhood over time). This information is then used for creating each cluster from hosts that will remain neighbors for sufficiently long time, ensuring the formation of clusters that are highly resistant to host mobility. For estimating the future host mobility, we use provably good …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Minimizing the fuel consumption and the risk in maritime transportation: A bi-objective weather routing approach",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0305054817301934",
            "Abstract": "The paper presents an improved solution to the ship weather routing problem based on an exact time-dependent bi-objective shortest path algorithm. The two objectives of the problem are the minimization of the fuel consumption and the total risk of the ship route while taking into account the time-varying sea and weather conditions and an upper bound on the total passage time of the route. Safety is also considered by applying the guidelines of the International Maritime Organization (IMO). As a case study, the proposed algorithm is applied for finding ship routes in the area of the Aegean Sea, Greece. Enhancements of the proposed algorithm are also presented which improve the efficiency of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:KqnX2w3egDsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A rendezvous-based approach enabling energy-efficient sensory data collection with mobile sinks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6030870/",
            "Abstract": "A large class of Wireless Sensor Networks (WSN) applications involve a set of isolated urban areas (e.g., urban parks or building blocks) covered by sensor nodes (SNs) monitoring environmental parameters. Mobile sinks (MSs) mounted upon urban vehicles with fixed trajectories (e.g., buses) provide the ideal infrastructure to effectively retrieve sensory data from such isolated WSN fields. Existing approaches involve either single-hop transfer of data from SNs that lie within the MS's range or heavy involvement of network periphery nodes in data retrieval, processing, buffering, and delivering tasks. These nodes run the risk of rapid energy exhaustion resulting in loss of network connectivity and decreased network lifetime. Our proposed protocol aims at minimizing the overall network overhead and energy expenditure associated with the multihop data retrieval process while also ensuring balanced energy …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Efficient Scheme for Dynamic Car Relocation in Free-Floating Car-Sharing Systems",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9071681/",
            "Abstract": "In this paper, a new scheme for dynamic relocation in free floating car sharing systems is proposed. First, a heuristic approach is presented for designing a car relocation plan which achieves a better balance between supply and demand in such a system within strict time limits. As being heuristic, the algorithm is fast, further aiding in maintaining fast responsiveness in dynamic scenarios. Furthermore, an on-fly-correction of the original relocation plan is also presented for dealing with changes in car distribution happening in the system due to its concurrent use by the users. Thus, the relocation plan is still effective even in the case that the predictions of future user movements are not accurate.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:1paMEeroeoQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evolutionary computation for the ship routing problem",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-61801-2_4",
            "Abstract": "In this chapter, we present evolutionary algorithms for solving the real time ship weather routing problem. The objectives to be minimized are the mean total risk and fuel cost incurred along the obtained route while considering the time-varying sea and weather conditions and also a constraint on the total passage time of the route. In addition, for achieving a high safety level the proposed approaches should return only solutions compliant with the guidelines of the International Maritime Organization (IMO). Two different well-known genetic algorithms, namely SPEA2 and NSGA-II are applied to the ship routing problem and a comparative performance evaluation of the two algorithms is performed. The proposed approaches are tested on real data and compared with an exact algorithm which solves the same problem.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:4E1Y8I9HL1wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Mobile recommender systems in tourism",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804513001094",
            "Abstract": "Recommender Systems (RSs) have been extensively utilized as a means of reducing the information overload and offering travel recommendations to tourists. The emerging mobile RSs are tailored to mobile device users and promise to substantially enrich tourist experiences, recommending rich multimedia content, context-aware services, views/ratings of peer users, etc. New developments in mobile computing, wireless networking, web technologies and social networking leverage massive opportunities to provide highly accurate and effective tourist recommendations that respect personal preferences and capture usage, personal, social and environmental contextual parameters. This article follows a systematic approach in reviewing the state-of-the-art in the field, proposing a classification of mobile tourism RSs and providing insights on their offered services. It also highlights challenges and promising research …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Efficient metaheuristics for the mixed team orienteering problem with time windows",
            "Publication year": 2016,
            "Publication url": "https://www.mdpi.com/123398",
            "Abstract": "Given a graph whose nodes and edges are associated with a profit, a visiting (or traversing) time and an admittance time window, the Mixed Team Orienteering Problem with Time Windows (MTOPTW) seeks for a specific number of walks spanning a subset of nodes and edges of the graph so as to maximize the overall collected profit. The visit of the included nodes and edges should take place within their respective time window and the overall duration of each walk should be below a certain threshold. In this paper we introduce the MTOPTW, which can be used for modeling a realistic variant of the Tourist Trip Design Problem where the objective is the derivation of near-optimal multiple-day itineraries for tourists visiting a destination which features several points of interest (POIs) and scenic routes. Since the MTOPTW is a NP-hard problem, we propose the first metaheuristic approaches to tackle it. The effectiveness of our algorithms is validated through a number of experiments on POI and scenic route sets compiled from the city of Athens (Greece). View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:xa5BkEQK8BgC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Efficient parallel text retrieval techniques on bulk synchronous parallel (BSP)/coarse grained multicomputers (CGM)",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-008-0225-x",
            "Abstract": "In this paper, we present efficient, scalable, and portable parallel algorithms for the off-line clustering, the on-line retrieval and the update phases of the Text Retrieval (TR) problem based on the vector space model and using clustering to organize and handle a dynamic document collection. The algorithms are running on the Coarse-Grained Multicomputer (CGM) and/or the Bulk Synchronous Parallel (BSP) model which are two models that capture within a few parameters the characteristics of the parallel machine. To the best of our knowledge, our parallel retrieval algorithms are the first ones analyzed under these specific parallel models. For all the phases of the proposed algorithms, we analytically determine the relevant communication and computation cost thereby formally proving the efficiency of the proposed solutions. In addition, we prove that our technique for the on-line retrieval phase performs …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Incentivization schemes for vehicle allocation in one-way vehicle sharing systems",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7580857/",
            "Abstract": "The major operational problem in one-way vehicle sharing systems is the vehicle stock imbalance problem. In this paper, we address this problem by proposing a new approach for dynamically allocating vehicles to users based on “incentivization” schemes which use reservations to coordinate supply-and-demand mismatches and price incentives for rewarding users, if they accept to pick up their vehicle from an oversupplied station and/or to drop off it to an under-supplied station. The system incentivizes users based on the priorities of vehicle relocations from station to station, taking into account the fluctuating demand for vehicles and parking places at different stations over time. We present two different schemes for incentivizing users to act in favour of the system. Both schemes consider budget constraints and are truthful and budget-feasible. We extensively evaluated our approach through simulations and …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:vjZqxyZ7hS4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimum walking static repositioning in free-floating electric car-sharing systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8569912/",
            "Abstract": "This article presents algorithms for operator-based static repositioning in free-floating car-sharing systems (FFCSs) which derive cost-effective relocation tours. The FFCS fleet may include both electric and conventional cars. Car repositioning takes place overnight and aims at complete rebalancing of the system i.e., at achieving an optimal, based on user demand, distribution of cars among non-overlapping cells of the FFCS operating area. It is also combined with battery recharging of electric cars i.e., the level of battery power is taken into account when deciding if and where each vehicle will be relocated. The Minimum Walking Car Repositioning Problem (MWCRP) is solved whose main objective is to minimize the walking distance in the relocation tours as the walking part of a relocation tour is the most laborious, time-consuming and therefore, the most expensive part compared to the driving one. The MWCRP is …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:IyxfXMz2bNAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Renewable Mobility in Smart Cities: The MOVESMART Approach",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=KpreDwAAQBAJ&oi=fnd&pg=PA135&dq=info:5Vsb4DtQ-_QJ:scholar.google.com&ots=-xBsl3z4B2&sig=TKtRWnTAiPd1s_TtIaBERh8614w",
            "Abstract": "The provision of personalized mobility services in urban environments that combine transportation modalities (electromobility, public transportation, etc.) together with the advent of modern transport models like bike and car sharing is essential for creating efficient sustainable mobility chains for travelers. Such a development presents many challenges related to the route planning in urban traffic networks as well as the offering of innovative features in urban mobility.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:w7CBUyPWg-0C",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Wireless sensor network deployment for remote elderly care monitoring",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2769493.2769539",
            "Abstract": "This paper reports hands-on experiences in designing, implementing and operating a wireless sensor network (WSN)-based prototype system for elderly care monitoring in home environments. The monitoring is based on the recording of environmental parameters like temperature, humidity and light intensity as well as micro-level incidents which allow to infer daily activities like moving, sitting, sleeping, usage of electricity appliances and plumbing components. The prototype is built upon inexpensive, of-the-shelf hardware (eg various sensors, Arduino microcontroller platforms, ZigBee-compatible wireless communication modules) and license-free software, thereby ensuring low system deployment cost. Upon detecting significant deviations from the ordinary activity pattern of individuals and/or sudden falls, the system issues automated alarms which may be forwarded to authorized persons via a variety of …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:4oJvMfeQlr8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stable and energy efficient clustering of wireless ad-hoc networks with LIDAR algorithm",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11872153_9",
            "Abstract": "The main objective of clustering in mobile ad-hoc network environments is to identify suitable node representatives, i.e. cluster heads (CHs) to store routing and topology information; CHs should be elected so as to maximize clusters stability, that is to prevent frequent cluster re-structuring. A popular clustering algorithm (LID) suggests CH election based on node IDs (nodes with locally lowest ID value become CHs). Although fast and simple, this method is biased against nodes with low IDs, which are likely to serve as CHs for long periods and are therefore prone to rapid battery exhaustion. Herein, we propose LIDAR, a novel clustering method which represents a major improvement over traditional LID algorithm: node IDs are periodically re-assigned so that nodes with low mobility rate and high energy capacity are assigned low ID values and, therefore, are likely to serve as CHs. Our protocol also greatly …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Defending wireless sensor networks from jamming attacks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394775/",
            "Abstract": "Wireless sensor networks (WSNs) are used in many applications which often include the monitoring and recording of sensitive information. Hence, their critical importance raises many security concerns. In the context of WSNs, jamming is the type of attack which interferes with the radio frequencies used by network nodes. In the event that an attacker uses a rather powerful jamming source, disruptions of WSNs proper function are likely to occur. As a result, the use of countermeasures against jamming in WSN environments is of immense importance. The main contribution of this article is the discussion of various defence methods against jamming that would allow a WSN to survive and work properly in a hostile jamming environment. Our focus is on frequency hopping spread spectrum (FHSS) and direct sequence spread spectrum (DSSS), two of the most effective countermeasures against jamming. We suggest the …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient algorithm for recommending personalized mobile tourist routes",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/49799749/2012_IET_20Software.pdf",
            "Abstract": "This article deals with the problem of deriving personalized recommendations for daily sightseeing itineraries for tourists visiting any destination. Our approach considers selected places of interest that a traveller would potentially wish to visit and derives a near-optimal itinerary for each day of visit; the places of potential interest are selected based on stated or implied user preferences. Our method enables the planning of customised daily personalised tourist itineraries considering user preferences, time available for visiting sights in daily basis, opening days of sights and average visiting times for these sights. Herein, we propose a heuristic solution to this problem addressed to both web and mobile web users. Evaluation and simulation results verify the competence of our approach against an alternative method.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cluster-based heuristics for the team orienteering problem with time windows",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38527-8_34",
            "Abstract": "The Team Orienteering Problem with Time Windows (TOPTW) deals with deriving a number of tours comprising a subset of candidate nodes (each associated with a “profit” value and a visiting time window) so as to maximize the overall “profit”, while respecting a specified time span. TOPTW has been used as a reference model for the Tourist Trip Design Problem (TTDP) in order to derive near-optimal multiple-day tours for tourists visiting a destination featuring several points of interest (POIs), taking into account a multitude of POI attributes. TOPTW is an NP-hard problem and the most efficient known heuristic is based on Iterated Local Search (ILS). However, ILS treats each POI separately; hence it tends to overlook highly profitable areas of POIs situated far from the current location, considering them too time-expensive to visit. We propose two cluster-based extensions to ILS addressing the aforementioned …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Effective determination of mobile agent itineraries for data aggregation on sensor networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5342418/",
            "Abstract": "A key feature of wireless sensor networks (WSNs) is the collaborative processing, where the correlation existing over the local data of sensor nodes (SNs) is exploited so that the total data volume can be reduced (data aggregation). The use of Mobile Agents (MAs), i.e., software entities able of migrating among nodes and resuming execution naturally, fits in this scenario; the local data of an SN can be combined with the data collected by an MA from other SNs in a way that depends on the specific program code of the MA. In this paper, we consider the problem of calculating near-optimal routes for MAs that incrementally aggregate the data as they visit the nodes in a distributed sensor network. Our algorithm follows a greedy-like approach always selecting the next node to be included in an itinerary in such a way that the cost of the so far formed itineraries is kept minimum at each step. Simulation results confirm the …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient binary morphological algorithms on a massively parallel processor",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/845997/",
            "Abstract": "One of the most important features in image analysis and understanding is shape. Mathematical morphology is the image processing branch that deals with shape analysis. The definition of all morphological transformations is based on two primitive operations, i.e. dilation and erosion. Since many applications require the solution of morphological problems in real time, researching time efficient algorithms for these two operations is crucial. In this paper efficient parallel algorithms for the binary dilation and erosion are presented and evaluated for an advanced associative processor. Simulation results indicate that the achieved speedup is linear.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient event handling protocol for wireless sensor and actor networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6912470/",
            "Abstract": "A critical issue dealt with in Wireless Sensor and Actor Networks (WSANs) is the real time response of actors to events occurring in the network area. The fast notification of actors from Sensor Nodes (SNs) about the events as well as the effective coordination of actors for prompt event handling is most important in these networks. In this paper, we introduce a distributed protocol for effective event handling in a WSAN. Existing approaches mainly favoring actors near the current event for handling it, may lead to highly ineffective solutions for certain worst-case scenarios. Through a randomized approach, our solution also selects distant actors for handling events, and guarantees fast average responsiveness to events and a balanced energy distribution among actors. In addition, it features efficient distributed algorithms for sensor to actor and actor to actor coordination which are of independent interest.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "JAID: An Algorithm for Data Fusion and Jamming Avoidance on Sensor Networks",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Damianos-Gavalas/publication/223517855_JAID_An_algorithm_for_data_fusion_and_jamming_avoidance_on_distributed_sensor_networks/links/5a4bac120f7e9b8284c2d44b/JAID-An-algorithm-for-data-fusion-and-jamming-avoidance-on-distributed-sensor-networks.pdf",
            "Abstract": "Mobile Agent (MA) technology has been recently proposed in Wireless Sensors Networks (WSNs) literature to answer the scalability problem of client/server model in data fusion applications. In this paper, we describe the critical role MAs can play in the field of security and robustness of a WSN in addition to data fusion. The design objective of our Jamming Avoidance Itinerary Design (JAID) algorithm is twofold:(a) to calculate near-optimal routes for MAs that incrementally fuse the data as they visit the nodes;(b) in the face of jamming attacks against the WSN, to modify the itineraries of the MAs to avoid the jammed area (s) while not disrupting the efficient data dissemination from working sensors. If the number of jammed nodes is small, JAID only modifies the pre-jamming scheduled itineraries to increase the algorithm’s promptness. Otherwise, JAID reconstructs the agent itineraries excluding the jammed area (s). Another important feature of JAID is the suppression of data taken from sensors when the associated readings do not change overtime. Data suppression also applies sensors’ readings are identical to those of their neighboring sensors. Simulation results confirm the effectiveness of our proposed algorithm against jamming attacks as well as its performance gain over alternative approaches in data fusion tasks.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:TeJ9juy8vcMC",
            "Publisher": "Technical Report, TR-2007-09-10, Department of Cultural Technology & Communication, University of the Aegean, Greece"
        },
        {
            "Title": "Mobility prediction in mobile ad-hoc networks",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/mobility-prediction-mobile-hoc-networks/45274",
            "Abstract": "A Mobile Ad hoc NETwork (MANET) is a collection of wireless mobile nodes forming a network without using any existing infrastructure. All mobile nodes function as mobile routers that discover and maintain routes to other mobile nodes of the network and therefore, can be connected dynamically in an arbitrary manner. The mobility attribute of MANETs is a very significant one. The mobile nodes may follow different mobility patterns that may affect connectivity, and in turn protocol mechanisms and performance. Mobility prediction may positively affect the service-oriented aspects as well as the application-oriented aspects of ad hoc networking. At the network level, accurate node mobility prediction may be critical to tasks such as call admission control, reservation of network resources, pre-configuration of services and QoS provisioning. At the application level, user mobility prediction in combination with user’s profile …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Mobile agent itinerary planning for WSN data fusion: considering multiple sinks and heterogeneous networks",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.3184",
            "Abstract": "Mobile agent (MA)‐based middleware has been thoroughly investigated in the past few years as a means to address the efficiency, scalability, and reliability issues of data fusion applications on wireless sensor networks. Deriving an efficient itinerary for each MA to follow is of high importance, because itineraries determine to a large extent the overall performance of data fusion tasks. In this article, we present a novel algorithmic approach for efficient itinerary planning of MA objects undertaking data fusion tasks. We adopt a method based on iterated local search to construct the itineraries (ie, visiting sequences of source nodes) assigned to multiple traveling MAs. We apply alternative optimization criteria which aim either at minimizing the overall energy expenditure over all derived MA itineraries or prolonging the network lifetime. Furthermore, we propose algorithmic solutions for 2 realistic settings which have not …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:hEXC_dOfxuUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey on algorithmic approaches for solving tourist trip design problems",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s10732-014-9242-5?sa_campaign=email/event/articleAuthor/onlineFirst&error=cookies_not_supported&code=e9ddebf6-3de9-4230-a2d6-bf8640d10e31",
            "Abstract": "The tourist trip design problem (TTDP) refers to a route-planning problem for tourists interested in visiting multiple points of interest (POIs). TTDP solvers derive daily tourist tours, ie, ordered visits to POIs, which respect tourist constraints and POIs attributes. The main objective of the problem discussed is to select POIs that match tourist preferences, thereby maximizing tourist satisfaction, while taking into account a multitude of parameters and constraints (eg, distances among POIs, visiting time required for each POI, POIs visiting days/hours, entrance fees, weather conditions) and respecting the time available for sightseeing on a daily basis. The aim of this work is to survey models, algorithmic approaches and methodologies concerning tourist trip design problems. Recent approaches are examined, focusing on problem models that best capture a multitude of realistic POIs attributes and user constraints; further …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:IHkkN1K1AlAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Continuous and discrete time label setting algorithms for the time dependent bi-criteria shortest path problem",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=12188891698379785630&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:ybfzIt2tCtgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reactive wireless sensor networks",
            "Publication year": 2013,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=27358406",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:j7XjBeKFbTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ABP: a low-cost, energy-efficient clustering algorithm for relatively static and quasi-static MANETs",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSNet.2008.02271",
            "Abstract": "Clustering techniques have been proposed to construct hierarchies of nodes inside Mobile Ad Hoc Networks (MANETs) thereby increasing their scalability and manageability and reducing the amount of maintained routing information. Herein, we introduce a distributed clustering algorithm that uses both location and energy metrics for cluster formation. Our proposed solution addresses cluster stability, manageability and energy efficiency issues. Unlike existing active clustering methods, our algorithm relieves the network from the unnecessary burden of control messages broadcasting, especially for relatively static and quasi-static network topologies. The efficiency, scalability and competence of our algorithm against alternative approaches have been demonstrated through simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Optimal hypercube simulation on the partitioned optical passive stars network",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-007-0130-8",
            "Abstract": " Partitioned Optimal Passive Stars network, POPS(d,g), is an optical interconnection network of N processors (N=dg) with g 2 optical passive star couplers. In this network, there are g groups of d processors each and the g 2 couplers are used for connecting each group with each of the groups, including itself. In this paper, we present a technique for optimally simulating a frequently arising hypercube communication pattern on this network for all combinations of values of d and g. Specifically, we show that one-hop movements on the hypercube along the same dimension can be simulated on the POPS(d,g) network in    slots for d≠g and in 2 slots for d=g. ",
            "Abstract entirety": 1,
            "Author pub id": "Q0GeDawAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Efficient heuristics for the time dependent team orienteering problem with time windows",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-04126-1_13",
            "Abstract": "The Time Dependent Team Orienteering Problem with Time Windows (TDTOPTW) can be used to model several real life problems. Among them, the route planning problem for tourists interested in visiting multiple points of interest (POIs) using public transport. The main objective of this problem is to select POIs that match tourist preferences, while taking into account a multitude of parameters and constraints and respecting the time available for sightseeing in a daily basis. TDTOPTW is NP-hard while almost the whole body of the related literature addresses the non time dependent version of the problem. The only TDTOPTW heuristic proposed so far is based on the assumption of periodic service schedules. Herein, we propose two efficient cluster-based heuristics for the TDTOPTW which yield high quality solutions, take into account time dependency in calculating travel times between POIs and make no …",
            "Abstract entirety": 0,
            "Author pub id": "Q0GeDawAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Cham"
        }
    ]
}]