[{
    "name": "Χαρούλα Αγγέλη",
    "romanize name": "Charoula Angeli",
    "School-Department": " Education",
    "University": "ucy",
    "Rank": "Καθηγητής",
    "Apella_id": 1884,
    "Scholar name": "Charoula Angeli",
    "Scholar id": "3eOMkcUAAAAJ",
    "Affiliation": "Professor of Instructional Technology, Department of Education, University of Cyprus",
    "Citedby": 7721,
    "Interests": [
        "Instructional Technology",
        "Computers in Education",
        "Technological Pedagogical Content Knowledge"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=3eOMkcUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Andrea Anschuetz studied sociology, education and psychology at the University of Oldenburg (Germany). She works as a research assistant in the project: The influence of immediate feedback on subsequent learning in children. In her doctoral dissertation she examines epistemological beliefs of elementary school children.",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4020-6596-5.pdf#page=10",
            "Abstract": "Donna Berthelsen is a senior lecturer in educational and developmental psychology in the School of Early Childhood at the Queensland University of Technology. She has professional qualifications in teaching and psychology. Donna is engaged in ongoing research projects with her colleague, Joanne Brownlee, that explores the epistemological beliefs of students and practising teachers in early childhood education programs and the relationships between the nature of those beliefs and their teaching practice. Donna is also engaged in other national educational and developmental research projects which are funded by the Australian government focussed on evaluation of early education intervention programs as well as longitudinal research on family and social influences on children’s development and wellbeing at home and school.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teacher education for effective technology integration",
            "Publication year": 2018,
            "Publication url": "http://ijet.itd.cnr.it/article/view/1055",
            "Abstract": "About a decade ago, several researchers used Shulman’s (1986) framework about Pedagogical Content Knowledge (PCK)–a body of knowledge that constitutes a special amalgam of content, pedagogy, learn-ers, and context–as a theoretical basis for developing TPCK or TPACK: a framework for guiding teach-ers’ cognition about technology integration in teaching and learning (Angeli, Valanides, & Christodoulou, 2016). Different models of TPCK/TPACK are proposed in the literature, each with a different focus (on practice, instructional design, context, etc.) and with a different theoretical interpretation about the nature and development of the knowledge that teachers need to have to be able to teach with technology (eg, Angeli & Valanides, 2005, 2009, 2013; Koehler & Mishra, 2008; Niess, 2005). The two dominant TPCK/TPACK models in the literature are the integrative model and the transformative model. The integrative model is more closely associated with the term TPACK, and was proposed by Koehler and Mishra (2008). It conceptualizes TPCK as an integrative body of knowledge that is created on the spot by the mere inter-sections between different bodies of knowledge, such as content and pedagogy, content and technology, and pedagogy and technology. The transformative model was proposed by Angeli and Valanides (2005) and, unlike the integrative model, it conceptualizes TPCK as a unique body of knowledge that needs to be ex-plicitly taught by teacher educators. In the transformative model, content, pedagogy, learners, technology, and context are regarded as significant individual contributors to the development of TPCK.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reasons for non-critical thinking: The multilevel model approach New Trends and Issues Proceedings on Humanities...",
            "Publication year": 2018,
            "Publication url": "https://www.academia.edu/download/63202705/3912-Article_Text-15689-1-10-2019010420200505-97838-fml7n8.pdf",
            "Abstract": "In current literature, one is offered a number of ways of discussing critical thinking, and furthermore, authors follow different tracks grounded in a variety of disciplines (philosophical, psychological and educational) to approach the concept. The only consensus within this topic seems to be the claim that there is no consensus concerning the definition and the construct of critical thinking. I propose that the critical thinking is a complex concept, which simultaneously involves components at three levels, at the level of the culture, the individual and the language. I call the resulting framework a multilevel model (MLM) of the critical thinking concept. The paper argues that the study of critical thinking and non-critical thinking instances within the framework of the MLM allows us a better understanding of the phenomena internationally, and in addition, that no one level can be singled out as the only appropriate level of analysis of critical thinking instances.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing Computer Science Teachers’ Technological Pedagogical Content Knowledge",
            "Publication year": 2015,
            "Publication url": "https://www.learntechlib.org/p/150430/",
            "Abstract": "In the study herein, the authors adopted the framework of technological pedagogical content knowledge and the instructional design model of technology mapping in order to teach secondary education computer science teachers how to teach with technology. During a 15-hour teacher professional development program, teachers were trained how to think about the educational affordances of different computer tools and how to use them to transform computer science content and existing classroom practices. In addition, teachers learned how to think iteratively about technology, content, and pedagogy in order to design learning activities appropriate for learners’ conceptual ecology. The findings of the study strongly indicate that technological pedagogical content knowledge and technology mapping are efficient and effective methodological frameworks for teaching teachers how to teach with technology.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Introducing e-TPCK: An adaptive e-learning technology for the development of teachers’ technological pedagogical content knowledge",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4899-8080-9_16",
            "Abstract": "In this chapter, the authors discuss the design and implementation of e-TPCK, an adaptive e-learning system that targets the development of teachers’ Technological Pedagogical Content Knowledge (TPCK). This adaptive system deploys a technological solution that promotes teachers’ on-going TPCK development by engaging them in the design of learner-centered and ICT-infused scenarios, fostering a self-paced and personalized learning experience, while taking into account teachers’ diverse needs, information processing constraints, and preferences. The design and implementation of e-TPCK followed the methodology of design-based research and, thus, the system itself has undergone three cycles of revisions during the last 3 years. The design of the system was informed by different theoretical and methodological frameworks, such as, the framework of TPCK, theories of Self-Regulated Learning …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Distributed cognition in a sixth-grade classroom: An attempt to overcome alternative conceptions about light and color",
            "Publication year": 2008,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/37700",
            "Abstract": "In this study, we discuss the scaffolded design of ODRES (Observe, Discuss, and Reason with Evidence in Science), a computer tool that was designed to be used with elementary school children in science, and report on the effects of learning with ODRES on students’ conceptual understandings about light, color, and vision. Succinctly, dyads of sixth-grade students were engaged in distributed collaborative inquiry regarding the scientific concepts of light, vision, and color in order to solve a mystery problem about a stolen diamond. ODRES was employed to scaffold students’ collaborative inquiry with different tools, such as the simulator that simulates the effects of the color of a light source on an object, the magnifying glass that enables students to make careful observations, and the notebook that organizes the results of students’ investigations. Students performed two cycles of collaborative inquiry, and each cycle was followed by a classroom discussion where students could present their solutions, share information, reflect, raise questions, and get feedback about their proposed solutions. The results showed that learning with ODRES positively affected students’ understandings and promoted a lasting effect on their conceptions. Moreover, the results provide useful guidance about how ODRES can be used as a learning tool in collaborative inquiry, and explain the role of discussion and investigation of inquiry processes at the level of a distributed cognitive system. Implications for designing distributed educational systems for children are finally discussed. (Keywords: distributed cognitive system, collaborative inquiry, computer-assisted learning …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scientific Investigations of Elementary School Children Technology",
            "Publication year": 2014,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/38643",
            "Abstract": "The study provides evidence concerning elementary school children's ability to conduct a scientific investigation. Two hundred and fifty sixth-grade students and 248 fourth-grade students were administered a test, and based on their performance, they were classified into high-ability and low-ability students. The sample of this study was randomly selected and included 80 students, 40 fourth-grade and 40 sixth-grade students of low and high abilities. Students were specifically instructed to investigate the functioning of a device, to think aloud prior and after any experiment with the device, and to keep a record of their experimental results. The results showed that students were inclined to mainly collect evidence from the experimental space and failed to control variables during their investigation. The majority of the students had difficulties with effectively organizing collected data and failed to coordinate hypotheses with evidence. The significant interaction effect that was found between grade level and ability in terms of students' investigation ability indicates that the existing gap between high- and low-ability students becomes bigger as students become older. Undoubtedly, ongoing research efforts for identifying patterns of children's cognitive development will be most valuable as they can have important implications for the design of teaching scenarios and inquiry-based science activities conducive to accelerating students' cognitive growth and scientific investigation abilities. © 2013 Springer Science+Business Media New York.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Epistemological beliefs and ill-structured problem-solving in solo and paired contexts",
            "Publication year": 2012,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.15.1.2.pdf",
            "Abstract": "A mixed-method exploratory approach was employed to examine the relationship between epistemological beliefs and quality of thinking when participants first thought about an ill-structured problem alone, and then with another person in a dyad. The results showed that there was not a systematic connection between epistemological beliefs and ill-structured problem solving in either solo or paired contexts. It is speculated that the emotional and cultural nature of the problem affected participants’ problem-solving approach. It is recommended that future empirical studies examine the relationship between epistemological beliefs and thinking in a contextualized way by assuming an integrative approach so that emotions, epistemological beliefs, and cognition are considered systemically.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:kNdYIx-mwKoC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Floating and Sinking of an Object in a Liquid-Based on Socio-cognitive Constructivism: Training Material for Students",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=7969059835003425740&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:hMod-77fHWUC",
            "Publisher": "Palacký University"
        },
        {
            "Title": "Programming in early childhood education: A systematic review",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212868921000891",
            "Abstract": "The current study aims to provide a systematic review of the literature about the teaching of programming in early-childhood education, and specifically for the age group of 3-8 years old. The review presents empirical investigations with young learners and reports on relevant frameworks and curriculum programs, effects of teaching approaches and educational tools on learning, and learning outcomes and pedagogical benefits of teaching programming. Based on the empirical studies reviewed in this study, programming can be introduced to young learners as a stand-alone subject matter or can be integrated in the regular kindergarten curriculum with other subject areas such as music, movement and dance, art, science, mathematics, and literacy. In addition, programming can be infused in literacy and storytelling activities as a developmentally appropriate delivery approach. The authors conclude that future …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:tzM49s52ZIMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Using Blogs as an Instructional Tool to Enhance the Digital Skills of 21st Century Learners in University Settings",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=FCAEEAAAQBAJ&oi=fnd&pg=PA376&dq=info:G9r_vkqeU2MJ:scholar.google.com&ots=UhN6rmqDEo&sig=KzUti6Slma5xNRLfWbUMeRXFqlg",
            "Abstract": "In today’s modern societies, digital devices are a seamless part of everybody’s life. It is, therefore, widely recognized by higher education institutions and organizations that digital skills must constitute an important component of human capital, and a goal for education. Blogs are social media tools that enable the publication of digital information. In particular, blogs are powerful instructional tools, because, they require information from multiple sources, such as, text, images, videos and links. Additionally, blogs support integrated and authentic student assessment, as they can be used as artifacts that students can create through their course of learning. In this paper, the authors examine the role of blogs as instructional tools for enhancing the digital skills of 21st century learners in university settings. Specifically, we present preliminary results from a research study that was conducted to teach undergraduate students how to effectively use the web for educational purposes. Preliminary research results indicate that undergraduate students are mostly content consumers rather that content creators. In particular, while they demonstrate strong operational and social skills when navigating the web, they lack skills related to completing more advanced tasks, such as information search and content creation. The results also show a strong need for future studies to focus on critical literacies, such as the evaluation and ethical use of digital content.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Academic Conferences and publishing limited"
        },
        {
            "Title": "Distributed cognition in a sixth-grade classroom: An attempt to overcome alternative conceptions about light and color",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15391523.2008.10782510",
            "Abstract": "In this study, we discuss the scaffolded design of ODRES (Observe, Discuss, and Reason with Evidence in Science), a computer tool that was designed to be used with elementary school children in science, and report on the effects of learning with ODRES on students’ conceptual understandings about light, color, and vision. Succinctly, dyads of sixth-grade students were engaged in distributed collaborative inquiry regarding the scientific concepts of light, vision, and color in order to solve a mystery problem about a stolen diamond. ODRES was employed to scaffold students’ collaborative inquiry with different tools, such as the simulator that simulates the effects of the color of a light source on an object, the magnifying glass that enables students to make careful observations, and the notebook that organizes the results of students’ investigations. Students performed two cycles of collaborative inquiry, and each cycle …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:roLk4NBRz8UC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Domain-specific aspects of technological pedagogical content knowledge: Music education and the importance of affect",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11528-017-0244-7",
            "Abstract": "The present study addresses the lack of a theoretical framework for the integration of technology in music teaching and learning, and explores, within the framework of Technological Pedagogical Content Knowledge (TPACK), the importance of affect in the instructional design of music lessons. The purpose of this study is twofold: (a) to extend the theoretical framework of TPACK to a design framework by enriching it with domain-specific design guidelines for the teaching of music, and, (b) to identify and propose design guidelines, which can facilitate associations of affect with cognition in learning music with technology. The research has practical significance for teachers and practitioners as it provides explicit instructional design guidance of how music lessons can be designed based on TPACK principles that address both the cognitive and the affective domain.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An exploratory study of the role of epistemological beliefs on learners' solo and duo thinking about an ill-defined issue",
            "Publication year": 2007,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/37723",
            "Abstract": "An exploratory study of the role of epistemological beliefs on learners' solo and duo thinking \nabout an ill-defined issue Toggle navigation English Ελληνικά English English Ελληνικά Login \nToggle navigation View Item Home Δημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή \nΚοινωνικών Επιστημών και Επιστημών Αγωγής / Faculty of Social Sciences and Education \nΤμήμα Επιστημών της Αγωγής / Department of Education View Item Home Δημοσιεύσεις ΠΚ / \nUCY Publications 003 Σχολή Κοινωνικών Επιστημών και Επιστημών Αγωγής / Faculty of Social \nSciences and Education Τμήμα Επιστημών της Αγωγής / Department of Education View Item \nConference Object An exploratory study of the role of epistemological beliefs on learners' solo \nand duo thinking about an ill-defined issue Thumbnail Date 2007 Author ORCID logo Angeli, \nCharoula ORCID logo Valanides, Nicos Source IADIS International Conference on Cognition , :…",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Role of the Authority of the Text on Critical Thinking",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10780-012-9161-z.pdf",
            "Abstract": "The paper puts forward the argument that critical thinking (and its teaching) should be approached by taking into critical account operations of authority that blunt the reflective disposition toward written texts. The empirical grounds of this argument have been examined by means of a specific study. The study explored in a higher-education setting the extent to which students’ critical thinking was influenced by the authority of textuality. Eighty-two undergraduates were randomly divided into Group A and Group B. Two passages, extracted from internationally well-known cultural-textual sources, were compiled into two sets of materials. Set A consisted of an anonymized passage drawn from a text of fascist ideology, and Set B consisted of an anonymized passage drawn from a text of democratic theory. During the research session, students in Group A received first Set A and then Set B, and Group B received …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Developing teacher self-efficacy to teach science and computational thinking with educational robotics: using scaffolded programming scripts",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-99858-9_11",
            "Abstract": "There is a paucity of studies examining pre-service teachers’ self-efficacy to use robotics to teach science, and especially computational thinking skills. This chapter reports on a study examining pre-service teachers’ self-efficacy to teach science and computer programming with robotics using LEGO WeDo robotics kits supported by scaffolded programming scripts. Pre-service teachers’ self-efficacy was assessed, before and after the robotics activity, with questionnaires to evaluate the extent to which the scaffolded programming intervention influenced them positively or negatively in believing that they developed the skill and confidence to teach with educational robotics. Statistical results indicate that the robotics intervention with scaffolded programming scripts was successful at increasing pre-service teachers’ computational thinking skills and self-efficacy for teaching with robotics. The study results further …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Asynchronous Computer Conferencing as Mindtools: Implications for Integrating Mindtools in the Classroom",
            "Publication year": 2003,
            "Publication url": "https://www.learntechlib.org/p/18032/",
            "Abstract": "We report on the findings of a study that was completed in July of 2002 regarding the affordances of asynchronous conferencing to foster quality computer-mediated interactions. Specifically, we investigated the extent to which COW, can be used to extend classroom discussion beyond scheduled class time. The results of the study indicated that COW did not encourage extensive communication among the participants. In addition, participants' discourse was mostly unjustified claims and personal opinions, and evidence of critical thinking was scarce. Undoubtedly, the integration of conferencing systems in classroom settings constitutes a complex issue. We conclude that any tool alone, no matter how powerful it might be, it is not a mindtool, but it can be transformed into a mindtool depending on how and when it is utilized and for what purposes.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:hC7cP41nSMkC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Teaching computer science in secondary education: A technological pedagogical content knowledge perspective",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2532748.2532755",
            "Abstract": "In the study herein, Technological Pedagogical Content Knowledge (TPCK), a framework that extends the conceptualization of Pedagogical Content Knowledge, was adopted in order to teach three computer science concepts, namely,\" Data,\"\" Processing,\" and\" Information\". Technology Mapping, a method proposed in the literature for developing TPCK, was used for rethinking the instructional design of the unit\" Data-Processing-Information\", so that Excel could be adequately utilized for teaching it. In particular, the technical affordances of Excel were used in a powerful pedagogical way in order to eliminate learners' existing misconceptions about the three concepts. Twelve eighth graders, five girls and seven boys, participated in the study. Students had basic computing skills, but no prior knowledge about how to use Excel. The classroom teacher chose to use Excel, because it is a tool that enables quick data entry …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning by design as an approach for developing science teachers’ ICT-related pedagogical content knowing",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=15239652683178237274&hl=en&oi=scholarr",
            "Abstract": "The purpose of this chapter was to examine the extent to which adopting the learning by design approach, as it was instantiated with a specific instructional systems design (ISD) model, in an information communication technology (ICT) teacher professional development programme could be an effective approach for developing science teachers' ICT-related pedagogical content knowing (ICT-related PCKg). ICT-related PCKg is conceptualized as an extension to Shulman's (1986) pedagogical content knowledge (PCK), and is described as the ways knowledge about tools and their affordances, pedagogy, content, learners, and context are synthesized into an understanding of how particular topics can be taught with ICT in ways that signify the added value of ICT.Ten science teachers participated in the programme. The span of the programme was 70 periods of 45-minutes over four months. A qualitative analysis of participants' ICT-enhanced lessons and information from other sources indicated that the learning by design approach constitutes an effective approach for developing teachers' ICT-related PCKg. Specifically, the majority of the teachers who participated in the study selected appropriate science topics to be taught with ICT, transformed science content with appropriate ICT tools and ICT-supported representations, identified ICT-supported teaching tactics, and integrated their ICT activities in the classroom with inquiry-based pedagogy. The development of teachers' ICT-related PCKg seems to be a challenging task, and teachers, as well as teacher-educators, need to undertake systematic committed efforts for its evolution and growth …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Interaction Effect between Gender and Scaffolding Strategy during an Intervention about how to Teach Young Learners to Think Computationally with a Floor Programmable Robot",
            "Publication year": 2021,
            "Publication url": "https://www.learntechlib.org/p/219348/",
            "Abstract": "In this study, the authors hypothesized that scaffolding would play a significant role in the development of children’s computational thinking skills during learning with the Bee-Bot because the Bee-Bot does not provide a visual representation of the commands children use to program it. Accordingly, the researchers used two scaffolding techniques in the form of external memory systems, namely, Type A and Type B. The two scaffolding techniques were designed taking into consideration gender differences in terms of the types of learning activities that pre-primary education boys and girls prefer at this level of development. According to the findings, while both genders benefited from both scaffolding techniques, a statistically significant interaction effect between gender and scaffolding technique was detected showing that boys benefited more from the individualistic, kinesthetic spatially oriented, and manipulative …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:uLbwQdceFCQC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "The effect of electronic scaffolding for technology integration on perceived task effort and confidence of primary student teachers",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15391523.2004.10782424",
            "Abstract": "Forty-one primary student teachers were divided into two groups and were instructed how to integrate certain Information and Communication Technology (ICT) tools in learning activities. Only one group was guided to use Filamentality, a fill-in-the-blank interactive Web site, and to organize Internet information in a Hotlist and a Scrapbook. Questionnaires were administered to collect data related to students’ perceived task effort (PTE) as a result of integrating ICT in the learning environment, and their confidence levels in using ICT tools, while their initial attitudes toward ICT and its integration in the classroom were taken into consideration. The results indicated that Filamentality effectively scaffolded particular aspects of ICT integration in learning and instruction, and significantly reduced learners’ amount of PTE, but there was not always a significant effect on learners’ self-reported confidence levels.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:0EnyYjriUFMC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Investigating K-2 Students' Computational Thinking Skills during a Problem-Solving Activity about the Water Cycle Using Educational Robotics.",
            "Publication year": 2019,
            "Publication url": "https://eric.ed.gov/?id=ED608661",
            "Abstract": "The main purpose of the study was to investigate K-2 children’s development of computational thinking skills through an activity with Blue-Bot, a floor programmable robot. Twenty children between six and seven years old participated in the study. Children were engaged in problem-solving activities with the Blue-Bot to learn how to program it and about the water cycle. The results of the study reported statistically significant learning gains between the initial and final assessment of children’s computational thinking skills as they were measured holistically with a rubric that was developed for the purposes of this study. In addition, the results showed that learning with robotics activities was an effective way to teach children about the water cycle.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:LjlpjdlvIbIC",
            "Publisher": "International Association for the Development of the Information Society"
        },
        {
            "Title": "The role of cognitive style and textual and visual representations on learners' problem solving with modeling software",
            "Publication year": 2006,
            "Publication url": "https://brill.com/downloadpdf/book/edcoll/9789087901189/BP000005.pdf",
            "Abstract": "Many educators argue (eg, Bransford, Brown, & Cocking, 2001; Bruer, 1993; Paul, 1995; Penner, 2000/2001, Richmond, 2001) that the way students are taught in schools is outdated, and, thus, they are not well equipped to think and communicate effectively. Nonetheless, learning how to think, communicate, and problem-solve can be taught, and greatly depends on classroom practices (Bruer, 1993). New interactive and computer-based technologies can be integrated in the classroom to scaffold and amplify students' thinking and learning (Bransford, Brown, & Cocking, 2001). Several researchers (eg, Glass & Mackey, 1988; Haken, 1981; Jonassen & Reeves, 1996; Penner, 2000/2001) assert that dynamic systems modeling tools are perhaps the most intellectually demanding technologies that\" enhance the cognitive powers of human beings during thinking, problem solving, and learning\"(Jonassen & Reeves …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:HE397vMXCloC",
            "Publisher": "Brill Sense"
        },
        {
            "Title": "An interaction effect between young children's field dependence-independence and order of learning with glass-box and black-box simulations: Evidence for the malleability of cognitive style in computer-supported learning",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S074756321630231X",
            "Abstract": "A counterbalanced measures design was used to examine whether the order of learning with a glass-box simulation about the life cycle of butterflies, and, a black-box simulation about the life of bees, differentially affected field-dependent and field-independent children's performance on two related knowledge tests. The children aged from 5 to 6.5 years old were classified into a field type based on their Children's Embedded Figures Test scores. Subsequently, they were assigned into Group A and Group B. Group A learned first with the glass-box simulation followed by the black-box simulation, while Group B used the tools in the reverse order. A statistically significant interaction effect was found between field type and order of learning with the simulations on the butterfly post-test performance, showing that learning first with the black-box simulation facilitated field-dependent children's subsequent learning with the …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Action Research and Science Education",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/32336091/SEI.pdf",
            "Abstract": "The present review aspires to familiarize readers with the main stakes of action research, and single out its pertinence to the vision of critical and effective education. Thus, the theoretical and conceptual arsenal of action research, its core assumptions, its rationale, and its relevance to science education are briefly explored. Action research emerges as research in education and not as research on education, and its philosophical framework includes a politicized, ideology-laden, action-oriented, and constructivist conception of reflection and knowledge. However, action research does also suffer from problems and frequently succumbs to manipulation and power relations. Nevertheless, it constitutes the most convincing contemporary approach that stands against rival rationalist or technicist views. Action research also promises to empower teachers and limit their dependence on academic researchers, and to make students’ learning experiences more lasting, fulfilling, and scientifically organized. Teachers as reflective practitioners will be also continually reminded through their own activities that science is not just about human inventiveness, progress, and control over inner and outer nature, but that it is also or, perhaps, even more about limits that the well-being of the community and the environment poses to human ambition.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Scaffolded Programming Scripts in Educational Robotics Activities to Teach Preservice Teachers Computational Thinking.",
            "Publication year": 2017,
            "Publication url": "https://eric.ed.gov/?id=ED591629",
            "Abstract": "In an era where computational thinking is regarded as a basic skill for the 21st century that needs to be taught across the K-12 curriculum, research shows that teacher education programs do not adequately prepare preservice teachers to promote computational thinking skills in classroom teaching. Accordingly, the present study contributes to the body of knowledge that can be used to inform the teaching of computational thinking in teacher education through the use of scaffolded programming scripts with educational robotics activities, within the context of a science lesson about gears. The study reports effects on preservice teachers' computational thinking, knowledge about gears, and self-reported efficacy to teach with educational robotics.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:t6usbXjVLHcC",
            "Publisher": "AERA Online Paper Repository. Available from: American Educational Research Association. 1430 K Street NW Suite 1200, Washington, DC 20005"
        },
        {
            "Title": "Epistemological beliefs and ill-defined problem-solving in solo and duo contexts",
            "Publication year": 2010,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/37718",
            "Abstract": "Epistemological beliefs and ill-defined problem-solving in solo and duo contexts Toggle \nnavigation English Ελληνικά English English Ελληνικά Login Toggle navigation View Item Home \nΔημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή Κοινωνικών Επιστημών και Επιστημών Αγωγής / \nFaculty of Social Sciences and Education Τμήμα Επιστημών της Αγωγής / Department of \nEducation View Item Home Δημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή Κοινωνικών \nΕπιστημών και Επιστημών Αγωγής / Faculty of Social Sciences and Education Τμήμα Επιστημών \nτης Αγωγής / Department of Education View Item Conference Object Epistemological beliefs \nand ill-defined problem-solving in solo and duo contexts Thumbnail Date 2010 Author ORCID \nlogo Angeli, Charoula ORCID logo Valanides, Nicos Source Proceedings of the IADIS \nInternational Conference on Cognition and Exploratory Learning in the Digital Age, CELDA 87-:/…",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Technological Pedagogical Content Knowledge",
            "Publication year": 2018,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/62153",
            "Abstract": "Advances in Technological Pedagogical Content Knowledge Toggle navigation English \nΕλληνικά English English Ελληνικά Login Toggle navigation View Item Home Δημοσιεύσεις ΠΚ \n/ UCY Publications 003 Σχολή Κοινωνικών Επιστημών και Επιστημών Αγωγής / Faculty of \nSocial Sciences and Education Τμήμα Επιστημών της Αγωγής / Department of Education View \nItem Home Δημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή Κοινωνικών Επιστημών και \nΕπιστημών Αγωγής / Faculty of Social Sciences and Education Τμήμα Επιστημών της Αγωγής / \nDepartment of Education View Item Book Advances in Technological Pedagogical Content \nKnowledge Thumbnail Date 2018 Editor De Rossi, M. ORCID logo Angeli, Charoula Publisher \nThe Italian Journal of Educational Technology, Italian Association of Educational Technology \nGoogle Scholar check Metadata Show full item record URI http://gnosis.library.ucy.ac.cy/handle/…",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:dQ2og3OwTAUC",
            "Publisher": "The Italian Journal of Educational Technology, Italian Association of Educational Technology"
        },
        {
            "Title": "DEVELOPING SECONDARY EDUCATION COMPUTER SCIENCE TEACHERS’TECHNOLOGICAL PEDAGOGICAL CONTENT KNOWLEDGE",
            "Publication year": 2015,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=856127",
            "Abstract": "In the study herein the authors adopted the framework oftechnological pedagogical content knowledge (TPCK) and the approach oftechnology mapping in order to teach secondary education computer scienceteachers how to teach with technology. During a 15-hour teacherprofessional development program, teachers learned how to think about theeducational affordances of different computer tools, and how to use them tomake computer science content more understandable to learners. In addition, teachers learned how to think iteratively about technology, content, andpedagogy in order to design learning activities appropriate for learners’ conceptual ecology. The study presents good examples of TPCK in practiceby demonstrating teachers’ actual instructional artifacts as these emergedthrough their participation in the teacher professional development program, as well as their evaluations of the program.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:bFI3QPDXJZMC",
            "Publisher": "European Scientific Institute"
        },
        {
            "Title": "Technological Pedagogical Content Knowledge (TPACK): Revision and Rethinking",
            "Publication year": 2015,
            "Publication url": "https://www.learntechlib.org/p/150569/",
            "Abstract": "The Handbook of Technological Pedagogical Content Knowledge (TPCK) for Educators was critical to the development of the field of educational technology research and practice, but much has changed since its publication. The Handbook of Technological Pedagogical Content Knowledge (TPCK) for Educators was critical to the development of the field of educational technology research and practice, but much has changed since its publication. Each paper/presentation will be allocated 15 minutes. The first four papers will be presented during the first hour, and the final three papers during the second hour. The final 15 minutes of the second hour will be allocated to a summary and an interactive question-and-answer period led by the discussants.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Reviewers and Editorial Assistants",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4020-8827-8.pdf#page=281",
            "Abstract": "Reviewers and Editorial Assistants Page 281 Appendix: Reviewers and Editorial Assistants • \nCharoula Angeli (University of Cyprus, Cyprus) • Hermann Astleitner (University of Salzburg, \nAustria) • Geraldine Clarebout (Catholic University of Leuven, Belgium) • Oliver Diekamp \n(Ludwigs-Maximilian University of Munich, Germany) • Bernhard Ertl (University of the Federal \nForces Munich, Germany) • Joachim Funke (University of Heidelberg, Germany) • Tina Hascher \n(University of Salzburg, Austria) • David Hibbard (California State University, Chico, USA) • \nHolger Horz (University of Koblenz-Landau, Germany) • Paul Kirschner (Open University of the \nNetherlands) • Linda Kline (California State University, Chico, USA) • Birgitta Kopp \n(Ludwigs-Maximilian University of Munich, Germany) • Beatrice Ligorio (University of Bari, Italy) \n• Susanne Narziss (University of Dresden, Germany) • Brian Oppy,(California State University, , (…",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Preparing pre-service teachers to promote computational thinking in school classrooms",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-93566-9_7",
            "Abstract": "Computational thinking is an essential skill for the twenty-first century. Teacher education departments, however, do not currently have the knowledge to promote computational thinking in their programs. The question, then, becomes how to include the teaching of computational thinking in teacher education courses. The present study directly addresses this issue. In particular, the study proposes the use of scaffolded programming scripts as one method for teaching computational thinking in pre-service teacher education. In this study, scaffolded programming scripts were used in the context of educational robotics activities for the teaching of a science lesson on gears. The results report effects on pre-service teachers’ computational thinking, knowledge about gears and how they work, and self-reported efficacy to teach with educational robotics. The authors discuss implications and future research directions.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Preparing preservice elementary teachers to teach science through computer models",
            "Publication year": 2006,
            "Publication url": "https://www.learntechlib.org/p/20017/",
            "Abstract": "The purpose of this study was to examine the extent to which preservice elementary teachers were able to construct viable scientific models with a computer-modeling tool, namely Model-It, and design a science lesson with models. The results of the study showed that (a) Model-It, through its scaffolds (ie, Plan, Build, and Test modes), enabled the majority of preservice teachers to build models that were structurally correct,(b) participants' models were structurally correct but simplistic, and (c) 65% of the participants preferred to teach science using the explorative modeling method, 27% the expressive method, and only 8% both the explorative and the expressive methods. In essence, Model-It effectively scaffolded preservice teachers' first modeling experiences and enabled them to quickly build and test their models. It is, however, recognized that systematic efforts need to be undertaken in teacher education …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Society for Information Technology & Teacher Education"
        },
        {
            "Title": "Technology mapping: An approach for developing technological pedagogical content knowledge",
            "Publication year": 2013,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.2190/EC.48.2.e",
            "Abstract": "Technology mapping ™ is proposed as an approach for developing technological pedagogical content knowledge (TPCK). The study discusses in detail instructional design guidelines in relation to the enactment of TM, and reports on empirical findings from a study with 72 pre-service primary teachers within the context of teaching them how to teach with Excel. Repeated Measures MANOVA findings showed that TM was effective and efficient in developing TPCK competencies; however, development of TPCK competencies was directly related to the complexity of the design task, as this was determined by the educational affordances of Excel.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:8k81kl-MbHgC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Music Cognition and Affect in the Design of Technology-Enhanced Music Lessons",
            "Publication year": 2020,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/feduc.2020.518209/full",
            "Abstract": "The present study addresses the lack of an instructional design methodology for the integration of technology in music teaching and learning, and explores, within the framework of Technological Pedagogical Content Knowledge (TPCK), the importance of affect in instructional design. The study extends the theoretical framework of TPCK to a design framework and proposes a methodology and instructional design guidelines that address both the cognitive and the affective domains of learning. The research has both practical and theoretical significance as it provides teachers with explicit guidance on how to design music lessons based on TPCK principles, and, examines interactions among content, technology, cognition, and affect. Through the 4E perspective, technology and the proposed approach are viewed as agents of a distributed system that can support the embodied minds to develop musical and emotional understanding.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Music Cognition and Affect in the Design of Technology-Enhanced Music Lessons",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=lPIUEAAAQBAJ&oi=fnd&pg=PA206&dq=info:83QmlqwdaEYJ:scholar.google.com&ots=MBpFTSaQ1O&sig=ywtqxOvmLag5nurNQoIRhJGtA-w",
            "Abstract": "Accepted: 07 September 2020 Published: 29 September 2020Citation: Macrides E and Angeli C (2020) Music Cognition and Affect in the Design of Technology-Enhanced Music Lessons. Front. Educ. 5: 518209. doi: 10.3389/feduc. 2020.518209",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:WqliGbK-hY8C",
            "Publisher": "Frontiers Media SA"
        },
        {
            "Title": "Distributed cognition: A framework for understanding the role of computers in classroom teaching and learning",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/pdf/10.1080/15391523.2008.10782508",
            "Abstract": "Research on the role of computers in educacon is mainly outcomes-based, and focuses on the effects of computers on student learning primarily from two perspectives-the ampLfication and augmentation perspectives (Azevedo, 2005; Kozma, 1991; Lajoie, 1993; Lajoie, 2003; Liu & Bera, 2005; Pea, 1985; Saljo, 1999; Watters & Die: z: mann 2007; Wijekumar, Meyer, Wagoner, & Ferguson, 2006). According to the amplification perspective, computers share the cognitive burde:: 1 of carrying out tasks that humans are not very good at, such as, pertorming complex calculations, and storing and retrieving information (Salomon, PerkJns, & Globerson, 1991; Salomon, 1993). From the augmentation perspective, computers not only arr_plif) r what humans do, but also shape human cognition by facilitating the comtruction of mental representations of abstract concepts and phenomena through the use of advanced computer …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:Se3iqnhoufwC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Bubble dialogue: Tools for supporting literacy and mind",
            "Publication year": 2012,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.4324/9780203053805-13/bubble-dialogue-tools-supporting-literacy-mind-charoula-angeli-donald-cunningham",
            "Abstract": "Literacy (ie, reading and writing) has been one of the most prominent and controversial issues in education for several decades (Noll, 1995). The debate has often centered on two different approaches of teaching reading and writing, namely the phonics approach and the whole language approach. Chall (1967, 1989), an advocate of the phonics approach, warned us that whole language does not provide enough structure for children who come from homes that are not reading-supportive and recommended that this structure be systematically provided. On the other hand, Goodman (1986), an advocate of whole language, asserted that the phonics approach makes language learning difficult because it breaks language into arbitrary and abstract little pieces. Language, as a consequence, too often becomes unrelated to the needs and experiences of learners. Although the debate continues, and no matter which side …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Developing Pre-Service Teachers' Technological Pedagogical Content Knowledge With E-TPCK",
            "Publication year": 2019,
            "Publication url": "https://www.igi-global.com/chapter/developing-pre-service-teachers-technological-pedagogical-content-knowledge-with-e-tpck/215510",
            "Abstract": "The authors discuss the design of e-TPCK, a self-paced adaptive electronic learning environment that was integrated in a second-year educational technology course to engage pre-service teachers' in rich learning experiences in order to develop their technological pedagogical content knowledge (TPCK) in a personalized way. The system deploys a technological solution that promotes teachers' ongoing TPCK development by engaging them in rich and valuable personalized learning experiences through the use of technology-infused design scenarios, while taking into account teachers' diverse needs, information processing constraints, and preferences. Results from an experimental research design study revealed statistically significant differences between the control group and the experimental group in favor of the experimental group, signifying that students in the experimental group who learned with e …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:5ugPr518TE4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Evaluating the Use of ICT in Education: Psychometric Properties of the Survey of Factors Affecting Teachers Teaching with Technology (SFA-T3)",
            "Publication year": 2008,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.11.1.69.pdf",
            "Abstract": "There are a number of measurement instruments in the field of education whose aims are to measure various aspects of educational technology. However, the psychometric properties of such instruments are not always determined, and their use is not always appropriate. The aim of this study was to determine the psychometric properties of the survey of factors affecting teachers teaching with technology (SFA-T3) when used with a sample of Greek Cypriot teachers. The results of this study show that the reliability evidence obtained from the responses to the questionnaire was satisfactory. The construct validity evidence was also determined based on a factor analysis that created ten easily interpretable factors. Some gender differences have also appeared in the teachers’ responses on the various factors, which is in accordance with similar literature that exists in other countries as well.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "ICT-related pedagogical content knowledge: A model for teacher preparation",
            "Publication year": 2005,
            "Publication url": "https://www.learntechlib.org/p/19585/",
            "Abstract": "The study discusses the evolvement of an Instructional Systems Design (ISD) model as it was evaluated and progressively refined after consecutive iterations. The proposed ISD model can be used in technology courses or method courses to develop teachers' ICT-related pedagogical content knowledge (PCK), which is that body of knowledge that is essential for teachers to be able to teach with ICT. The results showed that the evolved model was effective in developing certain aspects of ICT-related PCK and that systematic efforts are needed to engage teachers in technology-rich design activities so that they develop adequately all aspects of ICT-related PCK.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:4DMP91E08xMC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Science and Technology Literacy in the 21st Century",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=3870554138410434508&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:isC4tDSrTZIC",
            "Publisher": "University of Cyprus"
        },
        {
            "Title": "Teaching pre-service elementary teachers to teach science with computer models",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-0449-7_12",
            "Abstract": "Many reported studies relating to models and modeling clearly indicate that science teachers need to be knowledgeable about the role of models and modeling in science and need to be engaged in rich modeling activities, so that they become able to use models in science teaching and learning. In view of adequately preparing pre-service teachers to teach science through models, the authors in this chapter discuss how a cohort of pre-service elementary teachers was introduced to model-based teaching/learning and reasoning. Data for this study were collected from 62 pre-service teachers, who had the same background knowledge and similar computing skills. After four lab meetings about the pedagogical uses of computer models and computer-modeling tools, students were asked to propose a science lesson with computer models to be taught in a real classroom. Both qualitative and quantitative …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Thinking about Complex Problems with Modeling Software: The Role of Cognitive Style and Visual and Textual Representations.",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/42704465/Thinking_about_Complex_Problems_with_Mod20160215-15389-cciqq6.pdf",
            "Abstract": "Sixty-five undergraduates, classified into Field-Dependent (FD), Field-Mixed (FM), and Field-Independent (FI) learners, were randomly assigned to two groups, Text-Only (TO) and Text-and-Visual (TV). The TO group received a textual description of a computer model, whereas the TV group received the same description but in both textual and visual format. Participants were asked to run the model using Model-It to solve a complex problem about immigration dynamics. A 3x2 ANOVA indicated that the TV group outperformed the TO group, that performance was significantly related to field-dependence/independence, and that there was a significant interaction effect. Specifically, Field-Independent learners in the Text-and-Visual group outperformed Field-Dependent and Field-Mixed learners in both groups, and Field-Independent learners in the Text-Only group.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Domain-Specific Aspects of Technological Pedagogical Content Knowledge: The Importance of Affect in Technology-Enhanced Music Teaching",
            "Publication year": 2018,
            "Publication url": "https://www.learntechlib.org/p/182815/",
            "Abstract": "The present study addresses the lack of a theoretical framework for the integration of technology in music teaching and learning, and explores, within the framework of Technological Pedagogical Content Knowledge the importance of affect in instructional design. The authors propose a set of music-specific design principles based on the TPCK framework while identifying the interrelations among musical content, emotions, and technology. The design guidelines were tested in an empirical investigation and statistically significant differences were found between the control and the experimental groups in favor of the experimental group. Further investigation is necessary to test the effectiveness of the proposed design principles. Including affect in the design process is a complicated and mostly unchartered area, and, thus, further research toward this direction is fully justified. Through the inclusion of affect in the …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Teachers' Practical Theories for the Design and Implementation of Problem-Based Learning.",
            "Publication year": 2002,
            "Publication url": "https://eric.ed.gov/?id=EJ656468",
            "Abstract": "Discusses the problem based learning (PBL) environment and positive and negative factors affecting the implementation of PBL in K-12 education. Identifies and examines design guidelines for PBL.(Contains 23 references.)(YDS)",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Action Research, the Reflective Teacher and Science Education.",
            "Publication year": 2005,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/38476",
            "Abstract": "The present review aspires to familiarize readers with the main stakes of action research, and single out its pertinence to the vision of critical and effective education. Thus, the theoretical and conceptual arsenal of action research, its core assumptions, its rationale, and its relevance to science education are briefly explored. Action research emerges as research in education and not as research on education, and its philosophical framework includes a politicized, ideology-laden, action-oriented, and constructivist conception of reflection and knowledge. However, action research does also suffer from problems and frequently succumbs to manipulation and power relations. Nevertheless, it constitutes the most convincing contemporary approach that stands against rival rationalist or technicist views. Action research also Promises to empower teachers and limit their dependence on academic researchers, and to make students' learning experiences more lasting, fulfilling, and scientifically organized. Teachers as reflective practitioners will be also continually reminded through their own activities that science is not just about human inventiveness, progress, and control over inner and outer nature, but that it is also or, perhaps, even more about limits that the well-being of the community and the environment poses to human ambition. ABSTRACT FROM AUTHOR]; Copyright of Science Education International is the property of Science Education International and its content may not be copied or emailed to multiple sites or posted to a listserv without the copyright holder's express written permission. However, users may print, download, or email articles for …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effect of robotics on elementary preservice teachers’ self-efficacy, science learning, and computational thinking",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10956-016-9663-z",
            "Abstract": "The current impetus for increasing STEM in K-12 education calls for an examination of how preservice teachers are being prepared to teach STEM. This paper reports on a study that examined elementary preservice teachers’ (n = 21) self-efficacy, understanding of science concepts, and computational thinking as they engaged with robotics in a science methods course. Data collection methods included pretests and posttests on science content, prequestionnaires and postquestionnaires for interest and self-efficacy, and four programming assignments. Statistical results showed that preservice teachers’ interest and self-efficacy with robotics increased. There was a statistically significant difference between preknowledge and postknowledge scores, and preservice teachers did show gains in learning how to write algorithms and debug programs over repeated programming tasks. The findings suggest that …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Technological pedagogical content knowledge: Exploring, developing, and assessing TPCK",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4899-8080-9.pdf",
            "Abstract": "Technological pedagogical content knowledge (TPCK or TPACK) is a rather young research field, which is still searching for a generally accepted and solid theoretical conceptualization. During the last decade, the concept of TPCK has received great attention from the research community, and, as a result, a significant number of articles have been published. The Editors acknowledge that research surrounding the conceptualization of TPCK has been primarily based on Shulman’s (1986, 1987) seminal work on pedagogical content knowledge (PCK). In essence, TPCK researchers worked toward enhancing or extending Shulman’s PCK to address the knowledge needed to teach with technology. Early work on the theorization of TPCK includes the work of Pierson (2001), who suggested adding technological knowledge (T) to the existing model of PCK in order to better define teacher technology integration, as well …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Tensions in specifying computing curricula for K-12: Towards a principled approach for objectives",
            "Publication year": 2018,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/itit-2017-0017/html",
            "Abstract": "In this article we examine key issues and tensions for developing and specifying Computing-related elements of curricula design, particularly the role of Computer Science in the curriculum. The article is based on a series of discussions and analyses of curriculum design across various countries with different approaches and traditions of Computing in the curriculum.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:eJXPG6dFmWUC",
            "Publisher": "De Gruyter Oldenbourg"
        },
        {
            "Title": "Examining the effects of field dependence–independence on learners' problem-solving performance and interaction with a computer modeling tool: Implications for the design of joint cognitive systems",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131512002588",
            "Abstract": "An investigation was carried out to examine the effects of cognitive style on learners' performance and interaction during complex problem solving with a computer modeling tool. One hundred and nineteen undergraduates volunteered to participate in the study. Participants were first administered a test, and based on their test scores they were classified into three groups, namely field-dependent, field-mixed, and field-independent learners. Participants then received the same set of integrated-format materials and were asked to use a computer modeling tool to solve a complex problem about immigration policy. A multivariate analysis of variance was performed with field type as the independent variable, and cognitive load, problem-solving performance, and learner interaction with the computer tool as the dependent variables. The results indicated that there was no significant difference in terms of the amount of …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A K-6 computational thinking curriculum framework: Implications for teacher knowledge",
            "Publication year": 2016,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.19.3.47.pdf",
            "Abstract": "Adding computer science as a separate school subject to the core K-6 curriculum is a complex issue with educational challenges. The authors herein address two of these challenges:(1) the design of the curriculum based on a generic computational thinking framework, and (2) the knowledge teachers need to teach the curriculum. The first issue is discussed within a perspective of designing an authentic computational thinking curriculum with a focus on real-world problems. The second issue is addressed within the framework of technological pedagogical content knowledge explicating in detail the body of knowledge that teachers need to have to be able to teach computational thinking in a K-6 environment. An example of how these ideas can be applied in practice is also given. While it is recognized there is a lack of adequate empirical evidence in terms of the effectiveness of the frameworks proposed herein, it is …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:UxriW0iASnsC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "A socio-technical analysis of factors affecting the integration of ICT in primary and secondary education",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/information-communication-technologies/22761",
            "Abstract": "We live in a world that is constantly impacted by information and communication technology (ICT). ICT is considered an important catalyst and tool for inducing educational reforms and progressively extending and modifying the concept of literacy. With the extensive use of ICT in schools and everyday life, the term computer literate has already been established. Schools are open systems that interact with their environment, and the effective use and integration of technology is directly associated with the role of various socio-technical factors that may impact the integration of ICT in schools. In this chapter, we report on an exploratory study undertaken in Cyprus schools to examine the status of using ICT from the perspective of socio-technical systems. Specifically, teachers’ knowledge of ICT, frequency of using ICT for personal purposes, frequency of using ICT for instructional purposes in different subject matters …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Technological pedagogical content knowledge as a framework for integrating educational technology in the teaching of computer science",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4899-8080-9_11",
            "Abstract": "The chapter adopts the framework of Technological Pedagogical Content Knowledge (TPCK) in order to redesign the teaching of three computer science lessons about (a) three basic computer science concepts, namely, data, processing, and information, (b) the representation of data in computer language, and (c) the differences between main and secondary memory. The chapter uses the systematic guidelines of technology mapping to transform the teaching content with the use of educational technologies and in particular spreadsheets. While the framework of TPCK and the guidelines of technology mapping proved to be adequate methodological frameworks for the teaching of computer science, it is pointed out that the focus herein has been on the cognitive domain of learning, and that the frameworks have to be also tried out within the context of other subject-matter areas where the emphasis is also on …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Measuring the Internet Skills of Gen Z Students in Higher Education: Validation of the Internet Skills Scale in University Settings",
            "Publication year": 2021,
            "Publication url": "https://riunet.upv.es/handle/10251/172371",
            "Abstract": "[EN] Internet technologies have infiltrated higher education institutions around the world. At the same time, the latest generation of students, the so-called Generation Z (Gen Z), are entering higher education. Gen Z is the first generation born in an Internet-connected world, and digital devices are a seamless part of its life. As a result, Gen Z students have already been engaged with informal digital learning via internet-based technologies outside of formalized education settings. However, previous research has shown that their engagement with these technologies is limited and might not sufficiently cover the knowledge and skills needed to perform internet activities effectively in higher education. Additionally, their familiarity with digital devices and tools varies. Consequently, there is a need for higher education institutions to close the skills gap by applying assessment processes that will assist them in forming policies and training resources for undergraduate students. To achieve the above, research efforts need to focus on developing theoretically informed and valid instruments that measure internet skills. This study has contributed to the validation of a self-assessment questionnaire, the Internet Skills Scale, that can be used in university settings. The questionnaire measures five types of internet skills: operational, information-navigation, social, creative, and critical. The results presented herein provide directions for future research in the field.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Editorial Universitat Politècnica de València"
        },
        {
            "Title": "Developing Computational Thinking in Early Childhood Education: A Focus on Algorithmic Thinking and the Role of Cognitive Differences and Scaffolding",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-65657-7_3",
            "Abstract": "Computational thinking is considered as important as reading, writing, and arithmetic. Many researchers, worldwide, have argued about the importance of integrating the teaching of computational thinking skills in school settings from an early age. However, little has been done in terms of systematically investigating the factors influencing the development of computational thinking in pre-primary education. Accordingly, the study herein investigated the development of young children’s computational thinking using robotics activities taking into consideration individual cognitive differences. One hundred and eighty children participated in the study. Participants were randomly assigned into six groups according to their cognitive type and scaffolding strategy. The findings showed that the cognitive type significantly affected children’s cognitive performance during learning with the robotics activities. In addition …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:JQOojiI6XY0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Distributed cognition: A framework for understanding learning with technology",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=1602823799505862531&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:R3hNpaxXUhUC",
            "Publisher": "PSYCHOLOGY PRESS"
        },
        {
            "Title": "Coding, programming and the changing curriculum for computing in schools",
            "Publication year": 2019,
            "Publication url": "https://www.ifip-tc3.org/app/download/7193549351/OCCE+2018+TC3+UNESCO+meeting+040219+CS+coding.pdf",
            "Abstract": "A meeting in Linz, Austria in June 2018 was convened by UNESCO together with IFIP TC3 in order to examine the needs and challenges/opportunities in relation to changing Computing curricula and the renewed focus on “coding” or programming and a stronger Computer Science content. The following key challenges previously identified (see task force/EDUSummIT report–Appendix 1) were all considered by delegates to apply in their own countries but with varying importance at different stages in their processes of curriculum change. Key Challenges (see Task Force TC 3/EDUSummIT Report Appendix 1 of this report) 1. Lack of clear understanding of Computer science/Informatics as an academic discipline. 2. Need for Computer Science/Informatics as a distinct subject in school curricula is controversial and poorly understood.3. Computational thinking, a core component of Computer Science/Informatics this considered to be important in 21st century skills, but due to its complexity, it is difficult to implement in schools. 4. The development of Computer Science/Informatics school curricula is impeded by insufficient empirical evidence of student learning in order to support content definition and sequencing. 5. Previous ICT curricula deliveries poorly prepared students for Computer Science/Informatics in further/higher education or professional employment. 6. Integrating Computer Science/Informatics across other subjects in school curricula has been ineffective.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Preservice elementary teachers as information and communication technology designers: An instructional systems design model based on an expanded view of pedagogical content knowledge",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1365-2729.2005.00135.x",
            "Abstract": " This study discusses the evolution of an instructional systems design (ISD) model that is based on an expanded view of Shulman's concept of pedagogical content knowledge (PCK). An initial model was evaluated in the first iteration of a design experiment, and then it was changed and assessed in two other iterations that followed. The proposed ISD model can be used in educational technology courses, elementary teacher education method courses, and teacher professional development courses to develop information and communication technology (ICT)‐related PCK. ICT‐related PCK comprises a body of knowledge that educators need to be able to teach with ICT. Evidence from the present study, with preservice elementary teachers, indicates that the evolved model was effective in developing some aspects of ICT‐related PCK. Based on the results of the study, more systematic efforts are needed to engage …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Blackwell Science Ltd"
        },
        {
            "Title": "Assessing Preservice Teachers’ Scientific Reasoning: Content Analysis of a Text-Based Computer-Supported Online Conference",
            "Publication year": 2006,
            "Publication url": "https://www.learntechlib.org/p/22718/",
            "Abstract": "Forty-seven preservice teachers who were enrolled in a science education methods course were introduced to the use of hypothetico-predictive arguments in the context of testing hypotheses about several experiments. During a lab session, participants were asked to predict and discuss in teams of two to three students what would happen when a cylinder is inverted over a burning candle upright in a pan of water and resolve any differences in points of view using the an online discussion forum in WebCT. The online discussion forum was anonymous in order to encourage students' participation in dialogue and negotiation of meaning. The results of this study showed that despite the fact that participants had previously taken other science courses they lack a sound understanding of the nature of important science inquiry processes such as hypothesis testing and evidence-based argumentation.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:u_35RYKgDlwC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Teaching spreadsheets: A TPCK perspective",
            "Publication year": 2013,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.4324/9780203078723-20/teaching-spreadsheets-tpck-perspective-charoula-angeli",
            "Abstract": "Spreadsheets are computerized systems that have automated the recordkeeping process. Learning about them in school is important, because they are an indispensable tool in the contemporary workplace. Traditionally, the teaching of spreadsheets, in K-12 settings, tertiary education, and teacher professional development programs, has had a technocentric and decontextualized focus, and aimed at mainly demonstrating the technical features of the computer application in relation to storing, calculating, and presenting information. As a result, students and teachers failed to recognize how spreadsheets could be used to support thinking and learning in various disciplines and content domains. What is the required knowledge for teaching spreadsheets in a contextualized way as tools that can facilitate the teaching and learning process?",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:_kc_bZDykSQC",
            "Publisher": "Routledge"
        },
        {
            "Title": "A Framework and an Instructional Design Model for the Development of Students' Computational and Algorithmic Thinking.",
            "Publication year": 2016,
            "Publication url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1019&context=mcis2016",
            "Abstract": "The authors herein, describe their efforts towards designing technology-enhanced instruction for teaching Computational and Algorithmic Thinking. This study examined students’ development of Computational and Algorithmic Thinking, by utilizing the framework of Technological Pedagogical Content Knowledge and the instructional design model of Technology Mapping. Different technological tools were used for both groups of participants; the experimental and the control group. In particular, the experimental group used educational robotics and the control group used a 3D interactive programming environment. Both groups were 8th graders coming from different secondary education schools in Cyprus. A pre-post test research design was adopted in each classroom intervention. To check whether the interventions facilitated students’ development and understanding of Computational and Algorithmic Thinking …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Technological Pedagogical Content Knowledge and the Inclusion of Affect in the Design of Technology-Enhanced Music Lessons.",
            "Publication year": 2019,
            "Publication url": "https://eric.ed.gov/?id=ED614721",
            "Abstract": "In this study, the authors propose a set of design principles based on the framework of Technological Pedagogical Content Knowledge (TPCK or TPACK) through the subject matter of music focusing on the affective domain, and identify interrelations among musical content, emotions, and technology. The design guidelines were tested in an empirical investigation and the results showed statistically significant differences between the control and the experimental groups in favor of the experimental group. The study extends the theoretical framework of TPCK to a design framework and proposes instructional design guidelines that address both the cognitive and the affective domains of learning, a focus that is currently missing from the existing TPCK or TPACK literature.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:2KloaMYe4IUC",
            "Publisher": "AERA Online Paper Repository. Available from: American Educational Research Association. 1430 K Street NW Suite 1200, Washington, DC 20005"
        },
        {
            "Title": "TPCK in pre-service teacher education: Preparing primary education students to teach with technology",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Charoula-Angeli/publication/229038437_TPCK_in_pre-service_teacher_education_Preparing_primary_education_students_to_teach_with_technology/links/00b7d51f10dedc28d1000000/TPCK-in-pre-service-teacher-education-Preparing-primary-education-students-to-teach-with-technology.pdf",
            "Abstract": "Two epistemological views are assumed, namely the integrative and the transformative views, for exploring the construct of technological pedagogical content knowledge (TPCK). The transformative view is adopted and based on empirical findings it is concluded that TPCK constitutes a unique body of knowledge constructed from the dynamic interaction of constituent knowledge bases, namely knowledge of content, pedagogy, learners, context, and technology. A clarified view of TPCK is discussed and two models for teaching and assessing TPCK are described. Technology Mapping is proposed as a design-based approach for understanding and promoting a constructivist methodology toward the development of TPCK, and an integrating model of assessment, consisting of three forms, namely, expert/teacher assessment, peer assessment, and self-assessment, is proposed for assessing TPCK.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue articles",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/42544129/ets_13_1_contents.pdf",
            "Abstract": "Journal of Educational Technology & Society Page 1 iii ISSN 1436-4522. © International Forum \nof Educational Technology & Society (IFETS). The authors and the forum jointly retain the \ncopyright of the articles. Permission to make digital or hard copies of part or all of this work for \npersonal or classroom use is granted without fee provided that copies are not made or distributed \nfor profit or commercial advantage and that copies bear the full citation on the first page. \nCopyrights for components of this work owned by others than IFETS must be honoured. \nAbstracting with credit is permitted. To copy otherwise, to republish, to post on servers, or to \nredistribute to lists, requires prior specific permission and/or a fee. Request permissions from the \neditors at kinshuk@massey.ac.nz. ISSN 1436-4522 (online) and 1176-3647 (print). © \nInternational Forum of Educational Technology & Society (IFETS). The authors and the forum the . …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personal Epistemology and Ill-Defi ned Problem Solving in Solo and Duo Contexts",
            "Publication year": 2012,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.4324/9780203806616-21/personal-epistemology-ill-defi-ned-problem-solving-solo-duo-contexts-nicos-valanides-charoula-angeli",
            "Abstract": "The chapter reports on the results of a mixed-methods study that was undertaken to examine how teachers with different personal epistemologies reasoned about a controversial ill-defi ned issue individually and with others in dyads. The results of the study showed that teachers used more cognitive statements to support their point of view when they thought alone and more cultural and emotional statements when they thought with others in dyads. Thus, based on the results, controversial ill-defi ned problem solving within a social context may trigger more emotional activity for an individual than when he or she thinks alone. It is recommended that future studies examine the relationship between epistemic beliefs and reasoning in a contextualized way by assuming an integrative approach so that emotions, epistemological beliefs, and cognition are considered systematically.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Routledge"
        },
        {
            "Title": "An instructional design model for teaching pre-service elementary teachers to teach science with computer models",
            "Publication year": 2011,
            "Publication url": "https://www.ingentaconnect.com/contentone/asp/asl/2011/00000004/f0020011/art00006",
            "Abstract": "Many reported studies about models and modeling clearly indicate that teachers need to be knowledgeable about the role of models and modeling in science and need to be engaged in rich modeling activities, so that they become able to use models in science teaching and learning. In view of adequately preparing pre-service teachers to teach science through models, the authors herein discuss an instructional design model that was developed to guide pre-service teachers' preparation in the pedagogical uses of computer models. After the intervention, pre-service teachers were asked to propose two science topics to be taught with computer models and to design a lesson for each topic. Both qualitative and quantitative analyses were conducted to assess preservice teachers' lessons. Recommendations about how the instructional design model can be further improved in future teacher preparation programs are …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:pyW8ca7W8N0C",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "009 COGNITIVE LOAD IMPOSED BY INTEGRATING INFORMATION AND COMMUNICATION TECHNOLOGY IN A TEACHER EDUCATION COURSE",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/42295060/ED469619.pdf#page=93",
            "Abstract": "Prospective teachers necessarily need formal training in integrating different technologies in the teaching-learning environment. In this paper, we report on findings regarding primary student teachers' attitudes about the use of technology in education, their frequency of software use such as the Internet and Hyperstudio, and the extent to which the use of web-based tools, such as Filamentality, affected their perceived cognitive load.Three questionnaires were administered to 41 fourth-year primary student teachers to collect data. These students were divided into two intact groups formed during registration. At the beginning of the semester, students were given a short questionnaire to indicate how frequently they used the technologies of the Internet and Hyperstudio. Students were also administered a 15-item questionnaire measuring their attitudes towards ICT and its integration in the classroom. The cognitive load imposed by technology was measured with a questionnaire, at the end of the semester, in terms of:(a) the mental effort they exerted to learn Hyperstudio,(b) the mental effort they exerted to search the Internet and collect quality information for their projects, and (c) the mental effort they exerted to design instructional activities using Hyperstudio. One group was deliberately instructed and guided to use Filamentality, and organize the information collected in a Hotlist and a Scrapbook, while the other was not. The results of the study showed that the majority of students had favorable attitudes towards technology-enhanced instruction. In addition, there were initial differences in students' frequency of using the Internet and Hyperstudio. An …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Understanding Teachers as Designers of Computer-Based Adaptive Instruction",
            "Publication year": 2018,
            "Publication url": "https://www.learntechlib.org/p/182743/",
            "Abstract": "The paper reports on an intervention implemented for preparing teachers in the design of adaptive e-learning The qualitative analysis included data gathered from a variety of sources and aimed at identifying difficulties the teachers faced during the intervention such as distinguishing between adaptability and adaptivity, as well as, between adaptation coming from digital technology and adaptation enacted by a human-teacher The research is significant as it tackles a topic in the field of teacher education and instructional design that is currently uncharted, and provides baseline data in regards to how teacher educators can prepare teachers to be instructional designers of adaptive e-learning.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:eflP2zaiRacC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "A conceptual framework for scaffolding critical thinking in an online conference for a science education methods course",
            "Publication year": 2005,
            "Publication url": "https://www.learntechlib.org/p/20159/",
            "Abstract": "The purpose of this research study was to develop a conceptual framework for scaffolding learners' critical thinking in a text-based online conferencing system for a science education methods course. The specific question that we sought to answer in this paper was what kinds of scaffolds are needed, so that students are able to think critically about an issue in science. A review of the literature was conducted and the results of the review identified five different types of scaffolding in promoting critical thinking in science. They included (a) scaffolding conceptual understanding in science,(b) scaffolding general critical thinking skills,(c) scaffolding science-specific processes,(d) scaffolding general habits of mind in science, and (e) scaffolding the application of criteria or standards in science.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:aqlVkmm33-oC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "An Instructional Model for Transforming Science Education Method Courses with Technology",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/13148/",
            "Abstract": "In this study, an instructional design model was developed and employed for restructuring science education method courses with technology. Using tools, such as multimedia authoring tools, the design and implementation of high quality technology-enhanced learning was modeled repeatedly. The results from two case studies identified several difficulties that primary student teachers faced in designing computer-assisted instruction for science. Succinctly, student teachers faced difficulties in regard to (a) using appropriate technology-supported representations to transform science content,(b) identifying computer-supported teaching strategies, as well as (c) integrating technology with inquiry-based pedagogy in the classroom.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Observe, Discuss, and Reason with Evidence in Science: Scaffolding Conceptual Change with ODRES",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30861794/200509L016.pdf",
            "Abstract": "In this study, we discuss the scaffolded design of ODRES™, a computer tool that was designed to be used with elementary school children in science. Succinctly, the software engages learners in inquiry learning to solve a mystery problem about a stolen diamond. ODRES™ scaffolds students’ investigations with different tools such as the simulator, which simulates the effects of the colour of a light source on an object, a magnifying glass, which enables students to make careful observations, and the notebook, which organizes the results of students’ investigations. Herein, we report on the effects of learning with ODRES™ as well as the effects of ODRES™ on students understandings about light and colour. The results showed that the effects of the intellectual partnership with ODRES™ as well as the cognitive residue that ODRES™ left on learners were significant.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data mining in educational technology classroom research: Can it make a contribution?",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131517301264",
            "Abstract": "The paper addresses and explains some of the key questions about the use of data mining in educational technology classroom research. Two examples of use of data mining techniques, namely, association rules mining and fuzzy representations are presented, from a study conducted in Europe and another in Australia. Both of these studies examine student learning, behaviors, and experiences within computer-supported classroom activities. In the first study, the technique of association rules mining was used to understand better how learners with different cognitive types interacted with a simulation to solve a problem. Association rules mining was found to be a useful method for obtaining reliable data about learners' use of the simulation and their performance with it. The study illustrates how data mining can be used to advance educational software evaluation practices in the field of educational technology. In …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Investigating TPCK through music focusing on affect",
            "Publication year": 2018,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/IJILT-08-2017-0081/full/html",
            "Abstract": "The purpose of this paper is to address the lack of a theoretical framework for the integration of technology in music teaching and learning, and explores, within the framework of Technological Pedagogical Content Knowledge (TPCK or TPACK), the importance of affect in instructional design.The authors reviewed relevant literature related to the fields of music education, instructional design, and technology integration. Accordingly, they developed guidelines for designing technology-enhanced learning for the activities of music composition and listening.The authors propose a set of design principles based on the TPCK framework through the subject matter of music focusing on the affective domain, and identify interrelations among musical content, emotions, and technology. The design guidelines were tested in an empirical investigation and the results showed …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "An exploratory study about the role of epistemological beliefs and dispositions on learners’ thinking about an iII-defined issue in solo and duo problem-solving contexts",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-6596-5_9",
            "Abstract": "This chapter examines the relationship between epistemological beliefs and dispositions and their role on ill-defined problem solving in solo and duo contexts. The results showed that different aspects of epistemological beliefs correlated significantly with some dispositions, and that solo and duo contexts triggered different aspects of the constructs, although both of them were important for illdefined problem solving. Lastly, the findings showed that emotions were associated with some aspects of epistemological beliefs and dispositions in the duo problemsolving context only.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Scientific investigations of elementary school children",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10956-013-9448-6.pdf",
            "Abstract": "The study provides evidence concerning elementary school children’s ability to conduct a scientific investigation. Two hundred and fifty sixth-grade students and 248 fourth-grade students were administered a test, and based on their performance, they were classified into high-ability and low-ability students. The sample of this study was randomly selected and included 80 students, 40 fourth-grade and 40 sixth-grade students of low and high abilities. Students were specifically instructed to investigate the functioning of a device, to think aloud prior and after any experiment with the device, and to keep a record of their experimental results. The results showed that students were inclined to mainly collect evidence from the experimental space and failed to control variables during their investigation. The majority of the students had difficulties with effectively organizing collected data and failed to coordinate …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "2Theoretical Considerations of Technological Pedagogical Content Knowledge",
            "Publication year": 2016,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.4324/9781315771328-8/2theoretical-considerations-technological-pedagogical-content-knowledge-charoula-angeli-nicos-valanides-andri-christodoulou",
            "Abstract": "In 2005, Technological Pedagogical Content Knowledge (TPCK or TPACK) was introduced to the educational research community as a framework for technology integration, as well as a body of knowledge of what teachers need to know to teach with technology (Angeli& Valanides, 2005; Koehler & Mishra, 2005; Niess, 2005). During the last decade, TPCK has received great attention from the research community, and, as a result, a considerable number of relevant articles appeared in the literature (Voogt, Fisser, Pareja Roblin, Tondeur, & van Braak, 2013).",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Routledge"
        },
        {
            "Title": "e-TPCK: An Adaptive E-Learning Technology for the Development of Teachers’ Technological Pedagogical Content Knowledge",
            "Publication year": 2015,
            "Publication url": "https://www.learntechlib.org/p/150431/",
            "Abstract": "The authors herein discuss the design and implementation of e-TPCK, an adaptive e-learning environment that targets the development of teachers’ Technological Pedagogical Content Knowledge (TPCK). The system deploys a technological solution that promotes teachers' ongoing TPCK development by engaging them in the design of learner-centered ICT-infused scenarios fostering a self-paced and personalized learning experience, while taking, at the same time, into account teachers’ diverse needs, information processing constraints, and preferences. The design of the system followed a design-based research methodology and was informed by different theoretical and methodological frameworks. The authors conclude with recommendations about how to improve the design of e-TPCK by incorporating built-in features to support adaptive scaffolding and self-regulatory processes in order to provide a …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Distributed Cognition in a Sixth-Grade Classroom: An Attempt to Overcome Alternative Conceptions about Light and...",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/66895641/EJ826080.pdf",
            "Abstract": "In this study, we discuss the scaffolded design of ODRES (Observe, Discuss, and Reason with Evidence in Science), a computer tool that was designed to be used with elementary school children in science, and report on the effects of learning with ODRES on students’ conceptual understandings about light, color, and vision. Succinctly, dyads of sixth-grade students were engaged in distributed collaborative inquiry regarding the scientific concepts of light, vision, and color in order to solve a mystery problem about a stolen diamond. ODRES was employed to scaffold students’ collaborative inquiry with different tools, such as the simulator that simulates the effects of the color of a light source on an object, the magnifying glass that enables students to make careful observations, and the notebook that organizes the results of students’ investigations. Students performed two cycles of collaborative inquiry, and each cycle was followed by a classroom discussion where students could present their solutions, share information, reflect, raise questions, and get feedback about their proposed solutions. The results showed that learning with ODRES positively affected students’ understandings and promoted a lasting effect on their conceptions. Moreover, the results provide useful guidance about how ODRES can be used as a learning tool in collaborative inquiry, and explain the role of discussion and investigation of inquiry processes at the level of a distributed cognitive system. Implications for designing distributed educational systems for children are finally discussed.(Keywords: distributed cognitive system, collaborative inquiry, computer-assisted learning …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing young children's computational thinking with educational robotics: An interaction effect between gender and scaffolding strategy",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563219301104",
            "Abstract": "The study examined the effects of learning with the Bee-Bot on young boys' and girls' computational thinking within the context of two scaffolding techniques. The study reports statistically significant learning gains between the initial and final assessment of children's computational thinking skills. Also, according to the findings, while both boys and girls benefited from the scaffolding techniques, a statistically significant interaction effect was detected between gender and scaffolding strategy showing that boys benefited more from the individualistic, kinesthetic, spatially-oriented, and manipulative-based activity with the cards, while girls benefited more from the collaborative writing activity. In regards to the children's problem-solving strategies during debugging, the results showed that the majority of them used decomposition as a strategy to deal with the complexity of the task. These results are important, because they …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Using educational data mining methods to assess field-dependent and field-independent learners’ complex problem solving",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11423-013-9298-1.pdf",
            "Abstract": "The present study investigated the problem-solving performance of 101 university students and their interactions with a computer modeling tool in order to solve a complex problem. Based on their performance on the hidden figures test, students were assigned to three groups of field-dependent (FD), field-mixed (FM), and field-independent (FI) learners, and were instructed to use integrated-format materials and Model-It® in order to solve a problem about immigration policy. The results showed that there were significant differences among the three groups of learners in terms of their problem-solving performance. Consequently, the study employed educational data mining (EDM) methods in order to examine how FD and FI learners actually interacted with Model-It® in order to solve the problem. The EDM methods provided rich analytical information and details about learners’ interactions with the computer …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Transforming a teacher education method course through technology: Effects on preservice teachers’ technology competency",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131504000946",
            "Abstract": "In this study, an instructional design model was employed for restructuring a teacher education course with technology. The model was applied in a science education method course, which was offered in two different but consecutive semesters with a total enrollment of 111 students in the fall semester and 116 students in the spring semester. Using tools, such as multimedia authoring tools in the fall semester and modeling software in the spring semester, teacher educators designed high quality technology-infused lessons for science and, thereafter, modeled them in classroom for preservice teachers. An assessment instrument was constructed to assess preservice teachers’ technology competency, which was measured in terms of four aspects, namely, (a) selection of appropriate science topics to be taught with technology, (b) use of appropriate technology-supported representations and transformations for …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Improving computer science education",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=fTGSv1QeiYIC&oi=fnd&pg=PR1&dq=info:LJ_-iNovUTUJ:scholar.google.com&ots=I8UWYKdIRv&sig=jZ6tgBeiaZqQQUL9LYKnjbCcx7U",
            "Abstract": "Improving Computer Science Education examines suitable theoretical frameworks for conceptualizing teaching and learning computer science. This highly useful book provides numerous examples of practical,\" real world\" applications of major computer science information topics, such as:• Spreadsheets• Databases• Programming Each chapter concludes with a section that summarzies recommendations for teacher professional development. Traditionally, computer science education has been skills-focused and disconnected from the reality students face after they leave the classroom. Improving Computer Science Education makes the subject matter useful and meaningful by connecting it explicitly to students' everyday lives.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Epistemological and methodological issues for the conceptualization, development, and assessment of ICT–TPCK: Advances in technological pedagogical content knowledge (TPCK)",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131508001085",
            "Abstract": "In this paper, several issues regarding the epistemology of technological pedagogical content knowledge (TPCK) are first raised for the purpose of clarifying the construct. Specifically, the transformative and integrative views are juxtaposed for exploring the epistemology of TPCK, and, at the end, the transformative view is adopted concluding that TPCK is a unique body of knowledge that is constructed from the interaction of its individual contributing knowledge bases. Then, ICT–TPCK is introduced as a strand of TPCK, and is described as the ways knowledge about tools and their affordances, pedagogy, content, learners, and context are synthesized into an understanding of how particular topics that are difficult to be understood by learners or difficult to be represented by teachers can be transformed and taught more effectively with technology in ways that signify its added value. One model for the development and …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Promoting Evidence-Based Reasoning in Science Through Technology: The Case of Learning about Colour and Light with ODRES™",
            "Publication year": 2006,
            "Publication url": "https://www.learntechlib.org/p/22719/",
            "Abstract": "In this study we report on the effects of learning with ODRES™, a computer tool that was designed to promote elementary students' evidence-based scientific reasoning, as well as the effects of ODRES™ on students' conceptions three months after the study was completed. A t-test for paired samples was performed, and the difference between participants' performance on the pre-test and post-test was found to be statistically significant indicating that the effects of the intellectual partnership with ODRES™ were significant. Three months after the post-test, a transfer test was administered to examine the cognitive residue that the intellectual partnership with the tool has left on learners. A t-test for paired samples showed that the difference between participants' performance on the pre-test and transfer test was statistically significant, while there was no statistically significant difference between students' performance on …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "The effects of scaffolded programming scripts on pre-service teachers’ computational thinking: Developing algorithmic thinking through programming robots",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212868921000519",
            "Abstract": "Workers in the areas of science, technology, engineering and mathematics play a significant role in the sustained growth and stability of the global economy, and, thus constitute a critical component in helping all countries worldwide to prosper. In this context, computational thinking constitutes an important skill to have as it enables workers to develop creative solutions to complex problems. Nonetheless, across all economies worldwide, there is a need to have more workers who are able to think through problems, challenges, and solutions in computational terms. It is thus of utmost importance to integrate the teaching of computational thinking in K-12 education in order to reduce the skills gap between education and the workplace. A pertinent and crucial question that arises is whether teachers have the knowledge and skills to teach students how to think computationally. Existing research shows that teacher …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Instructional Design Effects, Field Dependence-Independence, and Problem Solving with a Computer Modeling Tool",
            "Publication year": 2011,
            "Publication url": "https://www.learntechlib.org/p/38342/",
            "Abstract": "The study investigated the extent to which two types of instructional materials and learner field dependence-independence affected learners’ cognitive load, time spent on task, and problem-solving performance in a complex system with a computer modeling tool. One group received a static diagram and a textual description in a split format, and the second group received the same static diagram and textual description in an integrated format. MANOVA revealed that the split-format materials contributed to higher cognitive load, higher time spent on task, and lower problem-solving performance than the integrated-format materials. There was also an interaction effect, only in terms of students’ problem-solving performance, between field dependence-independence and instructional materials, indicating that the facilitating effect of the integrated-format materials was restricted to the field-independent learners.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Computer Science in the School Curriculum: Issues and Challenges",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vexIDwAAQBAJ&oi=fnd&pg=PA419&dq=info:qhn-Vh820ZcJ:scholar.google.com&ots=5EQKiJQnLE&sig=3lYJ_tqhCUOvsvLh_LutZMQU67k",
            "Abstract": "This paper is based on analysis and discussion undertaken over several years by researchers, policymakers and practitioners from a range of countries which vary in their approaches to the curriculum for Computer Science. The discussions, undertaken predominantly within the International Federation of Information Processing (IFIP) and EDUsummIT communities were motivated by a need to examine the rationale, issues and challenges following some concerns across the globe about the position and nature of Computer Science in the school curriculum. We summarise our findings and focus specifically on challenges for the computer science education community in",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Developing Preschool Children's Computational Thinking with Educational Robotics: The Role of Cognitive Differences and Scaffolding.",
            "Publication year": 2019,
            "Publication url": "https://eric.ed.gov/?id=ED608699",
            "Abstract": "The development of computational thinking is as important as writing, reading and arithmetic, and, it should start as early as kindergarten (Wing, 2008). However, little has been done in terms of investigating the factors influencing the development of computational thinking in preschool education (Bers et al., 2014; Ching et al., 2018; Kazakoff et al., 2013; Sullivan et al., 2013). Accordingly, the study herein investigated how young children’s computational thinking could be developed using the Bee-Bot and two scaffolding techniques, while children’s field-dependence/independence (FDI) was taken into consideration. The study has practical significance for classroom teachers, as they can use the results of this research to integrate the teaching of computational thinking skills in their lessons.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:ye4kPcJQO24C",
            "Publisher": "International Association for the Development of the Information Society"
        },
        {
            "Title": "How do field-dependent and field-independent learners interact with a computer modeling tool to solve a problem? Implications for the design of joint cognitive systems",
            "Publication year": 2012,
            "Publication url": "http://www.icicte.org/Proceedings2012/Papers/03-1-Angeli.pdf",
            "Abstract": "Research accounts on examining only the performance of a system are not sufficient, because they cannot establish principles about how technology affordances work with learners, and how one should go about improving the performance of the system. Therefore, in the current study, a mixed-method research methodology was undertaken in order to understand how 119 learners with different cognitive styles interacted with a computer-modeling tool to solve a problem. Implications for the design of effective joint cognitive systems are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Professional development for computer‐enhanced learning: a case study with science teachers",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/02635140701847397",
            "Abstract": "The preparation of science teachers to integrate computers in their teaching seems to be a challenging task, and teacher educators need to undertake systematic and coordinated efforts for effectively preparing teachers to teach with computers. The present study implemented a professional development approach for in‐service science teachers regarding the pedagogical uses of computers in teaching and learning, and examined its effectiveness. The results showed that the approach was effective in adequately preparing science teachers to design computer‐enhanced learning with various computer applications. Specifically, the majority of the teachers who participated in the study selected appropriate science topics to be taught with computers, transformed science content with appropriate computer tools and computer‐supported representations, identified computer‐supported teaching tactics, and integrated …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:WF5omc3nYNoC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Cases on Developing Teachers Technological Pedagogical Content Knowledge (TPACK) in the Digital Age",
            "Publication year": 2019,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/62314",
            "Abstract": "Cases on Developing Teachers Technological Pedagogical Content Knowledge (TPACK) in the \nDigital Age Toggle navigation English Ελληνικά English English Ελληνικά Login Toggle \nnavigation View Item Home Δημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή Κοινωνικών \nΕπιστημών και Επιστημών Αγωγής / Faculty of Social Sciences and Education Τμήμα Επιστημών \nτης Αγωγής / Department of Education View Item Home Δημοσιεύσεις ΠΚ / UCY Publications \n003 Σχολή Κοινωνικών Επιστημών και Επιστημών Αγωγής / Faculty of Social Sciences and \nEducation Τμήμα Επιστημών της Αγωγής / Department of Education View Item Book Cases on \nDeveloping Teachers Technological Pedagogical Content Knowledge (TPACK) in the Digital \nAge Thumbnail Date 2019 Editor Niess, M. Gillow-Wiles, H. ORCID logo Angeli, Charoula \nPublisher IGI Global Place of publication Hershey, PA Google Scholar check Metadata Show …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:hkOj_22Ku90C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Examining the effects of text-only and text-and-visual instructional materials on the achievement of field-dependent and field-independent learners during problem-solving with modeling software",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/BF02504715",
            "Abstract": "Sixty-five undergraduates were classified into field-dependent, field-mixed, and field-independent learners, and were randomly assigned to two groups: text-only and text-and-visual. Participants in the text-only group received a description of a model in textual format, whereas participants in the other group received the same description in textual-and-visual format. Participants were then asked to individually explore a computer model, test hypotheses, and solve a problem related to immigration policies. Their problem-solving performance was analyzed using a 3×2 analysis of variance (ANOVA). Results showed that the text-and-visual group outperformed the text-only group, that performance was significantly related to field-dependence-independence, and that there was a significant interaction effect. Specifically, field-independent learners in the text-and-visual group outperformed field-dependent and …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "An adaptive e-Learning strategy to overcome the inherent difficulties of the learning content",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-45153-4_40",
            "Abstract": " In this paper we propose a strategy of adaptive e-learning that aims to help students overcoming the inherent difficulties of STEM-related subject matters for which they have known misconceptions. The paper reports on empirical findings derived from classroom interventions which were undertaken to investigate the impact of the proposed strategy. For each intervention, an adaptive e-course was developed and tested with encouraging results. Since the proposed strategy is descriptive in nature the paper can be used as the basis for future studies that validate it with other subject matters than those mentioned herein.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Effects of Electronic Scaffolding on Preservice Teachers Perceived Task Effort",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/12749/",
            "Abstract": "Forty-one preservice teachers were divided into two groups and were instructed how to integrate certain Information and Communication Technology (ICT) tools in learning activities. Only one group was guided to use Filamentality, a fill-in-the-blank interactive web site, and organize Internet information in a Hotlist and a Scrapbook. Questionnaires were administered to collect data related to students' perceived task effort (PTE) as a result of integrating ICT in the learning environment. The results indicated that Filamentality effectively scaffolded particular aspects of ICT integration in learning and instruction, and significantly reduced learners' amount of PTE.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:TFP_iSt0sucC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Holy COW: Scaffolding case-based “Conferencing on the Web” with preservice teachers",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Charoula-Angeli/publication/237554493_Holy_COW_Scaffolding_Case-Based_Conferencing_on_the_Web_With_Preservice_Teachers/links/5475c7ab0cf29afed612b44f/Holy-COW-Scaffolding-Case-Based-Conferencing-on-the-Web-With-Preservice-Teachers.pdf",
            "Abstract": "This study explored how to use the Web to foster collaboration and interaction among preservice teachers in undergraduate educational psychology. These preservice teachers conversed electronically with peers, mentors, and instructors on the Web about cases related to their early field experiences using an asynchronous conferencing tool called Conferencing on the Web (COW). Whereas earlier research compared levels of scaffolding on student generation and discussion of cases in COW within specific time periods, this particular study allowed longer amounts of time for students to post and discuss cases. In addition, there was more qualitative data collected here than in the previous study. The 157 student participants in this study produced 319 cases during the conference with 620 peer replies and 298 mentor replies. Students submitted the majority of their cases to the secondary-school conference, while less than ten percent of the cases were submitted to the general-case conference. In effect, they failed to perceive the generalizability of their field experiences. Students received on average about three peer or mentor comments on their cases. Transcript analyses from 75 randomly selected cases indicated that students failed to justify most of their comments. In addition, peer feedback was extremely conversational and opinionated. Conversely, instructor mentoring was focused on high level questioning, providing examples, and case specific feedback. While data from student interviews and evaluative surveys on their electronic conferencing experience were mixed, students who experienced this activity as part of an entire Web-based …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scaffolding complex learning with a computer modeling tool in a science education methods course",
            "Publication year": 2005,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/38640",
            "Abstract": "In this study, we provided preservice teachers with a computer modeling experience in a science education methods course, and studied the effects of this experience on their abilities to construct viable scientific models with a computer-modeling tool and teach a sixth-grade science lesson through models. The results of the study showed that (a) Model-It, through its scaffolds (i.e., plan, build, and test modes), enabled the majority of preservice teachers to build models that were structurally correct, (b) participants' models were structurally correct but simplistic, and (c) 65% of the participants preferred to teach science using the explorative modeling method, 27% the expressive method, and only 8% both the explorative and the expressive methods. In essence, the software provided participants with a tool to quickly build and test their models as well as reflect on the viability of their models. Thus, Model-it effectively scaffolded preservice teachers' first modeling experiences. It is however recognized that systematic efforts need to be undertaken to adequately prepare prospective teachers to teach science through models.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer science in the school curriculum: Issues and challenges",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-74310-3_43",
            "Abstract": "This paper is based on analysis and discussion undertaken over several years by researchers, policymakers and practitioners from a range of countries which vary in their approaches to the curriculum for Computer Science. The discussions, undertaken predominantly within the International Federation of Information Processing (IFIP) and EDUsummIT communities were motivated by a need to examine the rationale, issues and challenges following some concerns across the globe about the position and nature of Computer Science in the school curriculum. We summarise our findings and focus specifically on challenges for the computer science education community in communicating, clarifying needs and promoting curriculum change in order to encourage Computer Science in the curriculum both theoretically and practically.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Technological Pedagogical Content Knowledge: A framework for preparing teachers in technology integration",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Stefania-Donadio/publication/326317046_Docenti_e_tecnologie_didattiche_alla_Scuola_Don_Milani_otto_anni_di_esperienza_della_comunita_online_e_del_centro_risorse_del_territorio/links/5b45a244a6fdcc66191721f9/Docenti-e-tecnologie-didattiche-alla-Scuola-Don-Milani-otto-anni-di-esperienza-della-comunita-online-e-del-centro-risorse-del-territorio.pdf#page=17",
            "Abstract": "In an era where new digital technologies are gradually revolutionizing all aspects of daily life, teachers are called once more to respond to the needs of the society and find ways to integrate these technologies in their classroom teaching. Educating teachers on how to effectively integrate technology in classroom practices has been one of the main and continual goals of national and international school reform efforts in various countries (NCEE, 2007; Mouza, 2009). A variety of approaches have been adopted over the years to prepare and support teachers in integrating technology in classroom practices, although the results have not always been positive (Ertmer & Ottenbreit-Leftwich, 2010). For this reason, about a decade ago, researchers around the world set out to develop a conceptual framework to systematically guide teachers’ cognition about technology integration. Overwhelmingly, researchers agreed that teachers need to develop a body of knowledge that has been referred to in the literature as Technological Pedagogical Content Knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Arguing for computer science in the school curriculum",
            "Publication year": 2016,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.19.3.38.pdf",
            "Abstract": "Computer science has been a discipline for some years, and its position in the school curriculum has been contested differently in several countries. This paper looks at its role in three countries to illustrate these differences. A reconsideration of computer science as a separate subject both in primary and secondary education is suggested. At EDUsummIT 2015 it was argued that the major rationales for including computer science as a subject in the K-12 curriculum are economic, social and cultural. The paper explores these three rationales and also a beneficence matrix to assist curriculum designers. It also argues computer science is rapidly becoming critical for generating new knowledge, and should be taught as a distinct subject or content area, especially in secondary schools. The paper concludes by looking at some of the key questions to be considered when implementing computer science in the school …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:dshw04ExmUIC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Examining the effects of an instructional intervention on destabilizing learners' misconceptions about the central processing unit",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2670757.2670784",
            "Abstract": "This study examined students' misconceptions about the central processing unit (CPU) and how these could be destabilized, by utilizing the framework of Technological Pedagogical Content Knowledge and the instructional design model of Technology Mapping. The technological tool that was used in the study was MS Excel™. One hundred and fifty 8 th graders participated, 71 (47, 3%) females and 79 (52, 7%) males. The participants were students in thirteen different intact classes coming from four different schools and were taught by four different secondary education computer science teachers. The duration of the instructional intervention was two teaching periods of 45 minutes each. At the beginning of the first teaching period a pretest was administered to test students' initial perceptions about the CPU. At the end of the intervention the pretest was again administered as posttest. To check whether the …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing Third-Grade Students’ Computational Thinking Skills with Educational Robotics",
            "Publication year": 2018,
            "Publication url": "https://www.learntechlib.org/p/182493/",
            "Abstract": "The paper addresses the issue of how computational thinking can be taught to young children with the use of educational robotics using the kit LEGO WeDo Due to the young age of the students who participated in the study, computational thinking was measured in terms of four sub-skills, namely, sequencing, correspondence between actions and instructions, debugging, and flow of control Students were assigned to an experimental group and a control group The results of the study showed that educational robotics was an effective method for teaching computational thinking skills to elementary school students According to the findings, students in the experimental group outperformed the students in the control group These findings showed that, despite the short duration of the intervention, engaging children in computer programming activities with robots helped them to develop computational thinking skills",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:D_sINldO8mEC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Examining the Effects of Electronic Mentoring Prompts on Learners' Scientific Reasoning Skills in a Text-Based Online Conference for a Science Education Course.",
            "Publication year": 2008,
            "Publication url": "https://eric.ed.gov/?id=EJ890646",
            "Abstract": "In a science education methods course, groups of students were initially involved in a face-to-face discussion and were sensitized about certain conflicting claims regarding a puzzling observation or set of observations. They were then instructed to resolve their conflicting ideas through electronic discussion. Students had two weeks time to participate in the online discussion by posting their points of view as well as replying to others' postings using the asynchronous discussion feature of WebCT. Students discussed these claims, and conducted more experiments, whenever they felt they need, in order to reach consensus about their opposing claims. The online discussion was anonymous in order to encourage students' participation in dialogue and negotiation of meaning. It was thus possible to identify students' alternative frameworks and attempt to facilitate conceptual change and understanding. The instructor of the course participated in the online discussion as a student by asking challenging questions. Students were supposed after participating in the online discussion to reach consensus and individually email their answers to the instructor. The data analysis provided ample evidence of students' patterns of thinking and their difficulties to be involved in evidence-based argumentation and reach valid conclusions acting as\" practicing scientists\" by forming and testing relevant hypotheses.(Contains 3 tables.)",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:dhFuZR0502QC",
            "Publisher": "International Council of Associations for Science Education. Dokuz Eylul University Faculty of Education, Buca, Izmir 35150, Turkey"
        },
        {
            "Title": "The impact of cognitive and affective aspects of cognitive conflict on learners’ conceptual change about floating and sinking",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/02635143.2013.811074",
            "Abstract": "Cognitive conflict has been identified as an important factor for bringing about students’ conceptual change. Researchers draw attention to the need to study not only cognitive factors related to cognitive conflict but affective factors as well.  Purpose:                 The purpose of this study was to investigate the contribution of cognitive and non-cognitive aspects involved in cognitive conflict on students’ conceptual change.  Sample:                 Fifteen students, five from each of fourth, sixth and eighth grades, participated in the study. Seven students were male, and the rest were female. All students had high academic performance and were good at explaining their reasoning.  Design and method:                 The study focused …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:4TOpqqG69KYC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Computational thinking education: Issues and challenges",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563219303978",
            "Abstract": "Computational Thinking is a term applied to describe the increasing attention on students' knowledge development about designing computational solutions to problems, algorithmic thinking, and coding. It focuses on skills children develop from practicing programming and algorithms, and enables the development of qualities such as abstract thinking, problem solving, pattern recognition, and logical reasoning. Contemporary educational and infrastructural developments, like “CS for All” (https://www.csforall.org/), ISTE's Standards for Students in Computational Thinking (https://www.iste.org/explore/Solutions/Computational-thinking-for-all?articleid=152), Computer Science Teachers Association's Concepts of Computational Thinking (http://advocate.csteachers.org/2014/09/15/computational-thinking-and-beyond/), and the appearance of tools such as robotics, 3D printing, microprocessors, and intuitive programming …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Advancing the TPACK Framework",
            "Publication year": 2021,
            "Publication url": "https://www.learntechlib.org/p/219324/",
            "Abstract": "Given the conceptual and theoretical issues facing TPACK and its utility to the profession, now is the time to engage in dialogue regarding the future of TPACK as a theoretical framework for effective technology integration into teaching and learning. The purpose of this panel is to present divergent perspectives regarding the conceptual nature of the TPACK framework and to engage the TPACK community in active dialogue regarding the future of TPACK and its ongoing development. In doing so, it is the hope that future areas for research are identified that will have the potential to advance the TPACK framework and its value to the profession.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:W5xh706n7nkC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Full length articles",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/36614786/ets_11_3_contents.pdf",
            "Abstract": "Journal of Educational Technology & Society Page 1 iii ISSN 1436-4522. © International Forum \nof Educational Technology & Society (IFETS). The authors and the forum jointly retain the \ncopyright of the articles. Permission to make digital or hard copies of part or all of this work for \npersonal or classroom use is granted without fee provided that copies are not made or distributed \nfor profit or commercial advantage and that copies bear the full citation on the first page. \nCopyrights for components of this work owned by others than IFETS must be honoured. \nAbstracting with credit is permitted. To copy otherwise, to republish, to post on servers, or to \nredistribute to lists, requires prior specific permission and/or a fee. Request permissions from the \neditors at kinshuk@massey.ac.nz. ISSN 1436-4522 (online) and 1176-3647 (print). © \nInternational Forum of Educational Technology & Society (IFETS). The authors and the forum the . …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introduction to special issue: Technological pedagogical content knowledge",
            "Publication year": 2013,
            "Publication url": "https://journals.sagepub.com/doi/pdf/10.2190/EC.48.2.a",
            "Abstract": "Researchers during the last years initiated systematic research efforts for the purpose of developing theory and models to ground research in the area of teacher cognition about technology integration (Angeli & Valanides, 2005, 2009; Margerum-Leys & Marx, 2003; Mishra & Koehler, 2006; Niess, 2005; Pierson, 2001). Particularly, they advocated that teachers need to develop a new body of knowledge, namely, technological pedagogical content knowledge (TPCK). TPCK constitutes an enrichment to Shulman’s (1986, 1987) pedagogical content knowledge (PCK), and is conceptualized as a body of knowledge that results from the interaction among different teacher knowledge bases, such as, knowledge about subject matter, pedagogy, learners, context, and technology. Studies on TPCK or TPACK—a term proposed in 2007 that could be more easily spoken and remembered than TPCK—are worthy of …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:M3ejUd6NZC8C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Effects of instruction on changes in epistemological beliefs",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0361476X05000020",
            "Abstract": "In this study, we investigated the effects of teaching critical-thinking principles on university students’ epistemological beliefs, whether these effects had any relation to the teaching approaches, and whether there was any significant interaction effect between teaching approach and students’ epistemological beliefs. One hundred and eight undergraduates were randomly assigned to three different 65-min instructional interventions, namely, General, Infusion, and Immersion approaches. Statistical analyses of the data using a Repeated Measures ANOVA showed a statistically significant higher post-assessment performance, F (1, 105) = 19.769, p = .00. The main effect related to the intervention was also significant, F (2, 105) = 3.995, p = .021, but there was no significant interaction between intervention and epistemological beliefs. Post hoc comparisons revealed that students assigned to the Infusion strategy …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Special issue articles",
            "Publication year": 2012,
            "Publication url": "https://www.ds.unipi.gr/et&s/journals/15_1/ets_15_1_contents.pdf",
            "Abstract": "ISSN 1436-4522.© International Forum of Educational Technology & Society (IFETS). The authors and the forum jointly retain the copyright of the articles.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PAUL: An adaptive electronic learning environment to develop teacher expertise and ICT-related technological pedagogical content knowledge (ICT-TPCK)",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/paul-adaptive-electronic-learning-environment/40557",
            "Abstract": "Adaptive e-learning systems can be extremely valuable tools in developing innovative learner-centered environments in any content domain. One area that can benefit greatly from adaptive e-learning systems is teacher development in the educational uses of computers. In this chapter, we discuss the design of PAUL, an adaptive computer-based learning environment for the development of ICT-related pedagogical content knowledge, a unique body of knowledge that teachers need to develop in order to be able to teach with ICT. PAUL combines two opposing trends in adapting instruction, namely instruction that is both controlled by the learner and the system. We expect the impact of PAUL to be significant as it will provide a venue for effective teacher professional development situating learning in virtual communities of practice and supporting teacher thinking about the educational uses of ICT in teaching and …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Learning and teaching about scientific models with a computer-modeling tool",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S074756320700012X",
            "Abstract": "The study presents efforts to support pre-service primary school teachers in learning and teaching about scientific models, and discusses the impact of these efforts on their understandings. We provided pre-service primary school teachers with a module on computer modeling and studied the effects of this experience on their abilities to construct viable scientific models with a computer-modeling tool, namely, Model-It [Metcalf, J. S., Krajcik, J., & Soloway, E. (2000). MODEL-IT: A Design Retrospective. In M. J. Jacobson & R. B. Kozma (Eds.), Innovations in Science and Mathematics Education (pp. 77–115). Mahwah, NJ: Lawrence Erlbaum Associates], in order to teach a sixth-grade science lesson. The results of the study showed that Model-It, through its scaffolds (i.e., Plan, Build, and Test), enabled the majority of pre-service teachers to build models that were structurally correct, but simplistic. The participants showed …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:UebtZRa9Y70C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Instructional effects on critical thinking: Performance on ill-defined issues",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0959475208000753",
            "Abstract": "Undergraduate students in dyads (N = 72) were randomly and equally assigned to four groups, namely three teaching groups (General, Infusion, and Immersion) and the control group. Students were initially administered the California Critical Thinking Skills Test (CCTST). After instruction, each dyad's critical-thinking performance on an ill-defined problem was tested. A one-way ANCOVA, with the mean CCTST score of each dyad as covariate, indicated that the covariate and the teaching method were significant. Post hoc comparisons showed that the Infusion and the Immersion groups outperformed only the control group. Other quantitative and qualitative analyses revealed that students assigned to the different teaching groups exhibited diverse understandings of critical thinking.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Science and Technology Education as a Driver for Designing Powerful Web-Based Learning Environments",
            "Publication year": 2001,
            "Publication url": "https://www.learntechlib.org/p/93451/",
            "Abstract": "Discusses design principles derived from the socio-cognitive theoretical framework for developing Web-based environments to support the construction of scientific knowledge through situated action.(Author/MM)",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational thinking",
            "Publication year": 2019,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/62315",
            "Abstract": "Computational thinking Toggle navigation English Ελληνικά English English Ελληνικά Login \nToggle navigation View Item Home Δημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή Κοινωνικών \nΕπιστημών και Επιστημών Αγωγής / Faculty of Social Sciences and Education Τμήμα \nΕπιστημών της Αγωγής / Department of Education View Item Home Δημοσιεύσεις ΠΚ / UCY \nPublications 003 Σχολή Κοινωνικών Επιστημών και Επιστημών Αγωγής / Faculty of Social \nSciences and Education Τμήμα Επιστημών της Αγωγής / Department of Education View Item \nBook Chapter Computational thinking Thumbnail Date 2019 Author Malyn-Smith, Joyce ORCID \nlogo Angeli, Charoula Publisher Springer Place of publication New York Source Encyclopedia \nof Education and Information Technology Google Scholar check Metadata Show full item record \nURI http://gnosis.library.ucy.ac.cy/handle/7/62315 Collections Τμήμα Επιστημών της / of [] …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Technology Enhanced Quality Learning for All: The EDUsummIT 2015 Call to Action",
            "Publication year": 2016,
            "Publication url": "https://www.learntechlib.org/p/171774/",
            "Abstract": "EduSummIT is a global community of policy-makers, researchers, and educators working together to move education into the digital age. The fourth EDUsummIT took place September 14-15, 2015 in Bangkok, Thailand, in close connection with the UNESCO Bangkok. About 100 policy-makers, researchers and educators worked in nine thematic working groups on themes conditional for quality learning with technology. The Call to Action that resulted from EDUsummIT2015 will be presented and discussed with the SITE audience in an interactive symposium.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:abG-DnoFyZgC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Challenges for IT-enabled formative assessment of complex 21st century skills",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10758-018-9379-7",
            "Abstract": "In this article, we identify and examine opportunities for formative assessment provided by information technologies (IT) and the challenges which these opportunities present. We address some of these challenges by examining key aspects of assessment processes that can be facilitated by IT: datafication of learning; feedback and scaffolding; peer assessment and peer feedback. We then consider how these processes may be applied in relation to the assessment of horizontal, general complex 21st century skills (21st CS), which are still proving challenging to incorporate into curricula as well as to assess. 21st CS such as creativity, complex problem solving, communication, collaboration and self-regulated learning contain complex constructs incorporating motivational and affective components. Our analysis has enabled us to make recommendations for policy, practice and further research. While there is …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "The effects of case‐based learning on early childhood pre‐service teachers' beliefs about the pedagogical uses of ICT",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/1358165042000253302",
            "Abstract": "The study examined the extent to which case‐based learning could have an effect on pre‐service teachers' beliefs about the pedagogical uses of ICT in the classroom. One hundred second year early childhood pre‐service teachers enrolled in an ICT course participated in the study. Research data were collected with a questionnaire, reflection papers, course evaluations and focus interviews. The findings showed that initially the majority of pre‐service teachers had negative beliefs and certain misconceptions regarding the pedagogical uses of ICT and that case‐based learning effected their beliefs and conceptions. Future research studies should examine the extent to which a case‐based learning approach for the teaching of ICT in pre‐service teacher training can actually have an effect on appropriately integrating ICT into real classroom practices.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:ufrVoPGSRksC",
            "Publisher": "Taylor and Francis Ltd"
        },
        {
            "Title": "On the Use of e-TPCK for Situated Teacher Professional Development.",
            "Publication year": 2017,
            "Publication url": "https://eric.ed.gov/?id=ED579468",
            "Abstract": "The authors herein justify the need for e-TPCK, an adaptive e-learning system for teaching in-service teachers how to teach with technology. Outlining the instructional design process involved and the adaptivity feature of e-TPCK, it is explained how the system promotes and measures the development of teachers’ Technological Pedagogical Content Knowledge (TPCK). Considering the novel alternative of the system to more traditional professional development approaches, the authors conclude with the argument for employing e-TPCK in real classroom settings in a situated way.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:LPZeul_q3PIC",
            "Publisher": "International Association for the Development of the Information Society"
        },
        {
            "Title": "Communication in a web‐based conferencing system: the quality of computer‐mediated interactions",
            "Publication year": 2003,
            "Publication url": "https://bera-journals.onlinelibrary.wiley.com/doi/abs/10.1111/1467-8535.d01-4",
            "Abstract": "Time constraints and teaching in crowded classrooms restrict in‐depth dialogical interaction in teaching and learning. Electronic conferencing systems, however, have the potential to foster online discussions beyond class time. Case‐based instruction also constitutes a promising approach in fostering learners' participation and reflection. The purpose of this study was to investigate (a) the extent to which an electronic conferencing system, named COW (“Conferencing on the Web”), facilitates pre‐service teachers' communication outside their classroom, when discussing teaching cases from their field experiences, and (b) the potential of COW and case‐based instruction to foster quality discourse and promote students' critical‐thinking skills. The results showed that students' online discourse was mostly an exchange of personal experiences and did not reflect well‐supported reasoning. Future research on the issue …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Learning by Design as an Approach for the Development of Science Teachers ICT-Related Pedagogical Content Knowledge",
            "Publication year": 2005,
            "Publication url": "https://www.learntechlib.org/p/19736/",
            "Abstract": "The purpose of the study was to examine the extent to which learning by design could be an effective approach for developing science teachers' ICT-related pedagogical content knowledge (ICT-related PCK) during an ICT teacher professional development program. A qualitative analysis of participants' ICT-lessons indicated that the learning by design approach could potentially be an effective approach for developing science teachers' ICT-related PCK considering the fact that the construct of ICT-related PCK develops over time with actual teaching experience, and thus a one-time training program would certainly not be enough to adequately prepare all participants to integrate ICT in their teaching.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Examining the effects of learning in dyads with computer-based multimedia on third-grade students' performance in history",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131515300646",
            "Abstract": "The research examined the impact of multimedia within the context of collaborative dyadic learning on students' performance in a third-grade history lesson, taking into consideration students' individual collaborative skills and dyad collaboration level. Participants were divided into a control group and an experimental group. The same learning materials were used for both groups, with the difference that the learning materials for the experimental group were delivered via a computer. Students in the control group worked in dyads with print materials, whereas students in the experimental group worked in dyads with a multimedia computer application. After considering the effects of learners' individual collaborative skills and dyad collaboration level, the results showed that the experimental group outperformed the control group exemplifying the positive influence of the dyadic collaboration around a computer on …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Handbook of Research on TPACK in the Digital Age",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=S3NyDwAAQBAJ&oi=fnd&pg=PR1&dq=info:Lm-Da56GfzUJ:scholar.google.com&ots=adnGq1n-v-&sig=1JwON6KXG60fl_Gf6LqTFXlUShY",
            "Abstract": "The impact of digital technologies in education has called for teachers to be prepared to facilitate their students’ learning through communication, collaboration, critical thinking, and creativity. In order to create ideal learning environments for their students, teachers must develop a more integrated knowledge for infusing digital technologies as learning tools, a knowledge referred to as TPACK. The Handbook of Research on TPACK in the Digital Age provides innovative insights into teacher preparation for the effective integration of digital technologies into the classroom. The content within this publication represents the work of online learning, digital technologies, and pedagogical strategies. It is designed for teachers, educational designers, instructional technology faculty, administrators, academicians, and education graduate students, and covers topics centered on classroom technology integration and teacher knowledge and support.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:NJ774b8OgUMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Order Effects of Learning with Modeling and Simulation Software on Field-Dependent and Field-Independent Children's Cognitive Performance: An Interaction Effect.",
            "Publication year": 2014,
            "Publication url": "https://eric.ed.gov/?id=ED557384",
            "Abstract": "The study examined the interaction between field dependence-independence (FD/I) and learning with modeling software and simulations, and their effect on children’s performance. Participants were randomly assigned into two groups. Group A first learned with a modeling tool and then with simulations. Group B learned first with simulations and then with a modeling tool. A statistically significant interaction was found between FD/I and the order of using the two types of software. FI children in group A outperformed FD children in the same group on the modeling task. However, these results were not observed with the FD children in group B indicating that learning first with simulations facilitated the subsequent learning with the modeling tool of FD children only.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:hFOr9nPyWt4C",
            "Publisher": "International Association for the Development of the Information Society"
        },
        {
            "Title": "The Influence of the Computer on Third-Grade Primary School Students’ Collaborative Skills and Performance in a History Lesson",
            "Publication year": 2015,
            "Publication url": "https://www.learntechlib.org/p/150402/",
            "Abstract": "The research examined the influence of the computer on the collaborative skills of dyads, students’ individual collaborative skills, and students’ performance in a third-grade history lesson, taking into consideration initial attitudes toward collaborative learning as well as initial individual collaborative skills. Participants were divided into a control group and an experimental group. The same learning materials were used for both groups, with the difference that the learning materials for the experimental group were delivered via a computer. The results of the research demonstrate the positive impact of computers on students’ performance only, as the experimental group outperformed the control group.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "A distributed cognition approach to overcome alternative conceptions about light and color",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/30678556/200818L009.pdf",
            "Abstract": "The purpose of the study was to report on the effects of learning with ODRES™(Observe, Discuss, and Reason with Evidence in Science), a computer tool that was used with elementary school children. Succinctly, dyads of sixth-grade students were engaged in distributed collaborative inquiry regarding the scientific concepts of light and color in order to solve a mystery problem about a stolen diamond. ODRES™ was employed to scaffold students’ collaborative inquiry with different tools, such as the simulator that simulates the effects of the color of a light source on an object, the magnifying glass that enables students to make careful observations, and the notebook that organizes the results of students’ investigations. The results showed that learning with ODRES™ positively affected students’ understandings and promoted a lasting effect on their conceptions. Moreover, the results provide useful guidance about how ODRES™ can be used as a learning tool in collaborative inquiry and explain the role of discussion and investigation of inquiry processes at the level of a distributed cognitive system. Implications for designing distributed educational systems for children are finally discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating the Effects of Gender and Scaffolding tools on the Development of Preschooler’s Computational Thinking",
            "Publication year": 2020,
            "Publication url": "https://www.eduhk.hk/cte2020/doc/CTE2020%20Proceedings.pdf#page=165",
            "Abstract": "A large body of literature emphasizes the importance of effective integration of computational thinking at preschool education (Ching, Hsu, & Baldwin, 2018) as it is enlisted in the 21st century skills (Lye & Koh, 2014). Nonetheless, the factors related to the development of computational thinking are under investigation (Román-González, Pérez-González, Moreno-León, & Robles, 2018). Consequently, the study herein investigated the impact of scaffolding and gender in the development of one hundred and eighty children’s computational thinking. The results indicated strong interaction (p< 0.000) between the aforementioned factors and the advancement of computational thinking producing practical suggestions for the preschool educators and the computing community in general.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Examining the Effects of Scaffolded Programming Activities with Robots on Pre-service Teachers’ Computational Thinking",
            "Publication year": 2021,
            "Publication url": "https://www.learntechlib.org/p/219349/",
            "Abstract": "Computational thinking is an essential skill for people to develop so that they can manage challenges in their personal and professional lives. Accordingly, during the last decade, lots of efforts have been undertaken to teach computational thinking in educational settings starting as early as pre-primary education. A pertinent and crucial question that arises is whether teachers have the knowledge and skills to teach students how to think computationally. In this article, the author concurs with existing research showing that teacher education departments do not currently know how to promote computational thinking in their programs. The question, then, becomes how to include the teaching of computational thinking in teacher education courses. The present study directly addresses this issue. In particular, the study proposes the use of scaffolded programming activities with robots in an educational technology course …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:_Ybze24A_UAC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Interplay of internal and external representations: students’ drawings and textual explanations about shadow phenomena",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/23796529.2013.11674710",
            "Abstract": "Fifty-six third-year kindergarten student teachers (KTS) were presented with an experimental setting for investigating shadow phenomena. Prior to performing any specific experiment, KTS were asked to externalize their ideas about shadow phenomena corresponding to different configurations of the experimental setting through the use of drawings accompanied by textual explanations. Then, they were asked to perform each of the corresponding experiments and compare the experimental outcomes with their own initial conceptions. The findings clearly demonstrated that the use of drawings and textual explanations triggered students’ thinking as they progressively restructured their internal representations. Implications for using visuals in science education are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:ldfaerwXgEUC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Field dependence–independence and instructional-design effects on learners’ performance with a computer-modeling tool",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563209000909",
            "Abstract": "The study investigated the extent to which two types of instructional materials and learner field dependence–independence affected learners’ cognitive load, time spent on task, and problem-solving performance in a complex system with a computer-modeling tool. One hundred and one primary student teachers were initially categorized into field dependent, field mixed, and field-independent learners based on their performance on the Hidden Figures Test, and were then randomly assigned to two experimental conditions. One group received a static diagram and a textual description in a split format, and the second group received the same static diagram and textual description in an integrated format. MANOVA revealed that the split-format materials contributed to higher cognitive load, higher time spent on task, and lower problem-solving performance than the integrated-format materials. There was also an …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Critical thinking beyond skill",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1111/j.1469-5812.2007.00311.x",
            "Abstract": "The aim of this article is to investigate possibilities for conceptions of critical thinking beyond the established educational framework that emphasizes skills. Distancing ourselves from the older rationalist framework, we explain that what we think wrong with the skills perspective is, amongst other things, its absolutization of performativity and outcomes. In reviewing the relevant discourse, we accept that it is possible for the skills paradigm to be change‐friendly and context‐sensitive but we argue that it is oblivious to other, non‐purposive kinds of rationality that are indispensable to critical thought. Our suggestion is that there is an aporetic element in critical thought that is missing from contemporary educational positions. We consider some other efforts to redeem the surplus of criticality that performativity fails to take into account and conclude that the aporetic element that we highlight accommodates better than other …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Preservice teachers as ICT designers: An instructional design model based on an expanded view of pedagogical content knowledge",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5846327718514757199&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Interaction between Children's Field Dependence-Independence and Order of Learning with Glass Box and Black Box Simulations.",
            "Publication year": 2016,
            "Publication url": "https://eric.ed.gov/?id=ED595536",
            "Abstract": "The present study was undertaken in order to investigate issues related to the integration of instructional simulations in the education of young children aged from 5 to 6.5 years old. A counterbalanced measures design was adopted to investigate the extent to which there was an interaction effect between field dependence-independence (FD-I) and order of learning with a glass-box simulation and a black-box simulation. According to the results, there was a statistically significant interaction between FD-I and the order of using the glass-box and the black-box simulations. Specifically, the findings showed that learning first with the black-box simulation facilitated field-dependent children's subsequent learning with the glass-box simulation enabling them to perform as good as field-independent children.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:eMMeJKvmdy0C",
            "Publisher": "AERA Online Paper Repository. Available from: American Educational Research Association. 1430 K Street NW Suite 1200, Washington, DC 20005"
        },
        {
            "Title": "Instructional strategies for teaching critical thinking: An empirical investigation",
            "Publication year": 2010,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/37698",
            "Abstract": "Instructional strategies for teaching critical thinking: An empirical investigation Toggle \nnavigation English Ελληνικά English English Ελληνικά Login Toggle navigation View Item \nHome Δημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή Κοινωνικών Επιστημών και \nΕπιστημών Αγωγής / Faculty of Social Sciences and Education Τμήμα Επιστημών της \nΑγωγής / Department of Education View Item Home Δημοσιεύσεις ΠΚ / UCY Publications \n003 Σχολή Κοινωνικών Επιστημών και Επιστημών Αγωγής / Faculty of Social Sciences and \nEducation Τμήμα Επιστημών της Αγωγής / Department of Education View Item Book \nInstructional strategies for teaching critical thinking: An empirical investigation Thumbnail \nDate 2010 Author ORCID logo Angeli, Charoula Publisher LAP Lambert Academic \nPublishing. Place of publication Germany Google Scholar check Metadata Show full item \nrecord URI https://gnosis.library.ucy.ac.cy/handle/7/της …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:KxtntwgDAa4C",
            "Publisher": "LAP Lambert Academic Publishing."
        },
        {
            "Title": "Knowledge base for information and communication technology in education",
            "Publication year": 2018,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/62154",
            "Abstract": "This chapter systematically explores the knowledge base required by teachers for the effective application of ICT in education. The Technological Pedagogical Content Knowledge (TPCK) framework and developments in associated research are reviewed. The authors suggest an alternate approach for better understanding the knowledge base required for application of ICT in education by providing a theorization about technological knowledge in relation to how a teacher realizes and actualizes the pedagogical affordances of technological tools in teaching and learning. The authors conclude that this body of knowledge cannot exist outside the frame of reference of the teacher, can be developed through systematic learning activities targeting or facilitating its development, and grows with ongoing participation or involvement in valuable professional experiences. Implications for the nature of TPCK and its development are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "The Effects of Textual and Textual-Visual Representations on Field-Dependent and Field-Independent Learners' Performance during Problem-Solving with Modeling Software",
            "Publication year": 2003,
            "Publication url": "https://www.learntechlib.org/p/13859/",
            "Abstract": "Sixty-four undergraduates were classified into Field Dependent (FD), Between Field Dependent/Independent (BFD/I), and Field Independent (FI) learners, and were randomly assigned to Text-Only (TO) and Text-and-Visual (TV) groups. Participants had to individually explore a model constructed with Model-It. The TO group received a description of the model in textual format, and the TV group received the description in textual-and-visual format. Performance was analyzed using a 3 (FD, BFD/I, FI) x 2 (TO, TV) ANOVA. The results indicated that the TV group outperformed the TO group, with F= 5.316, p=. 025, and that performance was significantly related to cognitive control ability, with F= 4.284, p=. 018. There was also a significant interaction effect, with F= 7.881, p=. 001. Post hoc comparisons showed that FI learners outperformed both FD and BFD/I learners. The results showed that the affordances of dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:k_IJM867U9cC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Content analysis of online discussion in an applied educational psychology course",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1003764722829",
            "Abstract": "This study analyzed discussion in an online conferencethat supplemented class discussion using aninstructional method called the starter-wrappertechnique within a traditional graduate leveleducational psychology course. Various quantitativemeasures were recorded to compare instructor andstudent participation rates. In addition, Henri's(1992) model for content analysis of computer-mediatedcommunication was employed to qualitatively analyzethe electronic discourse. Using this model, five keyvariables were examined: (1) student participationrates; (2) electronic interaction patterns; (3) socialcues within student messages; (4) cognitive andmetacognitive components of student messages; and (5)depth of processing -- surface or deep -- within messageposting. Transcript content analyses showed that,while students tended to post just the one requiredcomment per week in the conference, their …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A Blended Learning Environment for a Science Education Methods Course: Content Analysis of a Text-Based Online Conference",
            "Publication year": 2005,
            "Publication url": "https://www.learntechlib.org/p/20187/",
            "Abstract": "In a lab meeting, students were asked to predict and discuss in teams of two to three students what would happen when a cylinder is inverted over a burning candle upright in a pan of water. Because students presented conflicting claims about the experiment they were instructed to resolve their differences in an online discussion forum using the asynchronous conferencing system of WebCT. Students' replies to the question posted in the online discussion forum were carefully read and analyzed. The frequency of sound (evidence-based) arguments was low. The presence of specific persistent alternative conceptions and lack of familiarity with the process of hypothesis testing or lack of the ability to clearly differentiate among hypotheses, predictions, results and conclusions seem to be the main obstacles for sound argumentation.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:HDshCWvjkbEC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Differences in electronic exchanges in synchronous and asynchronous computer-mediated communication: The effect of culture as a mediating variable",
            "Publication year": 2016,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10494820.2014.961484",
            "Abstract": "Two hundred and eighty undergraduates from universities in two countries were asked to read didactic material, and then think and write about potential solutions to an ill-defined problem. The writing was conducted within a synchronous or asynchronous computer-mediated communication (CMC) environment. Asynchronous CMC took the form of email exchanges between American learners only, Southern European learners only, and American and Southern European learners together. Synchronous CMC was restricted to dyads consisting of American–American, Southern European–Southern European, and American–Southern European students dialoguing. Additionally, a number of Americans and Southern Europeans were each paired with a content-“mirroring” computer-generated partner to account of the effect of thinking with an unresponsive partner in synchronous CMC. Results revealed that dyadic …",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Routledge"
        },
        {
            "Title": "An E-Learning Adaptive System for Teaching Teachers How to Teach with Technology: A Perspective from Technological Pedagogical Content Knowledge.",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Charoula-Angeli/publication/283714157_An_E-Learning_Adaptive_System_for_Teaching_Teachers_How_to_Teach_with_Technology_A_Perspective_from_Technological_Pedagogical_Content_Knowledge/links/56444ef008ae451880a712e1/An-E-Learning-Adaptive-System-for-Teaching-Teachers-How-to-Teach-with-Technology-A-Perspective-from-Technological-Pedagogical-Content-Knowledge.pdf",
            "Abstract": "While systematic and worthwhile research efforts have been undertaken regarding the conceptualization, development, and assessment of technological pedagogical content knowledge (TPCK) within the context of face-to-face learning experiences in higher education and teacher professional development settings, the authors herein posit that the framework of TPCK requires a technological solution, because the limited amount of time that is usually devoted in conventional teacher education courses and one-time only ICT training courses, as well as teachers’ different needs, skills, knowledge, expectations, expertise, subject-matter area, and in general readiness, render traditional face-to-face learning experiences inadequate for providing ongoing TPCK development. On the basis of the above rationale, in this paper the authors introduce the design and development surrounding e-TPCK, an adaptive electronic learning environment that teacher educators, teacher trainers, and in-service and pre-service teachers can use to foster ongoing TPCK development.",
            "Abstract entirety": 1,
            "Author pub id": "3eOMkcUAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effects of field dependence-independence and instructional design on learners' performance in a complex system with a computer modeling tool",
            "Publication year": 2009,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/37719",
            "Abstract": "The effects of field dependence-independence and instructional design on learners' \nperformance in a complex system with a computer modeling tool Toggle navigation English \nΕλληνικά English English Ελληνικά Login Toggle navigation View Item Home Δημοσιεύσεις ΠΚ \n/ UCY Publications 003 Σχολή Κοινωνικών Επιστημών και Επιστημών Αγωγής / Faculty of Social \nSciences and Education Τμήμα Επιστημών της Αγωγής / Department of Education View Item \nHome Δημοσιεύσεις ΠΚ / UCY Publications 003 Σχολή Κοινωνικών Επιστημών και Επιστημών \nΑγωγής / Faculty of Social Sciences and Education Τμήμα Επιστημών της Αγωγής / Department \nof Education View Item Conference Object The effects of field dependence-independence and \ninstructional design on learners' performance in a complex system with a computer modeling \ntool Thumbnail Date 2009 Author ORCID logo Angeli, Charoula ORCID logo Valanides…",
            "Abstract entirety": 0,
            "Author pub id": "3eOMkcUAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        }
    ]
}]