[{
    "name": "Χρήστος Πολίτης",
    "romanize name": "Christos Politis",
    "School-Department": "Faculty of Science, Engineering and Computing",
    "University": "Kingston University London",
    "Rank": "Καθηγητής",
    "Apella_id": 1786,
    "Scholar name": "Christos Politis",
    "Scholar id": "-U99zuEAAAAJ",
    "Affiliation": "Kingston University London",
    "Citedby": 2015,
    "Interests": [
        "Wireless Communications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=-U99zuEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Harmful interference threshold and energy detector for on-board interference detection",
            "Publication year": 2016,
            "Publication url": "https://orbilu.uni.lu/bitstream/10993/29258/1/Ka_band_Final.pdf",
            "Abstract": "Interference issues have been identified as a threat for satellite communication systems and services, resulting in throughput degradation and revenue loss to the satellite operators. The situation is likely to become worse over the next years, as new services are deployed. In this context, an onboard spectrum monitoring unit (SMU) is proposed to detect interference reliably. Current satellite SMUs are deployed on the ground and the introduction of an in-orbit SMU can bring several benefits, eg simplifying the ground based station in multibeam systems. Furthermore, the interference to signal plus noise ratio (ISNR) threshold on the uplink of a satellite forward link is identified as the harmful interference threshold above which the SMU needs to reliably detect interference. Moreover, this paper introduces the hypothesis testing problem required for the detection of interference and provides a performance analysis of the energy detector (ED) to solve this problem. Finally, simulation results are provided for validation.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:J-ba04ztB30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile Multimedia Communications: 6th International ICST Conference, MOBIMEDIA 2010, Lisbon, Portugal, September 6-8, 2010. Revised Selected Papers",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Lc-6BQAAQBAJ&oi=fnd&pg=PR2&dq=info:Z8O8HNUKiloJ:scholar.google.com&ots=1kt1aufuZ_&sig=mbSDE1sNe_I5T0mslNYHZ1ogP64",
            "Abstract": "This book constitutes the thoroughly refereed post-conference proceedings of the 6th International ICST Conference on Mobile Multimedia Communications (MOBIMEDIA 2010) held in Lisbon, Portugal, in September 2010, which was accompanied by the First International Workshop on Cognitive Radio and Cooperative Strategies for POWER Saving (C2POWER 2010), the Workshop on Impact of Scalable Video Coding on Multimedia Provisioning (SVCVision 2010), and the First International Workshop on Energy-efficient and Reconfigurable Transceivers (EERT 2010). The 59 revised full papers presented were carefully reviewed and selected from numerous submissions and are organized in topical sections on advanced techniques for video transmission; multimedia distribution; modelling of wireless systems; cellular networks; mobility concepts for IMT-advances (MOBILIA); media independent handovers (MIH-4-MEDIA); and IP-based emergency applications and services for next generation networks (PEACE).",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer"
        },
        {
            "Title": "An overview of post-disaster emergency communication systems in the future networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8910632/",
            "Abstract": "The emerging 5G communication network is gaining tremendous attention from mobile network operators, regulators, and academia due to the provisions of network densification, ultra-low latency and improved spectral and energy efficiencies. However, post-disaster EMS, which nowadays predominantly depends on the wireless communication infrastructure, is significantly lagging behind in terms of innovation, standards, and investments. Since the 5G vision is the revolution of the telecommunication industry, provisions of efficiently handling EMS is expected to be distributed, autonomous, and resilient to the network vulnerabilities due to both manmade and natural disasters. In this article, the 4G LTE approaches for typical post-disaster communication and their shortcomings will be discussed. We elaborate three typical post-disaster network scenarios when the network is congested, partly functional or completely …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:AkvegQHRDQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal spectrum hole selection & exploitation in cognitive radio networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6144225/",
            "Abstract": "Future networks, especially in the framework of smart cities will be populated with various kinds of equipment accessing wireless communication channels. A much higher device variety will increase spectrum scarcity. Cognitive radio networks will be a key enabling technology in order to cope with the availability of the allocated radio spectrum bands. Cognitive Radio (CR) technology significantly utilizes current static spectrum bands assignment in an opportunistic manner. In this paper, we propose two spectrum opportunity (or spectrum hole) selection schemes; Minimum Collision Technique (MCT) and Maximum Residual Lifetime Technique (MRLT). The proposed techniques are evaluated by average channel utilization, average channel collision and successful secondary transmission bytes over licensed channels in a specific period of time (100s). The numerical results confirm that the MRLT scheme provides …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MAGNET secure service discovery architecture",
            "Publication year": 2005,
            "Publication url": "http://eprints.kingston.ac.uk/8500/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cluster based data centric routing paradigm for wireless sensor networks",
            "Publication year": 2013,
            "Publication url": "http://eprints.kingston.ac.uk/27002/",
            "Abstract": "A cluster based data centric routing paradigm for wireless sensor networks - Kingston \nUniversity Research Repository Jump to main menu navigation [j] Jump to page content [k] \nResearch at Kingston University Login Home About Browse by Year Browse by Research Area \nBrowse by Faculty Browse by Kingston Author Search Help A cluster based data centric routing \nparadigm for wireless sensor networks Toussi, Ahora M. and Politis, Christos (2013) A cluster \nbased data centric routing paradigm for wireless sensor networks. In: Wireless World Research \nForum Meeting 30; 23-25 April 2013, Oulu, Finland. (Unpublished) Full text not available from \nthis archive. Item Type: Conference or Workshop Item (Paper) Event Title: Wireless World \nResearch Forum Meeting 30 Research Area: Computer science and informatics Faculty, \nSchool or Research Centre: Faculty of Science, Engineering and Computing (until 2017) URLs: …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic resource allocation for IEEE802. 16e",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_15",
            "Abstract": "Mobile communications has witnessed an exponential increase in the amount of users, services and applications. New high bandwidth consuming applications are targeted for B3G networks raising more stringent requirements for Dynamic Resource Allocation (DRA) architectures and packet schedulers that must be spectrum efficient and deliver QoS for heterogeneous applications and services. In this paper we propose a new cross layer-based architecture framework embedded in a newly designed DRA architecture for the Mobile WiMAX standard. System level simulation results show that the proposed architecture can be considered a viable candidate solution for supporting mixed services in a cost-effective manner in contrast to existing approaches.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:3pYxbvHKFu8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Cognitive radio for 5G wireless networks",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781118867464.ch6",
            "Abstract": "Demand for 5G cells is driven by consumer demand where traffic is doubling each year. Now industry is preparing for a bigger challenge, an astounding 1000‐fold increase in data traffic expected in this decade. This sets the stage for enabling 5G technology that delivers fast and cost‐effective data connectivity, whilst minimising the deployment cost. Despite the success of small cells and MIMO in 4G systems, there is no single technology advance that can meet this traffic demand. In fact, today's technology roadmaps depict different mixes of spectrum (Hertz), spectral efficiency (bits per Hertz per cell) and small cells (cells per square kilometre) as a stepping stone towards meeting this ambitious target. Traditionally, purchasing additional spectrum has been a stopgap solution towards satisfying new Quality of Service demands and coping with extra load on the network. This will also continue to be a solution, as …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:JQOojiI6XY0C",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Multilayer Mobility Management for All-IP Networks: Pure SIP vs",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=789916752196244746&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:JaLtl8ASYokC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectrum Sensing and Interference Characterization",
            "Publication year": 2008,
            "Publication url": "https://kclpure.kcl.ac.uk/portal/en/publications/spectrum-sensing-and-interference-characterization(7dd9e98c-2c58-4acf-9b4b-b0581bca9e92).html",
            "Abstract": "Holland, O., Muck, M., Martigne, P., Bourse, D., Cordier, P., Jemaa, SB, Houze, P., Grandblaise, D., Kloeck, C., Renk, T., Pan, J., Slanina, P., Moessner, K., Giupponi, L., Romero, JP, Agusti, R., Attar, A. & Aghvami, H., 2007, 2007 2ND IEEE INTERNATIONAL SYMPOSIUM ON NEW FRONTIERS IN DYNAMIC SPECTRUM ACCESS NETWORKS, VOLS 1 AND 2. NEW YORK: IEEE, p. 232-239 8 p.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:it4f3qIuXWYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of secure video transmission over WiMAX networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35155-6_3",
            "Abstract": "The IEEE 802.16 standard, which is known as Worldwide Interoperability for Microwave Access (WiMAX), is one of the latest technologies in the wireless world. The main goal of WiMAX is to deliver wireless communications with guaranteed quality of service (QoS), security and mobility. Multimedia applications are bandwidth demanding and error sensitive, whereas wireless medium is unreliable and bandwidth limited. In this paper, we evaluate the performance of secure video transmission over WiMAX networks. We mainly illustrate the results of the simulations. To this end we depict the processing time and the throughput introduced when IP Security (IPSec) is applied over WiMAX. The most commonly used cryptographic algorithms and Hashed-Message Authentication Codes (HMAC), such as Advanced Encryption Standard (AES), Data Encryption Standard (DES), 3DES, Secure Hash Algorithm 1 (SHA …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A selective multipath routing protocol for ubiquitous networks",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870518301641",
            "Abstract": "During the past years, ubiquitous networks have become an interesting topic for research due to their flexible and independent nature in terms of network infrastructure. A lot of effort has been made around the design of efficient routing protocols, mainly because of their unique characteristics, such as, dynamic topology, high mobility and limited bandwidth. In this paper, we propose a new routing protocol which is based on our Multipath-ChaMeLeon (M-CML) routing protocol. We perform a network optimization analysis of M-CML under a series of simulations taking into account three Quality of Service (QoS) metrics and we provide the results with statistical confidence interval by applying the Wilcoxon signed-rank test model. On top of the outcome of the analysis, we also apply an intelligent algorithm to enhance our protocol’s effectiveness by reducing the improvident emission of data packets. The new protocol …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:0urtJCGzaFQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Feedback information and energy efficiency of MIMO transmission modes in LTE",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6222756/",
            "Abstract": "Feedback information provides a leverage for improving the system performance of wireless communication systems. This paper investigates the effects that feedback information in terms of Channel Quality Information (CQI), Precoding Matrix Indicator (PMI) and Rank Indicator (RI) have on the energy efficiency of two popular Multiple Input Multiple Output (MIMO) transmission modes; Open Loop Spatial Multiplexing (OLSM) and Closed Loop Spatial Multiplexing (CLSM) in the downlink of 3rd Generation Partnership Project (3GPP) Long Term Evolution (LTE). This paper introduces an energy efficiency metric: Energy Consumption Rating (ECR) and present results for multi-user MIMO scenarios in a (2×2), (4×2) and (4×4) antenna configurations. The results from simulations carried out show that feedback information is essential to optimize system throughput and energy efficiency as the CLSM configurations, which …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Routing Challenges and Directions for Smart Objects in Future Internet of Things",
            "Publication year": 2011,
            "Publication url": "http://www.iab.org/wp-content/IAB-uploads/2011/03/Ramrekha.pdf",
            "Abstract": "The Future Internet of things will consist of smart objects that will form distributed and autonomous peripheral wireless networks near the user end. The distributed nature of smart object networks, also termed ad hoc networks, require novel cooperative effective and efficient protocols for dynamic environment. It is therefore very important to provide a unified flexible framework for Ad hoc smart object communication that will allow adaptive, hybrid routing in order to satisfy Ad hoc networking requirements as proposed by the Cognitive and Adaptive Module (CAM) in [15].",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Use cases and testbed solutions for 5G cellular backhauling via satellite",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sat.1395",
            "Abstract": "This paper describes the use cases and testbed solutions for 5G cellular backhauling via satellite developed within the H2020 5G‐Public Private Partnership (PPP) Phase III project “5G‐VINNI” (5G Verticals Innovation Infrastructure). It presents the end‐to‐end design of the 5G‐VINNI Norway and Luxembourg Facility Sites and aims to showcase the satellite integration into 5G with focus on satellite backhauling solutions. It elaborates on the satellite transport network between the 5G Radio Access Network (RAN) and the 5G Core Network (5GC), where design aspects on the satellite network integration into the standard 3GPP 5GC architecture are detailed. It also addresses the split of the 5GC between the Central Node and the Edge Node, where the Edge Node can be fixed and nomadic. The paper describes also the Management and Orchestration (MANO) and Network Functions Virtualisation Infrastructure (NFVI …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:plAW456RD7MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An analytical evaluation of energy consumption in cooperative cognitive radio networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6533791/",
            "Abstract": "This paper studies the total energy consumption of a cooperative cognitive radio network in coexistence with a stochastic multi-channel licensed network. Energy consumption of each cognition phase at the secondary user is mathematically analyzed and obtained. The numerical results presented show the various interactions between the secondary network size, availability of appropriate spectrum holes and the total energy consumption for different states of the cognitive radio network under discussion.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework supporting extreme emergency services",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/47454428/A_framework_supporting_extreme_emergency20160723-20268-1dpvpw0.pdf",
            "Abstract": "In many extreme emergency scenarios, such as natural or manmade disasters, the rescuers may face difficulty using traditional legacy networks due to destruction or collapse of infrastructure in such events or in case of remote disaster locations. The nature of mobile ad hoc networks (MANETs) makes them suitable to be utilized in the context of an emergency for various rescue teams. However, the security and reliability of the mobile ad hoc based communications can be decisive in the effectiveness and efficiency of rescue missions in extreme emergency cases. Furthermore, these stringent requirements propagate through to upper layers that include transport and application layer. In this paper we propose a framework for handling the P2P overlay serves different purposes and combines different technologies. The general functionalities of the framework are structured and unstructured overlays in MANETs. In addition, we propose a new suite of protocols called PEACE1 Security Platform (PSP) that can address the key research challenges surrounding fast, reliable and secure MANETs for supporting emergency services in extreme catastrophic events.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperation Between Networks",
            "Publication year": 2004,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8493",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:f2IySw72cVMC",
            "Publisher": "Wiley"
        },
        {
            "Title": "Autonomous Interference Monitoring System",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=16731288345180505761&hl=en&oi=scholarr",
            "Abstract": "1 INTRODUCTION This is the second of a two volume report detailing the results of the Licence Exempt (LE) measurement study, carried out on behalf of Ofcom by Mass Consultants Ltd (MASS) using the Autonomus Interference Monitoring System (AIMS).Volume 1 provides a summary report while Volume 2 (this report) provides the detailed measurement results from each of the 20 measurement locations. The detailed measurement results are preceded by a section (Section 2), which discusses the analysis methods used and explains how to interpret the various graphs.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A testbed implementation for securing olsr in mobile ad hoc networks",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1010.4986",
            "Abstract": "Contemporary personal computing devices are increasingly required to be portable and mobile enabling user's wireless access, to wired network infrastructures and services. This approach to mobile computing and communication is only appropriate in situations where a coherent infrastructure is available. There are many situations where these requirements are not fulfilled such as; developing nations, rural areas, natural disasters, and military conflicts to name but a few. A practical solution is to use mobile devices interconnected via a wireless medium to form a network, known as a Mobile Ad-hoc Network (MANET), and provide the services normally found in wired networks. Security in MANETs is an issue of paramount importance due to the wireless nature of the communication links. Additionally due to the lack of central administration security issues are different from conventional networks. For the purposes of this article we have used the \"WMN test-bed\" to enable secure routing in MANETs. The use of cryptography is an efficient proven way of securing data in communications, but some cryptographic algorithms are not as efficient as others and require more processing power, which is detrimental to MANETs. In this article we have assessed different cryptographic approaches to securing the OLSR (Optimised Link State Routing) protocol to provide a basis for research. We conclude the paper with a series of performance evaluation results regarding different cryptographic and hashing schemes. Our findings clearly show that the most efficient combination of algorithms used for authentication and encryption are SHA-1 and AES respectively …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sensing optimization in cooperative cognitive radio networks",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050914009302",
            "Abstract": "Cooperative spectrum sensing is a key function in cognitive radio networks in order to provide unused spectrum access opportunities and mitigate the impact of interference to the primary networks. Cooperative sensing can incur additional cooperation overhead, increased energy consumption, extra sensing time and delay in heterogeneous networks. In this paper, the sensing time period is optimized to minimize energy consumption in a diverse cooperative network using square law combining decision rule. The evaluation results confirm significant improvement in the sensing time and sensing task energy consumption.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:WqliGbK-hY8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A multipath mobile ad-hoc routing protocol for enhanced reliability in lossy communications",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551936/",
            "Abstract": "Reliability of communication in unpredictable environments with increased complexity and lossless properties is one of the main objectives in wireless communication technologies. The autonomous nature of Mobile Ad hoc Networks (MANETs) classifies them as an effective solution to address emergency situation scenarios, such as rescue or disaster relief operations that take place in hostile and hazardous environments. This paper proposes a multipath approach based on the proactive Optimized Link State Routing (OLSR) protocol called RESCUE OLSR (R-OLSR), designed as an initial approach of the EU-ICT RESCUE project. The protocol exploits its capability to identify and transmit data via multiple paths based on two different relay approaches named Simple Relay Routing (SRR) and Advanced Relay Routing (ARR). The protocol's efficiency is substantiated through a simulation scenario within a MANET …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:5p9vMBpPSXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A health 4.0 based approach towards the management of multiple sclerosis",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-47617-9_10.pdf",
            "Abstract": "Multiple sclerosis is a chronic and variable disease in matters of symptoms, clinical course and outcome. The ultimate goal of currently used drugs and therapeutic strategies is the control of disease activity and the delay of the ongoing disability. During the last decades, a number of disease-modifying drugs (DMDs), all products of advanced biotechnology are being used. However, these DMDs are yet partially effective since the ongoing disability progression may hardly be prevented. There is growing evidence that these DMDs might be more effective if more accurate monitoring of the disease itself throughout a period of time might be available. In the new era of MS treatment and on the basis of our current knowledge about MS management, it became pretty clear that the overall therapeutic strategy should always be scheduled on strictly individualized basis. To this, MS patients should be encouraged to take …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:eJD0kABLposC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Energy efficiency and QoS in wireless sensor networks",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/16662",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SpecTRally Efficient fIxed wireless networK basEd on dual standards",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/17101/",
            "Abstract": "SpecTRally Efficient fIxed wireless networK basEd on dual standards - Kingston University \nResearch Repository Jump to main menu navigation [j] Jump to page content [k] Research at \nKingston University Login Home About Browse by Year Browse by Research Area Browse by \nFaculty Browse by Kingston Author Search Help SpecTRally Efficient fIxed wireless networK \nbasEd on dual standards Diaz, Emilio, Engels, Marc, Cianca, Ernestina, Chenu-Tournier, Marc, \nWachsmann, Klaus-Peter, Politis, Christos, Forkel, Ingo, Rosson, Patrick and Noguet, \nDominique (2003) SpecTRally Efficient fIxed wireless networK basEd on dual standards. In: \n12th IST Mobile and Wireless Communications Summit; 15 - 18 June 2003, Aveiro, Portugal. \nFull text not available from this archive. Item Type: Conference or Workshop Item (Poster) Event \nTitle: 12th IST Mobile and Wireless Communications Summit Research Area: Computer and (…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Capacity Optimization in Cooperative Cognitive Radio Networks",
            "Publication year": 2015,
            "Publication url": "https://publications.waset.org/10001610/capacity-optimization-in-cooperative-cognitive-radio-networks",
            "Abstract": "Cooperative spectrum sensing is a crucial challenge in cognitive radio networks. Cooperative sensing can increase the reliability of spectrum hole detection, optimize sensing time and reduce delay in cooperative networks. In this paper, an efficient central capacity optimization algorithm is proposed to minimize cooperative sensing time in a homogenous sensor network using OR decision rule subject to the detection and false alarm probabilities constraints. The evaluation results reveal significant improvement in the sensing time and normalized capacity of the cognitive sensors.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient spectrum decision scheme in opportunistic spectrum access networks",
            "Publication year": 2012,
            "Publication url": "http://eprints.kingston.ac.uk/23094/",
            "Abstract": "In this paper, we propose and compare two spectrum decision schemes namely; Adaptive Spectrum Decision (ASD) and Maximum Remaining Lifetime (MRL). The simulation results and performance analysis such as channel utilization, data delivery, and handoff rates are evaluated and compared.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient power control algorithm for supporting cognitive communications in shared spectrum areas",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16644-0_43",
            "Abstract": "The concept of Cognitive Radio (CR) is meant to be utilised by both licensed and license-exempt users that coexist in a shared spectrum area whenever they need to avoid causing unaffordable interference to each other by following some rules. In fact, primary users should be protected by any license-exempt transmission. To this end, power control is a pivotal mechanism to be used for interference management in these scenarios. Especially, transmit power control is a vehicle to mitigate interference, in presence of CR technology, when primary receivers are attempting to reach a desired Signal-to Interference Noise Ratio (SINR) level. In this work we assume that a CR network relies on the same spectrum area with a primary network. Our scope is to measure the introduced interference level caused by the CR transmitter and to properly modify its power to allow a legacy user to reach a required SINR …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "RCTP: An enhanced routing protocol based on collection tree protocol",
            "Publication year": 2015,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1155/2015/363107",
            "Abstract": "Due to implementation of routing protocols in limited power supply devices in wireless sensor networks (WSNs), this paper presents and evaluates Rainbow Collection Tree Protocol (RCTP) as an enhanced version of Collection Tree Protocol (CTP). CTP is a lightweight, efficient, robust, and also reliable routing protocol for WSNs. CTP as a cross layer routing protocol is also a platform-independent protocol. It uses Trickle Algorithm to optimize the overhead cost and also makes it quickly adaptable to changes in topology. The basic foundation of CTP is on link quality identification and it uses expected transmission count (ETX). ETX is not stable during the time in real environments and ETX fluctuations cause the routing protocols to not work in optimum level. RCTP uses average expected transmission count (AETX) as link quality metric that has shown it is more stable than ETX. It also uses a new mechanism in parent …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:hkOj_22Ku90C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Dynamic Resource Allocation Architecture for IEEE802. 16e: Design and Performance Analysis.",
            "Publication year": 2008,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=1383469X&asa=Y&AN=34119395&h=qgihUFENQbSp%2FBP7%2FxcADG8KCaBfpxB9xrzN%2BqZDe7STD%2FXA%2Fq0e93dTDhRfyQoz1qNie1qvekrt9BKwvrcvlQ%3D%3D&crl=c",
            "Abstract": "Mobile communications has witnessed an exponential increase in the amount of users, services and applications. WiMAX (Worldwide Interoperability for Microwave Access) targets to provide broadband connectivity to wide area coverage, both in fixed and in mobile environments, as well as in the provision of QoS constraints of those applications and services envisioned for Next Generation Networks (NGNs), which results in significant design challenges in the MAC (Medium Access Control) to provide the seamless transport of heterogeneous traffic in a cost-effective manner. This paper proposes a Dynamic Resource Allocation (DRA) architecture for the IEEE802. 16e broadband wireless system (also known as Mobile WiMAX) that can provide operators the flexibility to deliver broadband traffic with high spectral efficiency. The proposed DRA architecture framework encompasses scheduler, Link Adaptation …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:gL9scSG3K_gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent channel access technique in cognitive radio networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6169142/",
            "Abstract": "Future networks, especially in the framework of smart cities will be populated with various kinds of equipment accessing wireless communication channels. A much higher device variety will arise, ranging from identifiable objects to notebooks and smart phones. These aspects require high-level intelligent wireless access network. In order to cope with the vast number of technologies (machine-to-machine communications and sensor networks), cognitive radio network will be a key enabling technology. Cognitive Radio (CR) significantly utilizes current static radio frequency bands in an opportunistic manner. In this paper, we propose two intelligent channel access methods; Minimum Collision Technique (MCT) and Maximum Residual Lifetime Technique (MRLT) in CR networks. The proposed techniques are evaluated by average channel utilization and average channel collision on four dedicated channels in a …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Architectures for multiple P2P overlays in MANETs in emergency situations",
            "Publication year": 2009,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/9119",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Satellite support for enhanced mobile broadband content delivery in 5G",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8436902/",
            "Abstract": "Satellite communication has recently been included as one of the enabling technologies for 5G backhauling, in particular for the delivery of bandwidth-demanding enhanced mobile broadband (eMBB) application data in 5G. In this paper we introduce a 5G-oriented network architecture empowered by satellite communications for supporting emerging mobile video delivery, which is investigated in the EU 5GPPP Phase 2 SAT5G Project. Two complementary use cases are introduced, including (1) the use of satellite links to support offline multicasting and caching of popular video content at 5G mobile edge, and (2) real-time prefetching of DASH (Dynamic Adaptive Streaming over HTTP) video segments by 5G mobile edge through satellite links. In both cases, the objective is to localize content objects close to consumers in order to achieve assured Quality of Experiences (QoE) in 5G content applications. In the latter …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:djft3U1LymYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "未来无线世界的协同网络",
            "Publication year": 2005,
            "Publication url": "http://www.cqvip.com/qk/90822a/200504/15547402.html",
            "Abstract": " 0引言 可以设想,后3G系统(B3G)将是移动/无线通信系统和IP技术逐步演化,接近,最终融合并通过各种接入技术提供多种服务的系统.为实现这一设想,必须了解网络接入,通信服务,移动性,用户设备在支持异型结构方面的需求.另外,通过向研究领域提供指导性框架和技术发展的优先顺序来促进必要的组网技术研究,也是同样重要的.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:654Jc7Ppz2kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Benefits and challenges of software defined satellite-5G communication",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8795462/",
            "Abstract": "The convergence of innovation in satellite communications, 5G terrestrial systems and cloud technology promises a ubiquitous networking solution, which offers a wide range of features, including but not limited to: universal multiaccess coverage at extraordinarily high speeds & capacity, multi-tenancy, fixed and wireless access network convergence, software controlled, agile service provisioning, on-demand service-oriented resource allocation, and highly orchestrated. To meet the needs of future communication, a paradigm shift both in the terrestrial and satellite segments is needed, transforming them from data-only transport media to intelligent services, equipped with computational, storage and decision-making capacities. In this article, we present H2020 SaT5G project vision to integrate the next generation satellite systems into 5G terrestrial networks at different levels. To this end, after highlighting the benefits …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:beqBT5984LEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Panel on 3G planning and optimisation: Next generation regulation?",
            "Publication year": 2007,
            "Publication url": "http://eprints.kingston.ac.uk/8529/",
            "Abstract": "Panel on 3G planning and optimisation: Next generation regulation? - Kingston University \nResearch Repository Jump to main menu navigation [j] Jump to page content [k] Research at \nKingston University Login Home About Browse by Year Browse by Research Area Browse by \nFaculty Browse by Kingston Author Search Help Panel on 3G planning and optimisation: Next \ngeneration regulation? Politis, Christos (2007) Panel on 3G planning and optimisation: Next \ngeneration regulation? In: 18th IEEE International Symposium on Personal, Indoor and Mobile \nRadio Communications; 3 - 7 Sept 2007, Athens, Greece. Full text not available from this \narchive. Item Type: Conference or Workshop Item (Paper) Event Title: 18th IEEE International \nSymposium on Personal, Indoor and Mobile Radio Communications Research Area: Computer \nscience and informatics Faculty, School or Research Centre: Faculty of Computing, and :…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context transfer extension to mobility protocols for all-IP based infrastructures",
            "Publication year": 2003,
            "Publication url": "http://www.ee.surrey.ac.uk/CCSR/Software/OPNET/chew-WWRF-2003.pdf",
            "Abstract": "Making handover seamless is one of the key issues in mobility management for next generation all-IP networks. It is important to note that in the next few years the majority of terminals will be mobile and the majority of traffic will originate from IP-based applications offering more and more real-time services. The quality of real-time services like VoIP telephony and Video on demand will depend greatly on the ability to minimize the impact of the handover, hence traffic redirection of ongoing sessions.“Context Transfer” aims to contribute to the enhancement in handover performance. When a mobile node (MN) moves to a new subnet it needs to continue certain transport-or routing-related services that have already been established at the previous subnet. Such services are known as ‘context transfer candidate services’, and examples include header compression, QoS policy, AAA profile and IPsec state. Re-establishing these services at the new subnet will require a considerable amount of time for the protocol exchanges and as a result time-sensitive real-time traffic will suffer during this time. Alternatively context transfer candidate services state information can be transferred, for example, from the previous access router to the new access router so that the services can be reestablished quickly (see Figure 1). A layer-3 context transfer protocol will result in a quick re-establishment of context transfer candidate services at the new domain. In addition, operating at layer-3 ensures interoperability among layer-2 radio access technologies. It would contribute to the seamless operation of application streams and could reduce susceptibility to errors …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "水中での超音波帯域を用いたマルチキャスト通信によるはぐれダイバー検出法",
            "Publication year": 2016,
            "Publication url": "https://ipsj.ixsq.nii.ac.jp/ej/?action=pages_view_main&active_action=repository_view_main_item_detail&item_id=177193&item_no=1&page_id=13&block_id=8",
            "Abstract": "論文抄録近年, 水中での通信技術が注目, 発達し始めている. しかし, 水中での通信は地上の通信に比べいまだ未発展な技術である. その原因としては, 水中の環境は電波を用いた通信に向かないという根本的な問題があり, 超音波を用いることが主な方法となり, 通信速度, 通信量などが十分に確保できないからである. その中でも浅瀬での通信は特に未着手の領域となっているので, スキューバダイビングを行うような環境では通信技術はほとんど用いられていない. 本稿では, レクリエーショナルダイビングを行うスキューバダイバーを対象とした, 事故防止のためのはぐれダイバーの検出方法を提案する. 送信電力を調整することにより一定の範囲内のみ通信が可能な通信空間を構成し, ネットワークシミュレータを試作し, ノード間距離が一定以上離れている場合, はぐれノードが検出, 通知されているか評価を行った.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:MSzX15-gZgkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure dynamic & autonomous authentication framework for Mobile Ad-hoc Networks",
            "Publication year": 2013,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/26776/",
            "Abstract": "Mobile Ad-Hoc Networks (MANETs) by their nature are susceptible to security break-ins. Decentralised, self-organised and infrastructure less nature of MANETS lead to their inability to adapt to conventional cryptographic encryption. We propose a framework for an effective alternative to current key sharing security mechanisms for node authentication in MANET and secure data exchange.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:CKf5m1HYVjMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel ubiquitous cooperative communication platform (NEOCOP) for future emergency management systems",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/20903/",
            "Abstract": "A novel ubiquitous cooperative communication platform (NEOCOP) for future emergency \nmanagement systems - Kingston University Research Repository Kingston University \nLondon Logo Help Search Browse by Year Browse by Research Area Browse by Faculty \nBrowse by Kingston Author About Home Login A novel ubiquitous cooperative \ncommunication platform (NEOCOP) for future emergency management systems Ramrekha, \nTA, Politis, C. and Remagnino, P. (2011) A novel ubiquitous cooperative communication \nplatform (NEOCOP) for future emergency management systems. In: 27th Wireless World \nResearch Forum (WWRF) meeting; 18-20 Oct 2011, Dusseldorf, Germany. Metadata \nActions (Repository Editors) Item Control Page Item Control Page Accessibility Disclaimer \nCopyright Freedom of Information Privacy Policy Cookies …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Weak interference detection with signal cancellation in satellite communications",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7953366/",
            "Abstract": "Interference is identified as a critical issue for satellite communication (SATCOM) systems and services. There is a growing concern in the satellite industry to manage and mitigate interference efficiently. While there are efficient techniques to monitor strong interference in SATCOM, weak interference is not so easily detected because of its low interference to signal and noise ratio (ISNR). To address this issue, this paper proposes and develops a technique which takes place on-board the satellite by decoding the desired signal, removing it from the total received signal and applying an Energy Detector (ED) in the remaining signal for the detection of interference. Different from the existing literature, this paper considers imperfect signal cancellation, examining how the decoding errors affect the sensing performance, derives the expressions for the probability of false alarm and provides a set of simulations results …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:NKlx0PmyA3cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cognitive and adaptive framework for mobile ad-hoc networks",
            "Publication year": 2012,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/22796",
            "Abstract": "Mobile Ad-hoc Networks (MANETs) are fully distributed networks that consist of fully-connected collaborative nodes. Each node in the network can act as a relay, if required, in order to route information from source to destination nodes. Traditional routing approaches that are being further investigated for standardisation at the Internet Engineering Task Force (IETF) are flat reactive and proactive routing protocols such as Ad-hoc On-demand Distance Vector (AODV) routing and Optimised Link State Routing (OLSR) respectively. However, in literature, various more elaborate approaches have been presented based on hybrid routing solutions which include nature inspired routing algorithms, cluster based routing as well as proactive-reactive zonal based routing. A further avenue towards optimising the flat routing approaches in MANETs is to adopt a converged hybrid routing approach where the nodes in the network use cognitive algorithms to detect the state of the network and adapt the routing approach to fit these conditions. Furthermore, in order to tackle the issue of deploying ad-hoc networks, a more realistic cognitive and adaptive framework is required. In this paper, we describe our work towards the development of such a converged routing approach and a suitable Cognitive and Adaptive Module (CAM), which is patent pending, for MANET deployments.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deploying parameters of wireless sensor networks in test bed environment",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6934876/",
            "Abstract": "IEEE 802.15.4 is a standard deification for networks with low data rate, low power consumption and also low characteristics of node resources. ZigBee is the emerging industrial standard for ad hoc network based on IEEE 802.15.4.Wireless Sensor Networks (WSNs) is expected to be used for remote monitoring, home automation and industrial control. One of the goals of WSNs is to minimize the running cost and therefore Star and Tree topologies have been designed to save energy as they do not require any routing table to send the packets to destination [1]. This paper includes the introduction to topologies supported by IEEE802.15.4, and also we have studied the deploying parameters of tree and star topologies in a test bed environment. In the end of this paper some techniques and measurements has been proposed for random deployment into the field.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical AAA architecture for user and multimedia service authentication in hybrid 3G/WLAN networking environments",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=I9zOAwAAQBAJ&oi=fnd&pg=PA445&dq=info:svITDm9zwzIJ:scholar.google.com&ots=1I7mLAlvWP&sig=Wwb2nV3t0hTfxQtR4KcVEyCA8ZE",
            "Abstract": "This paper proposes a AAA architecture for user and service authentication in All-IP network architecture that integrates heterogeneous wireless technologies (WLANs and 3G). The key innovative characteristics of the proposed approach includes the employment of SIM-based authentication for both WLAN and 3G access networks, use of single subscription base in the 3G network, employment of AAA gateway that translates WLAN AAA access messages (Radius or Diameter) to the corresponding 3G AAA ones and service authentication based on user’s profile and preferences.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Lulu. com"
        },
        {
            "Title": "Effect of mobility on QoS routing for extreme emergency mobile Ad-hoc networks",
            "Publication year": 2010,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/16740",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ROBUST: Reliable overlay based utilisation of services and topology for emergency MANETs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5722455/",
            "Abstract": "Emergency services and networks are an emerging area of scientific research. During an emergency scenario such as forest fires, earthquakes, tsunamis and terrorist attacks rescuers need to establish communication to coordinate their actions by using smart and lightweight mobile devices. To this end, autonomous networks should be utilised to support the afore communications. Mobile Ad-hoc Networks (MANETs) are a characteristic paradigm of IP-based autonomous networks that can be deployed during critical emergency missions. We propose utilising a peer-to-peer (P2P) paradigm when designing application layer communication and data sharing technologies between participants of the MANET. The architecture therefore must allow nodes to send and retrieve data without knowledge of the complexities of the network. To this end we propose a Distributed Hash Table (DHT) architecture which we optimise …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power control using game theory in a shared open spectrum",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30794513/2009_Power_Control_Using_Game_Theory_in_a_Shared_Open_Spectrum.pdf",
            "Abstract": "The main problem of the today’s IEEE 802.11 WLANs is the small number of available channels. In this paper we focus on a novel way of maximization of the network throughput and the provision of fairness which are key challenges in IEEE WLANs, using Game Theory. We examine two types of power control games, namely the non-cooperative and the cooperative power control game. In the case of non-cooperative power control game we find the Nash equilibrium in a distributed way. In the case of cooperative power control game we assume that there exists a central entity called coordinator which announces the calculated Nash bargaining solution to the access points. Finally, we present the results of simulations implemented in MATLAB through a series of plots and tables.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Grant P",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:RdUpO4xyVKMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New DLC layer design and evaluation for MTMR HiperMAN system",
            "Publication year": 2003,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/8514",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel architecture for multiple peer-to-peer overlays in manets in emergency situations",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:DwFgw5hZUzMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "未来无线世界的协同网络",
            "Publication year": 2005,
            "Publication url": "http://www.cqvip.com/qk/90822a/200504/15547402.html",
            "Abstract": " 0引言 可以设想,后3G系统(B3G)将是移动/无线通信系统和IP技术逐步演化,接近,最终融合并通过各种接入技术提供多种服务的系统.为实现这一设想,必须了解网络接入,通信服务,移动性,用户设备在支持异型结构方面的需求.另外,通过向研究领域提供指导性框架和技术发展的优先顺序来促进必要的组网技术研究,也是同样重要的.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:7XUxBq3GufIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Walsh–Hadamard transform based non–orthogonal multiple access (NOMA) and interference rejection combining in next-generation HetNets",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/993396",
            "Abstract": "In heterogeneous networks (HetNets), non-orthogonal multiple access (NOMA) has recently been proposed for hybrid-access small-cells, promising a manifold network capacity compared to OMA. One of the major issues with the installation of a hybrid-access mechanism in small-cells is the cross-tier interference (intercell interference (ICI)) caused by the macrocell users (MUs) that are unable to establish a connection to the small-cell base station (SBS). In this paper, a joint strategy is proposed for hybrid-access small-cells using the Walsh–Hadamard transform (WHT) with NOMA and interference rejection combining (IRC) to achieve high performance gains and mitigate intercell interference (ICI), respectively. WHT is applied mathematically as an orthogonal variable spreading factor (OVSF) to achieve diversity in communication systems. When applied jointly with NOMA, it ensures better performance gains than the conventional NOMA. It reduces the bit error rate (BER) and enhances subsequent throughput performance of the system. IRC is used at the receiver side for managing the cross-tier interference caused by MUs that are unable to connect to the small-cell base station (SBS) for hybrid-access. The work considers both ideal and nonideal successive interference cancellation (SIC) conditions for NOMA. Mathematical modeling is provided for the proposed joint strategy for HetNets and the results validate it in terms of BER and subsequent user throughput performance, compared to the conventional NOMA approach.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:mo9XK3BEATIC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Energy Efficient Rainbow Collection Routing Protocol for Wireless Snesor Networks",
            "Publication year": 2015,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/31430/",
            "Abstract": "Due to implementation of routing protocols in limited power supply devices in wireless sensor networks, this paper presents and evaluates Energy Eficient Rainbow Collection Tree Protocol (EFRCTP) as a novel, real-time, position based and energy efficient routing protocoli that is a new version of Rainbow Collection Tree Protocol (RCTP). RCTP is an enhanced version of Collection Tree Protocol (CTP) as a lightweight routing protocol for Wireless Sensor Networks (WSN)s. This paper analyses the impact of the Radio Frequency (RF) range to reducing the number of nodes which receive the signal by using a novel Parent Forwarding Region (PFR) technique. EFRCTP as a Geographical Routing Protocol (GRP) reduces the number of forwarding nodes and finally reduce the number of packets are sent and received and also to reduce collision in the network. A series of performance evaluations through Matlab and Omnet++ simulations show significant improvements in network performance parameters and total energy consumption over CTP and directed flooding routing protocols.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Novel Lightweight Multi-secret Sharing Technique for Mobile Adhoc Networks",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.898.3951&rep=rep1&type=pdf",
            "Abstract": "In this paper, we are concerned with security for Mobile Ad-hoc Networks (MANETs). Due to the decentralized and self-organizing MANET nature, which implies no direct trusted relationships among nodes, threshold secret sharing algorithms can play a key role in solving the problem of single point of failure in the traditional public-key infrastructure (PKI) architecture. We first motivate the need for efficient secret sharing techniques by reviewing security requirements for MANETs with a view of creating a prototype implementation, focusing on threshold cryptographic techniques for key management solutions. With the aim of designing a computationally lightweight secret sharing scheme, we then propose a novel technique for multi-secret sharing that will improve some aspects of the key management.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive spectrum opportunity access in cognitive radio networks",
            "Publication year": 2013,
            "Publication url": "http://eprints.kingston.ac.uk/24624/",
            "Abstract": "This paper presents the Adaptive Spectrum Opportunity Access (ASOA) scheme. The proposed scheme greatly improves spectrum utilization and provides improved QoS for the secondary users. The secondary data delivery time is adapted in different spectrum opportunities through ASOA scheme based on the estimated collision rates in a sophisticated way. The performance evaluations in terms of the channel utilization, channel collision, secondary data delivery and handoff rates are assessed and compared with the Maximum Idle Channel Remaining Lifetime (MICRL) schemes. The simulation results confirm the viability of the ASOA scheme in comparison with MICRL schemes.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:1qzjygNMrQYC",
            "Publisher": "Academy Publisher"
        },
        {
            "Title": "Towards a scalable routing approach for mobile ad-hoc networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7390521/",
            "Abstract": "The Internet is evolving towards a two-fold architecture that will comprise of traditional infrastructure based networks as well as emerging self organised autonomic peripheral networks. Such Internet peripheral networks are being termed as the Internet of things (IoT) whereby smart objects and devices will be connected together in a fully distributed fashion to provide ubiquitous services through pervasive networking. Mobile Ad hoc Networks (MANETs) is regarded as one of the pervasive self-organised networks that will play a major role in autonomic future internet communication. There are several wellknown challenges to be addressed in order to enable MANET deployments of large islands of interconnected smart devices. Therefore, in this paper, we perform simulations using the ns-2 software, for various well-known routing protocols for MANETs in order to determine the scalability of these protocols. This paper …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:rDsFeusoTZkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Requirements and vision for NG-Wireless",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/21165/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:tOudhMTPpwUC",
            "Publisher": "Wireless World Research Forum"
        },
        {
            "Title": "STRIKE: spectrally efficient fixed wireless network based on dual standards",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1249077/",
            "Abstract": "One of the major challenges of the telecommunication community for the coming years will be to make multimedia services available to everyone, even to those who are in remote places. Broadband fixed wireless access (BFWA) is one of the best positioned radio access technologies to provide broadband access with performances that surpass current 3G mobile data rates and are similar to wired xDSL systems. The paper addresses the solutions which are proposed and demonstrated in the frame of the IST-STRIKE project to enhance spectral efficiency for BFWA and to guarantee end-to-end quality of service (QoS) through a dual mode HiperMAN/HiperLAN system. The first aspect is covered by the use of multi-transmit multi-receive (MTMR) techniques. Indeed, as it is foreseen that the data rates available with the studied standards will be sufficient for the majority of single user needs, the best way to increase the …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "IMS to Support Emergency Services and Applications.",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/44530660/IMS_to_Support_Emergency_Services_and_Ap20160408-14303-1vldjai.pdf",
            "Abstract": "The transition to next generation networks is often coupled with the vision of innovative services providing personalized and customisable services over an all-IP infrastructure. To enable a smooth transition, next generation all-IP networks need not only support more services but also support emergency services. The idea here is to provide a general emergency management framework addressing extreme emergency situations such as terrorist attacks and natural catastrophes as well as day-to-day emergency cases based on the IP Multimedia Subsystem (IMS). In order to enable multimedia communication for emergency situations, an framework will be architected for supporting the distribution of currently centralised services such as VoIP and name translation and supporting those services in a reliable and secure manner withstanding any failures and changes of the network.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SATis5 solution: A comprehensive practical validation of the satellite use cases in 5G",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Florian-Voelk/publication/351415492_SATIS5_SOLUTION_A_COMPREHENSIVE_PRACTICAL_VALIDATION_OF_THE_SATELLITE_USE_CASES_IN_5G/links/60966e41299bf1ad8d8609ad/SATIS5-SOLUTION-A-COMPREHENSIVE-PRACTICAL-VALIDATION-OF-THE-SATELLITE-USE-CASES-IN-5G.pdf",
            "Abstract": "The 5G vision encompasses a broad range of use cases, including wide scale multimedia content distribution, Internet of Things (IoT) and the users’ connectivity on-board vessels, planes, trains and connected cars as well as in underserved and remote areas. The satellite community is interested to help accelerate the deployment of 5G also for such use case scenarios and hence to extend the dedicated and private networks towards a global, nomadic and mobile coverage also for 5G.To be able to play an important role within the 5G network of networks, the satellite community has taken the direction towards a convergent satellite-terrestrial architecture, in which the satellite network can be integrated as a 3GPP 5G access network, as a 3GPP or a non-3GPP access network and as a backhaul technology. To be able to effectively integrate the satellite networks within the 5G ecosystem, with minimal impact on the existing networks and following the development roadmap of the new satellite networks, a large-scale proof-of concept is required to provide the functional input to support the satellite related standardization.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:VHM5RxzNINsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SOAP: a cognitive hybrid routing protocol for mobile ad-hoc networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6849711/",
            "Abstract": "With the shift towards wireless technology increasing at a faster rate than ever before, it is becoming ever more important to focus on optimising the routing functionality of a wireless network. The purpose of this paper is to outline the different types of routing that can be applied in a Mobile Ad Hoc Network (MANET) and to propose a new routing protocol named SOAP. The SOAP routing protocol is designed as a cognitive hybrid protocol, making use of the functionality that exists in the popular proactive OLSR (Optimized Link State Routing) and reactive AODV (Ad hoc On-Demand Distance Vector) MANET routing protocols. The paper concludes that the SOAP protocol brings about performance improvements across a few Quality of Service metrics such as a lower delay than AODV and a lower routing overhead than OLSR but more work needs to be placed in ensuring its reliability and consistency across different …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cognitive radio: Regulatory inspirations",
            "Publication year": 2007,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/8496",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "5G enabled mobile healthcare for ambulances",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9024584/",
            "Abstract": "Provision of services such as remote healthcare, telemedicine and telesurgery is gaining popularity with the evolution in cellular networks. Mobile healthcare that involves in-ambulance treatment by a remote physician, has stringent connectivity criteria and that can be fulfilled by 5G's promising potential. 5G can provide high data rates, massive connectivity, ultra-reliability, high spectral efficiency and very low latencies. This paper presents a complete framework for a 5G enabled connected ambulance that focuses on two-way data communication including audio-visual multimedia flow between ambulances and hospitals. The model includes wireless transmission, based on a 5G network, of three types of data i.e. ultrasound videos, in-ambulance video streaming and vital signs measurements of patients. This will enable the doctors to remotely assist and guide the ambulance crew to provide initial medical care to in …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:h-xndbdg2koC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Location-Dependent service accounting",
            "Publication year": 2016,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420013153-41/location-dependent-service-accounting-michael-georgiades-christos-politis-nadeem-akhtar-rahim-tafazolli",
            "Abstract": "Accounting constitutes one of the most important functions in any telecommunication network. The provisioning of accounting requires very complicated functionality due to the large number of users involved as well as differences in the tariff schemes applied to different user groups. The accounting functionality consists of four subfunctions: metering, charging, accounting, and billing. The metering function is responsible for identifying and recording information relevant to the usage of a resource in a meaningful way; for example, the information could be about access to a resource or the time and duration of usage. The records created by the metering function are referred to as",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:hMod-77fHWUC",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "Cognitive radio",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/19951",
            "Abstract": "Cognitive radio - Kingston University Research Repository Jump to main menu navigation [j] \nJump to page content [k] Research at Kingston University Login Home About Browse by Year \nBrowse by Research Area Browse by Faculty Browse by Kingston Author Search Help Cognitive \nradio Pirmoradian, M. and Politis, C. (2010) Cognitive radio. In: McGraw-Hill, Editorial Staff, (ed.) \nMcGraw-Hill Yearbook of Science and Technology 2011. New York : McGraw-Hill. ISBN \n9780071763714 Full text not available from this archive. Item Type: Book Section Research \nArea: Computer science and informatics Faculty, School or Research Centre: Faculty of \nComputing, Information Systems and Mathematics (until 2011) Faculty of Computing, Information \nSystems and Mathematics (until 2011) > Mobile Information and Network Technology (MINT) \nResearch Centre Depositing User: Automatic Import Agent Date Deposited: 12 Aug 10::…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:GnPB-g6toBAC",
            "Publisher": "McGraw-Hill"
        },
        {
            "Title": "Secure end-to-end communications over WiMAX networks & Security framework for mobile ad-hoc networks in emergency cases",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/16970",
            "Abstract": "Secure end-to-end communications over WiMAX networks & Security framework for mobile \nad-hoc networks in emergency cases - Kingston University Research Repository Jump to main \nmenu navigation [j] Jump to page content [k] Research at Kingston University Login Home \nAbout Browse by Year Browse by Research Area Browse by Faculty Browse by Kingston Author \nSearch Help Secure end-to-end communications over WiMAX networks & Security framework \nfor mobile ad-hoc networks in emergency cases Politis, C., Panaousis, EA and Nazaryan, L. \n(2010) Secure end-to-end communications over WiMAX networks & Security framework for \nmobile ad-hoc networks in emergency cases. In: Information Security: Detect, Protect, Deter; \n17 March 2010, London, UK. Full text not available from this archive. Item Type: Conference \nor Workshop Item (Poster) Event Title: Information Security: Detect, Protect, Deter Area: , : :…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ChaMeLeon (CML): A hybrid and adaptive routing protocol for Emergency Situations",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/18415/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IETF MANET Working Group"
        },
        {
            "Title": "Energy conservative and coverage preservative clustering for wireless sensor networks",
            "Publication year": 2013,
            "Publication url": "http://eprints.kingston.ac.uk/25987/",
            "Abstract": "Energy conservative and coverage preservative clustering for wireless sensor networks - \nKingston University Research Repository Jump to main menu navigation [j] Jump to page \ncontent [k] Research at Kingston University Login Home About Browse by Year Browse by \nResearch Area Browse by Faculty Browse by Kingston Author Search Help Energy conservative \nand coverage preservative clustering for wireless sensor networks Mehdi Toussi, Ahora and \nPolitis, Christos (2013) Energy conservative and coverage preservative clustering for wireless \nsensor networks. In: IEEE PIMRC’13 Conference; 8-11 Sep 2013, London, UK. ISSN (print) \n2166-9570 Full text not available from this archive. Official URL: http://dx.doi.org/10.1109/PIMRC.\nItem Type: Conference or Workshop Item (Paper) Event Title: IEEE PIMRC’13 Conference \nOrganising Body: Institute of Electrical and Electronic Engineers Research Area: Computer , : :…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:gI9wzKcniAoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Entropy‐based opportunistic spectrum access for cognitive radio networks",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.2886",
            "Abstract": "This paper proposes an opportunistic spectrum decision scheme based on the weighted residual entropy concept for cognitive radio networks. The proposed scheme maximum entropy channel access selects appropriate spectrum opportunities based on the usefulness of the idle‐channel remaining lifetime estimated through the weighted residual entropy function for the unoccupied channels. The performance of the proposed spectrum decision scheme is evaluated using a wealth of efficiency metrics, namely channel utilisation, channel collision, spectrum handoff rate and collision probability in perfect and imperfect spectrum sensing environments. The probabilities of primary signal detection and false detection are taken into the proposed spectrum hole selection technique. Despite the increasing probability of false detection, simulation results show that this central spectrum decision scheme greatly improves …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "White Paper: Broadband wireless beyond 2020",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/19269/",
            "Abstract": "White Paper: Broadband wireless beyond 2020 - Kingston University Research Repository \nJump to main menu navigation [j] Jump to page content [k] Research at Kingston University \nLogin Home About Browse by Year Browse by Research Area Browse by Faculty Browse by \nKingston Author Search Help White Paper: Broadband wireless beyond 2020 Kaiser, Stefan \n[Contributor], Latva-aho, Matti [Contributor], Abdollahi, Seyedreza [Contributor], Al-Raweshidy, \nHamed [Contributor], Dahlman, Erik [Contributor], Demestichas, Panagiotis [Contributor], \nDillinger, Markus [Contributor], Foster, Robert [Contributor], Gruber, Markus [Contributor], Merz, \nPeter [Contributor], Mestre, Xavier [Contributor], Pirmoradian, Mahdi [Contributor], Politis, \nChristos [Contributor], Raaf, Bernhard [Contributor], Schaich, Frank [Contributor], Schellmann, \nMalte [Contributor], Tafazolli, Rahim [Contributor], Vucic, Nikola [Contributor] and Winkelmann, […",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Net! Works"
        },
        {
            "Title": "Design of new MAC-PHY interface for Multiple-antenna-based HIPERMAN System",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8515/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectrum allocations and new technologies: A look into the future",
            "Publication year": 2012,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/23694",
            "Abstract": "Spectrum allocations and new technologies: A look into the future - Kingston University \nResearch Repository Jump to main menu navigation [j] Jump to page content [k] Research \nat Kingston University Login Home About Browse by Year Browse by Research Area \nBrowse by Faculty Browse by Kingston Author Search Help Spectrum allocations and new \ntechnologies: A look into the future Politis, Christos (2012) Spectrum allocations and new \ntechnologies: A look into the future. In: International scientific conference, eRA – 7 The \nsynEnergy forum; 27- 30 Sept 2012, Piraeus, Greece. Full text not available from this archive. \nItem Type: Conference or Workshop Item (Lecture) Event Title: International scientific \nconference, eRA – 7 The synEnergy forum Research Area: Computer science and \ninformatics Faculty, School or Research Centre: Faculty of Science, Engineering and \nComputing (until 2017) Faculty of Science, and (…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context transfer module in wireless communication networks",
            "Publication year": 2004,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/17122",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A peer-to-peer overlay approach for emergency mobile ad hoc network based multimedia communications",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.4108/ICST.MOBIMEDIA2009.7860",
            "Abstract": "Overlay networks are located on top of the physical network and are generally favored for the implementation of peer-to-peer (P2P) networks providing services such as voice over IP (VoIP) communications. The operation of the overlay network results in the creation of routing data packets in the network layer. This paper considers the possibility of employing an overlay network for the Mobile Ad hoc NETwork (MANET) architecture in the intention of deploying a P2P network service for extreme emergency cases as described in the EU-FP7 PEACE project. The structured overlay network for the underlying MANET network, proposed in this paper, is built on Bamboo [12] which has been proven to be more efficient than other methods in literature. A study is carried out, using the network simulator ns-2, in order to demonstrate that the proposed enhanced overlay solution has less overhead, and that it has the potential to …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CTP-A: An enhanced version of collection tree protocol",
            "Publication year": 2013,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/26607/",
            "Abstract": "Due to implementation of routing protocols in limited power supply devices in wireless sensor networks, this paper present a new version of Collection Tree Protocols (CTP). CTP is a light routing protocol for Wireless Sensor Networks (WSNs) that the basic foundation is on following the data toward the sink with minimum overhead. CTP uses ETX as link communication quality metric between nodes. The previous researches show that ETX is not stable during the time in real environment and its fluctuation causes the routing protocols make mistake to choose the best path to the destination. CTP-R uses AETX as link metric that it has been shown is more stable than ETX. CTP-R is a cross-layer integration of tree topology and quality link metric to select the relay node plus a mechanism to make it capable to avoid the dead end routes and finally detect and route around connectivity holes. Detecting and routing around connectivity holes (Rainbow) could enhance performance of CTP to avoid the dead end routes and also loop routes without increasing any overhead to the system. CTP-R is an energy efficient protocol and achieves an improved performance in term of packet delivery ratio, packet travel time and total energy consumption.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Suitability of VVC and HEVC for Video Telehealth Systems",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Muhammad-Arslan-Usman/publication/345628129_Suitability_of_VVC_and_HEVC_for_video_telehealth_systems/links/5ffeeb1a92851c13fe0a54d3/Suitability-of-VVC-and-HEVC-for-video-telehealth-systems.pdf",
            "Abstract": "Video compression in medical video streaming is one of the key technologies associated with mobile healthcare. Seamless delivery of medical video streams over a resource constrained network emphasizes the need of a video codec that requires minimum bitrates and maintains high perceptual quality. This paper presents a comparative study between High Efficiency Video Coding (HEVC) and its potential successor Versatile Video Coding (VVC) in the context of healthcare. A large-scale subjective experiment comprising of twenty-four non-expert participants is presented for eight different test conditions in Full High Definition (FHD) videos. The presented analysis highlights the impact of compression artefacts on the perceptual quality of HEVC and VVC processed videos. Our results and findings show that VVC clearly outperforms HEVC in terms of achieving higher compression, while maintaining high quality in FHD videos. VVC requires upto 40% less bitrate for encoding an FHD video at excellent perceptual quality. We have provided rate-quality curves for both encoders and a degree of overlap across both codecs in terms of perceptual quality. Overall, there is a 71% degree of overlap in terms of quality between VVC and HEVC compressed videos for eight different test conditions.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:K-tzbvM8PMoC",
            "Publisher": "TECH SCIENCE PRESS"
        },
        {
            "Title": "Technology research programme: Research and development at Ofcom 2004/05",
            "Publication year": 2005,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8527/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Ofcom"
        },
        {
            "Title": "Energy efficient Load Balancing in self organized shared network",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294729/",
            "Abstract": "Energy is an expensive commodity in Long term Evolution-Advanced (LTEA) networks. In the recent years many researchers have proposed different approaches to minimize energy consumption in LTEA according to mobile users' point of view. In this paper we analyze the energy consumption of the network according to the operators' point of views. Network sharing and the Self Organized Network (SON) technologies are attractive solutions for cost reduction, and minimizing energy utilization in LTEA. The purpose of this paper is to provide a novel framework for minimizing energy cost per bit and assist with Self Organized Load Balancing algorithm (SO-LB) in shared network. Simulation results show that, by employing SO-LB in a shared network, it is possible to save 15-20% of the energy normally consumed in the LTEA non shared networks.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Securing neighbourhood discovery for mobile ad-hoc Networks",
            "Publication year": 2015,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/32008",
            "Abstract": "Securing neighbourhood discovery for mobile ad-hoc Networks - Kingston University \nResearch Repository Jump to main menu navigation [j] Jump to page content [k] Research \nat Kingston University Login Home About Browse by Year Browse by Research Area \nBrowse by Faculty Browse by Kingston Author Search Help Securing neighbourhood \ndiscovery for mobile ad-hoc Networks Jayawardana Weerasinghe, Nuwan S., Ladas, \nAlexandros, Adigun, Olyanka, Pfluegel, Eckhard and Politis, Christos (2015) Securing \nneighbourhood discovery for mobile ad-hoc Networks. In: Vehicular Technology \nConference (VTC Fall), IEEE 82nd, 6–9 September 2015, Boston, USA; 6-9 Sep 2015, \nBoston, MA, USA. (2015 IEEE 82nd Vehicular Technology Conference (VTC Fall)) Full text \nnot available from this archive. Official URL: http://dx.doi.org/10.1109/VTCFall.Item Type: \nConference or Workshop Item (Paper) Event Title: (VTC Fall…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:4Wrxgq2JVp0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "20 Managing the Radio Spectrum",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4906413/",
            "Abstract": "IEEE Vehicular Technology Magazine (ISSN 1556-6072) is published quarterly by The Institute of Electrical and Electronics Engineers, Inc. Headquarters: 3 Park Avenue, 17th Floor, New York, NY 10016-5997, USA+ 1 212 419 7900. Responsibility for the contents rests upon the authors and not upon the IEEE, the Society, or its members. The magazine is a membership benefit of the IEEE Vehicular Technology Society, and subscriptions are included in Society fee. Replacement copies for members are available for $20 (one copy only). Nonmembers can purchase individual copies for $98. Nonmember subscription prices are available on request. Copyright and Reprint Permissions: Abstracting is permitted with credit to the source. Libraries are permitted to photocopy beyond the limits of the US Copyright law for private use of patrons: 1) those post-1977 articles that carry a code at the bottom of the first page …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Routing challenges and directions for smart objects in future internet of things",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/18307/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A summary of cognitive radio work performed for the UIK regulator OFCOM",
            "Publication year": 2006,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/8499",
            "Abstract": "A summary of cognitive radio work performed for the UIK regulator OFCOM - Kingston \nUniversity Research Repository Help Search Browse by Year Browse by Research Area \nBrowse by Faculty Browse by Kingston Author About Home Login A summary of cognitive \nradio work performed for the UIK regulator OFCOM Bradford, Julie, Burbidge, Eddie, \nChandler, Derek, Kennett, Mike, Levine, Paul, Politis, Christos and Shukla, Anil (2006) A \nsummary of cognitive radio work performed for the UIK regulator OFCOM. In: Software \nDefined Radio Technical Conference and Product Exposition; 13 Nov - 17 Nov 2006, \nOrlando, USA. Official URL: http://www.sdrforum.org/pages/sdr06/sdr06_papers/3... \nMetadata Actions (Repository Editors) Item Control Page Item Control Page Accessibility \nDisclaimer Copyright Freedom of Information Privacy Policy Cookies …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SATis5: A 5G Testbed Integrating Satellite and Terrestrial Infrastructures",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Florian-Voelk/publication/351357914_SATis5_A_5G_Testbed_Integrating_Satellite_and_Terrestrial_Infrastructures/links/6093ae55458515d315fc342f/SATis5-A-5G-Testbed-Integrating-Satellite-and-Terrestrial-Infrastructures.pdf",
            "Abstract": "With the increasing interest into a convergent satellite terrestrial 5G system, the new 5G developments should move to the practically oriented integration of the technologies, especially towards the most promising use cases, as to be able to insure a competitive market share to the satellite networks. With all the efforts of the satellite community, the current 5G system is highly dominated by the terrestrial developments, lacking however the proof-of-concept, which will provide the functional input to support the satellite related standardization. This article presents the preparatory work and the first results of the SATis5 testbed project, including the pragmatic analysis of the 5G use cases from a satellite perspective, the targeted Key Performance Indicators (KPIs) for the convergent system and the integrated 5G architecture. From all of these, a set of critical technology elements is determined, providing a perspective of the specific features which will be implemented and evaluated in the testbed, as well as a direction towards 5G standardization for the satellite community.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:lOG7zRu2uA8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Novel 3D media technologies",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4939-2026-6.pdf",
            "Abstract": "A significant amount of effort has been made by the research community towards achieving immersive multi-view entertainment. Most of the effort has been targeted at content acquisition and rendering/display technologies, or at delivery of pre-encoded content rather than live content. A key feature of immersive communication is the ability for participants to interact with the remote environment, and to detect and evaluate that interaction via their senses [1]. Thus, immersive communication is evolving in a variety of directions. One possible goal is to emulate reality, in which case high fidelity, realistic renderings are important and spatial relationships must be maintained. Another possible goal is to achieve a state of immersive communication that goes beyond reality, for example, enabling millions of people to attend a lecture or a music concert in which everyone has a front row seat [1, 2].Commercial world has an …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:O0MA3yP7Y3UC",
            "Publisher": "Springer"
        },
        {
            "Title": "Integrating peer-to-peer functionalities and routing in mobile ad-hoc networks",
            "Publication year": 2016,
            "Publication url": "http://eprints.kingston.ac.uk/35133/",
            "Abstract": "Mobile Ad-hoc Networks (MANETs) impose strict requirements in terms of battery life, communication overhead and network latency, therefore optimization should be made to applications and services such as domain name service (DNS), dynamic host configuration protocol (DHCP) and session initiation protocol (SIP) if they are to be considered for use on MANETs. Due to the decentralized and self-organizing nature of MANETs, such applications could utilize a distributed name resolution/data storage service. Distributed Hash Tables (DHTs) enable these features by virtually organizing the network topology in a peer-to-peer (P2P) overlay. P2P overlays have been designed to operate on the application layer without knowledge of the underlying network thus causing poor performance. To address this problem, we propose and evaluate two different DHTs integrated with MANET routing in order to optimize the overall performance of MANET communications when P2P applications and services are used. Both architectures share the same functionality such as decentralization, self-reorganization, and self-healing but differ in MANET routing protocol. Performance evaluation using the NS2 simulator shows that these architectures are suited to different scenarios namely increasing network size and peer velocity. Comparisons with other well-known solutions have proven their efficiency with regard to the above requirements.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:t9Ks5LMjN0QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IMS-based telecommunication with a special focus on security and services issues",
            "Publication year": 2008,
            "Publication url": "http://eprints.kingston.ac.uk/8960/",
            "Abstract": "IMS-based telecommunication with a special focus on security and services issues - \nKingston University Research Repository Jump to main menu navigation [j] Jump to page \ncontent [k] Research at Kingston University Login Home About Browse by Year Browse by \nResearch Area Browse by Faculty Browse by Kingston Author Search Help IMS-based \ntelecommunication with a special focus on security and services issues Dagiuklas, Tassos \nand Politis, Christos (2008) IMS-based telecommunication with a special focus on security \nand services issues. In: 4th International Mobile Multimedia Communications Conference (MobiMedia); \n7 July - 9 July 2008, Oulu, Finland. Full text not available from this archive. Official URL: http://www.mobimedia.org/2008/index.shtml \nItem Type: Conference or Workshop Item (Other) Event Title: 4th International Mobile \nMultimedia Communications Conference (MobiMedia) Research Area: …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:p2g8aNsByqUC",
            "Publisher": "ACM/Springer"
        },
        {
            "Title": "The impact of mobility management schemes on the performance of multimedia services in All-IP Network infrastructures",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/8513/",
            "Abstract": "The impact of mobility management schemes on the performance of multimedia services in All-IP \nNetwork infrastructures - Kingston University Research Repository Jump to main menu navigation \n[j] Jump to page content [k] Research at Kingston University Login Home About Browse by Year \nBrowse by Research Area Browse by Faculty Browse by Kingston Author Search Help The \nimpact of mobility management schemes on the performance of multimedia services in All-IP \nNetwork infrastructures Politis, C. and Dagiuklas, T. (2003) The impact of mobility management \nschemes on the performance of multimedia services in All-IP Network infrastructures. In: First \nInternational Working Conference on Performance Modelling and Evaluation of \nHeterogeneous Networks; 21-23 July 2003, Ilkley, UK. Full text not available from this archive. \nItem Type: Conference or Workshop Item (Paper) Event Title: First International on and :…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cross-layer model to reduce control traffic overhead in peer-to-peer mobile ad-hoc networks",
            "Publication year": 2010,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/16661",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy efficient and scalable routing protocol for extreme emergency ad hoc communications",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-011-0336-0",
            "Abstract": "In this paper, we firstly present an energy efficient (E2) and protocol independent mechanism for Mobile Ad-hoc Networks (MANETs) routing in disaster rescue operations. In such extreme emergency scenarios, protocols need to be energy efficient and scalable. We therefore proceed to integrate the E2 mechanism with the scalable ChaMeLeon (CML) protocol and consequently term it as E2CML. We support the E2 mechanism design using an energy consumption model for MANET nodes and use a packet delivery delay model to explain the scalability and energy efficiency of CML. Through the integration process of E2-CML, we primarily aim at satisfying the requirements for emergency MANETs (eMANETs), but also intend to demonstrate that the proposed mechanism is portable across popular protocols such as Optimized Link State Routing (OLSR) and Ad hoc On-Demand Vector (AODV). Finally, the …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Plenary: RAS Next generation terminals-WWRF spectrum vision",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/16972/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a secure next generation PPDR communication: SALUS approach",
            "Publication year": 2014,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/30142/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:1yQoGdGgb4wC",
            "Publisher": "SW Press"
        },
        {
            "Title": "Energy efficiency metrics for scheduling algorithms in 3GPP LTE",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/18557",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy efficient load balancing in self organized shared network",
            "Publication year": 2012,
            "Publication url": "http://eprints.kingston.ac.uk/23141/",
            "Abstract": "Energy efficient load balancing in self organized shared network - Kingston University Research \nRepository Jump to main menu navigation [j] Jump to page content [k] Research at Kingston \nUniversity Login Home About Browse by Year Browse by Research Area Browse by Faculty \nBrowse by Kingston Author Search Help Energy efficient load balancing in self organized \nshared network Monteiro, VC, Mumtaz, S., Politis, C. and Rodriguez, J. (2012) Energy efficient \nload balancing in self organized shared network. In: IEEE TEMU (International Conference on \nTelecommunications and Multimedia); 30 Jul - 1 Aug 2012, Crete Island, Greece. (Submitted) \nFull text not available from this archive. Item Type: Conference or Workshop Item (Paper) \nEvent Title: IEEE TEMU (International Conference on Telecommunications and Multimedia) \nOrganising Body: IEEE Research Area: Computer science and informatics Faculty, School (…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust Device-to-Device 5G cellular communication in the post-disaster scenario",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8651832/",
            "Abstract": "The wireless communication is an integral part of the society, however, wireless network infrastructure may not fully function during post-disaster wireless network scenario in which we need wireless services even more than normal circumstances. In such post-disaster scenarios, the base stations (BS) could possibly be dysfunctional or overloaded by an excessive number of user calls or data, whereas user terminals are likely to be partially connected to or fully isolated from the BS radio signals. In this paper, we study the network behavior during the post-disaster when BSs undergo the thinning process due to the damage to the network infrastructure. During network recovery phase, we also study the network performance when new temporary BSs are distributed which will bring the network into BS superposition phase. Furthermore, Device-to-Device (D2D) assisted cellular communication helps to increase the link …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:tL5YfqkXb3gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of proactive multipath routing protocol for ubiquitous networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8292328/",
            "Abstract": "During the past years, a dramatic increase of peripheral self organised autonomic networks interworking with the traditional infrastructure networks has been highly noticed. Mobile Ad-Hoc Networks (MANETs) have become an interesting topic for research because of their independent nature in terms of network infrastructure and can play a vital role in future Internet communication. A lot of effort has been made in designing efficient routing protocols for MANETs, mainly because of their unique characteristics, such as dynamic topology, high mobility and limited bandwidth. In this paper we evaluate the performance of our Multipath-ChaMeLeon (M-CML) routing protocol and compare to other proactive protocols; Optimised Link State Protocol (OLSR) and Destination-Sequenced Distance Vector (DSDV). For this reason, we have considered 2 different scenarios for MANETs by varying the number of nodes and speed …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:vkz5F8TaVKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Maximizing network throughput",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5226938/",
            "Abstract": "In this article, we investigated, using game theory, the competition in a shared open spectrum between two operators. We proposed a new way of maximization of the network throughput, and we provided new ways toward the provision of fairness. We computed an NE and NBS of an NPG and CPG, respectively. Regarding strategies and the best game to be played, there is no single answer. The best solution depends on the perspective. However, the CPG is more effective in terms of clients' experienced quality of service. Our future work involves experimenting with more than two APs in the shared area and evaluating various quality of service metrics.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "D4. 1 Detailed design report on algorithms for MTMR system including classical approaches: IST-STRIKE project, deliverable D4. 1",
            "Publication year": 2003,
            "Publication url": "https://vbn.aau.dk/en/publications/d41-detailed-design-report-on-algorithms-for-mtmr-system-includin",
            "Abstract": "D4.1 Detailed design report on algorithms for MTMR system including classical approaches: \nIST-STRIKE project, deliverable D4.1 — Aalborg University's Research Portal Skip to main \nnavigation Skip to search Skip to main content Aalborg University's Research Portal Logo \nDansk English Home Profiles Projects Publications Activities Research Units Facilities Press / \nMedia Prizes Datasets Impacts Search by keywords, name or affiliation D4.1 Detailed design \nreport on algorithms for MTMR system including classical approaches: IST-STRIKE project, \ndeliverable D4.1 Marc Chenu-Tournier, Adrien Renoult, Klaus-Peer Wachsmann, Ernst \nZielinski, Harald Bothe, Ernestina Cianca, Andreas Hutter, Fanny Platbrood, Roshano Roberts, \nChristos Politis, Reza Hoshyar, Nicolas Cassiau, Beza Negash Getu, Piero Giorgi Department \nof Electronic Systems Research output: Book/Report › Book › Research Overview Original - IST-…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solar Powered Autonomous Hex-Copter for Surveillance, Security and Monitoring",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9435223/",
            "Abstract": "Due to innovation in machine automation and artificial intelligence (AI), surveillance and security paradigms are changing. The unmanned aerial vehicles are designed for surveillance of high importance area, that are either difficult to access or are located in dangerous zones. This paper focuses on design and construction of hex-copter with surveillance capabilities. The designed hex-copter has the ability to fly autonomously and cover the predefined path as well as send the video signals which are to be viewed on the ground base station, i.e., PC and smart phones etc., also the UAV is fully capable of self-controlled flight and solar based self-powering mechanism. For self-control mechanism, our design includes an ArduPilot Mega (APM) Version 2.8 flight controller having an in-built microcontroller with capability of interfacing with GPS and Inertial measurement sensor unit. The auto-flight path is generated with …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:XR3BWSlh_xcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cumulative interference",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5621603/",
            "Abstract": "We have considered a cognitive radio (CR) network in the presence of a primary network in which the cognitive users are distributed within the cognitive environment with constant density. In particular, we assumed that the primary transmitter and PR handshake so that the same spectrum bands can be utilized while also avoiding interference. For this reason, the handshaking technique occurs when the base station or primary receivers (PR) sends a beacon signal over the licensed spectrum network. We followed two techniques to calculate the expected aggregated interference caused by CRs that miss the beacon signal.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An energy efficient proposal in shared relay-based LTE network",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6629695/",
            "Abstract": "Energy is an expensive commodity in Long term Evolution-Advanced (LTEA) networks. In the recent years many researchers have proposed different approaches to minimize energy consumption in LTEA according to mobile users' point of view. In this paper we analyze the energy consumption of the network according to the operators' point of views. Network sharing and the Self Organized Network (SON) technologies are attractive solutions for cost reduction, and minimizing energy utilization in LTEA. The purpose of this paper is to provide a novel framework for minimizing energy cost per bit and assist with Self Organized Load Balancing algorithm (SO-LB) in shared network. Simulation results show that, by employing SOLB in a shared network, it is possible to save 15-20% of the energy normally consumed in the LTEA non shared networks",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:eMMeJKvmdy0C",
            "Publisher": "VDE"
        },
        {
            "Title": "Proceedings of the 5th International ICST Mobile Multimedia Communications Conference",
            "Publication year": 2009,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/16453/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:mB3voiENLucC",
            "Publisher": "ICST"
        },
        {
            "Title": "Skills development in the field of next generation networked media over 4G+ infrastructures: the Nereus approach and its first results",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8534204/",
            "Abstract": "The paper discusses the first-year results from the NEREUS project, an ERASMUS+ KA2 Strategic Partnership (2016-1-EL01-KA203-023637) for skills development in the field of “next generation networked media over 4G+ infrastructures”. It initially outlines the overall approach adopted by five European Higher Education Institutes (HEI) towards the implementation of a number of Intellectual Outputs in the areas of Informatics, Telecommunications and service/network Security, and presents the overall methodology/policy adopted for assessing the quality of the provided modules by external and internal advisory boards. In turn, the paper elaborates on the implementation of two Intensive Courses for assessing the educational/training content by real/actual audience, analyzes the evaluations results and describes the actions taken for enhancing the quality of the provided material, as well as NEREUS learning …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:Amrzk_ktLr0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy efficient load balancing for future self-organized shared networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-014-9888-1",
            "Abstract": "Energy is an expensive commodity in long term evolution-advanced (LTE-A) networks, spurring a myriad of research approaches in recent years to attempt to minimize energy consumption in LTE-A, usually from the mobile users’ perspective. In this work, the energy consumption of the network is analyzed, according to the operators’ point of view. Network sharing and self-organized network (SON) technologies are attractive solutions for cost reduction, and for the minimization of energy utilization in LTE-A network. In this paper, a novel framework is provided using a self-organized load balancing (SO-LB) algorithm for minimizing energy cost per bit based on the scope of 3GPP standardization. Obtained simulation results show that by employing SO-LB algorithm in a shared network, it is possible to achieve up to 15–20 % savings in energy consumption when compared to LTE-A non-shared networks.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:N5tVd3kTz84C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Future networks and management",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/19604/",
            "Abstract": "Future networks and management - Kingston University Research Repository Help Search \nBrowse by Year Browse by Research Area Browse by Faculty Browse by Kingston Author \nAbout Home Login Future networks and management Abramowicz, Henrik, Schmidt, Ernst-Dieter \nS, Schmelz, Lars Christoph S, Pampu, Cornel, Kappler, Cornelia, Schramm, Mirko, \nPentikousis, Konstantinous, Zhou, Dongming, Glisic, Savo, Palacios, Juan, Mangues, Josep, \nDemestichas, Panagiotis, Toenjes, Ralf, Ramrekha, Tipu Arvind, Millar, Grant, Politis, Christos, \nFiguerola, Sergi, Simeonidou, Dimitra, Galis, Alex, Tafazolli, Rahim, Muñoz, Luis and Pampu, \nCornel (2011) Future networks and management. (Technical Report) Net!Works. Official URL: \nhttp://www.networks-etp.eu/fileadmin/user_upload/P... Metadata Actions (Repository Editors) \nItem Control Page Item Control Page Accessibility Disclaimer Copyright Freedom of Privacy …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:vRqMK49ujn8C",
            "Publisher": "Net! Works"
        },
        {
            "Title": "A case study of internet of things based on wireless sensor networks and smart phones",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=16078924055084592510&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:ef2wPL15CskC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperation Between Networks",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:vbGhcppDl1QC",
            "Publisher": "Wiley"
        },
        {
            "Title": "Virtual distributed testbed for optimisation and coexistence of heterogeneous systems",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1649161/",
            "Abstract": "The renown beyond 3G scenario depicts a diverse wireless networking world of \"network-of-wireless-networks\" accommodating a variety of radio technologies and mobile service requirements in a seamless manner. The achievement of this vision raises significant research challenges in view of system coexistence, system scale, interoperability, and evaluation tool design to provide a framework for cost-effective assessment of optimisation algorithms within a heterogeneous system environment. The UNITE (virtual distributed testbed for optimisation and coexistence of heterogeneous systems) platform aims to address the aforementioned research challenges by implementing an efficient, accurate and scalable virtual distributed testbed to support cross-system, and cross-layer optimization of heterogeneous systems in a unified manner. Through the use of the virtual testbed, cross-layer and cross-system interactions …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Next-Generation Communication Systems for PPDR: the SALUS Perspective",
            "Publication year": 2015,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/37110",
            "Abstract": "Next-Generation Communication Systems for PPDR: the SALUS Perspective - Kingston \nUniversity Research Repository Help Search Browse by Year Browse by Research Area \nBrowse by Faculty Browse by Kingston Author About Home Login Next-Generation \nCommunication Systems for PPDR: the SALUS Perspective Ladas, A., Jayawardana \nWeerasinghe, NS, Adigun, O. and Politis, C. (2015) Next-Generation Communication \nSystems for PPDR: the SALUS Perspective. In: Camara, D. and Nikaein, N., (eds.) Wireless \nPublic Safety Networks: Volume One: Overview and Challenges. London, UK : ISTE Press \nLtd - Elsevier Inc. pp. 49-91. ISBN 9781785480225 Official URL: http://dx.doi.org/10.1016/B978-1-78548-022-5.50003... \nMetadata Actions (Repository Editors) Item Control Page Item Control Page Accessibility \nDisclaimer Copyright Freedom of Information Privacy Policy Cookies …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:G7txJ4jiatkC",
            "Publisher": "ISTE Press Ltd-Elsevier Inc"
        },
        {
            "Title": "Hybrid multilayer mobility management with AAA context transfer capabilities for all-IP networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1325894/",
            "Abstract": "This article presents a multilayer mobility management scheme for all-IP networks where local mobility movements (micro-mobility) are handled separately from global movements (macro-mobility). Furthermore, a hybrid scheme is proposed to handle macro-mobility (mobile IP for non-real-time services and SIP for real-time services). The internetworking between micromobility and macro-mobility is implemented at an entity called the enhanced mobility gateway. Both qualitative and quantitative results have demonstrated that the performance of the proposed mobility management is better than existing schemes. Furthermore, a context transfer solution for AAA is proposed to enhance the multilayer mobility management scheme by avoiding the additional delay introduced by AAA security procedures.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure multimedia communications on WiMAX",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/17473/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multipath routing protocol for lossy communications in ad-hoc networks",
            "Publication year": 2016,
            "Publication url": "http://eprints.kingston.ac.uk/36405/",
            "Abstract": "A multipath routing protocol for lossy communications in ad-hoc networks - Kingston \nUniversity Research Repository Jump to main menu navigation [j] Jump to page content [k] \nResearch at Kingston University Login Home About Browse by Year Browse by Research \nArea Browse by Faculty Browse by Kingston Author Search Help A multipath routing \nprotocol for lossy communications in ad-hoc networks Pavlatos, N., Adigun, O., Ladas, A., \nWeerasinghe, N. and Politis, C. (2016) A multipath routing protocol for lossy \ncommunications in ad-hoc networks. In: EuCNC (EU Summit on Networks and \nCommunications); 27-30 Jun 2016, Athens, Greece. (Unpublished) Full text available as: [img] \nText (Paper of talk) Politis-C-36405.pdf - Supplemental Material Restricted to Registered \nusers only Download (221kB) Item Type: Conference or Workshop Item (Other) Event Title: \nEuCNC (EU Summit on Networks and Communications(…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:_TjUWtciUekC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure VoIP communications over WiMAX networks",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/16715/",
            "Abstract": "Secure VoIP communications over WiMAX networks - Kingston University Research Repository \nJump to main menu navigation [j] Jump to page content [k] Research at Kingston University Login \nHome About Browse by Year Browse by Research Area Browse by Faculty Browse by Kingston \nAuthor Search Help Secure VoIP communications over WiMAX networks Nazaryan, L., Politis, \nC. and Ehtisham, F. (2010) Secure VoIP communications over WiMAX networks. In: International \nConference on Telecommunications and Multimedia; 14 July - 16 July 2010, Chania, Crete, \nGreece. Full text not available from this archive. Official URL: http://www.temu.gr/2010/index.html \nItem Type: Conference or Workshop Item (Paper) Event Title: International Conference \non Telecommunications and Multimedia Research Area: Computer science and \ninformatics Faculty, School or Research Centre: Faculty of Computing, Information and (, …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile WiMAX: A broadband solution for rural UK",
            "Publication year": 2008,
            "Publication url": "http://eprints.kingston.ac.uk/9037/",
            "Abstract": "Mobile WiMAX: A broadband solution for rural UK - Kingston University Research Repository \nJump to main menu navigation [j] Jump to page content [k] Research at Kingston University \nLogin Home About Browse by Year Browse by Research Area Browse by Faculty Browse by \nKingston Author Search Help Mobile WiMAX: A broadband solution for rural UK Lynch, Andre \nand Politis, Christos (2008) Mobile WiMAX: A broadband solution for rural UK. In: Wireless \nWorld Research Forum Meeting 21; 13 Oct - 15 Oct 2008, Stockholm, Sweden. Full text not \navailable from this archive. Official URL: http://www.wireless-world-research.org/fileadmin/s... \nItem Type: Conference or Workshop Item (Paper) Event Title: Wireless World Research Forum \nMeeting 21 Research Area: Computer science and informatics Faculty, School or Research \nCentre: Faculty of Computing, Information Systems and Mathematics (until 2011) Faculty of , …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:HoB7MX3m0LUC",
            "Publisher": "WWRF"
        },
        {
            "Title": "NEREUS: an ERASMUS+ Strategic Partnership for skills development in the field of\" next generation networked media over 4G+ infrastructures\"",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8768594/",
            "Abstract": "This paper presents the implementation approach adopted by \"NEREUS\", an ERASMUS+ KA2 project, which is funded under the Strategic Partnership framework for enabling young engineers to gain multidisciplinary talents in the ICT domain, involving principles from the Informatics and Internet technologies, Telecommunications and Network engineering, Social Media sciences and service/network Security field. It describes the methodology utilized by five (5) European Higher Education Institutes towards the implementation and quality-evaluation of a novel multidisciplinary module/programme for \"next generation networked media over 4G+ infrastructures\", and elaborates on the planned activities for educating/training students in cutting-edge topics, of i) novel media coding and \"green\" transport mechanisms, ii) open network architectures with service orchestration, iii) QoS/QoE modeling & management, iv) next …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:jPVjDSAV6m0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure routing for supporting ad-hoc extreme emergency infrastructures",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5722467/",
            "Abstract": "The importance of emergency services has lead to an indispensable need for lightweight technologies that will support emergency rescue missions. Due to their nature and the non-infrastructure characteristics Mobile Ad-hoc Networks (MANETs) are characterised as autonomous networks that have the potential to be exploited when wireless communications should be established in an ad-hoc manner in cases that traditional telecommunications infrastructures such as 3G have failed. A critical issue within the context of MANETs is the routing protocol that has to be followed by the nodes in order to set up communication “bridges” among each other. On the other hand, malicious entities may try to disrupt the conventional functionality of any routing protocol by (i) modifying routing information, (ii) fabricating false routing information and (iii) impersonating other nodes. In this paper we apply the IPSec protocol over well …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MAC protocol for supporting QoS in All-IP HiperLAN2",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.138.1409&rep=rep1&type=pdf",
            "Abstract": "The demand for high-speed Internet access and the emergence of multimedia applications are leading towards a new area of broadband wireless networks. This paper focuses on HiperLAN2 air-interface standard based on an “all-IP” network architecture. An appropriate QoS framework is proposed, based on which, classification and scheduling mechanisms of traffic classes are investigated. These could be considered as potential enhancements and compliments to the MAC protocol of HiperLAN2 for providing end-to-end QoS.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context transfer extension to cellular-IP",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12445861258041418343&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:jMZTt8odoasC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectrum utilization in cognitive radio environment",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Christos-Politis-2/publication/266037357_Spectrum_Utilization_in_Cognitive_Radio_Environment/links/54c0f5c30cf28a6324a4b0c4/Spectrum-Utilization-in-Cognitive-Radio-Environment.pdf",
            "Abstract": "In cognitive networks a competitive scenario requires to explore and exploit appropriate licensed spectrum holes in network coverage area. Beside in this case primary channel usage obeys random distribution, therefore, an appropriate channel access mechanism could significantly improves the QoS of the both primary users and cognitive users. Here our aim is to evaluate and compare three spectrum hole selection approaches namely; RSHS, RSHS-TT and SHS-MR. In addition, average channel collision and channel utilization are considered to be performance evaluation metrics.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security model for emergency real-time communications in autonomous networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s10796-010-9259-8",
            "Abstract": "Towards the proliferation of architectures, tools and applications that have the potential to be used during an emergency rescue mission, we present a framework for emergency real-time communication using autonomous networks, called emergency Mobile Ad-hoc Networks (eMANETs). By eMANETs we refer to networks that are deployed in emergency cases where default telecommunications infrastructure has failed. Our goal is to design a security framework that will secure real-time communications during emergency rescue scenarios. The proposed framework consists of a secure routing protocol, intrusion detection provision and security extension for real-time communications using peer-to-peer overlays. We envisage that the results of this work will aid and serve the needs of any society against any event that threatens serious damage to human welfare or to the environment.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An Analytic study on Link Quality metrics: RSSI, LQI and ETX in Wireless Sensor Network",
            "Publication year": 2014,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/28422/",
            "Abstract": "Routing protocol plays an important role in data communication. Wireless Sensor Network (WSN) is used in the scenarios that need to use efficient routing protocols. One issue in term of efficiency in routing protocols in WSNs is energy consumption. Radio Frequency (RF) modules consumed most of energy in wireless sensors and focusing on this part could make an impact of increasing system lifetime. Metrics is an important part in any routing protocol. Most efficient metrics need to send packets to maintain link quality measurement by using RF module. Link quality may be measured by receiving packets and then save energy. Using Received signal strength indication (RSSI) or Link Quality Indication (LQI) of received packets does not need to use RF module to send packets to measure the link quality. In this paper, symmetry of RSSI and LQI in two directions have been studied and also relation between Expected Transmission Count (ETX), RSSI and LQI as link quality metrics. The evaluation in this paper is based on a series of WSN testbeds in real scenarios. The collected data from testbed shows symmetry in RSSI in both directions and also a significant correlation between RSSI and distance that makes it a capable link quality metric to be employed in routing protocols for devices that work in limited resources scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Securing AODV Against Wormhole Attacks in Emergency MANET Multimedia Communications, Wireless Multimedia and Networking (WMN) Research Group Kingston University London",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=12855523555126424499&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:4uoR24qA-WYC",
            "Publisher": "Jully"
        },
        {
            "Title": "Performance evaluation of secure video transmission over wimax",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/40990085/Performance_Evaluation_of_Secure_Video_Transmission_over_WIMAX__.pdf",
            "Abstract": "WiMAX is a wireless digital communication system based on the IEEE 802.16 standard which provides broadband wireless Internet access at very high rates that is up to 70 Mbps or a data rate of about 3 Mbps within a radius of 30-mile (data rate increases as the distance decreases). With the rapid increase in the wireless broadband use, the need for wireless fixed and mobile metropolitan area networks has ever been increasing. Multimedia communications, including audio and video are highly bandwidth demanding and error sensitive. When the coverage area of the wireless network technology is as high as with WiMAX, security becomes one of the most important issues. WiMAX, both mobile and fixed, has many attractive features such as connection-oriented MAC layer, provision of the Quality-of-Service (QoS) for different applications, efficient mobility and power save mode features. Needless to say, all these attractive features must be protected against malicious activities by security mechanisms. Providing secure multimedia communications by using a broadband wireless technology like WiMAXis likely to be challenging due to time or space overhead that occur. Security mechanisms might increase packet sizes thus delay, jitter and throughput are increased. In this paper, we evaluate the performance of secure video transmission over WiMAX networks under different cryptographic algorithms by using the OPNET simulator. The outcome of the results show negligible overhead introduced by the security extensions giving credence to their application in security sensitive scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Academy & Industry Research Collaboration Center (AIRCC)"
        },
        {
            "Title": "Spectrum on demand: a competitive open market model for spectrum sharing for UAV-assisted communications",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9220173/",
            "Abstract": "Unmanned aerial vehicle (UAV)-assisted communication has attracted significant interest from the industry, especially with regard to the vision of providing ubiquitous connectivity for beyond 5G (B5G) networks. in this article, we motivate the need for utilizing licensed spectrum for UAV-assisted communication and discuss its advantages such as reliability and security. We explore a new dimension to spectrum sharing by proposing a decentralized competitive open market approach-based model, where the different mobile network operators (MNOs) have the opportunity to lease the spectrum to UAV base stations (UAV-BSs), leading to new revenue generation opportunities. The proposed spectrum sharing mechanism is based on the logarithmic utility function and willingness to pay of each UAV-BS. We provide a trade-off analysis between spectrum sharing and price offered by the MNOs, highlighting the impact of …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:OlbiQ0ttILcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of moving experimentation facility to showcase satellite integration into 5G",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8801980/",
            "Abstract": "This paper presents the end-to-end design of the Satellite-enabled 5G Moving Experimentation Facility (S5GMEF) which is currently under development and aims to showcase the satellite integration into 5G with focus on satellite backhauling solutions. It elaborates on the satellite transport network between the 5G Radio Access Network (RAN) and the 5G Core (5GC), where design aspects on the satellite network integration into the standard 3GPP 5GC architecture are detailed. It also addresses the split of the 5G system between the Central Node and the Edge Node, which is hosted on-board a satellite connected vehicle. The paper describes also the Management and Orchestration (MANO) and Network Functions Virtualisation Infrastructure (NFVI) features of the S5GMEF.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:-c_eYhz9dBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy efficient relay-aided shared LTE network using CoMP and LB",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6633551/",
            "Abstract": "In this paper, we propose an energy-efficient scheduling algorithm for a relay-aided shared LTE network using CoMP and LB. A new complex scenario has been considered using a combination of the aforementioned four techniques. More explicitly, relay and LTE technologies are employed. In order to provide high-throughput for users at anywhere and anytime, we combine the relaying, the cooperative multipoint and the load balancing techniques in this paper, so as to increase the cell-edge users' throughput. Moreover, the interested area is jointly covered by two operators, who have an agreement in sharing their resources. For such a complicated relay-aided shared LTE network, we propose an energy efficient scheduling algorithm, whose objective is increase significantly the throughput and energy efficiency in the two operators' network sharing environment. Results have show meaningful increase up on the …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic resource allocation architecture for IEEE802. 16e: design and performance analysis",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-008-0065-1",
            "Abstract": "Mobile communications has witnessed an exponential increase in the amount of users, services and applications. WiMAX (Worldwide Interoperability for Microwave Access) targets to provide broadband connectivity to wide area coverage, both in fixed and in mobile environments, as well as in the provision of QoS constraints of those applications and services envisioned for Next Generation Networks (NGNs), which results in significant design challenges in the MAC (Medium Access Control) to provide the seamless transport of heterogeneous traffic in a cost-effective manner. This paper proposes a Dynamic Resource Allocation (DRA) architecture for the IEEE802.16e broadband wireless system (also known as Mobile WiMAX) that can provide operators the flexibility to deliver broadband traffic with high spectral efficiency. The proposed DRA architecture framework encompasses scheduler, Link Adaptation …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Secure decentralised ubiquitous networking for emergency communications",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294724/",
            "Abstract": "Our modern densely populated cities have created an Achilles heel for public safety services where natural or man-made disasters often result in high casualties. The 2005 London bombings have exposed the inadequacy of current First Responder (FR) communication systems for modern response operations. Additionally, FR organisations presently pay a tariff each time Public Protection and Disaster Relief (PPDR) communication technologies are used, rendering current PPDR communication expensive as compared to emerging license-exempt IP-based technologies. Decentralised ubiquitous networking proposes an alternative way of providing innovative secure wireless systems for IP-based, infrastructure independent PPDR communications. The ad-hoc setup capabilities of ubiquitous systems will reduce the cost for emergency response whilst allowing more flexible ways of communicating. Key …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security context transfer in multilayer mobility management schemes",
            "Publication year": 2004,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8505",
            "Abstract": "Security context transfer in multilayer mobility management schemes - Kingston University \nResearch Repository Jump to main menu navigation [j] Jump to page content [k] Research at \nKingston University Login Home About Browse by Year Browse by Research Area Browse by \nFaculty Browse by Kingston Author Search Help Security context transfer in multilayer mobility \nmanagement schemes Georgiades, M., Akhtar, N., Politis, C. and Tafazolli, R. (2004) Security \ncontext transfer in multilayer mobility management schemes. In: Next generation networking \nmiddleware; 9 - 14 May 2004, Athens, Greece. Full text not available from this archive. Item \nType: Conference or Workshop Item (Paper) Event Title: Next generation networking middleware \nAdditional Information: Workshop formed part of the Third International IFIP-TC6 Networking \nConference. Research Area: Computer science and informatics Faculty, School or : of …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emerging applications based on cognitive radio networks",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/20931",
            "Abstract": "Emerging applications based on cognitive radio networks - Kingston University Research \nRepository Jump to main menu navigation [j] Jump to page content [k] Research at Kingston \nUniversity Login Home About Browse by Year Browse by Research Area Browse by Faculty \nBrowse by Kingston Author Search Help Emerging applications based on cognitive radio \nnetworks Rifa Pous, H., Pirmoradian, M. and Politis, C. (2011) Emerging applications based on \ncognitive radio networks. In: 27th Wireless World Research Forum; 18 - 20 Oct 2011, Dusseldorf, \nGermany. (Unpublished) Full text not available from this archive. Item Type: Conference or \nWorkshop Item (Paper) Event Title: 27th Wireless World Research Forum Organising Body: \nWireless World Research Forum Research Area: Computer science and informatics Faculty, \nSchool or Research Centre: Faculty of Science, Engineering and Computing (until 2017) User:…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "My Papers",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=12814100136307194548&hl=en&oi=scholarr",
            "Abstract": "of [1]: Cybersecurity has become a key factor that determines the success or failure of companies that rely on information systems. Therefore, investment in cybersecurity is an important financial and operational decision. Typical information technology investments aim to create value, whereas cybersecurity investments aim to minimize loss incurred by cyber attacks. Admittedly, cybersecurity investment has become an increasingly complex one since information systems are typically subject to frequent attacks, whose arrival and impact fluctuate stochastically. Further, cybersecurity measures and improvements, such as patches, become available at random points in time making investment decisions even more challenging. We propose and develop an analytical real options framework that incorporates major components relevant to cybersecurity practice, and analyze how optimal cybersecurity investment …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:G887dSk7Sz8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of secure topology discovery protocol for emergency MANETs",
            "Publication year": 2015,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/30740",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aggregated interference in cognitive spectrum sharing area",
            "Publication year": 2010,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/16739",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Panel on CR and SDR: Regulator Ponders",
            "Publication year": 2006,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8528",
            "Abstract": "Panel on CR and SDR: Regulator Ponders - Kingston University Research Repository Jump to \nmain menu navigation [j] Jump to page content [k] Research at Kingston University Login Home \nAbout Browse by Year Browse by Research Area Browse by Faculty Browse by Kingston \nAuthor Search Help Panel on CR and SDR: Regulator Ponders Politis, Christos (2006) Panel \non CR and SDR: Regulator Ponders. In: 12th European Wireless Conference; 2 - 5 April 2006, \nAthens, Greece. Full text not available from this archive. Item Type: Conference or Workshop \nItem (Other) Event Title: 12th European Wireless Conference Research Area: Computer \nscience and informatics Faculty, School or Research Centre: Faculty of Computing, Information \nSystems and Mathematics (until 2011) Faculty of Computing, Information Systems and \nMathematics (until 2011) > Mobile Information and Network Technology (MINT) Research : : :: …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "5G-on the count of three...... paradigm shifts",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7377179/",
            "Abstract": "Presents a collection of slides covering the following topics: WWRF; 5G enabling radio technology; wireless devices; wireless communications; ultra dense networks; UDN system; universal resources management; network function virtualization; and cloud RAN.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IET"
        },
        {
            "Title": "Fundamentals of 5G mobile networks",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=xIxxBgAAQBAJ&oi=fnd&pg=PA13&dq=info:MN5EuNRMqs4J:scholar.google.com&ots=_AOzdN-Orf&sig=Y_Or367tD9ItIpwNmCKpEG0cgro",
            "Abstract": "Fundamentals of 5G Mobile Networks provides an overview of the key features of the 5th Generation (5G) mobile networks, discussing the motivation for 5G and the main challenges in developing this new technology. This book provides an insight into the key areas of research that will define this new system technology paving the path towards future research and development. The book is multi-disciplinary in nature, and aims to cover a whole host of intertwined subjects that will predominantly influence the 5G landscape, including the future Internet, cloud computing, small cells and self-organizing networks (SONs), cooperative communications, dynamic spectrum management and cognitive radio, Broadcast-Broadband convergence, 5G security challenge, and green RF. This book aims to be the first of its kind towards painting a holistic perspective on 5G Mobile, allowing 5G stakeholders to capture key technology trends on different layering domains and to identify potential inter-disciplinary design aspects that need to be solved in order to deliver a 5G Mobile system that operates seamlessly.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:BwyfMAYsbu0C",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "Securing WSN using public key cryptography",
            "Publication year": 2011,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/21404",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A case study of internet of things using wireless sensor networks and smartphones",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil_Panaousis/publication/257840438_A_case_study_of_Internet_of_Things_based_on_wireless_sensor_networks_and_smartphone/links/00463525f82342876d000000/A-case-study-of-Internet-of-Things-based-on-wireless-sensor-networks-and-smartphone.pdf",
            "Abstract": "In the state of the art, Internet of Things (IoT) tends to be touted as a future technology. Based on that concept and the constant development of Wireless Sensor Networks (WSNs), this paper explains and implements a case study of a converged Internet of Things based on a WSN and a smartphone. The implementation integrates the networking capabilities of a WSN, a wireless local area network and a smartphone device, in order to achieve a monitoring service and tracking mobility of objects for the purposes of future Internet of Things services. The scenario is to create a service, or a way that one will be able to “understand” and monitor an individual’s movement inside a house. At the end new concepts and ideas for future work will be presented. The paper is part of the WMN Research Group ongoing research to implement a futuristic service for monitoring elderly residents under the concept of smart homes.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue on resource and mobility management and cross-layer design for the support of multimedia services in heterogeneous emerging wireless networks",
            "Publication year": 2008,
            "Publication url": "https://goedoc.uni-goettingen.de/goescholar/bitstream/handle/1/4049/11277_2008_Article_9635.pdf?sequence=1",
            "Abstract": "The Future Networks’ vision towards a diverse wireless networking world, considers the support of any service, at any time delivered in a transparent optimized way. The demand for multimedia services delivered “anywhere and anyhow” has increased tremendously over the last few years leading to the evolution of the wireless industry towards all-IP networking. The research effort for the interworking heterogeneous technologies (eg WLANs, ad-hoc, wireless mesh, 4G, WiMAx, LTE etc.) amplifies the need to evaluate the conditions and restrictions to deliver these services. The QoS of multimedia services such as IP telephony, video-on-demand and mobile video will depend greatly on the ability to minimize the impact of the handover, hence traffic redirection in a seamless and secure transparent manner. Furthermore, Cross-layer and Cross-system optimization solutions will also be the enablers to deliver multimedia services over heterogeneous networks in a cost-effective manner. The main objectives in this special issue are to address novel research results in the areas of resource and mobility management protocols and cross-layer techniques to facilitate effective cooperation among heterogeneous wireless networks thus enabling seamless service mobility to the ‘end-user’in an optimized way.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:BqipwSGYUEgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Seamless multimedia services over all-IP based infrastructures: the EVOLUTE approach",
            "Publication year": 2002,
            "Publication url": "http://eprints.kingston.ac.uk/8520/1/Politis-C-8520.pdf",
            "Abstract": "The increasing amount of roaming Internet users in combination with the evolution of IP-based applications has created a strong demand for wide-area, broadband access to a number of IP multimedia services. Wireless LANs can complement the next-generation cellular networks, by offering a cost-efficient, wireless broadband data solution for hot spot areas. By combining the wide coverage of next-generation cellular systems with the speed and capacity advantages of wireless LANs, users can make the most out of wireless IP communication. Towards this direction, IST project EVOLUTE implements an all IP network infrastructure aiming to provide seamless multimedia services to roaming users. EVOLUTE addresses and attempts to resolve issues, such as, multilayer mobility management, vertical handoffs, fast and scalable Authentication-Authorization-Accounting(AAA) mechanisms, and ubiquitous service provisioning among heterogeneous environments. User trials have been defined and VoIP applications have been selected among others, to test and validate the capabilities of the EVOLUTE architecture.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperative networks for the future wireless world",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1336723/",
            "Abstract": "Beyond-3G (B3G) systems have been envisaged as an evolution and convergence of mobile/wireless communication systems and IP technologies to offer a multitude of services over a variety of access technologies. To fulfill the vision, it is necessary to understand the requirements with respect to the support of heterogeneity in network accesses, communication services, mobility, user devices, and so on. Besides, it is equally important to promote the necessary research in networking technology by providing a guiding framework of research areas and technical issues with priority. The new architectures and technologies have to address the fundamental assumptions and requirements that govern the design. All these issues are being tackled by the cooperative network group (CoNet) of WWRF; the group is working on a series of white papers outlining B3G visions and roadmap, architectural principles, research …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "End-to-end security protection",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5430537/",
            "Abstract": "The IEEE 802.16 standard (mobile broadband wireless access system), which is also known as worldwide interoperability for microwave access (WiMAX), is one of the latest technologies in the wireless world. The main goal of WiMAX is to deliver wireless communications with quality of service (QoS) guarantees, security, and mobility. In this article, we have evaluated the performance of the Internet Protocol security (IPSec) over WiMAX networks. We have also illustrated the results of the simulations. We have also depicted the processing time and the throughput introduced when IPSec is applied over WiMAX technology (IEEE 802.16).",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SIP and mobile IP inter-working for mobility management in All-IP networks",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8516/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data Attachment: A Novel Type of Wireless Transmission",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=5499445481782928789&hl=en&oi=scholarr",
            "Abstract": "The throughput of the next-generation wireless network (WN) should be significantly improved to satisfy the explosive growth of the variety of applications and the amount of data traffic. Various technologies such as OFDMA, NOMA, cooperative multi-point, and so on, have been proposed to improve the throughput of WN. The existing technologies can improve the performance of user throughput in WN via more effective resource utility. However, the data attachment (DA) messages which contain the base station number, frequency sub-channel number, and so on, are generally ignored and treated as invalid messages. Such a direct ignoring of DA may be a waste of the available resources for transmitting the wireless data, especially when the large-scale era of the 5G of wireless network is employed to support wireless transmission. In this article, we focus on exploring the application of the data attachment to the …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:qkm5LKljiV4C",
            "Publisher": "IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC"
        },
        {
            "Title": "QI-BRiCE: Quality Index for Bleeding Regions in Capsule Endoscopy Videos",
            "Publication year": 2020,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/47809/1/Usman-M-A-47809-VoR.pdf",
            "Abstract": "With the advent in services such as telemedicine and telesurgery, provision of continuous quality monitoring for these services has become a challenge for the network operators. Quality standards for provision of such services are application specific as medical imagery is quite different than general purpose images and videos. This paper presents a novel full reference objective video quality metric that focuses on estimating the quality of wireless capsule endoscopy (WCE) videos containing bleeding regions. Bleeding regions in gastrointestinal tract have been focused in this research, as bleeding is one of the major reasons behind several diseases within the tract. The method jointly estimates the diagnostic as well as perceptual quality of WCE videos, and accurately predicts the quality, which is in high correlation with the subjective differential mean opinion scores (DMOS). The proposed combines motion quality estimates, bleeding regions’ quality estimates based on support vector machine (SVM) and perceptual quality estimates using the pristine and impaired WCE videos. Our method Quality Index for Bleeding Regions in Capsule Endoscopy (QI-BRiCE) videos is one of its kind and the results show high correlation in terms of Pearson’s linear correlation coefficient (PLCC) and Spearman’s rank order correlation coefficient (SROCC). An F-test is also provided in the results section to prove the statistical significance of our proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:Wqn_fehR_TUC",
            "Publisher": "Tech Science Press"
        },
        {
            "Title": "Radio Spectrum Issues and Cognitive Mobile Computing",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-06704-9_6",
            "Abstract": "The rapid proliferation of mobile wireless devices, astronomical data traffic transmission and development of multifarious technologies has resulted in huge demand for usable radio spectrum bands. Allocation of new spectrum bands and maximizing the usage of currently allocated radio spectrum bands have become of vital importance in emerging mobile computing networks. This chapter highlights the importance and issues of radio spectrum in mobile computing networks and also presents cognitive functionalities as an appropriate solution to cope with the scarcity of usable radio spectrum in emerging cognitive mobile computing networks.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Considerations in the choice of suitable spectrum for mobile communications",
            "Publication year": 2008,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/9097",
            "Abstract": "Considerations in the choice of suitable spectrum for mobile communications - Kingston \nUniversity Research Repository Help Search Browse by Year Browse by Research Area \nBrowse by Faculty Browse by Kingston Author About Home Login Considerations in the \nchoice of suitable spectrum for mobile communications Dixon, Johnny [Editor], Politis, \nChristos [Editor], Wijting, Carl [Editor], Mohr, Werner [Contributor], Legutko, Christoph [Contributor] \nand Jian, Jiao [Contributor] (2008) Considerations in the choice of suitable spectrum for \nmobile communications. (Other) Zurich, Switzerland : Wireless World Research Forum. 13 p. \n(Visions and research directions for the Wireless World) Official URL: http://www.wireless-world-research.org/fileadmin/s... \nMetadata Actions (Repository Editors) Item Control Page Item Control Page Accessibility \nDisclaimer Copyright Freedom of Information Privacy Policy Cookies …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Wireless World Research Forum"
        },
        {
            "Title": "An adaptive qos routing solution for manet based multimedia communications in emergency cases",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_8",
            "Abstract": "The Mobile Ad hoc Networks (MANET) is a wireless network deprived of any fixed central authoritative routing entity. It relies entirely on collaborating nodes forwarding packets from source to destination. This paper describes the design, implementation and performance evaluation of CHAMELEON, an adaptive Quality of Service (QoS) routing solution, with improved delay and jitter performances, enabling multimedia communication for MANETs in extreme emergency situations such as forest fire and terrorist attacks as defined in the PEACE project. CHAMELEON is designed to adapt its routing behaviour according to the size of a MANET. The reactive Ad Hoc on-Demand Distance Vector Routing (AODV) and proactive Optimized Link State Routing (OLSR) protocols are deemed appropriate for CHAMELEON through their performance evaluation in terms of delay and jitter for different MANET sizes in a …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A probabilistic algorithm for secret matrix share size reduction",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6582801/",
            "Abstract": "Secret sharing is an important tool in cryptography and has many applications for wireless networks. This paper is motivated by the need for space-efficient secret sharing schemes. We first propose a simple probabilistic algorithm which can be used, prior to secret sharing, in order to split a given secret into public and private data. The public data can be made openly available, and any specific secret sharing method can be used in order to share the private data. We then show that, combined with a previously published space-efficient single secret sharing method, this yields a novel probabilistic matrix-based online multi-secret sharing method with small expected share size. In particular, compared with other matrix-based approaches, our scheme is of similar expected computational cost but smaller share size. Finally, we report on an implementation of our method and evaluate its performance. Our algorithm could …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:J-pR_7NvFogC",
            "Publisher": "VDE"
        },
        {
            "Title": "Survey on measurement localization techniques on wireless sensor networks",
            "Publication year": 2012,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/23916/",
            "Abstract": "Wireless sensor networks (WSNs) have been developed by improvement in hardware design and using advanced technology in chip production in last decade. Recently, more researchers have focus on WSNs and localization in wireless sensors. Global Positioning System (GPS) could assist mobile node to find its location but GPS module makes a tiny wireless sensor more expensive and more battery consumer. Some techniques could help wireless sensors to find its location without using any hardware device that are called range free techniques. Range free techniques use connectivity information and other information about neighbors to estimate its location. In this paper we consider localization in wireless sensor networks and methods and algorithm to find the location of each sensor without adding any positioning modules.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectrum sensing and fragmentation",
            "Publication year": 2009,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/16983/",
            "Abstract": "Politis, C.(2009) Spectrum sensing and fragmentation. In: 4th meeting of the Working Party 5A meeting: Land mobile service excluding IMT; amateur and amateur-satellite; 23 Nov-2 Dec 2009, Geneva, Switzerland.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy efficiency analysis for MIMO transmission schemes in LTE",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5941122/",
            "Abstract": "The demand for higher data rates in wireless communication systems has become inevitable with the availability of diverse range of multimedia applications in mobile communications today. Multiple Input Multiple Output (MIMO) antennas is one of the technologies utilized to support the required higher data rates in wireless communications. However, energy efficiency in cellular communications has generated lots of interest recently. Energy efficiency metrics will provide a yardstick for comparison and a pathway towards achieving the objectives of green communications in cellular networks. This paper investigates the energy efficiency of different MIMO transmission schemes applicable in 3rd Generation Partnership Project (3GPP) Long Term Evolution (LTE) and compares them with each other and SISO transmission. The Energy Consumption Rating (ECR) of the various MIMO schemes are derived and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of enhanced MAC design in MIMO-OFDM-based HIPERMAN system using multi-user detection techniques",
            "Publication year": 2004,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/8523",
            "Abstract": "Performance evaluation of enhanced MAC design in MIMO-OFDM-based HIPERMAN system \nusing multi-user detection techniques - Kingston University Research Repository Help Search \nBrowse by Year Browse by Research Area Browse by Faculty Browse by Kingston Author About \nHome Login Performance evaluation of enhanced MAC design in MIMO-OFDM-based \nHIPERMAN system using multi-user detection techniques Fan, Linghang, Hoshyar, Reza, Fazel, \nSadegh, Roberts, Roshano, Politis, Christos and Tafazolli, Rahim (2004) Performance \nevaluation of enhanced MAC design in MIMO-OFDM-based HIPERMAN system using multi-user \ndetection techniques. In: 7th International Symposium on Wireless Personal Multimedia \nCommunications; 12-15 Sept 2004, Abano Terme, Italy. ISSN (print) 1347-6890 Metadata \nActions (Repository Editors) Item Control Page Item Control Page Accessibility Disclaimer of …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The handbook of mobile middleware",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=d0ErBgAAQBAJ&oi=fnd&pg=PP1&dq=info:7YIk50p1AIwJ:scholar.google.com&ots=HYBhtm9YFV&sig=R2NrprwpxFpHmuDL43fQtM_9OFM",
            "Abstract": "Device miniaturization, wireless computing, and mobile communication are driving ubiquitous, pervasive, and transparent computing. Supporting these rapidly evolving technologies requires middleware solutions that address connectivity-level, location-dependent, and context-dependent issues. The Handbook of Mobile Middleware is an exhaustive o",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:MnogvFdIBdwC",
            "Publisher": "CRC press"
        },
        {
            "Title": "Framework for Ubiquitous Networking",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/19921/",
            "Abstract": "Framework for Ubiquitous Networking - Kingston University Research Repository Jump to main \nmenu navigation [j] Jump to page content [k] Research at Kingston University Login Home About \nBrowse by Year Browse by Research Area Browse by Faculty Browse by Kingston Author Search \nHelp Framework for Ubiquitous Networking Ramrekha, TA, Millar, GP, Panaousis, EA and \nPolitis, C. (2011) Kingston University Higher Education Corporation Framework for Ubiquitous \nNetworking. Application No GB1111955.9. Full text not available from this archive. Item \nType: Patent Research Area: Computer science and informatics Faculty, School or Research \nCentre: Faculty of Science, Engineering and Computing (until 2017) Faculty of Science, \nEngineering and Computing (until 2017) > Mobile Information and Network Technologies \nFaculty of Science, Engineering and Computing (until 2017) > School of Computing and : : :: …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Intellectual Property Office (IPO)"
        },
        {
            "Title": "Spectrum Monitoring Algorithms for Wireless and Satellite Communications",
            "Publication year": 2018,
            "Publication url": "https://orbilu.uni.lu/bitstream/10993/35755/1/PhD_Thesis_Christos.pdf",
            "Abstract": "[en] Nowadays, there is an increasing demand for more efficient utilization of the radio frequency",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:mS4qin7VKjkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time 3D QoE Evaluation of Novel 3D Media",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-2026-6_9",
            "Abstract": "Recent wireless networks enable the transmission of high bandwidth multimedia data, including advanced 3D video applications. Such wireless multimedia systems should be designed with the purpose of maximizing the quality perceived by the users. For instance, quality parameters can be measured at the receiver-side and fed back to the transmitter for system optimization. Measuring 3D video quality is a challenge due to a number of perceptual attributes associated with 3D video viewing (e.g., image quality, depth perception, naturalness). Subjective as well as objective metrics have been developed to measure 3D video quality against different artifacts. However most of these metrics are Full-Reference (FR) quality metrics and require the original 3D video sequence to measure the quality at the receiver-end. Therefore, these are not a viable solution for system monitoring/update “on the fly.” This chapter …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Cognitive vehicular communication for 5G",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7158273/",
            "Abstract": "Device-to-device (D2D) is increasingly becoming a prominent technology within the 5G story, portrayed as a means of offloading traffic from the core network. The ever increasing demand for vehicular traffic consumption is providing the impetus for a new architectural design that can harness the benefits of D2D for vehicular users, taking a step toward offloading vehicular traffic from the core network. We propose the notion of extending D2D for vehicular scenarios with the potential to coordinate vehicular traffic using the LTE band. Furthermore, we then extend this approach by investigating cognitive radio in synergy with a geo-location database, to exploit white spaces as a means of further offloading vehicular users. Our simulation results have shown that our approach can outperform the legacy IEEE 802.11p in terms of delay.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Predicting spectrum hole availability and reliability",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/16664/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Technology research and development: the regulator viewpoint",
            "Publication year": 2006,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/8498",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Next-generation communication systems for PPDR: the SALUS perspective",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9781785480225500030",
            "Abstract": "Public Protection and Disaster Relief (PPDR) agencies in European member states currently rely on digital Private Mobile Radio (PMR) networks for mission critical operations. PMR networks are based on two main standards for Europe: Terrestrial Trunked Radio (TETRA) and TETRAPOL. These networks provide secure and resilient mobile voice services, as well as basic data services. However, these traditional PMR networks show substantial limitations, when matched against modern requirements of PPDR agencies, including broadcast communications, dynamic secure groups, secure roaming, and emerging safety and security applications. Moreover, there are significant interoperability constraints when using multiple technologies, such as inter-technology coverage limitations, which can result in ineffective management of emergency events, both at national level as well as in cross-border regions.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:TNEldfgDb5MC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "AAA context transfer for seamless and secure multimedia services over all-IP infrastructures",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/53594599/65.pdf",
            "Abstract": "The all-IP based architecture for 3G networks and beyond will rely on a number of different access technologies, working seamlessly to support numerous services and applications. Security provisioning is an essential requirement in any such all-embracing network but this introduces an additional delay component to the total handoff delay crucially affecting the prime objective towards seamless mobility. In this paper we present a context transfer solution for seamless and secure multimedia services over all-IP infrastructures. The solution will act as an adhesive between the AAA and mobility management message exchanges by using the latter to forward AAA state information locally. For such a solution existing messages cellular IP were used as triggers and additional messages were introduced to carry the desired AAA context information. The results have shown that the overall handoff delay is reduced by approximately a factor of twenty. Additional results demonstrate the effect of AAA Context Transfer on multimedia services when integrated with the interworking mobility solution of SIP/Cellular IP [1].",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectrum and Beyond: WWRF and Research on Cognitive Methods",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/20932/",
            "Abstract": "Spectrum and Beyond: WWRF and Research on Cognitive Methods - Kingston University \nResearch Repository Jump to main menu navigation [j] Jump to page content [k] Research at \nKingston University Login Home About Browse by Year Browse by Research Area Browse by \nFaculty Browse by Kingston Author Search Help Spectrum and Beyond: WWRF and Research \non Cognitive Methods Panaousis, EA and Politis, C. (2011) Spectrum and Beyond: WWRF and \nResearch on Cognitive Methods. In: RRS plenary meeting #15; 8-9 Sept 2011, Sophia-Antipolis, \nFrance. Full text not available from this archive. Item Type: Conference or Workshop Item \n(Lecture) Event Title: RRS plenary meeting #15 Organising Body: ETSI Research Area: \nComputer science and informatics Faculty, School or Research Centre: Faculty of Science, \nEngineering and Computing (until 2017) Faculty of Science, Engineering and Computing () > (…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue on multimedia over ad-hoc and sensor networks",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-008-0097-6",
            "Abstract": "With the increased reliance of our modern society on communication infrastructures and the migration towards all-IP next generation networks, research and development activities must aim at providing stable and reliable broadband communication infrastructures and provisioning of new types of multimedia applications even under extreme situations. Existing wireless communication systems, such as 3G cellular networks and WLANs, are infrastructure based and often do not provide alternative communication paths, which instead are important in case the wireline/wireless infrastructure is damaged or heavily congested. Additionally, these solutions require increased capital investments and leading time for their deployment. These reasons gave birth to an increased interest for ad hoc and sensor networks, which represent network solutions that may be deployed in places where no any infrastructures are present …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An enhanced routing metric for ad hoc networks based on real time testbed",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6335326/",
            "Abstract": "The deployment of wireless ad-hoc networks compared to traditional infrastructure based networks offers several advantages such as fully distributed mobile operation, easy discovery of joining wireless devices and quick cheap network setup. The design of an effective routing protocol is one of the main challenges in the ad-hoc networking paradigm and the utilisation of an adequate link cost metric is essential. In this paper, the validity of ETX (Expected Transmission Count) as a link cost metric is investigated by studying its behaviour in real-time testbeds. In our performance evaluation, the ETX performance was studied in different distance scenarios. Subsequently, the main observation was that ETX values was not steady over time and usually fluctuated for a fixed scenario. Fluctuation in the ETX values affects a routing protocol in wrongly identifying the best path based on current ETX link cost and therefore new …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integration and Co-existence of Heterogeneous Technologies in the End to End 5G Communication.",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=8846983705108450648&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:Sf6vrWCRp3YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of Micromobility protocols for All-IP based infrastructures",
            "Publication year": 2002,
            "Publication url": "http://eprints.kingston.ac.uk/8522/",
            "Abstract": "Performance evaluation of Micromobility protocols for All-IP based infrastructures - Kingston \nUniversity Research Repository Jump to main menu navigation [j] Jump to page content [k] \nResearch at Kingston University Login Home About Browse by Year Browse by Research \nArea Browse by Faculty Browse by Kingston Author Search Help Performance evaluation of \nMicromobility protocols for All-IP based infrastructures Chew, Kar Ann, Politis, Christos and \nTafazolli, Rahim (2002) Performance evaluation of Micromobility protocols for All-IP based \ninfrastructures. In: Wireless World research forum meeting 7; 3 - 4 Dec 2002, Eindhoven, \nThe Netherlands. Full text not available from this archive. Official URL: http://www.wireless-world-research.org/index.php?i... \nItem Type: Conference or Workshop Item (Paper) Event Title: Wireless World research \nforum meeting 7 Additional Information: Paper located in WG3 folder Area: , : , …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Panel Presentation: Cognitive Radio: Hype or Reality?",
            "Publication year": 2008,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8962/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:NMxIlDl6LWMC",
            "Publisher": "WWRF"
        },
        {
            "Title": "IPSec provisioning in WiMAX networks",
            "Publication year": 2010,
            "Publication url": "https://scholar.archive.org/work/tqxaw3f3kfenzbcd32q4pkd5ci/access/wayback/http://dircweb.kingston.ac.uk/papers/Nazaryan2009_58854500/5430537.pdf",
            "Abstract": "(WiMAX), is one of the latest technologies in the wireless world. The main goal of WiMAX is to deliver wireless communications with quality of service (QoS) guarantees, security, and mobility. In this article, we have evaluated the performance of the Internet Protocol security (IPSec) over WiMAX networks. We have also illustrated the results of the simulations. We have also depicted the processing time and the throughput introduced when IPSec is applied over WiMAX technology (IEEE 802.16). WiMAX is a wireless digital communication system based on the IEEE 802.16 standard that provides broadband wireless Internet access at very high rates that is up to 70 Mb/s or a data rate of about 3 Mb/s within a radius of 50 km (data rate increases as the distance decreases)[1]. With the rapid increase in the wireless broadband use, the need for wireless fixed and mobile metropolitan area networks has ever been increasing. The main idea in Europe is to provide a wireless metropolitan area network, mainly last mile connectivity, with the line-of-sight (LoS) as well as non-LoS transmission",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Securing aodv against wormhole attacks in emergency manet multimedia communications",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.4108/ICST.MOBIMEDIA2009.7292",
            "Abstract": "The nature of Mobile Ad hoc NETworks (MANETs) makes them suitable to be utilized in the context of an extreme emergency for all rescue teams. We use the term emergency MANETs (eMANETs) in order to describe Next Generation Networks (NGNs) which are deployed in emergency cases such as forest fires and terrorist attacks. Secure routing in MANETs is critical. Due to the absence of a central authority, intermediate nodes act as routers forwarding packets across a multihop path. A well known attack against the conventional operation of routing protocols such as the Ad hoc On-demand Distance Vector (AODV) routing protocol, is the wormhole attack. Secure routing in eMANETs is critical due to the fact that secure multimedia communications should be established among the devices of the recovery workers.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A model for designing scalable and efficient adaptive routing approaches in emergency ad hoc communications",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983959/",
            "Abstract": "The self-organised nature of Mobile Ad hoc Networks (MANETs) makes it a suitable candidate for rescuer communication in disaster scenarios. This paper presents a model basis for supporting the design of hybrid and adaptive routing protocols such as ChaMeLeon (CML). A size threshold point between proactive and reactive routing approaches is established using a probabilistic analytical model using dimensional cardinalities of the effective operation area, called the critical area (CA). CML adapts its routing behaviour according to the network size in order to improve overall routing efficiency while preserving acceptable quality of service (QoS) relative to well known protocols that are Ad hoc On-demand Distance Vector (AODV) routing and Optimized Link Sate Routing (OLSR). These are also constituents of the reactive and proactive routing parts of CML respectively. The Evaluation section contains simulation …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multilayer mobility management for supporting multimedia services over all-IP networks: performance evaluation",
            "Publication year": 2003,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/8517",
            "Abstract": "Multilayer mobility management for supporting multimedia services over all-IP networks: \nperformance evaluation - Kingston University Research Repository Help Search Browse by \nYear Browse by Research Area Browse by Faculty Browse by Kingston Author About Home \nLogin Multilayer mobility management for supporting multimedia services over all-IP \nnetworks: performance evaluation Politis, C., Chew, K., Akhtar, N. and Tafazolli, R. (2003) \nMultilayer mobility management for supporting multimedia services over all-IP networks: \nperformance evaluation. In: EVOLUTE Workshop 2003: Beyond 3G Evolution of Systems \nand Services; 10 Nov 2003, Guildford, UK. (Unpublished) Metadata Actions (Repository \nEditors) Item Control Page Item Control Page Accessibility Disclaimer Copyright Freedom of \nInformation Privacy Policy Cookies …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobility impact on 6lowpan based wireless sensor network",
            "Publication year": 2012,
            "Publication url": "http://eprints.kingston.ac.uk/22572/",
            "Abstract": "Mobility impact on 6LoWPAN based Wireless Sensor Network - Kingston University Research \nRepository Jump to main menu navigation [j] Jump to page content [k] Research at Kingston \nUniversity Login Home About Browse by Year Browse by Research Area Browse by Faculty \nBrowse by Kingston Author Search Help Mobility impact on 6LoWPAN based Wireless Sensor \nNetwork Entezami, F., Ramrekha, T. Arvind and Politis, Christos (2012) Mobility impact on \n6LoWPAN based Wireless Sensor Network. In: 28th Wireless World Research Forum meeting; \n23-25 Apr 2012, Athens, Greece. Full text not available from this archive. Item Type: Conference \nor Workshop Item (Paper) Event Title: 28th Wireless World Research Forum meeting \nOrganising Body: Wireless World Research Forum Research Area: Computer science and \ninformatics Faculty, School or Research Centre: Faculty of Science, Engineering and (until ) of , …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Routing protocol metrics for wireless mesh networks",
            "Publication year": 2013,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/25608/",
            "Abstract": "Wireless Mesh Networks (WMNs) play an important role in today communication and they could take more portion of wireless communication in near future. WMN’s research area challenges on some problems such as low throughput and high delays. Routing Protocols in WMNs have a vital role in data communication and the main key in all routing protocols is metric. In this paper, most of the metrics in WMNs are considered in different categories. Link-quality and Load-dependant metrics are covered most of the metrics and then later metrics for multi channels networks are considered. Expected Transmission Count (ETX) as a famous link-quality metric with all its divisions have been studied and then more metrics which consider more wireless parameters such as intra and inter interferences have been added. In the last sections, some metrics which provide for multi channel networks and multi interface devices are mentioned and also metric for cognitive radio environment. In the end of the paper, conclusion with a comparison table has been provided to compare metrics in WMNs.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:olpn-zPbct0C",
            "Publisher": "Wireless World Research Forum"
        },
        {
            "Title": "Optimal spectrum hole selection in cognitive radio networks",
            "Publication year": 2011,
            "Publication url": "http://eprints.kingston.ac.uk/18414/",
            "Abstract": "Optimal spectrum hole selection in cognitive radio networks - Kingston University Research \nRepository Jump to main menu navigation [j] Jump to page content [k] Research at Kingston \nUniversity Login Home About Browse by Year Browse by Research Area Browse by Faculty \nBrowse by Kingston Author Search Help Optimal spectrum hole selection in cognitive radio \nnetworks Pirmoradian, Mehdi and Politis, Christos (2011) Optimal spectrum hole selection in \ncognitive radio networks. In: 26th Wireless World Research Forum; 11 - 13 Apr 2011, Doha, \nQatar. (Unpublished) Full text not available from this archive. Item Type: Conference or Workshop \nItem (Paper) Event Title: 26th Wireless World Research Forum Research Area: Computer \nscience and informatics Electrical and electronic engineering Faculty, School or Research \nCentre: Faculty of Computing, Information Systems and Mathematics (until 2011) Faculty of , () :…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "How HEVC compares to its successor VVC: quality assessment in the context of healthcare",
            "Publication year": 2020,
            "Publication url": "https://eprints.kingston.ac.uk/id/eprint/44556/1/Usman-M-A-44556-VoR.pdf",
            "Abstract": "Video compression in medical video streaming is one of the key technologies associated with mobile healthcare. Seamless delivery of medical video streams over a resource constrained network emphasizes the need of a video codec that requires minimum bitrates and maintains high perceptual quality. This paper presents a comparative study between High Efficiency Video Coding (HEVC) and its potential successor Versatile Video Coding (VVC) in the context of healthcare. A large-scale subjective experiment comprising of twenty-four non-expert participants is presented for eight different test conditions in Full High Definition (FHD) videos. The presented analysis highlights the impact of compression artefacts on the perceptual quality of HEVC and VVC processed videos. Our results and findings show that VVC clearly outperforms HEVC in terms of achieving higher compression, while maintaining high quality in FHD videos. VVC requires upto 40% less bitrate for encoding an FHD video at excellent perceptual quality. We have provided rate-quality curves for both encoders and a degree of overlap across both codecs in terms of perceptual quality. Overall, there is a 71% degree of overlap in terms of quality between VVC and HEVC compressed videos for eight different test conditions.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:pbQCAAeKvsAC",
            "Publisher": "Tech Science Press"
        },
        {
            "Title": "The role of cognitive radio in future spectrum use",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=12482033094463237340&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:jtOrAYjvdewC",
            "Publisher": "Unknown"
        },
        {
            "Title": "QoS provisioning and mobility management for IP-based wireless LAN",
            "Publication year": 2004,
            "Publication url": "https://search.proquest.com/openview/bb582b78429d491446777a794be2e8d0/1?pq-origsite=gscholar&cbl=51922&diss=y",
            "Abstract": "Today two major technological forces drive the telecommunication era: the wireless cellular systems and the Internet. As these forces converge, the demand for new services, increasing bandwidth and ubiquitous connectivity continuously grows. The next-generation mobile systems will be based solely or in a large extent, on the Internet Protocol (IP). This thesis begins by addressing the problems and challenges faced in a multimedia, IP-based Wireless LAN environment. The ETSI HiperLAN/2 system has been mainly selected as the test wireless network for our theoretical and simulation experiments. Apart from the simulations, measurements have been taken from real life test scenarios, where the IEEE 802.11 system was used (UniS Test-bed). Furthermore, a brief overview of the All-IP network infrastructure is presented. An extension to the conventional wireless (cellular) architecture, which takes advantage of …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multipath routing approach to enhance resiliency and scalability in ad-hoc networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7511315/",
            "Abstract": "This paper presents Multipath-ChaMeLeon (MCML) as an update of the existing ChaMeLeon (CML) routing protocol. CML is a hybrid and adaptive protocol designed for Mobile Ad-Hoc Networks (MANETs), supporting emergency communications. M-CML adopts the attributes of the proactive Optimized Link State Protocol (OLSR) and extends it so as to implement a multipath routing approach based on the Expected Transmission Count (ETX). The paper substantiates the efficiency of the protocol through a simulation scenario within a MANET using the NS-3 simulator. The acquired results indicate that M-CML routing approach combined with an intelligent link metric such as the ETX reduces the effects of link instabilities and enhances the network performance in terms of resiliency and scalability.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:w-fwKiQwpQAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Resource management of mobile cloud computing networks and environments",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=V2vCCAAAQBAJ&oi=fnd&pg=PP1&dq=info:OpaXQjj8VdYJ:scholar.google.com&ots=C_8j0TQgQN&sig=8MrW98JMHHkCeEime7_afLimAsI",
            "Abstract": "As more and more of our data is stored remotely, accessing that data wherever and whenever it is needed is a critical concern. More concerning is managing the databanks and storage space necessary to enable cloud systems. Resource Management of Mobile Cloud Computing Networks and Environments reports on the latest advances in the development of computationally intensive and cloud-based applications. Covering a wide range of problems, solutions, and perspectives, this book is a scholarly resource for specialists and end-users alike making use of the latest cloud technologies.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:0Kh4an1R61UC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Virtual distributed testbed for optimisation and coexistence of heterogeneous systems",
            "Publication year": 2006,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/17098",
            "Abstract": "Virtual distributed testbed for optimisation and coexistence of heterogeneous systems - \nKingston University Research Repository Jump to main menu navigation [j] Jump to page \ncontent [k] Research at Kingston University Login Home About Browse by Year Browse by \nResearch Area Browse by Faculty Browse by Kingston Author Search Help Virtual distributed \ntestbed for optimisation and coexistence of heterogeneous systems Bobb, Derek, Kormentzas, \nGeorge, Campos, Luis Miguel, Ibrahim, Nicolas, Mayrargue, Sylvie, Politis, Christos, Rodriguez, \nJonathon, Gameiro, Atilio and Tafazolli, Rahim (2006) Virtual distributed testbed for optimisation \nand coexistence of heterogeneous systems. In: 15th IST Mobile & Wireless Communications \nSummit; 4-8 June 2006, Mykonos, Greece. Full text not available from this archive. Item Type: \nConference or Workshop Item (Paper) Event Title: 15th IST Mobile & Wireless Summit : , : , …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Find the weakest link: Statistical analysis on wireless sensor network link-quality metrics",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6879479/",
            "Abstract": "Routing protocol plays an important role in data communication. A wireless sensor network (WSN) is usually deployed in scenarios where efficient and energy-aware routing protocols are desired. In wireless sensors, the radio-frequency (RF) modules consume most of the energy. Routing metrics are important in determining paths and maintaining the quality of service in routing protocols. The most efficient metrics need to send packets to maintain link-quality measurement using the RF module. In this article, two prominent link-quality metrics-received signal strength indication (RSSI) and link-quality indication (LQI)-are introduced; the symmetry of RSSI and LQI in two directions has been studied, and relations between the expected transmission count (ETX), RSSI, and LQI as link-quality metrics have been analyzed. The evaluation in this article is based on a series of WSN test beds in real scenarios. The collected …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy conservative and coverage preservative clustering for wireless sensor networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6666492/",
            "Abstract": "Clustering sensor nodes is an effective method to enhance network coverage and prolong network lifetime. In this paper we propose EAAFC (Energy Aware and Address Free Clustering), a clustering mechanism that analyses communication energy consumption and the impact of node failures on networks with different densities. The proposed algorithm aims at clustering nodes into groups with minimum number of cluster heads. EAAFC does not require global addressing or time synchronization to perform. Evaluation results show that EAAFC prolongs network's lifetime while improves network coverage.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "2020 Vision",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5621611/",
            "Abstract": "Based on the wireless world research forum (WWRF) vision of seven trillion wireless devices serving seven billion people by 2020, we identified several key user requirements and a scenario to motivate research on many different technical areas. If addressed successfully by the research community and the industry, innovation in new air interfaces (for high bit rate and capacity and low latency); network architectures (like mobile cloud, mesh networks, or cognitive systems); solutions to privacy, security, and trust; and devices that do not need to be recharged for long periods would unleash an era of the wireless world where: each and every person will be empowered by wireless services. Wireless device(s) will become our interface to the digital world. We will live an ambient life style, such that: 1) our mobile device will become the key enabler to interact with smart environments and users; and 2) our mobile device …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:d6JCS5z0ckYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed hash tables for peer-to-peer mobile ad-hoc networks with security extensions",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil_Panaousis/publication/257644725_Distributed_Hash_Tables_for_Peer-to-Peer_Mobile_Ad-hoc_Networks_with_Security_Extensions/links/02e7e525c7d349445b000000/Distributed-Hash-Tables-for-Peer-to-Peer-Mobile-Ad-hoc-Networks-with-Security-Extensions.pdf",
            "Abstract": "Serverless distributed computing, especially Mobile Ad-hoc NETworks (MANETs) have received significant attention from the research community. Peer-to-peer overlay networks have the potential to accommodate largescale, decentralised applications that can be integrated into a MANET architecture to enable peer-to-peer communication among different mobile peers. These overlay architectures must be very resilient and their utilisation, reliability and availability must satisfy the needs of mobile computing. One must also heed the fact that the wireless nature of the medium introduces security vulnerabilities. The aim of the work described in this paper is twofold. First, we describe our peer-to-peer distributed hash table (DHT) architecture entitled Reliable Overlay Based Utilisation of Services and Topology (ROBUST). This is designed to be efficiently applied to MANETs. We additionally propose security extensions to protect the ROBUST signalling messages against malicious activities. We evaluate the ROBUST performance as well as the security extensions under varying levels of mobility and network sizes by building a custom DHT module for the network simulator ns-2. The outcome of the results show negligible overhead introduced by the extensions giving credence to their application in security sensitive scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Academy Publisher"
        },
        {
            "Title": "Overview for the 37th WWRF Meeting [From the Guest Editors]",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8306180/",
            "Abstract": "Describes the above-named upcoming conference event. May include topics to be covered or calls for papers.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:xm1hsP5ya-EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cognitive radio adds intelligence to wireless technology",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=18103820271310262186&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new regulatory regime to support new wireless technologies",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/16969/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network Virtualization in the Wireless World [From the Guest Editors]",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7225217/",
            "Abstract": "Research Forum (WWRF34) included a mix of invited keynote speakers followed by working group meetings on contributions received and a discussion of the white papers in development. The meeting was held in Silicon Valley at the Hyatt Regency Hotel in Santa Clara, California and brought together ideas, visions, plans, and concrete initiatives of virtualization-driven fifth generation (5G) with the goal of creating a more flexible, cost-effective, and open wireless communication network. WWRF34 featured high-profile speakers from industry, standards bodies, and academia, who presented both near-term and visionary approaches to realizing such an information technology (IT)-enabled open network where all actors from users (including machines) to manufacturers to service providers will participate in an economically viable manner.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:zfsRRabFVBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Non-cooperative games between legitimate nodes and malicious coalitions in MANETs",
            "Publication year": 2011,
            "Publication url": "https://www.manospanaousis.com/papers/panaousis2011non.pdf",
            "Abstract": "Security for mobile ad hoc networks (MANETs) is a critical and thoroughly examined scientific area that has attracted the interest of many researchers. Many countermeasures against compromised or selfish nodes consider intrusion detection systems (IDS). In this paper we use game theory to model noncooperative security games between a MANET, which is defended by IDS operating at each node as well as a group of collaborative malicious nodes called malicious coalition. Our work innovates by finding the defend and attack probability distributions, of any MANET and malicious coalition, that maximise the utility of the players at the Nash Equilibrium (NE) of a non-cooperative security game between the aforementioned entities. To go a step further, this paper proposes a way to derive the intrusion detection or the attack effort respecting the corresponding energy costs of the MANET and the malicious coalition. Parameters such as intrusion detection rate, attacking cost, defending cost, false alarm detection rate and false alarm cost critically affect the final defending and attacking distribution probabilities as we have shown in this paper. Numerical results have been illustrated showing the changes at MANET’s utility, at NE, as a function of the packet size, the intrusion detection rate and the mobility.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game theoretic approach for securing AODV in emergency mobile ad hoc networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5355020/",
            "Abstract": "In many extreme emergency cases such as forest fires or tube terrorist attacks, the rescuers have difficulty using traditional legacy networks due to destruction or collapse of the infrastructure in such events. We use the term emergency mobile ad hoc networks (eMANETs) in order to describe next generation networks (NGNs) which are deployed in emergency cases. The security of these networks is critical. Especially secure routing is important given the fact that potential attackers aim to disrupt the appropriate operation of the routing protocol within an eMANET. In this paper we propose a game theoretic approach called AODV-GT (AODV-game theoretic) and we integrate this into the reactive ad hoc on-demand distance vector (AODV) routing protocol to provide defense against blackhole attacks. AODV-GT is based on the concept of non-cooperative game theory. AODV-GT outperforms AODV in terms of malicious …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quality of experience and quality of service metrics for 3D content",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-77842-6_10",
            "Abstract": "Traditionally, the quality of a multimedia system was mainly assessed through the evaluation of its Quality of Service (QoS) that is by evaluating system parameters such as bandwidth, latency, jitter, throughput, transmission delay, availability, etc. However, these metrics often failed to capture the actual end-user perceived quality, which has prompted the development of the construct of Quality of Experience (QoE), widely understood as an interaction of the technical features of multimedia systems with perceptual, and cognitive/emotional factors involved in the interpretation of those features by users. This chapter addresses the open issues in the field of QoS and QoE assessments. First, the perceptual characteristics of the multiview content are analyzed, and then a survey on the existing approaches for QoS and QoE estimation is performed. The analysis is then focused on the subjective aspects of QoE …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:PazO6pb-sMwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "New MAC design to accommodate joint detection techniques in a MIMO-OFDM-based HIPERMAN system",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1338436/",
            "Abstract": "One of the key research issues in wireless systems is how to improve the system capacity. MIMO has been proven as an effective method to achieve this. Previously, the focus of MIMO-OFDM research in high performance metropolitan area network (HIPERMAN) systems was on space time coding (STC) and beamforming. Recently, multi-user detection (MUD) has emerged as a novel approach in MIMO-OFDM-based HIPERMAN systems. In this paper, we have proposed a new MAC design, which includes the new and flexible MAC frame structure and an efficient dynamic resource allocation algorithm, in order to accommodate the MUD techniques in uplink transmission in HIPERMAN systems. The performance of the new MAC design has been evaluated via simulation means. The simulation results show that the new MAC design based on MUD can significantly increase the system capacity.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Connection admission control for supporting QoS in IP-Based HiperLAN2 networks",
            "Publication year": 2002,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8521/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Peace: IP-based emergency applications and services for next generation networks",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/44530649/PEACE_IP-based_Emergency_Applications_an20160408-23450-1vnanq2.pdf",
            "Abstract": "The transition to next generation networks is often coupled with the vision of innovative services providing personalized and customisable services over an all-IP infrastructure. To enable a smooth transition, next generation all-IP networks need not only support more services but also support emergency services. In the PEACE project we will provide a general emergency management framework addressing extreme emergency situations such as terrorist attacks and natural catastrophes as well as day-to-day emergency cases based on adhoc networking and the IP Multimedia Subsystem (IMS) respectfully. In order to enable multimedia communication for emergency situations, an architecture will be architected for supporting the distribution of currently centralised services such as VoIP and name translation and supporting those services in a reliable and secure manner withstanding any failures and changes of the network.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic spectrum access for NGN",
            "Publication year": 2008,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/9021/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time evaluation of mobility management schemes for all IP-based infrastructures",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/8518/",
            "Abstract": "Real-time evaluation of mobility management schemes for all IP-based infrastructures - \nKingston University Research Repository Jump to main menu navigation [j] Jump to page \ncontent [k] Research at Kingston University Login Home About Browse by Year Browse by \nResearch Area Browse by Faculty Browse by Kingston Author Search Help Real-time \nevaluation of mobility management schemes for all IP-based infrastructures Akhtar, N., \nGeorgiades, M., Politis, C. and Tafazolli, R. (2003) Real-time evaluation of mobility \nmanagement schemes for all IP-based infrastructures. In: EVOLUTE Workshop 2003: \nBeyond 3G Evolution of Systems and Services; 10 Nov 2003, Guildford, UK. (Unpublished) \nFull text not available from this archive. Item Type: Conference or Workshop Item (Paper) \nEvent Title: EVOLUTE Workshop 2003: Beyond 3G Evolution of Systems and Services \nResearch Area: Computer science and Faculty, : :…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Health 4.0: The case of multiple sclerosis",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7749437/",
            "Abstract": "Multiple sclerosis is a chronic and variable disease in matters of symptoms, clinical course and outcome. The ultimate goal of currently used drugs and therapeutic strategies is the control of disease activity and the delay of the ongoing disability. During the last decades, a number of disease-modifying drugs (DMDs), all products of advanced biotechnology are being used. However, these DMDs are yet partially effective since the ongoing disability progression may hardly be prevented. There is growing evidence that these DMDs might be more effective if more accurate monitoring of the disease itself throughout a period of time might be available. In the new era of MS treatment and on the basis of our current knowledge about MS management, it became pretty clear that the overall therapeutic strategy should always be scheduled on strictly individualized basis. To this, MS patients should be encouraged to take …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:RmcNAhKkducC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Green Communication in 4G Wireless Systems",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=tjWYWsKNwLoC&oi=fnd&pg=PA9&dq=info:-3D4N6CtxD0J:scholar.google.com&ots=DZ1PgU58LJ&sig=SN2Kruv_2MaTz63FWWzuul2S2GM",
            "Abstract": "Green communication has emerged as one of the most important research topics for radio systems. This leads us to develop an energy-efficient mechanism that adjusts transmission power according to the traffic load and reduces the energy per bit usage. For the vision of Europe 2020 as a smart, sustainable, and inclusive economy to become reality, the EU has set forth the 20: 20: 20 targets by which greenhouse gas emissions and energy reduction of primary use should be reduced by 20% while 20% of energy consumption should come from renewable resources.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:NJ774b8OgUMC",
            "Publisher": "River Publishers"
        },
        {
            "Title": "A case study of Internet of Things (IoT) based on Wireless Sensor Networks (WSNs) and Smartphone (iPhone)",
            "Publication year": 2012,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/22813/",
            "Abstract": "In the state of the art, Internet of Things (IoT) tends to be touted as a future technology. Based on that concept and the constant development of Wireless Sensor Networks (WSNs), this paper explains and implements a case study of a converged Internet of Things based on a WSN and a smartphone.  The implementation integrates the networking capabilities of a WSN, a wireless local area network and a smartphone device, in order to achieve a monitoring service and tracking mobility of objects for the purposes of future Internet of Things services. The scenario is to create a service, or a way that one will be able to “understand” and monitor an individual’s movement inside a house. At the end new concepts and ideas for future work will be presented. The paper is part of the WMN Research Group ongoing research to implement a futuristic service for monitoring elderly residents under the concept of smart homes.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of IPsec over WiMAX",
            "Publication year": 2009,
            "Publication url": "http://eprints.kingston.ac.uk/16770/",
            "Abstract": "Performance evaluation of IPsec over WiMAX - Kingston University Research Repository Jump \nto main menu navigation [j] Jump to page content [k] Research at Kingston University Login \nHome About Browse by Year Browse by Research Area Browse by Faculty Browse by \nKingston Author Search Help Performance evaluation of IPsec over WiMAX Nazaryan, Levon, \nKhan, Naveed, Panaousis, Emmanouil and Politis, Christos (2009) Performance evaluation of \nIPsec over WiMAX. In: Wireless World Research Forum meeting 23; 20-22 Oct 2009, Beijing, \nChina. Full text not available from this archive. Item Type: Conference or Workshop Item \n(Paper) Event Title: Wireless World Research Forum meeting 23 Research Area: Computer \nscience and informatics Faculty, School or Research Centre: Faculty of Computing, Information \nSystems and Mathematics (until 2011) Faculty of Computing, Information Systems and (until ) > …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Three-dimensional position-based adaptive real-time routing protocol for wireless sensor networks",
            "Publication year": 2015,
            "Publication url": "https://jwcn-eurasipjournals.springeropen.com/articles/10.1186/s13638-015-0419-x",
            "Abstract": "Devices for wireless sensor networks (WSN) are limited by power, and thus, routing protocols should be designed with this constraint in mind. WSNs are used in three-dimensional (3D) scenarios such as the surface of sea or lands with different levels of height. This paper presents and evaluates the Three-Dimensional Position-Based Adaptive Real-Time Routing Protocol (3DPBARP) as a novel, real-time, position-based and energy-efficient routing protocol for WSNs. 3DPBARP is a lightweight protocol that reduces the number of nodes which receive the radio frequency (RF) signal using a novel parent forwarding region (PFR) algorithm. 3DPBARP as a Geographical Routing Protocol (GRP) reduces the number of forwarding nodes and thus the traffic and packet collision in the network. A series of performance evaluations through MATLAB and Omnet++ simulations show significant improvements in network performance parameters and total energy consumption over the 3D Position-Based Routing Protocol (3DPBRP) and Directed Flooding Routing Protocol (DFRP).",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:W5xh706n7nkC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Resource management in mobile computing environments",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-06704-9.pdf",
            "Abstract": "Resource manipulation in dynamically changing environments has emerged as a critical part of the information technology infrastructure. The need for efficient resource manipulation stems from the increasing growth of wireless infrastructures and mobile networks. The need for a reliable management of resources in mobile computing environments, facilitating ubiquitous availability and efficient access to large quantities of distributed resources, has become apparent, as the number of people that communicate and collaborate computationally over the Internet, via different accessing systems and mobile devices, has increased. Mobile computing paradigm is set to drive technology over the next decade and integrate resources availability through the 3As (Anywhere, Anything, Anytime). Notwithstanding, there are a lot of challenges to meet, in order to have mobile computing paradigm applicable in all aspects and in …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Wireless for the Next Generation [From the Guest Editors]",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Christos-Politis-2/publication/224222908_Wireless_for_the_Next_Generation_From_the_Guest_Editors/links/54c0fbef0cf28eae4a6b4073/Wireless-for-the-Next-Generation-From-the-Guest-Editors.pdf",
            "Abstract": "The Wireless World Research Fo-rum (WWRF; www. wireless-worldresearch. org) was established in 2001 to bring together industry and academic researchers to create a clear, comprehensive, and harmonized view of future research in mobile and wireless communications. The WWRF is a global organization with more than 100 members from five continents, representing all sectors of mobile communications industry and the research community, with the mission to shape the wireless future. The forum provides strategic future research directions in the wireless field to generate, identify, and promote research areas and technical trends for mobile and wireless system technologies. Members also discuss how new insights will impact innovative application areas such as intelligent ambient environments, health care, automotive, education, and energy conservation.Besides several publications at regular journals, invited talks, sessions, and panels at major conferences, the WWRF has established the following two major publication channels. Together with the Wiley WWRF Book Series, with four books already being published and additional ones yet to be published, this special issue is a part of WWRF publications in IEEE",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An energy-aware distributed open market model for UAV-assisted communications",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9128475/",
            "Abstract": "Unmanned aerial vehicles (UAVs) have opened up numerous opportunities in terms of connectivity, especially in the context of realizing the vision of ubiquitous connectivity for 5G and beyond (B5G). The ease of mobility makes the UAV base stations (UAV-BSs) a viable candidate for providing ‘on demand’ services to the users. Moreover, viewing the spectrum crunch experienced by traditional cellular networks, the UAV-BSs can share the burden of providing connectivity. UAV-BSs can open up several business opportunities for mobile network operators (MNOs). In this paper, we propose an open market model, where a UAV-BS has the opportunity to establish a link with a terrestrial BS (TBS) of an MNO that provides the best connectivity and offers a lower price. A distributed model is considered where the decision making power lies with the UAV-BS. The TBS-selection problem is modeled as an integer linear …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:QI7uKX5mnFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementing a superwideband codec for smartphone VoIP services",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6582791/",
            "Abstract": "The growing popularity of Voice over IP (VoIP) services has allowed a number of important enhancements to basic voice services, including wideband codecs (coderdecoders) that allow higher fidelity audio to be efficiently transmitted. In addition, widespread use of smartphones has created an environment where such services can be rapidly adopted. This paper describes the implementation of Google's iSAC wideband codec in an Apple Smartphone, as part of a commercial VoIP client created by Voxygen1. In addition, the paper summarizes some recent trends in the implementation of wideband codecs.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:bnK-pcrLprsC",
            "Publisher": "VDE"
        },
        {
            "Title": "Multilayer mobility management for all-IP networks: pure SIP vs. hybrid SIP/mobile IP",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1208841/",
            "Abstract": "Next generation systems will support mobility based on the continuing advancements in wireless technology. An integrated solution, whereby mobility management is an integral part of the IP layer routing protocol, would be more advantageous for both the operator and the end user. In this paper, we present two mobility management architectures based on SIP and Mobile IP protocols. These configurations mainly allow/provide mobility in two different layers namely the application and network layers and due to that our proposal is so-called multilayered. Such mobility should be present over heterogeneous networks, such as UMTS, WLANs, as well as, fixed networks. The two proposed architectures are evaluated in terms of mobility-related metrics and for two types of traffic, real time and non real time. Finally, we propose the most suitable architecture for mobility management over heterogeneous all-IP infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:71d7Y1FijdoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Green framework for future cellular networks",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/16663/",
            "Abstract": "Green framework for future cellular networks - Kingston University Research Repository Jump to \nmain menu navigation [j] Jump to page content [k] Research at Kingston University Login Home \nAbout Browse by Year Browse by Research Area Browse by Faculty Browse by Kingston Author \nSearch Help Green framework for future cellular networks Adigun, Olayinka and Politis, Christos \n(2010) Green framework for future cellular networks. In: 25th Wireless World Research Forum \n(WWRF) meeting; 16 Nov - 18 Nov 2010, London, UK. Full text not available from this archive. \nOfficial URL: http://www.wireless-world-research.org/index.php?i... Item Type: Conference \nor Workshop Item (Paper) Event Title: 25th Wireless World Research Forum (WWRF) \nmeeting Research Area: Computer science and informatics Faculty, School or Research \nCentre: Faculty of Computing, Information Systems and Mathematics (until 2011) of , () (:…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Power allocation in cognitive spectrum sharing area using effective capacity in imperfect fading channel",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5764555/",
            "Abstract": "In this paper we propose a power control policy over an imperfect fading channel within a cognitive spectrum sharing area. In particular, our proposed scheme maximizes the secondary user effective capacity subject to the average interference power and the secondary user transmit power constraints. We also investigate the minimization of average interference power at the Primary Receiver (PR) under required effective capacity of the secondary user with respect to imperfect Channel State Information (CSI) between cognitive radio transmitter and the PR link. Furthermore the impact of the Quality of Service (QoS) exponent on effective capacity in imperfect channel is studied. The analytical results reveal that the effective capacity of the Secondary User (SU) under given average interference power and peak power constraints increases due to growing channel state error of the secondary transmitter-primary receiver …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Personal network security architecture",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10026830953/",
            "Abstract": "CiNii 論文 - Personal network security architecture CiNii 国立情報学研究所 学術情報ナビゲータ\n[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン \nEnglish 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 \nISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続き\nのご案内 Personal network security architecture POLITIS C. 被引用文献: 1件 著者 POLITIS C. \n収録刊行物 Proc. WPMC2005 Proc. WPMC2005, 328-333, 2005 被引用文献: 1件中 1-1件を \n表示 1 A New Security Architecture for Personal Networks and Its Performance Evaluation \nSHIN SeongHan , FATHI Hanane , KOBARA Kazukuni , PRASAD Neeli R. , IMAI Hideki IEICE \ntransactions on communications 91(7), 2255-2264, 2008-07-01 参考文献18件 Tweet 各種\nコード NII論文ID(NAID) 10026830953 資料種別 会議資料 データ提供元 CJP引用 書き出し ににに/…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simultaneous sensing and transmission for cognitive radios with imperfect signal cancellation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942018/",
            "Abstract": "In conventional cognitive radio systems, the secondary user employs a “listen-before-talk” paradigm, where it senses if the primary user is active or idle, before it decides to access the licensed spectrum. However, this method faces challenges, with the most important one being the reduction of the secondary user's throughput, as no data transmission takes place during the sensing period. In this context, the idea of simultaneous spectrum sensing and data transmission is proposed. This paper studies a system model where this concept is obtained through the collaboration of the secondary transmitter with the secondary receiver. First, the secondary receiver decodes the signal from the secondary transmitter, removes it from the total received signal, and then carries out spectrum sensing in the remaining signal in order to determine the presence/absence of the primary user. Different from the existing literature, this …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:yaBp1wUtcLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure techniques to support cognitive access in spectrum bands",
            "Publication year": 2010,
            "Publication url": "http://eprints.kingston.ac.uk/16684/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Positioning for performance enhancement in shared LTE and HSPA networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294711/",
            "Abstract": "Efficient radio resource management in wireless network systems is increasingly becoming a necessity as current trends drive towards increased number of users and bandwidth hungry applications and services. In this paper, two concepts for targeting this capacity challenge are addressed: cooperative and localization based radio resource management. In cooperation we refer to the concept of a sole entity responsible for managing radio resources for heterogeneous networking environments, and herein we explore an HSPA with an overlay LTE/network. For optimized decisions in such an environment, utilizing mobile positioning information seems to show enhanced system performance. This paper investigates the application of suitability based RAT selection using positioning information for enhanced throughput performance in heterogeneous networking environments. The results clearly show that, for …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing mobility management protocols to minimise AAA impact on handoff performance",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405004640",
            "Abstract": "In an all-IP-based network architecture that provides multimedia services for 3G and WLAN users, security provisioning is a paramount requirement. However, a security infrastructure (e.g., AAA) introduces additional impairments, in the form of delay components, to the total handoff performance crucially affecting the prime objective towards seamless and secure mobility. In this work, a Context Transfer solution is proposed, in order to support seamless and secure multimedia services over all-IP infrastructures. The solution acts as an adhesive between the AAA and mobility management entities by using the latter to forward AAA state information locally. In this solution, the mobility management protocol is used to trigger Context Transfer and additional messages have been introduced to carry the desired AAA context information. The results presented here show that the overall handoff delay is reduced significantly …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mobility Management and AAA Support Characterisation for Providing Seamless Multimedia Services over IP-based Infrastructures",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=12246220668253068686&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:Y0RG-0fxPaAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hybrid adaptive routing protocol for extreme emergency ad hoc communication",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5560057/",
            "Abstract": "The autonomous nature of Mobile Ad hoc Networks (MANETs) makes them suitable for the support of extreme emergency rescuer IP communications for next generation networks. A major hurdle towards the deployment of emergency MANETs (eMANETs) is the design of a distributed routing protocol that can adapt to its highly dynamic topology where the number of nodes in the network frequently varies. This paper presents ChaMeLeon (CML), a hybrid and adaptive routing protocol designed to adapt to the rapid topological changes in extreme emergency MANETs (eMANETs) when operating within a predefined disaster area. CML adaptively changes its routing behavior according to the number of nodes in the network, so that it can provide a more efficient routing approach than purely proactive or reactive routing protocols for varying size networks. The protocol can operate in one of three routing phases which …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Securing Neighbourhood Discovery for Mobile Ad-Hoc Networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7391135/",
            "Abstract": "We propose the use of a secure topology discovery scheme, based on certificate-less public key management, as part of a proposed secure version of the Neighbourhood Discovery Protocol (NHDP) for Mobile Ad-Hoc Networks. We provide an initial evaluation of the computational cost of sending secure HELLO messages, based on an Android app deployed within a small test-bed environment.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:gnsKu8c89wgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Managing the radio spectrum",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4906419/",
            "Abstract": "In this article, we focus on the vision of spectrally aware CR that comprises handsets automatically making use of under-utilized spectrum by sequentially hopping into spectrum gaps across a broad frequency range. The topics discussed in this article are based on a project funded by Ofcom (the U.K. Communications Regulator) to investigate the issues surrounding the introduction of CR technology.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-board interference detection and localization for SATCOM, Satellite Communications in the 5G Era",
            "Publication year": 2018,
            "Publication url": "https://orbilu.uni.lu/handle/10993/38253",
            "Abstract": "On-board interference detection and localization for SATCOM, Satellite Communications in the \n5G Era - Politis Christos Open Repository and Bibliography Login Home Help? EN FR \nUniversity of Luxembourg Library You are here: ORBi lu Detailled reference Reference : On-board \ninterference detection and localization for SATCOM, Satellite Communications... Document \ntype : Books : Book published as author, translator, etc. Discipline(s) : Engineering, computing \n& technology : Computer science Focus Areas : Computational Sciences To cite this reference: \nhttp://hdl.handle.net/10993/38253 Title : On-board interference detection and localization for \nSATCOM, Satellite Communications in the 5G Era Language : English Author, co-author : \nPolitis, Christos mailto [University of Luxembourg > Interdisciplinary Centre for Security, \nReliability and Trust (SNT) > >] Kalantari, Ashkan mailto [University of Luxembourg > Centre , […",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:RgMnzfD6kpIC",
            "Publisher": "IET"
        },
        {
            "Title": "Physical layer techniques for optimum performance of HiperLAN2 systems",
            "Publication year": 2002,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8519/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Architectures for Multiple Peer-to-Peer Overlays in MANETs in Emergency Situations",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=14416497804282647696&hl=en&oi=scholarr",
            "Abstract": "In emergency situations where the standard telecommunications infrastructure may be severely damaged, destroyed or overloaded, the emergency services need a means of communicating within their departments and with each other. Mobile Ad-hoc Networks (MANETs) may provide a viable solution as a fast and easily deployable network infrastructure for all types of emergency services in the context of such emergency situations. The ways in which users of the network are able to collaborate and interact with each other is a fundamental part of the emergency management process. Consequently a main research area lies in the development and deployment of overlay networks which cater for communication, collaboration and service discovery between participants. In this paper we discuss the motivations for furthering the research of overlay network architectures in emergency situations, we analyze the important concepts related to peer-to-peer overlay networks in general and thus propose two novel architectures for multiple cross-layer peerto-peer overlay networks.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:UY3hNwcQ290C",
            "Publisher": "Unknown"
        },
        {
            "Title": "STRIKE: spectrally efficient fixed wireless network based on dual standards",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8508/",
            "Abstract": "STRIKE: spectrally efficient fixed wireless network based on dual standards - Kingston \nUniversity Research Repository Help Search Browse by Year Browse by Research Area \nBrowse by Faculty Browse by Kingston Author About Home Login STRIKE: spectrally \nefficient fixed wireless network based on dual standards Mino Diaz, E., Engels, M., Cianca, E., \nChenu-Tournier, M., Hutter, A., Wachsmann, K.-P., Politis, C., Forkel, I., Rosson, P. and \nNoguet, D. (2003) STRIKE: spectrally efficient fixed wireless network based on dual \nstandards. In: Joint First Workshop on Mobile Future and Symposium on Trends in \nCommunications; 26-28 Oct 2003, Bratislava, Slovakia. ISBN 0780379934 Official URL: http://dx.doi.org/10.1109/TIC.\nMetadata Actions (Repository Editors) Item Control Page Item Control Page Accessibility \nDisclaimer Copyright Freedom of Information Privacy Policy Cookies …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:TY5xIG7f_2sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self organized energy efficient position aided relays in LTEA",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874490712000377",
            "Abstract": "Energy is an expensive commodity in Long term Evolution-Advanced networks (LTEA). In recent years many researchers have proposed different approaches to minimize energy consumption in LTEA. Relays and the Self Organized Network (SON) technologies are an attractive solution to cost reduction, and to minimize energy utilization in LTEA. SON has the potential for self-configuring, self-optimizing, self-healing and minimizing the energy consumption in the network and by deploying Relay Nodes (RNs) it enhances the capacity, the diversity and fairness in the network. In this paper we consider the self-optimizing and self-healing properties of SON and propose a novel energy efficient SON based position aided relay algorithm. The proposed algorithm is capable of reducing the energy consumption by 50% in the best case scenario. A System Level Simulator (SLS) is used to evaluate the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:XiSMed-E-HIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "System level evaluation methodology for energy saving",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=tjWYWsKNwLoC&oi=fnd&pg=PA203&dq=info:A1xHTmCu3HUJ:scholar.google.com&ots=DZ1PgU58LL&sig=LrSR1WhEMoX_jPueEjCAV5zf880",
            "Abstract": "The growing demand in data traffic coupled with the drive towards new generation handsets that are more power hungry are providing the impetus for new research initiatives towards energy saving. Although much research in energy efficiency has been geared towards hardware power optimization, the energy consumption of new generation wireless (3G and 4G) is sensitive on the design and flexibility of the dynamic resource allocation protocol, with a high fraction of the holistic power consumption attributed to the data transmission over the wireless connection. This sensitivity suggests that there is an opportunity for optimization of the energy consumption based on communications protocols, namely the link and transport layer protocols. In this chapter, we extend the analysis given in the prequel to understand how the link level performance interacts with the system level to form part of the system level model for analyzing system performance in cellular networks. Moreover, this chapter focuses on the dynamic resource allocation entity which is responsible for managing radio resources in wireless systems. We identify the energy saving performance metrics and provide a holistic system level performance analysis using traditional scheduling policies from an",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:5ugPr518TE4C",
            "Publisher": "River Publishers"
        },
        {
            "Title": "SIP-based end system mobility solution for all-IP infrastructures",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/8507/",
            "Abstract": "SIP-based end system mobility solution for all-IP infrastructures - Kingston University Research \nRepository Jump to main menu navigation [j] Jump to page content [k] Research at Kingston \nUniversity Login Home About Browse by Year Browse by Research Area Browse by Faculty \nBrowse by Kingston Author Search Help SIP-based end system mobility solution for all-IP \ninfrastructures Akhtar, N., Georgiades, M., Politis, C. and Tafazolli, R. (2003) SIP-based end \nsystem mobility solution for all-IP infrastructures. In: 12th IST Mobile and Wireless Communications \nSummit; 15 - 18 June 2003, Aveiro, Portugal. Full text not available from this archive. Item \nType: Conference or Workshop Item (Paper) Event Title: 12th IST Mobile and Wireless \nCommunications Summit Research Area: Computer science and informatics Faculty, School or \nResearch Centre: Faculty of Computing, Information Systems and Mathematics (until 2011) , (…",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On-board the satellite interference detection with imperfect signal cancellation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7536813/",
            "Abstract": "Interference issues have been identified as a threat for satellite communication systems and services, resulting in throughput degradation and revenue loss to the satellite operators. In this context, an on-board spectrum monitoring unit (SMU) can be used to detect interference reliably. Current satellite SMUs are deployed on the ground and the introduction of an in-orbit SMU can bring several benefits, e.g. simplifying the ground based station in multibeam systems. This paper proposes a two-step algorithm for on-board interference detection, exploiting the frame structure of DVB-S2X standard, which employs pilot symbols for data transmission. Assuming that the pilot signal is known at the receiver, it can be removed from the total received signal. Then, an Energy Detection (ED) technique can be applied on the remaining signal in order to decide the presence or absence of interference. The simulation results show …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:C5mqfHIFIucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Green ICT: Self-organization aided network sharing in LTE-A",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/39230099/54b90b2c0cf28faced6267c4.pdf",
            "Abstract": "One of the targets of Green Information and Communication Technology (ICT) is to reduce the energy consumption of ICT itself. This paper provides a tutorial on a new energy reduction approach–self-organization aided network sharing, which exploits the concept of cooperation and adaptation in the cellular system level. Detail reviews from different perspectives including the academic literature, the existing standard, etc. are provided. Moreover, a simply example with simulation results is provided to demonstrate the energy efficiency of the proposed scheme.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:K3LRdlH-MEoC",
            "Publisher": "River Publishers"
        },
        {
            "Title": "QoE-assured live streaming via satellite backhaul in 5G networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8666159/",
            "Abstract": "Satellite communication has recently been included as one of the key enabling technologies for 5G backhauling, especially for the delivery of bandwidth-demanding enhanced mobile broadband (eMBB) applications in 5G. In this paper, we present a 5G-oriented network architecture that is based on satellite communications and multi-access edge computing to support eMBB applications, which is investigated in the EU 5GPPP phase-2 satellite and terrestrial network for 5G project. We specifically focus on using the proposed architecture to assure quality-of-experience (QoE) of HTTP-based live streaming users by leveraging satellite links, where the main strategy is to realize transient holding and localization of HTTP-based (e.g., MPEG-DASH or HTTP live streaming) video segments at 5G mobile edge while taking into account the characteristics of satellite backhaul link. For the very first time in the literature, we …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:-w1eE4La9_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive power control policy using effective capacity in spectrum sharing area",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35155-6_18",
            "Abstract": "In this paper, we propose and analyses a power control policy in terms of maximizing effective capacity at physical and link layers under average interference and transmit power constraint of the cognitive transmitter in spectrum sharing area. The quality of service constraint and proposed power policy in physical layer drives the data queue at link layer to maximize the required statistical quality of service (QoS) of the cognitive users. In this work we also take into account the average transmit power constraint and channel state information at both transmitter and receiver sides. The numerical evaluations are confirmed our theoretical results.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An analysis of routing protocol metrics in wireless mesh networks",
            "Publication year": 2014,
            "Publication url": "http://eprints.kingston.ac.uk/29756/",
            "Abstract": "Wireless Mesh Networks (WMN)s play an important role in todays communication and they are expected to increase in proliferation in the field of wireless communication in the near future. Researchers in the area of WMNs address some issues like low throughput and high latency. Routing Protocols in WMNs have a vital role in data communication and the key parameter in all routing protocols is link metrics. In this paper the majority of link metrics in WMNs are studied in different categories. Link-quality and traffic-aware metrics account for most of the metrics, however multi channel network and cognitive radio systems are also considered in detail. In each section, by reviewing the metrics and its performance in detail, summary and comparison tables of link quality metrics are also provided to enable better understanding of this topic.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:ZuybSZzF8UAC",
            "Publisher": "New World Publishing"
        },
        {
            "Title": "Final version of the Network-Level Security Architecture Specification",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=4022929663083546043&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:JhbybO29vGQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid resource allocation for millimeter-wave NOMA",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8088525/",
            "Abstract": "The ever increasing demand for data traffic for future wireless systems poses challenging requirements for 5G wireless communications, such as high spectral efficiency, better interference management, and extensive connectivity. These challenges open the possibility to use NOMA schemes in future radio access networks. In these schemes, the users are multiplexed in the power domain in the transmitter and de-multiplexed using successive interference cancellation in the receiver. In this work, we propose a hybrid resource allocation technique that consists of orthogonal and non-orthogonal radio resources and also study the improvements in cell capacity achieved in several proposed cases. To this end, we use millimeter- wave-based single-cell deployment to evaluate the performance of this hybrid scheme.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:SEKBqlyTJecC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An energy efficient position based Adaptive real-time routing protocol for WSNs",
            "Publication year": 2015,
            "Publication url": "https://www.ingentaconnect.com/content/ben/swcc/2015/00000002/00000002/art00007",
            "Abstract": "Devices for Wireless Sensor Networks (WSN) are limited by power and thus routing protocols should be designed with this constrain in mind. This paper presents and evaluates an Energy Efficient Position Based Adaptive Real-Time Routing protocol (EFPBARP) as a novel, real-time, position based and energy efficient routing protocol. EFPBARP is a lightweight protocol that reduces the number of nodes which receive the RF signal using a novel Parent Forwarding Region (PFR) algorithm. EFPBARP as a Geographical Routing Protocol (GRP) reduces the number of forwarding nodes and thus the traffic and packet collision in the network. A series of performance evaluations through Matlab and Omnet++ simulations show significant improvements in network performance parameters and total energy consumption over CTP and Directed Flooding Routing Protocol (DFRP).",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "MAC Protocol for All-IP Hiperlan2",
            "Publication year": 2001,
            "Publication url": "http://eprints.kingston.ac.uk/id/eprint/8512/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive power control scheme for energy efficient cognitive radio networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6364836/",
            "Abstract": "Cognition in radio communication is a valuable means of improving spectrum utilization and can contribute to reducing energy consumption in wireless communication systems. This paper proposes a power control scheme using spectrum hole lifetime to diminish cognitive radio energy consumption. The secondary users' transmission power level will be adapted in different licensed channels subject to the channel characteristics, interference power constraint and idle channel lifetime. The power control scheme is evaluated in a multi-licensed channels environment. The simulation results confirm that the proposed scheme considerably improves the efficient use of energy at the cognitive user during the secondary use of licensed channel.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "State of the Art and Functional Specification of Network-Level Security Architecture",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=1044124007106413767&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:0paDrhnEFY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Securing ad hoc networks in extreme emergency cases",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil_Panaousis/publication/228670967_Securing_ad_hoc_networks_in_extreme_emergency_cases/links/0deec5257f1de10690000000/Securing-ad-hoc-networks-in-extreme-emergency-cases.pdf",
            "Abstract": "In many extreme emergency scenarios, such as natural or manmade disasters, the rescuers will have difficulty using traditional legacy networks due to destruction or collapse of infrastructure in such events or in case of remote disaster locations. The nature of mobile ad-hoc networks (MANETs) makes them suitable to be utilized in the context of an extreme emergency for all rescue teams. Therefore the network and the application layer security is critical for ad-hoc communications and encompasses several issues which need consideration. Thus, a main area of research lies in the investigation and development of secure routing and application protocols for MANETs. In this paper we discuss the motivation towards securing MANETs communications in extreme emergency cases, we analyze important security concepts in MANETs and we propose our ideas on a novel secure suite of protocols called PEACE1 Security Platform (PSP). The suite will provide a high trust level of detection and prevention against various attacks in MANETs.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive and secure routing protocol for emergency mobile ad hoc networks",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1005.1740",
            "Abstract": "The nature of Mobile Ad hoc NETworks (MANETs) makes them suitable to be utilized in the context of an extreme emergency for all involved rescue teams. We use the term emergency MANETs (eMANETs) in order to describe next generation IP-based networks, which are deployed in emergency cases such as forest fires and terrorist attacks. The main goal within the realm of eMANETs is to provide emergency workers with intelligent devices such as smart phones and PDAs. This technology allows communication \"islets\" to be established between the members of the same or different emergency teams (policemen, firemen, paramedics). In this article, we discuss an adaptive and secure routing protocol developed for the purposes of eMANETs. We evaluate the performance of the protocol by comparing it with other widely used routing protocols for MANETs. We finally show that the overhead introduced due to security considerations is affordable to support secure ad-hoc communications among lightweight devices.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Link layer modelling for energy efficient performance evaluation in wireless cellular networks",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=tjWYWsKNwLoC&oi=fnd&pg=PA177&dq=info:7sjjpIOIo1EJ:scholar.google.com&ots=DZ1PgU58MD&sig=h8dFvKUAJVMFFy6w30P0FvZvDfQ",
            "Abstract": "Performance of cellular networks are typically classified in three key categories: link level, system level and network level, all of which require diverse experimental platforms and appropriate interfacing to ensure all the dynamics of the cellular environment are captured. In the next two sections we will provide the author with an overview towards the building blocks required to analyze and evaluate the system level performance of cellular systems, that can also have application towards generic wireless systems. In first instance, this chapter presents the link level building blocks and modeling approach, a vital ingredient that determines how the physical layer transmission scheme influences the quality of the transport channels, and consequently the system level ecosystem. The link level building block acts as the interface for the system level experimental platform that will be elaborated further in the sequel chapter.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:wbdj-CoPYUoC",
            "Publisher": "River Publishers"
        },
        {
            "Title": "SDR implementation of a testbed for real-time interference detection with signal cancellation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8340048/",
            "Abstract": "Interference greatly affects the quality of service of wireless and satellite communications, having also a financial impact for the telecommunication operators. Therefore, as the interfering events increase due to the deployment of new services, there is an increasing demand for the detection and mitigation of interference. There are several interference detectors in the literature, evaluated by using extensive simulations. However, this paper goes one step further, designing, implementing, and evaluating the performance of the developed interference detection algorithms experimentally using a software defined radio, and particularly the universal software radio peripheral platform. A realistic communication system is implemented, consisting of a transmitter, a channel emulator, and a receiver. Based on this system, we implement all the appropriate communications features, such as pulse shaping, synchronization …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:V63Ir2N1OTwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Seamless multimedia sessions and real-time measurements in hybrid 3G and WLAN networks",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWMC.2007.014455",
            "Abstract": "This paper addresses the issue of multimedia service provisioning in heterogeneous network environment (WLANs and 3G systems). Particular emphasis is given on the interactions between multimedia signalling, mobility management and AAA interactions. The measurements are associated with service registration/authentication, video streaming within WLAN homogeneous environments and session transfer during movement across homogeneous and heterogeneous network environments. Furthermore, the impact of mobility management on the performance of multimedia services in terms of session reestablishment and packet loss is presented.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:nj26e0utjpAC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Standardisation advancements in the area of routing for mobile ad-hoc networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-011-0705-2",
            "Abstract": "Mobile Ad hoc Networks (MANETs) are self-organized and fully distributed networks that rely on the collaboration of participating devices to route data from source to destination. The MANET paradigm is expected to enable ubiquitous mobile communication and thus the proliferation of pervasive applications. The MANET Working Group (WG) of the Internet Engineering Task Force (IETF) is responsible for standardizing an appropriate Internet Protocol (IP) based routing protocol functionality for both static (mesh) and dynamic (mobile) wireless ad hoc network topologies. In this paper, we provide a background on the possibility to use MANETs for enabling future pervasive internet and innovative ubiquitous services. We also describe the work achieved by the MANET WG thus far on the area of secure unicast and multicast routing for MANETs. We also examine non-IETF work on this area, chiefly based on …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Spectrum allocation for cognitive radio use",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil_Panaousis/publication/228743217_Spectrum_Allocation_for_Cognitive_Radio_Use/links/0deec5257f1ddd9118000000/Spectrum-Allocation-for-Cognitive-Radio-Use.pdf",
            "Abstract": "One of the most regulated and scarce natural resources of all time is radio spectrum. Access to it has been chronically bounded ever since RF transmissions were first regulated in the early 20th century. There are several efforts to reduce interference with the most important and effective the allocation of spectrum to specific technologies. Additionally, new technologies that use spectrum more efficiently and more cooperatively, analogue switch-off and spectrum refarming, may help to overcome the spectrum shortage. These technologies come with great advances in the field of wireless communications and networking.In this paper we discuss the situation of the current spectrum allocation. Additionally, we explain the reasons of the growth need for utilisation of the license-exempt (LE) spectrum bands. The vast allocations of the latter could be enforced by using the technology of cognitive radios (CRs).",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "4G scenarios and system requirements",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.111.8541&rep=rep1&type=pdf",
            "Abstract": "This document intends to present a definition of scenarios, and a first approach to the definition of STRIKE project requirements, to be used by the different technical activities within the STRIKE project (WP3, WP4, WP5 and WP6).Aspects such as definition of services, traffic models, scenarios, channel models, and simulation and demonstrator common methodology are presented. A detailed specification of HIPERMAN and HIPERLAN/2 PHY, DLC and CL layers is provided. Also, the options of HIPERMAN–HIPERLAN/2 interworking, and the relevant multiple antennas techniques are introduced.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:cTy_cm4PQvYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How much energy needs for running energy harvesting powered wireless sensor node?",
            "Publication year": 2016,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/ehs-2015-0017/html",
            "Abstract": "There is a big challenge for research and industrial engineers to apply energy harvesting powered wireless sensors for practical applications. This is because wireless sensors is very power hungry while current energy harvesting systems can only harvest very limited energy from the ambient environment. In order for wireless sensors to be operated based on the limited energy harvested, understanding of power consumption of wireless sensors is the first task for implementation of energy harvesting powered wireless sensors systems. In this research an energy consumption model has been introduced for wireless sensor nodes and the power consumption in the life cycle of wireless communication sensors, consisting of JN5148 microcontroller and custom built sensors: a 3-axial accelerometer, a temperature sensor and a light sensor, has been studied. All measurements are based on a custom-built test bed. The …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:WTQy_8Ay2UsC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "White Paper-Cooperative Networks Research Challenges",
            "Publication year": 2003,
            "Publication url": "http://eprints.kingston.ac.uk/8509/",
            "Abstract": "White Paper - Cooperative Networks Research Challenges - Kingston University Research \nRepository Jump to main menu navigation [j] Jump to page content [k] Research at Kingston \nUniversity Login Home About Browse by Year Browse by Research Area Browse by Faculty \nBrowse by Kingston Author Search Help White Paper - Cooperative Networks Research \nChallenges Lindemann, Christoph, Politis, Christos, Sisalem, Dorgham, Hoekstra, Gerard, \nTeunissen, Harold, Nielsen, Johan, Urban, Josef, Palola, Marko, Sawada, Masahiro, Gonzalez, \nOsvaldo A., Schoo, Peter, Oda, Toshikane, Dagiuklas, Tasos and Teeuw, Wouter (2003) White \nPaper - Cooperative Networks Research Challenges. In: 9th Meeting Wireless World Research \nForum; 1-2 July 2003, Zurich, Switzerland. Full text not available from this archive. Item Type: \nConference or Workshop Item (Paper) Event Title: 9th Meeting Wireless World Research : , …",
            "Abstract entirety": 0,
            "Author pub id": "-U99zuEAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recipients' anonymity in multihop ad-hoc networks",
            "Publication year": 2012,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e95-d_1_181",
            "Abstract": "Multihop ad-hoc networks have a dynamic topology. Retrieving a route towards a remote peer requires the execution of a recipient lookup, which can publicly reveal sensitive information about him. Within this context, we propose an efficient, practical and scalable solution to guarantee the anonymity of recipients' nodes in ad-hoc networks.",
            "Abstract entirety": 1,
            "Author pub id": "-U99zuEAAAAJ:NhqRSupF_l8C",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        }
    ]
}]