[{
    "name": "Χριστόφορος Νίκου",
    "romanize name": "Christoforos Nikou",
    "School-Department": "Μηχανικών Ηλεκτρονικών Υπολογιστών & Πληροφορικής",
    "University": "uoi",
    "Rank": " Καθηγητής",
    "Apella_id": 1690,
    "Scholar name": "Christophoros Nikou",
    "Scholar id": "LOHLQrMAAAAJ",
    "Affiliation": "Professor of Computer Science and Engineering, University of Ioannina, Greece",
    "Citedby": 3662,
    "Interests": [
        "Image Analysis",
        "Computer Vision",
        "Image Processing",
        "Biomedical image processing",
        "Biomedical Image Analysis"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=LOHLQrMAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Automated detection of cell nuclei in pap smear images using morphological reconstruction and clustering",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5601778/",
            "Abstract": "In this paper, we present a fully automated method for cell nuclei detection in Pap smear images. The locations of the candidate nuclei centroids in the image are detected with morphological analysis and they are refined in a second step, which incorporates a priori knowledge about the circumference of each nucleus. The elimination of the undesirable artifacts is achieved in two steps: the application of a distance-dependent rule on the resulted centroids; and the application of classification algorithms. In our method, we have examined the performance of an unsupervised (fuzzy C-means) and a supervised (support vector machines) classification technique. In both classification techniques, the effect of the refinement step improves the performance of the clustering algorithm. The proposed method was evaluated using 38 cytological images of conventional Pap smears containing 5617 recognized squamous …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shot detection in video sequences using entropy based metrics",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1038995/",
            "Abstract": "A new method for detecting shot boundaries in video sequences using metrics based on information theory is proposed. The method relies on the mutual information and the joint entropy between frames and can detect cuts, fade-ins and fade-outs. The detection technique was tested on TV video sequences having different types of shots and significant object and camera motion inside the shots. It was favorably compared to other recently proposed shot cut detection techniques. The method is proven to detect both fades and abrupt cuts very effectively.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recovery of polarimetric Stokes images by spatial mixture models",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-28-3-465",
            "Abstract": "A Bayesian approach for joint restoration and segmentation of polarization encoded images is presented with emphasis on both physical admissibility and smoothness of the solution. Two distinct models for the sought polarized radiances are used: (i) the polarized light at each site of the image is described by its Stokes vector, which directly follows a mixture of truncated Gaussians, explicitly assigning zero probability to inadmissible configurations and (ii) polarization at each site is represented by the coherency matrix, which is parameterized by a set of variables assumed to be generated by a spatially varying mixture of Gaussians. Application on real and synthetic images using the proposed methods assesses the pertinence of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:dhFuZR0502QC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Curriculum learning of visual attribute clusters for multi-task classification",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320318300840",
            "Abstract": "Visual attributes, from simple objects (e.g., backpacks, hats) to soft-biometrics (e.g., gender, height, clothing) have proven to be a powerful representational approach for many applications such as image description and human identification. In this paper, we introduce a novel method to combine the advantages of both multi-task and curriculum learning in a visual attribute classification framework. Individual tasks are grouped after performing hierarchical clustering based on their correlation. The clusters of tasks are learned in a curriculum learning setup by transferring knowledge between clusters. The learning process within each cluster is performed in a multi-task classification setup. By leveraging the acquired knowledge, we speed-up the process and improve performance. We demonstrate the effectiveness of our method via ablation studies and a detailed analysis of the covariates, on a variety of publicly …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:738O_yMBCRsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Accurate Localization of Cell Nuclei in PAP Smear Images using Gradient Vector Flow Deformable Models.",
            "Publication year": 2010,
            "Publication url": "https://www.cse.uoi.gr/~cnikou/Publications/C030_INSICC-BIOSIGNALS-Valencia-2010.pdf",
            "Abstract": "In this work, we present an automated method for the detection of cells nuclei boundaries in conventional PAP stained cervical smear images. The proposed method consists of three phases: a) the definition of candidate nuclei centroids set using mathematical morphology, b) the initial approximation of cells nuclei boundaries and c) the application of the Gradient Vector Flow (GVF) snakes for the final estimation of candidate cell nuclei boundaries. It must be noted that the initial approximation of each snake position is obtained automatically, without any observer interference. For the final determination of the nuclei in our images, we perform a fuzzy C-means clustering, using a data set of patterns based on the characteristics of the area enclosed by the final position of the GVF snakes. The proposed method is evaluated using cytological images of conventional PAP smears, which contain 3616 recognized squamous epithelial cells. The results show that the application of the GVF snakes entails in accurate nuclei boundaries, and consequently in the improvement of the performance of the clustering algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Human activity recognition using robust adaptive privileged probabilistic learning",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-020-00953-x",
            "Abstract": "In this work, a supervised probabilistic approach is proposed that integrates the learning using privileged information (LUPI) paradigm into a hidden conditional random field (HCRF) model, called HCRF+, for human action recognition. The proposed model employs a self-training technique for automatic estimation of the regularization parameters of the objective function. Moreover, the method provides robustness to outliers by modeling the conditional distribution of the privileged information by a Student’s t-density function, which is naturally integrated into the HCRF+ framework. The proposed method was evaluated using different forms of privileged information on four publicly available datasets. The experimental results demonstrate its effectiveness concerning the state of the art in the LUPI framework using both hand-crafted and deep learning-based features extracted from a convolutional neural network.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer London"
        },
        {
            "Title": "3D physics-based reconstruction of serially acquired slices",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1035922/",
            "Abstract": "This paper presents an accurate, computationally efficient, fast and fully-automated algorithm for the alignment of 2D serially acquired sections forming a 3D volume. The method accounts for the main shortcomings of 3D image alignment: corrupted data (cuts and tears), dissimilarities or discontinuities between slices and missing slices. The approach relies on the determination of inter-slice correspondences. The features used for correspondence are extracted by a 2D physics-based deformable model parameterizing the object shape. Correspondence affinities and global constraints render the method efficient and reliable. The method has been evaluated on real images and the experimental results demonstrate its accuracy, as reconstruction errors are smaller than 1 degree in rotation and smaller than 1 pixel in translation.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semicca: A new semi-supervised probabilistic CCA model for keyword spotting",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8296453/",
            "Abstract": "In this paper we present a semi-supervised, attribute-based model suitable for keyword spotting (KWS) in document images. Our model can take advantage of available non-annotated segmented word images, as well as string annotations without a matching word image. We build our model by extending on the probabilistic interpretation of Canonical Correlation Analysis (CCA), solved using Expectation-Maximization (EM). On test-time, we back-project the query and database images to the embedded space by calculating the embedding space posterior density given the observations. Keyword spotting is then efficiently performed by computing query nearest neighbours in the embedded Euclidean space. We validate that our model offers superior performance given the presence of partially-labelled data, with keyword spotting trials on the Bentham and George Washington datasets.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reconstruction of serially acquired slices using physics-based modeling",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1263911/",
            "Abstract": "This paper presents an accurate, computationally efficient, fast, and fully automated algorithm for the alignment of two-dimensional (2-D) serially acquired sections forming a 3-D volume. The approach relies on the determination of interslice correspondences. The features used for correspondence are extracted by a 2-D physics-based deformable model parameterizing the object shape. Correspondence affinities and global constrains render the method efficient and reliable. The method accounts for one of the major shortcomings of 2-D slices alignment of a 3-D volume, namely variable and nonuniform thickness of the slices. Moreover, no particular alignment direction is privileged, avoiding global offsets, biases, and error propagation. The method was evaluated on real images and the experimental results demonstrated its accuracy, as reconstruction errors were smaller than I degree in rotation and smaller than 1 …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Inflammatory cell extraction and nuclei detection in Pap smear images",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/article/inflammatory-cell-extraction-and-nuclei-detection-in-pap-smear-images/128299",
            "Abstract": "The automated diagnosis of cervical cancer in Pap smear images is a difficult though extremely important procedure. In order to obtain reliable diagnostic information, the nuclei and their characteristics must be correctly identified and evaluated. However, the presence of inflammatory and overlapping cells in these images complicates the detection process. In this work, a segmentation algorithm is developed to extract the inflammatory cells and enable accurate nuclei detection. The proposed algorithm is based on the combination of gray level thresholding and the definition of a distance rule, which entails in the identification of inflammatory cells. The results indicate that our method significantly simplifies the nuclei detection process, as it reduces the number of inflammatory cells that may interfere.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "iRay: mobile AR using structure sensor",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7836479/",
            "Abstract": "Using depth information has become more popular in recent years, as it adds a new dimension to 2D camera views. We have developed a novel mobile application called iRay, which uses depth information to achieve highly accurate markerless registration on a mobile device for medical use. We use a Structure Sensor to capture depth information that is portable to iPad. Its SDK also provides SLAM data to track pose. ICP is applied to achieve highly accurate registration between the 3D surface of a human torso and a pre-scanned torso model. The experiments demonstrate our results under motion blur, partial occlusion, and small movements. This application has the potential to be used for medical education and intervention.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image segmentation with a class-adaptive spatially constrained mixture model",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071125/",
            "Abstract": "We propose a hierarchical and spatially variant mixture model for image segmentation where the pixel labels are random variables. Distinct smoothness priors are imposed on the label probabilities and the model parameters are computed in closed form through maximum a posteriori (MAP) estimation. More specifically, we propose a new prior for the label probabilities that enforces spatial smoothness of different degree for each cluster. By taking into account spatial information, adjacent pixels are more probable to belong to the same cluster (which is intuitively desirable). Also, all of the model parameters are estimated in closed form from the data. The proposed conducted experiments indicate that our approach compares favorably to both standard and previous spatially constrained mixture model-based segmentation techniques.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deformation-Invariant Networks For Handwritten Text Recognition",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9506414/",
            "Abstract": "Image deformations under simple geometric restrictions are crucial for Handwriting Text Recognition (HTR), since different writing styles can be viewed as simple geometrical deformations of the same textual elements. In this respect, the usefulness of including deformation invariance to an HTR system is indisputable. We explore different existing strategies for ensuring deformation invariance, including spatial transformers and deformable convolutions, under the context of text recognition, as well as introduce a new deformation-based algorithm, inspired by adversarial learning, which aims to reduce character output uncertainty during evaluation time. The resulting HTR system is shown to achieve state-of-the-art performance on the IAM and RIMES datasets.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Overlapping cell nuclei segmentation using a spatially adaptive active physical model",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6226464/",
            "Abstract": "A method for the segmentation of overlapping nuclei is presented, which combines local characteristics of the nuclei boundary and a priori knowledge about the expected shape of the nuclei. A deformable model whose behavior is driven by physical principles is trained on images containing a single nuclei, and attributes of the shapes of the nuclei are expressed in terms of modal analysis. Based on the estimated modal distribution and driven by the image characteristics, we develop a framework to detect and describe the unknown nuclei boundaries in images containing two overlapping nuclei. The problem of the estimation of an accurate nucleus boundary in the overlapping areas is successfully addressed with the use of appropriate weight parameters that control the contribution of the image force in the total energy of the deformable model. The proposed method was evaluated using 152 images of conventional …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "SPICE: Superpixel Classification for Cell Detection and Counting.",
            "Publication year": 2018,
            "Publication url": "https://www.scitepress.org/Papers/2018/65083/65083.pdf",
            "Abstract": "An algorithm for the localization and counting of cells in histopathological images is presented. The algorithm relies on the presegmentation of an image into a number of superpixels followed by two random forests for classification. The first random forest determines if there are any cells in the superpixels at its input and the second random forest provides the number of cells in the respective superpixel. The algorithm is evaluated on a bone marrow histopathological dataset. We argue that a single random forest is not sufficient to detect all the cells in the image while a cascade of classifiers achieves higher accuracy. The results compare favorably with the state of the art but with a lower computational cost.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gender and age estimation without facial information from still images",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-64556-4_38",
            "Abstract": "In this paper, the task of gender and age recognition is performed on pedestrian still images, which are usually captured in-the-wild with no near face-frontal information. Moreover, another difficulty originates from the underlying class imbalance in real examples, especially for the age estimation problem. The scope of the paper is to examine how different loss functions in convolutional neural networks (CNN) perform under the class imbalance problem. For this purpose, as a backbone, we employ the Residual Network (ResNet). On top of that, we attempt to benefit from appearance-based attributes, which are inherently present in the available data. We incorporate this knowledge in an autoencoder, which we attach to our baseline CNN for the combined model to jointly learn the features and increase the classification accuracy. Finally, all of our experiments are evaluated on two publicly available datasets.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Gaussian mixture-based mean shift for tracking under abrupt illumination changes",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6274293/",
            "Abstract": "Mean shift is a fundamental algorithm for visual object tracking which is based on the minimization of the distance between the discrete histogram of the target and the discrete histogram of the neighborhood of a candidate image location. While the algorithm performs well when the target's appearance and the lighting conditions are constant, it may fail when these conditions are not met because the ideal histogram is generally shifted with respect to the reference histogram. In this work, we propose to compute the initial histogram of the target using a Gaussian mixture model (GMM) rather than impulses generated by simple counting. This mixture plays the role of a weighting function, in the histograms computed in subsequent frames, in order to make them smoother and increase the overlapping area with the initial histogram. By these means, sudden illumination changes between consecutive frames may exhibit …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the optimization of probability vector MRFs in image segmentation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5306230/",
            "Abstract": "In the context of image segmentation, Markov random fields (MRF) are extensively used. However solution of MRF-based models is heavily dependent on how successfully the MRF energy minimization is performed. In this framework, two methodologies, complementary to each other, are proposed for random field optimization. We address the special class of models comprising a random field imposed on the probabilities of the pixel labels. This class of segmentation models poses a special optimization problem, as, in this case, the variables constituting the MRF are continuous and subject to probability constraints (positivity, sum-to-unity). The proposed methods are evaluated numerically in terms of objective function value and segmentation performance, and compare favorably to existing corresponding optimization schemes.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the importance of nucleus features in the classification of cervical cells in Pap smear images",
            "Publication year": 2012,
            "Publication url": "https://www.cs.uoi.gr/~cnikou/Publications/C047_IWPRHA_Tsukuba-2012.pdf",
            "Abstract": "In this work, we investigate the classification of cervical cells by exploiting only the nucleus features and not taking into account the features extracted from the cytoplasm area. This procedure is motivated by the fact that the nuclei areas can be extracted automatically from Pap smear images, in contrast to the cytoplasm segmentation which is not a solved problem yet. Furthermore, we consider the representation of these features in low dimensional spaces using non linear dimensionality reduction techniques, which can properly handle complex nonlinear data, as they better describe their manifold structure. The classification was performed in a supervised manner, using support vector machines (SVM) with several kernel functions. The obtained results indicate that we can achieve high classification performance when we use features extracted only from the nuclei areas.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Word spotting in handwritten text using contour-based models",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6981052/",
            "Abstract": "In this paper, we propose a method for spotting keywords in images of handwritten text. Relying on an object detection system in real images, local contour features are extracted from segmented word images in order to obtain a representative shape of a word-class. Thus, word spotting is cast following a query-by-word-class scenario where class models are generated using a random subset of the images belonging to that class. Cumbersome multi-writer conditions are tackled with a statistical model of intra-class deformations using principal component analysis (PCA). Novel word instances are detected through a combination of a Hough-style voting scheme with a non-rigid point matching algorithm. Finally, we evaluate the system's performance for word spotting as a classification task, using a vocabulary of word models.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Bayesian framework for image segmentation with spatially varying mixtures",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5445031/",
            "Abstract": "A new Bayesian model is proposed for image segmentation based upon Gaussian mixture models (GMM) with spatial smoothness constraints. This model exploits the Dirichlet compound multinomial (DCM) probability density to model the mixing proportions (i.e., the probabilities of class labels) and a Gauss-Markov random field (MRF) on the Dirichlet parameters to impose smoothness. The main advantages of this model are two. First, it explicitly models the mixing proportions as probability vectors and simultaneously imposes spatial smoothness. Second, it results in closed form parameter updates using a maximum  a posteriori  (MAP) expectation-maximization (EM) algorithm. Previous efforts on this problem used models that did not model the mixing proportions explicitly as probability vectors or could not be solved exactly requiring either time consuming Markov Chain Monte Carlo (MCMC) or inexact variational …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "DeTEC: detection of touching elongated cells in sem images",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50835-1_27.pdf",
            "Abstract": "A probabilistic framework using two random fields, DeTEC (Detection of Touching Elongated Cells) is proposed to detect cells in scanning electron microscopy images with inhomogeneous illumination. The first random field provides a binary segmentation of the image to superpixels that are candidates belonging to cells, and to superpixels that are part of the background, by imposing a prior on the smoothness of the texture features. The second random field selects the superpixels whose boundaries are more likely to form elongated cell walls by imposing a smoothness prior onto the orientations of the boundaries. The method is evaluated on a dataset of Clostridium difficile cell images and is compared to CellDetect.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Curve clustering with spatial constraints for analysis of spatiotemporal data",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410331/",
            "Abstract": "In this paper we present a new approach for curve clustering designed for analysis of spatiotemporal data. Such kind of data contains both spatial and temporal patterns that we desire to capture. The proposed methodology is based on regression and Gaussian mixture modeling and the novelty of the herein work is the incorporation of spatial smoothness constraints in the form of a prior for the data labels. This enables the proposed model to take into account the underlying property of spatiotemporal data that spatially adjacent data points most likely should belong to the same cluster. A maximum a posteriori Expectation Maximization (MAP-EM) algorithm is used for learning this model. We present numerical experiments with simulated data where the ground truth is known in order to assess the value of the introduced smoothness constraint, and also with real cardiac perfusion MRI data. The results are very …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A review of automated techniques for cervical cell image analysis and classification",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-4270-3_1",
            "Abstract": "Cervical smear screening is the most popular method used for the detection of cervical cancer in its early stages. The most eminent screening test is the Pap smear, which is based on the staining of cervical cells, using the technique that was first introduced by George Papanicolaou (Science 1942). With this screening technique, precancerous conditions and abnormal changes in cells that may develop into cancer are recognized. The widespread use of this test in developed countries has significantly reduced the incidence and mortality of invasive cervical cancer. In the last years, many methods have been appeared in the literature, which aim at the automated determination of the cytoplasm and the nucleus in these images. In this context, sophisticated image processing techniques and feature extraction and classification methods have been developed by several researchers, in order to derive useful …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "MR brain tissue classification using an edge-preserving spatially variant Bayesian mixture model",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-85988-8_6",
            "Abstract": "In this paper, a spatially constrained mixture model for the segmentation of MR brain images is presented. The novelty of this work is an edge-preserving smoothness prior which is imposed on the probabilities of the voxel labels. This prior incorporates a line process, which is modeled as a Bernoulli random variable, in order to preserve edges between tissues. The main difference with other, state of the art methods imposing priors, is that the constraint is imposed on the probabilities of the voxel labels and not onto the labels themselves. Inference of the proposed Bayesian model is obtained using variational methodology and the model parameters are computed in closed form. Numerical experiments are presented where the proposed model is favorably compared to state of the art brain segmentation methods as well as to a spatially varying Gaussian mixture model.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Elimination of outliers from 2-D point sets using the helmholtz principle",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7081346/",
            "Abstract": "A method for modeling and removing outliers from 2-D sets of scattered points is presented. The method relies on a principle due to Helmholtz stating that every large deviation from uniform noise should be perceptible, provided that the deviation is generated by an a contrario model of geometric structures. By assuming local linearity, we first employ a robust algorithm to model the local manifold of the corrupted data by local line segments. Our rationale is that long line segments should not be expected in a noisy set of points. This assumption leads to the modeling of the lengths of the line segments by a Pareto distribution, which is the adopted a contrario model for the observations. The model is successfully evaluated on two problems in computer vision: shape recovery and linear regression.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cell nuclei segmentation by learning a physically based deformable model",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6004925/",
            "Abstract": "In this work, we present an efficient framework for the training of active shape models (ASM), representing smooth shapes, which is based on the representation of a shape by the vibrations of a spring-mass system. A deformable model whose behavior is driven by physical principles is used on a training set of shapes. The boundary of the regions of interest of the elements of the training set is detected with the convergence of the physics-based deformable model and attributes of the shapes of interest are expressed in terms of modal analysis. Based on the estimated modal distribution, we develop a framework, similar in spirit to ASM, to detect and describe an unknown new shape. The main difference with respect to standard ASM is that the modal amplitudes of the learnt model are used instead of the 2D landmark points and the cost function to be minimized is accordingly modified. The proposed method is …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Entropy metrics used for video summarization",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/584458.584471",
            "Abstract": "New methods for detecting shot boundaries in video sequences and for extracting key frames using metrics based on information theory are proposed. The method for shot cut detection relies on the mutual information and the joint entropy between the frames. It can detect cuts, fade-ins and fade-outs. The detection technique was tested on TV video sequences having different types of shots and containing significant object and camera motion inside the shots. It is demonstrated that the method detects both fades and abrupt cuts with high accuracy. The method for key frame extraction is using the mutual information. We show that it captures satisfactorily the visual content of the shot.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inferring human activities using robust privileged probabilistic learning",
            "Publication year": 2017,
            "Publication url": "http://openaccess.thecvf.com/content_ICCV_2017_workshops/w38/html/Vrigkas_Inferring_Human_Activities_ICCV_2017_paper.html",
            "Abstract": "Classification models may often suffer from\" structure imbalance\" between training and testing data that may occur due to the deficient data collection process. This imbalance can be represented by the learning using privileged information (LUPI) paradigm. In this paper, we present a supervised probabilistic classification approach that integrates LUPI into a hidden conditional random field (HCRF) model. The proposed model is called LUPI-HCRF and is able to cope with additional information that is only available during training. Moreover, the proposed method employs Student's t-distribution to provide robustness to outliers by modeling the conditional distribution of the privileged information. Experimental results in three publicly available datasets demonstrate the effectiveness of the proposed approach and improve the state-of-the-art in the LUPI framework for recognizing human activities.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A joint physics-based statistical deformable model for multimodal brain image analysis",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/959300/",
            "Abstract": "A probabilistic deformable model for the representation of multiple brain structures is described. The statistically learned deformable model represents the relative location of different anatomical surfaces in brain magnetic resonance images (MRIs) and accommodates their significant variability across different individuals. The surfaces of each anatomical structure are parameterized by the amplitudes of the vibration modes of a deformable spherical mesh. For a given MRI in the training set, a vector containing the largest vibration modes describing the different deformable surfaces is created. This random vector is statistically constrained by retaining the most significant variation modes of its Karhunen-Loeve expansion on the training population. By these means, the conjunction of surfaces are deformed according to the anatomical variability observed in the training set. Two applications of the joint probabilistic …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Predicting privileged information for height estimation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7900113/",
            "Abstract": "In this paper, we propose a novel regression-based method for employing privileged information to estimate the height using human metrology. The actual values of the anthropometric measurements are difficult to estimate accurately using state-of-the-art computer vision algorithms. Hence, we use ratios of anthropometric measurements as features. Since many anthropometric measurements are not available at test time in real-life scenarios, we employ a learning using privileged information (LUPI) framework in a regression setup. Instead of using the LUPI paradigm for regression in its original form (i.e., ε-SVR+), we train regression models that predict the privileged information at test time. The predictions are then used, along with observable features, to perform height estimation. Once the height is estimated, a mapping to classes is performed. We demonstrate that the proposed approach can estimate the height …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the fusion of rgb and depth information for hand pose estimation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451022/",
            "Abstract": "Recent advances in deep learning have spurred 3D hand pose estimation, as convolutional network (ConvNet) based methods outperformed random forests. However, in the state of the art, ConvNet based methods employ only depth images of the hand without leveraging color and texture information from the RGB domain. In this paper, we investigate whether ConvNets can learn more rich and discriminative em-beddings, by combining RGB and depth information. To answer this question, we propose the fusion of RGB and depth information in a double-stream architecture. More specifically, RGB and depth images are fed into two separate networks by extracting features, which are subsequently fused at an intermediate layer of the ConvNet, implementing input-level fusion, feature-level fusion and score-level fusion. The double-stream scheme is coupled with a deep ConvNet, contrary to the shallow networks …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cervical cell classification based exclusively on nucleus features",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31298-4_57",
            "Abstract": "In this work, we present a framework for the efficient classification of cervical cells in normal and abnormal categories, based on features extracted exclusively from the nucleus area and ignoring the contingent cytoplasm features. This task is very important, since the nuclei are the only distinguishable areas in complex Pap smear images, as these images present a high degree of cell overlapping and the exact borders of the cytoplasm areas are ambiguous. We have examined the ability of non-linear dimensionality reduction schemes to produce accurate representation of the features manifold, along with the definition of an efficient feature subset, and their influence on the classification performance. Two unsupervised classifiers were used and the results indicate that we can achieve high classification performance when only the nuclei features are used.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Information theory-based shot cut/fade detection and video summarization",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1564125/",
            "Abstract": "New methods for detecting shot boundaries in video sequences and for extracting key frames using metrics based on information theory are proposed. The method for shot boundary detection relies on the mutual information (MI) and the joint entropy (JE) between the frames. It can detect cuts, fade-ins and fade-outs. The detection technique was tested on the TRECVID2003 video test set having different types of shots and containing significant object and camera motion inside the shots. It is demonstrated that the method detects both fades and abrupt cuts with high accuracy. The information theory measure provides us with better results because it exploits the inter-frame information in a more compact way than frame subtraction. It was also successfully compared to other methods published in literature. The method for key frame extraction uses MI as well. We show that it captures satisfactorily the visual content of …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Feature-based 3d morphing based on geometrically constrained sphere mapping optimization",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1774088.1774355",
            "Abstract": "Current trends in free form editing suggest the development of a new novel editing paradigm for CAD models beyond traditional CAD editing of mechanical parts. To this end we wish to develop accurate, robust and efficient 3D mesh deformation techniques such as 3D structural morphing.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fully robust framework for MAP image super-resolution",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6467337/",
            "Abstract": "In this work, we propose an adaptive M-estimation scheme for robust image super-resolution. The proposed algorithm relies on a maximum a posteriori (MAP) framework and addresses the presence of outliers in the low resolution images. Moreover, apart from the robust estimation of the high resolution image, the contribution of the method is twofold: (i) the robust computation of the regularization parameters controlling the relative strength of the prior with respect to the data fidelity term and (ii) the robust estimation of the optimal step size in the update of the high resolution image. Experimental results demonstrate that integrating these estimations into a robust framework leads to significant improvement in the accuracy of the high resolution image.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Markerless detection of ancient rock carvings in the wild: rock art in Vathy, Astypalaia",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865520301045",
            "Abstract": "In this paper, we discuss the problem of object detection in a cultural heritage application context. In particular, the objects to be detected are ancient rock carvings, discovered at the archaeological site of Vathy, Astypalaia in Greece. Without the help of a marker or a human expert, the rock carvings are extremely difficult for a visitor of the site to discern from their surroundings. We explore the possibility of using a computational method that could replace the human expert and detect the rock carvings of interest without the aid of a specific marker. We present a dataset of images that is comprised of annotated photographs of the rock carvings, taken in situ and under differing poses and lighting parameters. Two methods for detection are applied; the first method makes use of a supervised, deep learning-based model, while the other relies on feature point-based matching to an annotated template, in the context of …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:J-pR_7NvFogC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Iterative Weighted Transductive Learning for Handwriting Recognition",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-86337-1_39",
            "Abstract": "The established paradigm in handwriting recognition techniques involves supervised learning, where training is performed over fully labelled (transcribed) data. In this paper, we propose a weak supervision technique that involves tuning the trained network to perform better on a specific test set, after having completed its training with the standard training data. The proposed technique is based on the notion of a reference model, to which we refer as the “Oracle”, which is used for test data inference and retraining in an iterative manner. As test data that are erroneously labelled will be a hindrance to model retraining, we explore ways to properly weight Oracle labels. The proposed method is shown to improve model performance as much as  for Character Error Rate and  for Word Error Rate. Combined with a competitive convolutional-recurrent architecture, we achieve state-of-the-art recognition …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Shape-based word spotting in handwritten document images",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7333824/",
            "Abstract": "In this paper, we address the problem of word spotting using a shape-based matching scheme between segmented word images represented by local contour features. As in a typical query-by-example (QBE) paradigm, a user selects an instance of the query word from the collection of interest and a ranked list of images is returned, based on their similarity with the query. This is accomplished in two steps. The query image is firstly aligned with the test image according to a similarity measure defined on their descriptors and then the aligned images are matched through a deformable non-rigid point matching algorithm. Experiments are carried out on historical handwritten text, written in Greek and English, respectively. Moreover, comparisons with other QBE methods show the efficiency of our system as well as its flexibility in adapting to different scripts.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic video colorization using 3D conditional generative adversarial networks",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-33720-9_16",
            "Abstract": " In this work, we present a method for automatic colorization of grayscale videos. The core of the method is a Generative Adversarial Network that is trained and tested on sequences of frames in a sliding window manner. Network convolutional and deconvolutional layers are three-dimensional, with frame height, width and time as the dimensions taken into account. Multiple chrominance estimates per frame are aggregated and combined with available luminance information to recreate a colored sequence. Colorization trials are run successfully on a dataset of old black-and-white films. The usefulness of our method is also validated with numerical results, computed with a newly proposed metric that measures colorization consistency over a frame sequence.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A spatially adaptive hierarchical stochastic model for non-rigid image registration",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080373/",
            "Abstract": "In this paper, we propose a method for non-rigid image registration based on a spatially adaptive stochastic model. A smoothness constraint is imposed on the deformation field between the two images which is assumed to be a random variable following a Gaussian distribution, conditioned on the observations and maximum a posteriori (MAP) estimation is employed to evaluate the model parameters. Furthermore, the model is enriched by considering the deformation field to be spatially adaptive by assuming different density parameters for each image location. These parameters are assumed random variables generated by a Gamma distribution, which is conjugate to the Gaussian, leading to a model that can be estimated. Numerical experiments are presented that demonstrate the advantages of this model.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A global energy function for the alignment of serially acquired slices",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1203139/",
            "Abstract": "An accurate, computationally efficient, and fully automated algorithm for the alignment of two-dimensional (2-D) serially acquired sections forming a three-dimensional (3-D) volume is presented. The approach relies on the optimization of a global energy function, based on the object shape, measuring the similarity between a slice and its neighborhood in the 3-D volume. Slice similarity is computed using the distance transform measure in both directions. No particular direction is privileged in the method avoiding global offsets, biases in the estimation and error propagation. The method was evaluated on real images [medical, biological, and other computerized tomography (CT) scanned 3-D data] and the experimental results demonstrated its accuracy as reconstuction errors are less than one degree in rotation and less than one pixel in translation.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The 2018 IEEE Spoken Language Technology Workshop will be held 18–21 December in Athens, Greece.",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8398590/",
            "Abstract": "[Dates Ahead] Page 1 137 IEEE SIgnal ProcESSIng MagazInE | July 2018 | Please send \ncalendar submissions to: Dates Ahead, Att: Jessica Welsh, E-mail: j.welsh@ieee.org \nDATES AHEAD 2018 august IEEE 20th International Workshop on Multimedia signal \nProcessing (MMsP) 29–31 August, Vancouver, Canada. General Chairs: Z. Jane Wang and \nFrederic Dufaux URL: http://www.ece.ubc.ca/~mmsp2018/ sEPtEMbEr 26th European \nsignal Processing Conference (EusIPCO) 3–7 September, Rome, Italy. General Chair: \nPatrizio Campisi General Cochair: Josef Kittler URL: http://www.eusipco2018.org/ IEEE \nInternational Conference on Content-based Multimedia Indexing (CbMI) 4–6 September, La \nRochelle, France. General Chair: Renaud Péteri URL: http://cbmi2018.univ-lr.fr/ IEEE \nInternational Workshop on Machine Learning for signal Processing (MLsP) 17–20 \nSeptember, Aalborg, Denmark. General Chair: Zheng-…",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Combining shape, texture and intensity features for cell nuclei extraction in Pap smear images",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865511000171",
            "Abstract": "In this work, we present an automated method for the detection and boundary determination of cells nuclei in conventional Pap stained cervical smear images. The detection of the candidate nuclei areas is based on a morphological image reconstruction process and the segmentation of the nuclei boundaries is accomplished with the application of the watershed transform in the morphological color gradient image, using the nuclei markers extracted in the detection step. For the elimination of false positive findings, salient features characterizing the shape, the texture and the image intensity are extracted from the candidate nuclei regions and a classification step is performed to determine the true nuclei. We have examined the performance of two unsupervised (K-means, spectral clustering) and a supervised (Support Vector Machines, SVM) classification technique, employing discriminative features which were …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:roLk4NBRz8UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Heart Time Series Classification with Support Vector Machine",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rigid image registration based on pixel grouping",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4362842/",
            "Abstract": "We propose a pixel similarity-based algorithm enabling accurate rigid registration between single and multimodal images. The method relies on the partitioning of a reference image by a Gaussian mixture model (GMM). This partition is then projected onto the image to be registered. The main idea is that a Gaussian component in the reference image corresponds to a Gaussian component in the image to be registered. If the images are correctly registered the total distance between the corresponding components is minimum. An advantage of the proposed method is that it may handle multidimensional (vector valued) images where histogram-based methods such as the widely used mutual information is not tractable due to the high dimension of the data. Also, experimental results indicate that, even in the case of images presenting low SNR, the proposed algorithm compares favorably to the histogram-based …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guiding optical flow estimation using superpixels",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6004871/",
            "Abstract": "In this paper, we show how the segmentation of an image into superpixels may be used as preprocessing paradigm to improve the accuracy of the optical flow estimation in an image sequence. Superpixels play the role of accurate support masks for the integration of the optical flow equation. We employ a variation of a recently proposed optical flow algorithm relying on local image properties that are taken into account only if the involved pixels belong to the same image segment. Experimental results show that the proposed optical flow estimation scheme significantly improves the accuracy of the estimated motion field with respect to other standard methods.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust maximum a posteriori image super-resolution",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Journal-of-Electronic-Imaging/volume-23/issue-4/043016/Robust-maximum-a-posteriori-image-super-resolution/10.1117/1.JEI.23.4.043016.short",
            "Abstract": "A global robust M-estimation scheme for maximum a posteriori (MAP) image super-resolution which efficiently addresses the presence of outliers in the low-resolution images is proposed. In iterative MAP image super-resolution, the objective function to be minimized involves the highly resolved image, a parameter controlling the step size of the iterative algorithm, and a parameter weighing the data fidelity term with respect to the smoothness term. Apart from the robust estimation of the high-resolution image, the contribution of the proposed method is twofold: (1) the robust computation of the regularization parameters controlling the relative strength of the prior with respect to the data fidelity term and (2) the robust estimation of the optimal step size in the update of the high-resolution image. Experimental results demonstrate that integrating these estimations into a robust framework leads to significant improvement in …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:pqnbT2bcN3wC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Age Classification from Facial Images: Is Frontalization Necessary?",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50835-1_69.pdf",
            "Abstract": "In the majority of the methods proposed for age classification from facial images, the preprocessing steps consist of alignment and illumination correction followed by the extraction of features, which are forwarded to a classifier to estimate the age group of the person in the image. In this work, we argue that face frontalization, which is the correction of the pitch, yaw, and roll angles of the headpose in the 3D space, should be an integral part of any such algorithm as it unveils more discriminative features. Specifically, we propose a method for age classification which integrates a frontalization algorithm before feature extraction. Numerical experiments on the widely used FGnet Aging Database confirmed the importance of face frontalization achieving an average increment in accuracy of 4.43%.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Watershed-based segmentation of cell nuclei boundaries in Pap smear images",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687745/",
            "Abstract": "In this work we present a fully automated method for the accurate detection of cell nuclei boundaries in conventional Pap smear images, based on the watershed transform. For the extraction of nuclei and cytoplasm markers, which are used as starting points for the flooding process, a morphological reconstruction step is initially performed in each image. The watershed transform is then applied in the color morphological gradient image, which shows the boundaries of the more pronounced nuclei. For the elimination of false positive findings, salient features of shape and intensity of the detected regions were calculated and a clustering step is performed. The method was evaluated with a data set of 19 images containing 3616 recognized cells nuclei. The performance of the method was evaluated in terms of the correct detection of the positions of the nuclei. Comparisons with the segmentation results of the gradient …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tomographic image reconstruction withaspatially varying Gaussian mixture prior",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7351557/",
            "Abstract": "A spatially varying Gaussian mixture model (SVGMM) prior is employed to ensure the preservation of region boundaries in penalized likelihood tomographic image reconstruction. Spatially varying Gaussian mixture models are characterized by the dependence of their mixing proportions on location (contextual mixing proportions) and they have been successfully used in image segmentation. The proposed model imposes a Student's t-distribution on the local differences of the contextual mixing proportions and its parameters are automatically estimated by a variational Expectation-Maximization (EM) algorithm. The tomographic reconstruction algorithm is an iterative process consisting of alternating between an optimization of the SVGMM parameters and an optimization for updating the unknown image using also the EM algorithm. Numerical experiments on various photon limited image scenarios show that the …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Information theory-based analysis of partial and total occlusion in object tracking",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1039949/",
            "Abstract": "Metrics based on mutual information and not resorting to ground truth data are proposed in this paper in order to measure tracking reliability under occlusion., The variations of the proposed metrics can be used as a quantitative estimate of changes in the tracking region, caused by occlusion, sudden movement or the deformation of the tracked object. The proposed metric was tested on an object tracking scheme using multiple feature point correspondences. Experimental results have shown that mutual information can effectively characterize object appearance and reappearance in many computer vision applications.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Accurate image registration for MAP image super-resolution",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0923596512002299",
            "Abstract": "The accuracy of image registration plays a dominant role in image super-resolution methods and in the related literature, landmark-based registration methods have gained increasing acceptance in this framework. In this work, we take advantage of a maximum a posteriori (MAP) scheme for image super-resolution in conjunction with the maximization of mutual information to improve image registration for super-resolution imaging. Local as well as global motion in the low-resolution images is considered. The overall scheme consists of two steps. At first, the low-resolution images are registered by establishing correspondences between image features. The second step is to fine-tune the registration parameters along with the high-resolution image estimation, using the maximization of mutual information criterion. Quantitative and qualitative results are reported indicating the effectiveness of the proposed scheme …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Alignment of serially acquired slices using a global energy function",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1017264/",
            "Abstract": "An accurate, computationally efficient and fully-automated algorithm for the alignment of 2D serially acquired sections forming a 3D volume is presented. The method accounts for the main shortcomings of 3D image alignment: corrupted data (cuts and tears), dissimilarities or discontinuities between slices, non parallel or missing slices. The approach relies on the optimization of a global energy function, based on the object shape, measuring the similarity between a slice and its neighborhood in the 3D volume. Slice similarity is computed using the distance transform measure in both directions. No particular direction is privileged in the method avoiding global offsets, biases in the estimation and error propagation. The method was evaluated on real images (medical and biological 3D data) and the experimental results demonstrated the method's accuracy as reconstruction errors are less than 1 degree in rotation and …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active privileged learning of human activities from weakly labeled samples",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7532917/",
            "Abstract": "In many human activity recognition systems the size of the unlabeled training data may be significantly large due to expensive human effort required for data annotation. Moreover, the insufficient data collection process from heterogenous sources may cause dissimilarities between training and testing data. To address these limitations, a novel probabilistic approach that combines learning using privileged information (LUPI) and active learning is proposed. A pool-based privileged active learning approach is presented for semi-supervising learning of human activities from multimodal labeled and unlabeled data. Both uncertainty and distance from the decision boundary are used as query inference strategies for selecting an unlabeled observation and querying its label. Experimental results in four publicly available datasets demonstrate that the proposed method can identify complex human activities with high …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Feature-based 3D morphing based on geometrically constrained spherical parameterization",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167839611001075",
            "Abstract": "Current trends in free form editing motivate the development of a novel editing paradigm for CAD models beyond traditional CAD editing of mechanical parts. To this end, we need robust and efficient 3D mesh deformation techniques such as 3D structural morphing.In this paper, we present a feature-based approach to 3D morphing of arbitrary genus-0 polyhedral objects that is appropriate for CAD editing. The technique is based on a sphere parameterization process built on an optimization technique that uses a target function to maintain the correspondence between the initial polygons and the mapped ones, while preserving topology and connectivity through a system of geometric constraints. Finally, we introduce a fully automated feature-based technique that matches surface areas (feature regions) with similar topological characteristics between the two morphed objects and performs morphing according to this …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:mVmsd5A6BfQC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Multiple Atlas Inference and Population Analysis Using Spectral Clustering",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5595771/",
            "Abstract": "In medical imaging, constructing an atlas and bringing an image set in a single common reference frame may easily lead the analysis to erroneous conclusions, especially when the population under study is heterogeneous. In this paper, we propose a framework based on spectral clustering that is capable of partitioning an image population into sets that require a separate atlas, and identifying the most suitable templates to be used as coordinate reference frames. The spectral analysis step relies on pairwise distances that express anatomical differences between subjects as a function of the diffeomorphic warp required to match the one subject onto the other, plus residual information. The methodology is validated numerically on artificial and medical imaging data.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identifying People in Images by Classification of Visual Attributes",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8537761/",
            "Abstract": "When we are interested in providing a description of an object or a human, we tend to use visual attributes to accomplish this task. For example, a laptop can have a wide screen, a silver color, and a brand logo, whereas a human can be tall, female, wearing a blue t-shirt and carrying a backpack. Visual attributes in computer vision are equivalent to the adjectives in our speech. We rely on visual attributes since (i) they enhance our understanding by creating an image in our head of what this object or human looks like; (ii) they narrow down the possible related results when we want to search for a product online or when we want to provide a suspect description; (iii) they can be composed in different ways to create descriptions; (iv) they generalize well as with some finetuning they can be applied to recognize objects for different tasks; and (v) they are a meaningful semantic representation of objects or humans that …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DETCIC: Detection of Elongated Touching Cells with Inhomogeneous Illumination using a Stack of Conditional Random Fields.",
            "Publication year": 2018,
            "Publication url": "https://pdfs.semanticscholar.org/2f6f/9d5d7d7a635eda6ebb286e7dde7e53fb2ec5.pdf",
            "Abstract": "Automated detection of touching cells in images with inhomogeneous illumination is a challenging problem. A detection framework using a stack of two conditional random fields is proposed to detect touching elongated cells in scanning electron microscopy images with inhomogeneous illumination. The first conditional random field employs shading information to segment the cells where the effect of inhomogeneous illumination is reduced. The second conditional random field estimates the cell walls using their estimated cell wall probability. The method is evaluated using a dataset of Clostridium difficile cells. Finally, the method is compared with two region-based cell detection methods, CellDetect and DeTEC, improving the F-score by at least 20%.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visual tracking using spatially weighted likelihood of Gaussian mixtures",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314215001563",
            "Abstract": "A probabilistic real time tracking algorithm is proposed where the target’s feature distribution is represented by a Gaussian mixture model (GMM). The target localization is achieved by maximizing its weighted likelihood in the image sequence. The role of the weight in the likelihood definition is important as it allows gradient based optimization to be performed, which would not be feasible in a context of standard likelihood representations. Moreover, the algorithm handles scale and rotation changes of the target, as well as appearance changes, which modifies the components of the GMM. The real time performance is experimentally confirmed, while the algorithms has comparative performance with other state-of-the-art tracking algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:u_35RYKgDlwC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Probabilistic multiple face detection and tracking using entropy measures",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1262039/",
            "Abstract": "A joint probabilistic face detection and tracking algorithm, combining likelihood estimation and a prior probability, is proposed. The likelihood estimation scheme is based on the statistical training of sets of automatically generated feature points and a mutual information tracking cue, while the prior probability estimation is based on a Gaussian temporal model. The likelihood estimation process is the core of a multiple face detection scheme used to initialize the tracking process. The resulting system has been tested on real image sequences and is robust to significant partial occlusion and illumination changes.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast and efficient vanishing point detection in indoor images",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6460856/",
            "Abstract": "A method for detecting a vanishing point in structured images is presented. The method relies on the detection of line segments from an edge map by representing clusters of edge points by the long axes of highly eccentric ellipses. The extracted lines provide a set of candidate vanishing points computed by their intersections, which are assigned weights proportional to the lengths of the line segments they belong to. Then, a voting scheme is applied through an accumulator array generated by griding the image frame. The votes of each grid cell are weighted by the Π-sigmoid kernel allowing cells to contribute to their neighbors.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nuclei Detection Using Residual Attention Feature Pyramid Networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8941655/",
            "Abstract": "Detection of cell nuclei in microscopy images is a challenging research topic due to limitations in acquired image quality as well as due to the diversity of nuclear morphology. This has been a topic of enduring interest with promising success shown by deep learning methods. Recently, attention gating methods have been proposed and employed successfully in a diverse array of pattern recognition tasks. In this work, we introduce a novel attention module and integrate it with feature pyramid networks and the state-of-the-art Mask R-CNN network. We show with numerical experiments that the proposed model outperforms the state-of-the-art baseline.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wind: Wasserstein inception distance for evaluating generative adversarial network performance",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9053325/",
            "Abstract": "In this paper, we present Wasserstein Inception Distance (WInD), a novel metric for evaluating performance of Generative Adversarial Networks (GANs). The proposed metric extends on the rationale of the previously proposed Frechet Inception Distance (FID), in the sense that GAN performance is quantified in terms of data and model distribution divergence. We extend FID by relaxing the Gaussian hypothesis of the related inception features and extend it for non-Gaussian, multimodal distributions. Gaussian Mixture Models (GMMs) are used to model data and model inception features, and the Wasserstein distance is employed as a pdf matching metric. We show that the proposed WInD metric inherits the desirable features of FID and correlates well with actual GAN performance. Furthermore, WInD can correctly evaluate cases were data and model distribution erroneously would appear as well peforming using FID …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image Analysis PCA and Eigenfaces",
            "Publication year": 2003,
            "Publication url": "http://www.cs.uoi.gr/~cnikou/Courses/Image_Analysis/2011-2012/10_PCA_and_Eigenfaces_6spp.pdf",
            "Abstract": "Image Analysis PCA and Eigenfaces Face detection and recognition Face detection and \nrecognition Consumer application: iPhoto 200 Page 1 1 Image Analysis PCA and Eigenfaces \nUniversity of Ioannina - Department of Computer Science Christophoros Nikou cnikou@cs.uoi.gr \nImages taken from: D. Forsyth and J. Ponce. Computer Vision: A Modern Approach, Prentice Hall, \n2003. Computer Vision course by Svetlana Lazebnik, University of North Carolina at Chapel Hill. \nComputer Vision course by Michael Black, Brown University. Research page of Antonio Torralba, \nMIT. 2 Face detection and recognition C. Nikou – Image Analysis (T-14) 3 Face detection \nand recognition C. Nikou – Image Analysis (T-14) Detection Recognition “Sally” 4 Consumer \napplication: iPhoto 2009 C. Nikou – Image Analysis (T-14) http://www.apple.com/ilife/iphoto/ \n5 Consumer application: iPhoto 2009 It can be trained to recognize pets! C. – (-…",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A class-adaptive spatially variant mixture model for image segmentation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4130435/",
            "Abstract": "We propose a new approach for image segmentation based on a hierarchical and spatially variant mixture model. According to this model, the pixel labels are random variables and a smoothness prior is imposed on them. The main novelty of this work is a new family of smoothness priors for the label probabilities in spatially variant mixture models. These Gauss-Markov random field-based priors allow all their parameters to be estimated in closed form via the maximum a posteriori (MAP) estimation using the expectation-maximization methodology. Thus, it is possible to introduce priors with multiple parameters that adapt to different aspects of the data. Numerical experiments are presented where the proposed MAP algorithms were tested in various image segmentation scenarios. These experiments demonstrate that the proposed segmentation scheme compares favorably to both standard and previous spatially …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey of document image word spotting techniques",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320317300870",
            "Abstract": "Vast collections of documents available in image format need to be indexed for information retrieval purposes. In this framework, word spotting is an alternative solution to optical character recognition (OCR), which is rather inefficient for recognizing text of degraded quality and unknown fonts usually appearing in printed text, or writing style variations in handwritten documents. Over the past decade there has been a growing interest in addressing document indexing using word spotting which is reflected by the continuously increasing number of approaches. However, there exist very few comprehensive studies which analyze the various aspects of a word spotting system. This work aims to review the recent approaches as well as fill the gaps in several topics with respect to the related works. The nature of texts and inherent challenges addressed by word spotting methods are thoroughly examined. After presenting …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:SP6oXDckpogC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Solving SVM, SVM+, SVR and SVR+ using Quadratic Programming",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=15402107033411560591&hl=en&oi=scholarr",
            "Abstract": "This tutorial along with the code provided were used for the “Predicting Privileged Information for Height Estimation” publication [1]. To create this tutorial we used the work of Vapnik and Vashist [2] which introduces the LUPI paradigm and contains the dual formulation in all cases discussed below, the tutorial on Support Vector Regression of Smola and Schölkopf [3] and the study on SMO-type decomposition of Chen et al.[4]. If you found this tutorial useful please cite accordingly.For the implementation part we used the CVXOPT 1 Python package for convex optimization. The quadrprog function in MATLAB can be used as well. For simplification, throughout the tutorial MATLAB notation is followed and thus,[a; b] refers to the concatenation of vectors,.* refers to element-wise multiplication. Functions such as eye, ones, zeros and repmat are used accordingly.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Salient Object Detection with Pretrained Deeplab and k-Means: Application to UAV-Captured Building Imagery",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68787-8_35",
            "Abstract": "We present a simple technique that can convert a pretrained segmentation neural network to a salient object detector. We show that the pretrained network can be agnostic to the semantic class of the object of interest, and no further training is required. Experiments were run on UAV-captured aerial imagery of the “smart home” structure located in the premises of the CERTH research center. Further experiments were also run on natural scenes. Our tests validate the usefulness of the proposed technique.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Visual tracking using the Earth Mover's Distance between Gaussian mixtures and Kalman filtering",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885610001587",
            "Abstract": "In this paper, we demonstrate how the differential Earth Mover's Distance (EMD) may be used for visual tracking in synergy with Gaussian mixtures models (GMM). According to our model, motion between adjacent frames results in variations of the mixing proportions of the Gaussian components representing the object to be tracked. These variations are computed in closed form by minimizing the differential EMD between Gaussian mixtures, yielding a very fast algorithm with high accuracy, without recurring to the EM algorithm in each frame. Moreover, we also propose a framework to handle occlusions, where the prediction for the object's location is forwarded to an adaptive Kalman filter whose parameters are estimated on line by the motion model already observed. Experimental results show significant improvement in tracking performance in the presence of occlusion.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Heartbeat time series classification with support vector machines",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4588343/",
            "Abstract": "In this study, heartbeat time series are classified using support vector machines (SVMs). Statistical methods and signal analysis techniques are used to extract features from the signals. The SVM classifier is favorably compared to other neural network-based classification approaches by performing leave-one-out cross validation. The performance of the SVM with respect to other state-of-the-art classifiers is also confirmed by the classification of signals presenting very low signal-to-noise ratio. Finally, the influence of the number of features to the classification rate was also investigated for two real datasets. The first dataset consists of long-term ECG recordings of young and elderly healthy subjects. The second dataset consists of long-term ECG recordings of normal subjects and subjects suffering from coronary artery disease.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Matching mixtures of curves for human action recognition",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314213002270",
            "Abstract": "A learning-based framework for action representation and recognition relying on the description of an action by time series of optical flow motion features is presented. In the learning step, the motion curves representing each action are clustered using Gaussian mixture modeling (GMM). In the recognition step, the optical flow curves of a probe sequence are also clustered using a GMM, then each probe sequence is projected onto the training space and the probe curves are matched to the learned curves using a non-metric similarity function based on the longest common subsequence, which is robust to noise and provides an intuitive notion of similarity between curves. Alignment between the mean curves is performed using canonical time warping. Finally, the probe sequence is categorized to the learned action with the maximum similarity using a nearest neighbor classification scheme. We also present a variant …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Action Recognition by Matching Clustered Trajectories of Motion Vectors.",
            "Publication year": 2013,
            "Publication url": "https://www.scitepress.org/Papers/2013/42779/42779.pdf",
            "Abstract": "A framework for action representation and recognition based on the description of an action by time series of optical flow motion features is presented. In the learning step, the motion curves representing each action are clustered using Gaussian mixture modeling (GMM). In the recognition step, the optical flow curves of a probe sequence are also clustered using a GMM and the probe curves are matched to the learned curves using a non-metric similarity function based on the longest common subsequence which is robust to noise and provides an intuitive notion of similarity between trajectories. Finally, the probe sequence is categorized to the learned action with the maximum similarity using a nearest neighbor classification scheme. Experimental results on common action databases demonstrate the effectiveness of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Splitting of overlapping nuclei guided by robust combinations of concavity points",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9034/903431/Splitting-of-overlapping-nuclei-guided-by-robust-combinations-of-concavity/10.1117/12.2036255.short",
            "Abstract": "In this work, we propose a novel and robust method for the accurate separation of elliptical overlapped nuclei in microscopic images. The method is based on both the information provided by the global boundary of the nuclei cluster and the detection of concavity points along this boundary. The number of the nuclei and the area of each nucleus included in the cluster are estimated automatically by exploiting the different parts of the cluster boundary demarcated by the concavity points. More specifically, based on the set of concavity points detected in the image of the clustered nuclei, all the possible configurations of candidate ellipses that fit to them are estimated by least squares fitting. For each configuration, an index measuring the fitting residual is computed and the configuration providing the minimum error is selected. The method may successfully separate multiple (more than two) clustered nuclei as the fitting …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:2P1L_qKh6hAC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "The mixtures of Student’s t-distributions as a robust framework for rigid registration",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885608002473",
            "Abstract": "The problem of registering images or point sets is addressed. At first, a pixel similarity-based algorithm for the rigid registration between single and multimodal images is presented. The images may present dissimilarities due to noise, missing data or outlying measures. The method relies on the partitioning of a reference image by a Student’s t-mixture model (SMM). This partition is then projected onto the image to be registered. The main idea is that a t-component in the reference image corresponds to a t-component in the image to be registered. If the images are correctly registered the distances between the corresponding components is minimized. Moreover, the extension of the method to the registration of point clouds is also proposed. The use of SMM components is justified by the property that they have heavier tails than standard Gaussians, thus providing robustness to outliers. Experimental results indicate …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:Se3iqnhoufwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Robust Image Segmentation with Mixtures of Student's t-Distributions. Image Processing, 2007. ICIP 2007",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=13613417447108835120&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MAP tomographic reconstruction with a spatially adaptive hierarchical image model",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8081469/",
            "Abstract": "A method for penalized likelihood tomographic reconstruction is presented which is based on a spatially adaptive stochastic image model. The model imposes onto the image a smoothing Gaussian prior whose parameters follow a Gamma distribution. Three variations of the model are examined: (i) a stationary model, where the Gamma distribution has the same constant parameter for the entire image, (ii) a non stationary model, where this parameter varies with respect to location and (iii) a non stationary directional model where the parameter varies also with respect to orientation (horizontal or vertical direction). In all cases, the MAP criterion provides a closed form solution for both the unknown image and the parameters of the model. Numerical experiments showed that the reconstructions obtained using the proposed image priors outperform the state of the art EM based methods.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Visual tracking by adaptive Kalman filtering and mean shift",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_19",
            "Abstract": "A method for object tracking combining the accuracy of mean shift with the robustness to occlusion of Kalman filtering is proposed. At first, an estimation of the object’s position is obtained by the mean shift tracking algorithm and it is treated as the observation for a Kalman filter. Moreover, we propose a dynamic scheme for the Kalman filter as the elements of its state matrix are updated on-line depending on a measure evaluating the quality of the observation. According to this measure, if the target is not occluded the observation contributes to the update equations of the Kalman filter state matrix. Otherwise, the observation is not taken into consideration. Experimental results show significant improvement with respect to the standard mean shift method both in terms of accuracy and execution time.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Motion segmentation by model-based clustering of incomplete trajectories",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-23783-6_10",
            "Abstract": "In this paper, we present a framework for visual object tracking based on clustering trajectories of image key points extracted from a video. The main contribution of our method is that the trajectories are automatically extracted from the video sequence and they are provided directly to a model-based clustering approach. In most other methodologies, the latter constitutes a difficult part since the resulting feature trajectories have a short duration, as the key points disappear and reappear due to occlusion, illumination, viewpoint changes and noise. We present here a sparse, translation invariant regression mixture model for clustering trajectories of variable length. The overall scheme is converted into a Maximum A Posteriori approach, where the Expectation-Maximization (EM) algorithm is used for estimating the model parameters. The proposed method detects the different objects in the input image sequence …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "3D volume reconstruction by serially acquired 2D slices using a distance transform-based global cost function",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_35",
            "Abstract": "An accurate, computationally efficient and fully-automated algorithm for the alignment of 2D serially acquired sections forming a 3D volume is presented. The method accounts for the main shortcomings of 3D image alignment: corrupted data (cuts and tears), dissimilarities or discontinuities between slices, missing slices. The approach relies on the optimization of a global energy function, based on the object shape, measuring the similarity between a slice and its neighborhood in the 3D volume. Slice similarity is computed using the distance transform measure in both directions. No particular direction is privileged in the method avoiding global offsets, biases in the estimation and error propagation. The method was evaluated on real images (medical, biological and other CT scanned 3D data) and the experimental results demonstrated the method’s accuracy as reconstruction errors are less than 1 degree in …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Entropy-based metrics for the analysis of partial and total occlusion in video object tracking",
            "Publication year": 2004,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-vis_20040738",
            "Abstract": "Metrics measuring tracking reliability under occlusion that are based on mutual information and do not resort to ground truth data are proposed. Metrics for both the initialisation of the region to be tracked as well as for measuring the performance of the tracking algorithm are presented. The metrics variations may be interpreted as a quantitative estimate of changes in the tracking region due to occlusion, sudden movement or deformation of the tracked object. Performance metrics based on the Kullback–Leibler distance and normalised correlation were also added for comparison purposes. The proposed approach was tested on an object tracking scheme using multiple feature point correspondences. Experimental results have shown that mutual information can effectively characterise object appearance and reappearance in many computer vision applications.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Registering sets of points using Bayesian regression",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231212001634",
            "Abstract": "This work addresses the problem of non-rigid registration between two 2D or 3D points sets as a novel application of Relevance Vector Machines (RVM). An iterative framework is proposed which consists of two steps: at first, correspondences between distinct points are estimated by the Hungarian algorithm and then a regression procedure based on a Bayesian linear model (RVM) maps the two sets of points. By these means, a large variety of transformation is captured without imposing any prior knowledge on the form of the point sets. The proposed algorithm provides a smooth transformation even if the correspondence between the points in the two sets contains erroneous matches. The algorithm was successfully evaluated on sets of points with varying difficulty and favorably compared with state-of-the-art methods in cases of noise.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Robust image segmentation with mixtures of Student's t-distributions",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4378944/",
            "Abstract": "Gaussian mixture models have been widely used in image segmentation. However, such models are sensitive to outliers. In this paper, we consider a robust model for image segmentation based on mixtures of Student's  t -distributions which have heavier tails than Gaussian and thus are not sensitive to outliers. The  t -distribution is one of the few heavy tailed probability density functions (pdf) closely related to the Gaussian, that gives tractable maximum likelihood inference via the Expectation-Maximization (EM) algorithm. Numerical experiments that demonstrate the properties of the proposed model for image segmentation are presented.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nikou C, Heitz F, Nehlig A, Namer I, Armspach JA robust statistics-based global energy function for the alignment of serially...",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/50949972/Nikou_C_Heitz_F_Nehlig_A_Namer_I_Armspac20161218-22330-oywdy9.pdf",
            "Abstract": "Autoradiographic analysis of the functional changes occurring in the rat brain are most often performed on coronal sections that allow a good insight into the events occurring at the structural level but lacks the 3D context which is necessary to fully understand the involvement of the brain structures in specific situations like focal seizures with or without generalization. Therefore a robust, fully-automated algorithm for the registration of serially acquired autoradiographic sections is presented. The method accounts for the main difficulties of autoradiographic alignment: corrupted data (cuts and tears), dissimilarities or discontinuities between slices, non parallel or missing slices. The approach relies on the minimization of a global energy function based on robust statistics. The energy function measures the similarity between a slice and its neighborhood in the 3D volume. No particular direction is privileged in the method, so that global offsets, biases in the estimation or error propagations are avoided. The method is evaluated qualitatively and quantitatively on real autoradiographic data. Rat brain autoradiographic volumes are reconstructed with registration errors less than 1 degree in rotation and less than 1 pixel in translation.© 2003 Elsevier Science BV All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting privileged information for facial expression recognition",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7550048/",
            "Abstract": "Most of the facial expression recognition methods consider that both training and testing data are equally distributed. As facial image sequences may contain information for heterogeneous sources, facial data may be asymmetrically distributed between training and testing, as it may be difficult to maintain the same quality and quantity of information. In this work, we present a novel classification method based on the learning using privileged information (LUPI) paradigm to address the problem of facial expression recognition. We introduce a probabilistic classification approach based on conditional random fields (CRFs) to indirectly propagate knowledge from privileged to regular feature space. Each feature space owns specific parameter settings, which are combined together through a Gaussian prior, to train the proposed t-CRF+ model and allow the different tasks to share parameters and improve classification …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A probabilistic formulation of the optical flow problem",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6460244/",
            "Abstract": "The Horn-Schunck (HS) optical flow method is widely employed to initialize many motion estimation algorithms. In this work, a variational Bayesian approach of the HS method is presented where the motion vectors are considered to be spatially varying Student's t-distributed unobserved random variables and the only observation available is the temporal image difference. The proposed model takes into account the residual resulting from the linearization of the brightness constancy constraint by Taylor series approximation, which is also assumed to be a spatially varying Student's t-distributed observation noise. To infer the model variables and parameters we recur to variational inference methodology leading to an expectation-maximization (EM) framework in a principled probabilistic framework where all of the model parameters are estimated automatically from the data.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A physically-based statistical deformable model for brain image analysis",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45053-X_34",
            "Abstract": "A probabilistic deformable model for the representation of brain structures is described. The statistically learned deformable model represents the relative location of head (skull and scalp) and brain surfaces in Magnetic Resonance Images (MRIs) and accommodates their significant variability across different individuals. The head and brain surfaces of each volume are parameterized by the amplitudes of the vibration modes of a deformable spherical mesh. For a given MRI in the training set, a vector containing the largest vibration modes describing the head and the brain is created. This random vector is statistically constrained by retaining the most significant variation modes of its Karhunen-Loeve expansion on the training population. By these means, the conjunction of surfaces are deformed according to the anatomical variability observed in the training set. Two applications of the probabilistic …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Robust incremental hidden conditional random fields for human action recognition",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-03801-4_12",
            "Abstract": "Hidden conditional random fields (HCRFs) are a powerful supervised classification system, which is able to capture the intrinsic motion patterns of a human action. However, finding the optimal number of hidden states remains a severe limitation for this model. This paper addresses this limitation by proposing a new model, called robust incremental hidden conditional random field (RI-HCRF). A hidden Markov model (HMM) is created for each observation paired with an action label and its parameters are defined by the potentials of the original HCRF graph. Starting from an initial number of hidden states and increasing their number incrementally, the Viterbi path is computed for each HMM. The method seeks for a sequence of hidden states, where each variable participates in a maximum number of optimal paths. Thereby, variables with low participation in optimal paths are rejected. In addition, a robust …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Curriculum learning for multi-task classification of visual attributes",
            "Publication year": 2017,
            "Publication url": "https://openaccess.thecvf.com/content_ICCV_2017_workshops/w38/html/Sarafianos_Curriculum_Learning_for_ICCV_2017_paper.html",
            "Abstract": "Visual attributes, from simple objects to soft-biometrics have proven to be a powerful representational approach for many applications such as image description and human identification. In this paper, we introduce a novel method to combine the advantages of both multi-task and curriculum learning in a visual attribute classification framework. Individual tasks are grouped based on their correlation so that two groups of strongly and weakly correlated tasks are formed. The two groups of tasks are learned in a curriculum learning setup by transferring the acquired knowledge from the strongly to the weakly correlated. The learning process within each group is performed in a multitask classification setup. The proposed method learns better and converges faster than learning all the tasks in a typical multi-task learning paradigm. We demonstrate the effectiveness of our approach on the publicly available, SoBiR, VIPeR and PETA datasets and report state-of-the-art results across the board.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Images of the Athenian Sun: Highlights From ICIP 2018 in Greece [Conference Highlights]",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8700670/",
            "Abstract": "104 IEEE SIgnal ProcESSIng MagazInE| May 2019| enjoyed a fine technical program, put together with the help of an outstanding technical program committee. The program included nine tutorials and five special sessions, which focused on emerging research areas. The technical program comprised 127 sessions arranged in thematic streams to avoid thematic overlaps and allow audience members to attend more sessions in their areas of interest. Sessions were very well attended, despite the competition from the food buffet, which remained well stocked throughout the conference. The conference offered three plenary talks on topics of great interest to our community, covering both academic and industrial trends. The plenary talks, enthusiastically received by ICIP attendees, were given by prominent scientists.■ C.-C. Jay Kuo, from the University of Southern California, shed light on the underlying operational …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identifying human behaviors using synchronized audio-visual cues",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7350122/",
            "Abstract": "In this paper, a human behavior recognition method using multimodal features is presented. We focus on modeling individual and social behaviors of a subject (e.g., friendly/aggressive or hugging/kissing behaviors) with a hidden conditional random field (HCRF) in a supervised framework. Each video is represented by a vector of spatio-temporal visual features (STIP, head orientation and proxemic features) along with audio features (MFCCs). We propose a feature pruning method for removing irrelevant and redundant features based on the spatio-temporal neighborhood of each feature in a video sequence. The proposed framework assumes that human movements are highly correlated with sound emissions. For this reason, canonical correlation analysis (CCA) is employed to find correlation between the audio and video features prior to fusion. The experimental results, performed in two human behavior …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ISING-GAN: annotated data augmentation with a spatially constrained generative adversarial network",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9098618/",
            "Abstract": "Data augmentation is a popular technique with which new dataset samples are artificially synthesized to the end of assisting training of learning-based algorithms and avoiding overfitting. Methods based on generative adversarial networks (GANs) have recently rekindled interest in research on new techniques for data augmentation. With the current paper we propose a new GAN-based model for data augmentation, comprising a suitable Markov random field-based spatial constraint that encourages synthesis of spatially smooth outputs. Oriented towards use with medical imaging sets where a localization/segmentation annotation is available, our model can simultaneously also produce artificial annotations. We gauge performance numerically by measuring performance through U-Net trained to detect cells on microscopy images, by taking into account the produced augmented dataset. Numerical trials, as well as …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A review of human activity recognition methods",
            "Publication year": 2015,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/frobt.2015.00028/full",
            "Abstract": "Recognizing human activities from video sequences or still images is a challenging task due to problems such as background clutter, partial occlusion, changes in scale, viewpoint, lighting, and appearance. Many applications, including video surveillance systems, human-computer interaction, and robotics for human behavior characterization, require a multiple activity recognition system. In this work, we provide a detailed review of recent and state-of-the-art research advances in the field of human activity classification. We propose a categorization of human activity methodologies and discuss their advantages and limitations. In particular, we divide human activity classification methods into two large categories according to whether they use data from different modalities or not. Then, each of these categories is further analyzed into sub-categories, which reflect how they model human activities and what type of activities they are interested in. Moreover, we provide a comprehensive analysis of the existing, publicly available human activity classification datasets and examine the requirements for an ideal human activity recognition dataset. Finally, we report the characteristics of future research directions and present some open issues on human activity recognition.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:_xSYboBqXhAC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Joint recovery and segmentation of polarimetric images using a compound mrf and mixture modeling",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5413970/",
            "Abstract": "We propose a new approach for the restoration of polarimetric Stokes images, capable of simultaneously segmenting and restoring the images. In order to easily handle the admissibility constraints inherent to Stokes images, a proper transformation of the images is introduced. This transformation exploits the correspondence between any Stokes vector and the covariance matrix of the two components of the electric vector of the light wave. A Bayesian model based on a mixture of Gaussian kernels is used for the transformed images. Inference is achieved using the EM framework. To quantify the performances of this approach, the algorithm is tested with both synthetic and real data. We note that the pixels of the restored Stokes images issued from our approach are always physically admissible which is not the case for the nai¿ve pseudo-inverse approach.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spatially varying mixtures incorporating line processes for image segmentation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s10851-009-0174-x",
            "Abstract": "Spatially varying mixture models are characterized by the dependence of their mixing proportions on location (contextual mixing proportions) and they have been widely used in image segmentation. In this work, Gauss-Markov random field (MRF) priors are employed along with spatially varying mixture models to ensure the preservation of region boundaries in image segmentation. To preserve region boundaries, two distinct models for a line process involved in the MRF prior are proposed. The first model considers edge preservation by imposing a Bernoulli prior on the normally distributed local differences of the contextual mixing proportions. It is a discrete line process model whose parameters are computed by variational inference. The second model imposes Gamma prior on the Student’s-t distributed local differences of the contextual mixing proportions. It is a continuous line process whose parameters …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Quaternion Generative Adversarial Networks for Inscription Detection in Byzantine Monuments",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68787-8_12",
            "Abstract": "In this work, we introduce and discuss Quaternion Generative Adversarial Networks, a variant of generative adversarial networks that uses quaternion-valued inputs, weights and intermediate network representations. Quaternionic representation has the advantage of treating cross-channel information carried by multichannel signals (e.g. color images) holistically, while quaternionic convolution has been shown to be less resource-demanding. Standard convolutional and deconvolutional layers are replaced by their quaternionic variants, in both generator and discriminator nets, while activations and loss functions are adapted accordingly. We have succesfully tested the model on the task of detecting byzantine inscriptions in the wild, where the proposed model is on par with a vanilla conditional generative adversarial network, but is significantly less expensive in terms of model size (requires  less …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A split-and-merge framework for 2D shape summarization",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6046607/",
            "Abstract": "An algorithm for the representation and summarization of a 2D shape is presented. The shape points are modeled by ellipses with very high eccentricity in order to summarize the contour of the shape by the major axes of these elongated ellipses. To this end, at first, a single ellipse is fitted to the shape which is then iteratively split to a large number of highly eccentric ellipses to cover the shape points. Then, a merge process follows in order to combine neighboring ellipses with collinear major axes to reduce the complexity of the model. Experimental results showed that the proposed algorithm provides a shape summary which not only overcomes the representation of a shape by a Gaussian mixture model but also is largely more accurate with respect to the progressive probabilistic Hough transform for shape representation. It must be noted that, for our method, a shape is a unordered set of points describing the …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variational-Bayes optical flow",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s10851-014-0494-3",
            "Abstract": "The Horn-Schunck (HS) optical flow method is widely employed to initialize many motion estimation algorithms. In this work, a variational Bayesian approach of the HS method is presented, where the motion vectors are considered to be spatially varying Student’s t-distributed unobserved random variables, i.e., the prior is a multivariate Student’s t-distribution, while the only observations available is the temporal and spatial image difference. The proposed model takes into account the residual resulting from the linearization of the brightness constancy constraint by Taylor series approximation, which is also assumed to be a spatially varying Student’s t-distributed observation noise. To infer the model variables and parameters we recur to variational inference methodology leading to an expectation-maximization (EM) framework with update equations analogous to the Horn-Schunck approach. This is …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Edge preserving spatially varying mixtures for image segmentation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4587416/",
            "Abstract": "A new hierarchical Bayesian model is proposed for image segmentation based on Gaussian mixture models (GMM) with a prior enforcing spatial smoothness. According to this prior, the local differences of the contextual mixing proportions (i.e. the probabilities of class labels) are Studentpsilas t-distributed. The generative properties of the Student's t-pdf allow this prior to impose smoothness and simultaneously model the edges between the segments of the image. A maximum a posteriori (MAP) expectation-maximization (EM) based algorithm is used for Bayesian inference. An important feature of this algorithm is that all the parameters are automatically estimated from the data in closed form. Numerical experiments are presented that demonstrate the superiority of the proposed model for image segmentation as compared to standard GMM-based approaches and to GMM segmentation techniques with …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical similarity transformations between Gaussian mixtures",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6549112/",
            "Abstract": "In this paper, we propose a method to estimate the density of a data space represented by a geometric transformation of an initial Gaussian mixture model. The geometric transformation is hierarchical, and it is decomposed into two steps. At first, the initial model is assumed to undergo a global similarity transformation modeled by translation, rotation, and scaling of the model components. Then, to increase the degrees of freedom of the model and allow it to capture fine data structures, each individual mixture component may be transformed by another, local similarity transformation, whose parameters are distinct for each component of the mixture. In addition, to constrain the order of magnitude of the local transformation (LT) with respect to the global transformation (GT), zero-mean Gaussian priors are imposed onto the local parameters. The estimation of both GT and LT parameters is obtained through the …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Majorization-minimization mixture model determination in image segmentation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5995349/",
            "Abstract": "A new Bayesian model for image segmentation based on a Gaussian mixture model is proposed. The model structure allows the automatic determination of the number of segments while ensuring spatial smoothness of the final output. This is achieved by defining two separate mixture weight sets: the first set of weights is spatially variant and incorporates an MRF edge-preserving smoothing prior; the second set of weights is governed by a Dirichlet prior in order to prune unnecessary mixture components. The model is trained using variational inference and the Majorization-Minimization (MM) algorithm, resulting in closed-form parameter updates. The algorithm was successfully evaluated in terms of various segmentation indices using the Berkeley image data base.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Show me your body: Gender classification from still images",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7532941/",
            "Abstract": "In this work, we investigate the problem of predicting gender from still images using human metrology. Since the values of the anthropometric measurements are difficult to be estimated accurately from state-of-the-art computer vision algorithms, ratios of anthropometric measurements were used as features. Additionally, since several measurements will not be available at test time in a real-life scenario, we opted for the Learning Using Privileged Information (LUPI) paradigm. During training, we used as features, ratios from all the available anthropometric measurements, whereas at test time only ratios of measurable (i.e., observable) quantities were used. We show that by using the LUPI framework, the estimation of soft biometric characteristics such as gender is possible. Gender classification from human metrology is also tested on real images with promising results.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robustness of support vector machine-based classification of heart rate signals",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4462216/",
            "Abstract": "In this study, we discuss the use of support vector machine (SVM) learning to classify heart rate signals. Each signal is represented by an attribute vector containing a set of statistical measures for the respective signal. At first, the SVM classifier is trained by data (attribute vectors) with known ground truth. Then, the classifier learnt parameters can be used for the categorization of new signals not belonging to the training set. We have experimented with both real and artificial signals and the SVM classifier performs very well even with signals exhibiting very low signal to noise ratio which is not the case for other standard methods proposed by the literature",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An information theoretic approach to joint probabilistic face detection and tracking",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1038071/",
            "Abstract": "A joint probabilistic face detection and tracking algorithm for combining a likelihood estimation and a prior probability is proposed. Face tracking is achieved by a Bayesian framework. The likelihood estimation scheme is based on statistical training of sets of automatically generated feature points, while the prior probability estimation is based on the fusion of an information theoretic tracking cue and a Gaussian temporal model. The likelihood estimation process is the cone of a multiple face detection scheme used to initialize the tracking process. The resulting system was tested on real image sequences and is robust to significant partial occlusion and illumination changes.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust Image Registration using Mixtures of t-distributions",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4409127/",
            "Abstract": "We propose a pixel similarity-based algorithm enabling accurate rigid registration between single and multimodal images presenting gross dissimilarities due to noise, missing data or outlying measures. The method relies on the partitioning of a reference image by a Student's t-mixture model (SMM). This partition is then projected onto the image to be registered. The main idea is that a t-component in the reference image corresponds to a t-component in the image to be registered. If the images are correctly registered the weighted sum of distances between the corresponding components is minimized. The use of SMM components is justified by the property that they have heavier tails than standard Gaussians, thus providing robustness to outliers. Experimental results indicate that, even in the case of images presenting low SNR or important amount of dissimilarities due to temporal changes, the proposed algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A robust statistics-based global energy function for the alignment of serially acquired autoradiographic sections",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027002003692",
            "Abstract": "Autoradiographic analysis of the functional changes occurring in the rat brain are most often performed on coronal sections that allow a good insight into the events occurring at the structural level but lacks the 3D context which is necessary to fully understand the involvement of the brain structures in specific situations like focal seizures with or without generalization. Therefore a robust, fully-automated algorithm for the registration of serially acquired autoradiographic sections is presented. The method accounts for the main difficulties of autoradiographic alignment: corrupted data (cuts and tears), dissimilarities or discontinuities between slices, non parallel or missing slices. The approach relies on the minimization of a global energy function based on robust statistics. The energy function measures the similarity between a slice and its neighborhood in the 3D volume. No particular direction is privileged in the method …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Modeling sets of unordered points using highly eccentric ellipses",
            "Publication year": 2014,
            "Publication url": "https://asp-eurasipjournals.springeropen.com/articles/10.1186/1687-6180-2014-11",
            "Abstract": "An algorithm for modeling a set of unordered two-dimensional points by line segments is presented. The points are modeled by highly eccentric ellipses, and line segments are extracted by the major axes of these elongated ellipses. At first, a single ellipse is fitted to points which is then iteratively split to a large number of highly eccentric ellipses to cover the set of points. Then, a merge process follows in order to combine neighboring ellipses with almost collinear major axes to reduce the complexity of the model. Experimental results on various databases show that the proposed scheme is an efficient technique for modeling unordered sets of points and shapes by line segments. A computer vision application of the method is also presented regarding the detection of retinal fundus image features, such as end-points, junctions, and crossovers.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:70eg2SAEIzsC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "A novel framework for motion segmentation and tracking by clustering incomplete trajectories",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314212001063",
            "Abstract": "In this paper, we present a framework for visual object tracking based on clustering trajectories of image key points extracted from an image sequence. The main contribution of our method is that the trajectories are automatically extracted from the image sequence and they are provided directly to a model-based clustering approach. In most other methodologies, the latter constitutes a difficult part since the resulting feature trajectories have a short duration, as the key points disappear and reappear due to occlusion, illumination, viewpoint changes and noise. We present here a sparse, translation invariant regression mixture model for clustering trajectories of variable length. The overall scheme is converted into a maximum a posteriori approach, where the Expectation–Maximization (EM) algorithm is used for estimating the model parameters. The proposed method detects the different objects in the input image …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:HDshCWvjkbEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "SIPAKMED: A new dataset for feature and image based classification of normal and pathological cervical cells in Pap smear images",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451588/",
            "Abstract": "Classification of cervical cells in Pap smear images is a challenging task due to the limitations these images exhibit and the complexity of the morphological changes in the structural parts of the cells. This procedure is very important as it provides fundamental information for the detection of cancerous or precancerous lesions. For this reason several algorithms have been proposed in order to classify normal and abnormal cells in such images. However, it is a common phenomenon that each research group usually creates its own dataset of images, as well-established datasets are not publicly available. To overcome this obstacle and to assist the research progress in this field, we present an annotated image database of Pap smear images, in which the cells are categorized in five different classes, depending on their cytomorphological features. The area of the cytoplasm and the nucleus in each image is manually …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Construction of a 3D physically-based multi-object deformable model",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/900946/",
            "Abstract": "This paper addresses the problem of describing the significant intra- and inter-variability of 3D deformable structures within 3D image data sets. In pursuing it, a 3D probabilistic physically based deformable model is defined. The statistically learned deformable model captures the spatial relationships between the different objects surfaces, together with their shape variations. The structures of interest in each volume are parameterized by the amplitudes of the vibration modes of a deformable spherical mesh. For a given 3D image in the training set, a vector containing the largest vibration modes describing the desired object is created. This random vector is statistically constrained by retaining the most significant variation modes of its Karhunen-Loeve (KL) expansion on the considered population. The surfaces of the modeled structures thus deform according to the variability observed in the training set. A preliminary …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tomographic image reconstruction with a spatially varying gamma mixture prior",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10851-018-0817-x",
            "Abstract": "A spatially varying Gamma mixture model prior is employed for tomographic image reconstruction, ensuring effective noise elimination and the preservation of region boundaries. We define a line process, modeling edges between image segments, through appropriate Markov random field smoothness terms which are based on the Student’s t-distribution. The proposed algorithm consists of two alternating steps. In the first step, the mixture model parameters are automatically estimated from the image. In the second step, the reconstructed image is estimated by optimizing the maximum-a-posteriori criterion using the one-step-late expectation–maximization and preconditioned conjugate gradient algorithms. Numerical experiments on various photon-limited image scenarios show that the proposed model outperforms the compared state-of-the-art reconstruction models.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Segmentation of cell clusters in Pap smear images using intensity variation between superpixels",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7314207/",
            "Abstract": "The automated interpretation of Pap smear images is a challenging issue with several aspects. The accurate segmentation of the structuring elements of each cell is a crucial procedure which entails in the correct identification of pathological situations. However, the extended cell overlapping in Pap smear slides complicates the automated analysis of these cytological images. In this work, we propose an efficient algorithm for the separation of the cytoplasm area of overlapping cells. The proposed method is based on the fact that in isolated cells the pixels of the cytoplasm exhibit similar features and the cytoplasm area is homogeneous. Thus, the observation of intensity changes in extended subareas of the cytoplasm indicates the existence of overlapping cells. In the first step of the proposed method, the image is tesselated into perceptually meaningful individual regions using a superpixel algorithm. In a second …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shape encoding for edge map image compression",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7351063/",
            "Abstract": "A method for the efficient encoding and decoding of a shape with application to edge map image compression is proposed. The method relies on the modeling of the manifold of a shape by line segments. Then, encoding is performed by collecting the characteristic features of each line segment, namely the starting and ending points and the number of points contributing to the computation of the corresponding segment. The reconstruction of the shape may be obtained by uniform sampling of points from each line segment computed in the encoding process. Experimental analysis demonstrates that in case of employing a robust and efficient line segment detection algorithm, the proposed encoding/decoding scheme exhibits high compression rates, compared to widely used lossless compression methods, while providing low distortion values.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Visual tracking by weighted likelihood maximization",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6495053/",
            "Abstract": "A probabilistic real time tracking algorithm is proposed. The distribution of the target is represented by a Gaussian mixture model (GMM) and the weighted likelihood of the target is maximized in order to localize it in an image sequence. The role of the weight is important as it allows gradient based optimization to be performed, which would not be feasible in a context of standard likelihood representations. The algorithm models both the object to be tracked and local background elements and handles scale changes in target's appearance. It is experimentally demonstrated that the algorithm runs in real time, and it is at least at the same performance level with the mean shift algorithm while it provides more accurate target localization in non trivial scenarios (e.g. shadows).",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bayesian multiview manifold learning applied to hippocampus shape and clinical score data",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-61188-4_15",
            "Abstract": "In this paper, we present a novel Bayesian model for manifold learning, suitable for data that are comprised of multiple modes of observations. Our data are assumed to be lying on a non-linear, low-dimensional manifold, modelled as a locally linear structure. The manifold local structure and the manifold coordinates are latent stochastic variables that are estimated from a training set. Through the use of appropriate prior distributions, neighbouring points are constrained to have similar manifold coordinates as well as similar manifold geometry. A single set of latent coordinates is learned, common for all views. We show how to solve the model with variational inference. We also exploit the multiview aspect of the proposed model, by showing how to estimate missing views of unseen data. We have tested the proposed model and methods on medical imaging data of the OASIS brain MRI dataset [6]. The data …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Information Theory Based Face Tracking",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-0371-2_14",
            "Abstract": "Automatic detection and tracking of human body parts (e.g. face, arms) is a challenging research topic with applications in many domains such as human computer interaction, surveillance, face recognition and human joint audio and video localization systems.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Improving 3D medical image compression efficiency using spatiotemporal coherence",
            "Publication year": 2020,
            "Publication url": "https://www.ingentaconnect.com/content/ist/ei/2020/00002020/00000010/art00007",
            "Abstract": "Advanced methodologies for transmitting compressed images, within acceptable ranges of transmission rate and loss of information, make it possible to transmit a medical image through a communication channel. Most prior works on 3D medical image compression consider volumetric images as a whole but fail to account for the spatial and temporal coherence of adjacent slices. In this paper, we set out to develop a 3D medical image compression method that extends the 3D wavelet difference reduction algorithm by computing the similarity of the pixels in adjacent slices and progressively compress only the similar slices. The proposed method achieves high-efficiency performance on publicly available datasets of MRI scans by achieving compression down to one bit per voxel with PSNR and SSIM up to 52:3 dB and 0:7578, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:1qzjygNMrQYC",
            "Publisher": "Society for Imaging Science and Technology"
        },
        {
            "Title": "Real time visual tracking using a spatially weighted von Mises mixture model",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865517300867",
            "Abstract": "A real time, kernel based, model-free tracking algorithm is proposed, which employs a weighted von Mises mixture as the target’s appearance model. The mixture weights, which are provided by a spatial kernel, along with the hue values are used in order to estimate the parameters of the weighted von Mises mixture model. The von Mises distribution is suitable for circular data and it is employed in order to eliminate drawbacks in kernel-based tracking caused by eventual shifts of the target’s histogram bins. The weights allow a mean shift-like gradient based optimization by maximizing the weighted likelihood, which would not be feasible in the context of a standard von Mises mixture. Moreover, as only the hue component of the target is involved, many quantities of the algorithm may be pre-calculated for given parameters and therefore the algorithm can perform in real time, which is experimentally confirmed. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:uWQEDVKXjbEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Classifying behavioral attributes using conditional random fields",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_8",
            "Abstract": "A human behavior recognition method with an application to political speech videos is presented. We focus on modeling the behavior of a subject with a conditional random field (CRF). The unary terms of the CRF employ spatiotemporal features (i.e., HOG3D, STIP and LBP). The pairwise terms are based on kinematic features such as the velocity and the acceleration of the subject. As an exact solution to the maximization of the posterior probability of the labels is generally intractable, loopy belief propagation was employed as an approximate inference method. To evaluate the performance of the model, we also introduce a novel behavior dataset, which includes low resolution video sequences depicting different people speaking in the Greek parliament. The subjects of the Parliament dataset are labeled as friendly, aggressive or neutral depending on the intensity of their political speech. The …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Informatiio Theory-Based Shot Cut",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=2779912863953183826&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A regression mixture model with spatial constraints for clustering spatiotemporal data",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213008004278",
            "Abstract": "We present a new approach for curve clustering designed for analysis of spatiotemporal data. Such data contains both spatial and temporal patterns that we desire to capture. The proposed methodology is based on regression and Gaussian mixture modeling. The novelty of the herein work is the incorporation of spatial smoothness constraints in the form of a prior for the data labels. This allows to take into account the property of spatiotemporal data according to which spatially adjacent data points have higher probability to belong to the same cluster. The proposed model can be formulated as a Maximum a Posteriori (MAP) problem, where the Expectation Maximization (EM) algorithm is used to estimate the model parameters. Several numerical experiments with both simulated data and real cardiac perfusion MRI data are used for evaluating the methodology. The results are promising and demonstrate the value of …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:hqOjcs7Dif8C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Tex-Lex: Automated generation of texture lexicons using images from the world wide web",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622814/",
            "Abstract": "A method for automatic creation of a semantic texture database is introduced, which exploits the cumulative knowledge that exists in the image tags on the World Wide Web. In the first step of the method, a number of images are retrieved from the Web using the text search option provided by search engines by querying simple notions (e.g. sky, grass water, etc.). These images are segmented into a number of predefined regions using standard clustering and each region is described by a set of image features. The descriptors of the extracted regions of the whole set of images are compared based on the Bhattacharyya distance and the ones that are more similar are considered to be entries of a dictionary associated with the initial keyword used for the query. Moreover, the corresponding regions are parts of the visual lexicon describing the keyword. Also, an already existing lexicon may be iteratively updated by new …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the improvement of image registration for high accuracy super-resolution",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5946570/",
            "Abstract": "Accurate image registration plays a preponderant role in image super-resolution methods and in the related literature landmark based registration methods have gained increasing acceptance in this framework. However, their solution relies on point correspondences and on least squares estimation of the registration parameters necessitating further improvement. In this work, a maximum a posteriori scheme for image super-re solution is presented where the image registration part is accomplished in two steps. At first, the low resolution images are registered by establishing correspondences between robust SIFT features. In the second step, the estimation of the registration parameters is fine-tuned along with the estimation of the high resolution image, in an iterative procedure, using the maximization of the mutual information criterion. Numerical results showed that the reconstructed image is consistently of higher …",
            "Abstract entirety": 0,
            "Author pub id": "LOHLQrMAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Global sampling of image edges",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7025955/",
            "Abstract": "An algorithm for sampling image edge points is presented. At first, the image edges are summarized by line segments, which represent the long axis of highly eccentric ellipses. Then, each line segment is partitioned into a number of bins and the point which is closer to the center of the bin is selected. Experiments on widely used databases demonstrate that the proposed method is accurate and provides samples that preserve the coherence of the initial information of the edge map, which is of importance in image retrieval applications.",
            "Abstract entirety": 1,
            "Author pub id": "LOHLQrMAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        }
    ]
}]