[{
    "name": "Χρυσή Κοκολογιαννάκη",
    "romanize name": "Chrysi Kokologiannaki",
    "School-Department": "Μαθηματικών",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 19951,
    "Scholar name": "Chrysi Kokologiannaki",
    "Scholar id": "5bM3fdIAAAAJ",
    "Affiliation": "Professor, University of Patras",
    "Citedby": 261,
    "Interests": [
        "differential equations",
        "special functions"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=5bM3fdIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Bounds for functions involving ratios of modified Bessel functions",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022247X11006500",
            "Abstract": "We give bounds for the functions f ν (x)= I ν+ 1 (x) x I ν (x) and g ν (x)= I ν′(x) I ν (x), using the Mittag-Leffler expansion. Some of the obtained bounds are already known and other are sharper than the known or extend the validity of ν.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Zeros of the derivatives of Bessel and Struve functions",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Arpad-Baricz/publication/301857215_Zeros_of_derivatives_of_Bessel_and_Struve_functions/links/5743d66708ae9ace841b40b7/Zeros-of-derivatives-of-Bessel-and-Struve-functions.pdf",
            "Abstract": "We prove that for ν> n− 1 all zeros of the nth derivative of Bessel function of the first kind Jν are real and simple. Moreover, we show that the positive zeros of the nth and (n+ 1) th derivative of Bessel function of the first kind Jν are interlacing when ν≥ n, and n is a natural number or zero. Our methods include the Weierstrassian representation of the nth derivative, properties of the Laguerre-Pólya class of entire functions, and the Laguerre inequalities. Some similar results for the zeros of the first and second derivative of the Struve function of the first kind Hν are also proved. The main results obtained in this paper generalize and complement some classical results on the zeros of Bessel functions of the first kind. Some open problems related to Hurwitz theorem on the zeros of Bessel functions are also proposed, which may be of interest for further research.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Absence of the point spectrum in a class of tridiagonal operators",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S009630030200022X",
            "Abstract": "Let T be the tridiagonal operator Te n= c n e n+ 1+ c n− 1 e n− 1+ b n e n, Te 1= c 1 e 2+ b 1 e 1, where c n and b n are real sequences with c n> 0, lim n→∞ c n= c, lim n→∞ b n= b, n= 1, 2,…, and e n is an orthonormal basis in a Hilbert space H. The spectrum of T consists of the interval [− 2 c+ b, 2 c+ b] plus a point spectrum outside the interval, which may be empty, finite or denumerable with accumulation points the points− 2 c+ b or 2 c+ b. Here sufficient conditions are given such that the point spectrum of the operator T outside the interval [− 2 c+ b, 2 c+ b] is empty, which means that the spectrum of T is the entire interval [− 2 c+ b, 2 c+ b]. The results are illustrated with examples.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the zeros of polynomials satisfying a three-term recurrence relation with complex coefficients",
            "Publication year": 2012,
            "Publication url": "http://ilirias.com/jiasf/repository/docs/JIASF3-3-2.pdf",
            "Abstract": "A general class of polynomials satisfying a three-term recurrence relation with complex coefficients is studied, with respect to their zeros. The method used is a functional-analytic one, which connects these zeros, with the eigenvalues of a specific linear operator in an abstract finite dimensional Hilbert space. In this way, inequalities for the real and imaginary part of the complex zeros of these polynomials can be obtained. As specific cases, the Laguerre and Ultraspherical polynomials with complex coefficients are treated. The obtained results are compared with some already known ones.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the support of the measure of orthogonality of a class of orthogonal polynomials",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0096300301000765",
            "Abstract": "For orthogonal polynomials of the form p n Q n+ 1 (x)+ q n Q n− 1 (x)+ r n Q n (x)= xQ n (x), Q 0 (x)= 0, Q 1 (x)= 1, where p n> 0, q n> 0, r n∈ R and lim n→∞ p n= lim n→∞ q n= 1/2, a general sufficient condition is found such that the support of the measure of orthogonality is the entire interval [− 1, 1]. Starting from this result, more general cases of orthogonal polynomials are studied as a perturbation problem. The results are applied to Pollaczek polynomials, Random-walk polynomials (RWP), Neutron-transport polynomials and generalized co-recursive polynomials.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "ORTHOGONAL POLYNOMIALS IN TWO VARIABLES: FIVE-TERM RECURRENCE RELATION AND RELATED RESULTS",
            "Publication year": 2018,
            "Publication url": "http://www.ilirias.com/jiasf/repository/docs/JIASF9-3-5.pdf",
            "Abstract": "We prove that a family of orthogonal polynomials Pn, m (x, y) satisfy a five-term recurrence relation, which is a “natural” generalization of the three-term recurrence relation satisfied by the classical orthogonal polynomials. Moreover, we show that these polynomials satisfy a theorem similar to Favard’s theorem. We also give a Darboux-Christoffel type formula for the polynomials Pn, m (x, y).",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "UNIV PRISHTINES"
        },
        {
            "Title": "Some properties of Γq, k (t) and related functions",
            "Publication year": 2016,
            "Publication url": "http://www.m-hikari.com/ijcms/ijcms-2016/1-4-2016/p/kokologiannakiIJCMS1-4-2016.pdf",
            "Abstract": "Properties, monotonicity results and inequalities for the functions Γq, k (t), ψq, k (t) and Bq, k (t, s), for t, s, k> 0 and 0< q< 1 are derived. The obtained results are new and the monotonicity results of the functions Γq, k (t) and ψq, k (t) generalize known results for the functions Γq (t), ψq (t) and Γk (t), ψk (t).",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Some properties of the k-gamma function",
            "Publication year": 2013,
            "Publication url": "https://lematematiche.dmi.unict.it/index.php/lematematiche/article/view/1025",
            "Abstract": "We give completely monotonicity properties and inequalities for functions involving the Γ_k functions and their logarithmic derivatives ψ_k functions. We introduce a k-analogue of the Riemann Zeta function ζ_k as an integral and using Schwarz’s and Holder’s inequalities we obtain some inequalities relating ζ_k and Γ_k functions. The obtained results are the k-anologues of known results concerning functions involving the Gamma and psi functions.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bounds for k-gamma and k-beta functions",
            "Publication year": 2013,
            "Publication url": "http://www.ilirias.com/jiasf/repository/docs/JIASF4-3-1.pdf",
            "Abstract": "Some power product bounds are given for the functions Γk (x) and Bk (x, y). The bounds for Γk (x) are k-generalization of bounds given by Starc (2002) for the function Γ (x) and the bounds for Bk (x, y) are new.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the zeros of J ν″′(x)",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10652469.2012.720253",
            "Abstract": "The zeros of J″′ν(x) are studied by using classical analysis and the properties of J ν(x). It is proved that J″′ν(x) has infinite positive zeros and between two consecutive positive zeros of J ν(x), there exist at least one zero of J ν″′(x) for ν>1. Moreover, several theorems are given regarding their location depending on the values of ν. Also, alternative proofs are given regarding the monotonicity of the positive zeros of J″′ν(x) for ν>(1+√5)/2 and ν>1.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:WF5omc3nYNoC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Limit points of eigenvalues of truncated unbounded tridiagonal operators",
            "Publication year": 2007,
            "Publication url": "https://www.degruyter.com/document/doi/10.2478/s11533-007-0009-1/html",
            "Abstract": "Let T be a self-adjoint tridiagonal operator in a Hilbert space H with the orthonormal basis {e                 n}n=1∞, σ(T) be the spectrum of T and Λ(T) be the set of all the limit points of eigenvalues of the truncated operator T                 N. We give sufficient conditions such that the spectrum of T is discrete and σ(T) = Λ(T) and we connect this problem with an old problem in analysis.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Versita"
        },
        {
            "Title": "On the zeros of a class of analytic functions.",
            "Publication year": 2007,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15485390&AN=24199604&h=6VTXQNYglP6qiL6D81F81LVSCCIoJBlpJkD0bwlomjfL%2Bgv8057s%2Fqi5S%2BR4NfGC%2BEb5AvMJPkncJlHzWJq%2Bfw%3D%3D&crl=c",
            "Abstract": "The zeros of a class of analytic functions represented by a continued fraction are studied. The results are applied to the zeros of the mixed Bessel function Jv(z)+ μJv+ 1(z), μ∈ C and improve a previously known result.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tridiagonal operators and zeros of polynomials in two variables",
            "Publication year": 2016,
            "Publication url": "https://www.hindawi.com/journals/aaa/2016/6301413/",
            "Abstract": "The aim of this paper is to connect the zeros of polynomials in two variables with the eigenvalues of a self-adjoint operator. This is done by use of a functional-analytic method. The polynomials in two variables are assumed to satisfy a five-term recurrence relation, similar to the three-term recurrence relation that the classical orthogonal polynomials satisfy.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "COMBINATIONS OF ORTHOGONAL POLYNOMIALS",
            "Publication year": 2009,
            "Publication url": "https://ijpam.eu/contents/2009-50-1/10/10.pdf",
            "Abstract": "Let {Pn (x)}∞ n= 0 be an orthogonal sequence of polynomials. We consider two families of polynomials defined by Qn (x)= APn (x)+ BPn− 1 (x)+ CPn− 2 (x), where A, B, C are real numbers with A= 0 and Sn (x)=(Anx+ Bn) Pn− 1 (x)+ ΓnPn (x), where An= 0, Bn and Γn are real sequences. We find conditions that the polynomials Qn (x) and Sn (x) are orthogonal, we derive the three-term recurrence relation which is satisfied by each of them and we illustrate the results by some examples. We also give some results concerning the zeros of the polynomials Qn (x) and Sn (x).AMS Subject Classification: 33C45, 05E35",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simple proofs of classical results on zeros of  and ",
            "Publication year": 2014,
            "Publication url": "https://projecteuclid.org/journals/tbilisi-mathematical-journal/volume-7/issue-2/Simple-proofs-of-classical-results-on-zeros-of-mathbfJ_nux-and/10.2478/tmj-2014-0014.short",
            "Abstract": "The Bessel functions  and their derivatives  can be represented by infinite series and infinite products. Using these representations we give very simple proofs for known results concerning the zeros of the above functions.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:aqlVkmm33-oC",
            "Publisher": "Tbilisi Centre for Mathematical Sciences"
        },
        {
            "Title": "q-Completely monotonic and q-Bernstein functions",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Valmir-Krasniqi/publication/264048464_q-Completely_monotonic_and_q-Bernstein_functions/links/00b7d53cc87f9e781f000000/q-Completely-monotonic-and-q-Bernstein-functions.pdf",
            "Abstract": "We introduce the q-Bernstein functions, for 0< q< 1, and give sufficient and necessary conditions for a function to belong to the class of q-Bernstein functions. For some classes of functions we give results concerning q-completely monotonic and q-Bernstein functions. The obtained results are q-analogue of known results.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stieltjes transforms of a class of probability measures",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377042702006167",
            "Abstract": "Let the probability measures μ N, N= 2, 3,… be defined by μ N ({λ k, N})= 1/N, μ N (A)= 0 for λ k, N∉ A, where λ k, N, k= 1, 2,…, N are the zeros of the orthogonal polynomial P N+ 1 (x), which is obtained recursively by P 0 (x)= 0, P 1 (x)= 1, a n P n+ 1 (x)+ a n− 1 P n− 1 (x)+ b n P n (x)= xP n (x). Conditions on a n and b n are found such that the sequence μ N, N= 2, 3,… converges weakly to the Dirac measure at the point zero. This is achieved through the convergence of the sequence of Stieltjes transforms∫−∞∞ d μ N (t)/(λ− t) to the function 1/λ. Typical examples are the Al-Salam and Carlitz polynomials, the Wall polynomials, the Lommel polynomials and the Tricomi–Carlitz polynomials.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Monotonicity properties of oscillatory solutions of differential equation ",
            "Publication year": 2013,
            "Publication url": "https://dml.cz/dmlcz/143532",
            "Abstract": "We obtain monotonicity results concerning the oscillatory solutions of the differential equation . The obtained results generalize the results given by the first author in [1] (1976). We also give some results concerning a special case of the above differential equation.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Department of Mathematics, Faculty of Science of Masaryk University, Brno"
        },
        {
            "Title": "Panayiotis D. Siafarikas: His Life and Work",
            "Publication year": 2013,
            "Publication url": "http://campus.mst.edu/adsa/contents/v8n2p1.pdf",
            "Abstract": "In this paper, the life and work of the late Professor Panayiotis D. Siafarikas is presented. His research interests lied within differential equations, difference equations, special functions and orthogonal polynomials. As a minimum tribute, a conference dedicated to his memory was organized in Patras, Greece, in September 2012, entitled “International Conference on Differential Equations, Difference Equations and Special Functions”. This paper summarizes the welcome talks presented at the conference which covered several aspects of his personal, academic and research life.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Newton sum rules of the zeros of some associated orthogonal q-polynomials.",
            "Publication year": 2006,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15485390&AN=22250282&h=BDqUTIWdrsCWyc1QE4kVZqujwSTXXj%2FtyDexv4BUXqEfyugtdYhplTbWotf1fdu9mXVDBBP39veMt%2FP3yDDJuA%3D%3D&crl=c",
            "Abstract": "By using a functional analytic method we evaluate the Newton sum rules of the zeros of some classes of associated orthogonal q-polynomials, in terms of the coefficients of the three-term recurrence relation, which they satisfy. As particular cases we obtain the Newton sum rules of some associated orthogonal polynomials found recently.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Properties and inequalities of generalized k-gamma, beta and zeta functions",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Chrysi-Kokologiannaki/publication/228520451_Properties_and_inequalities_of_generalized_k-gamma_beta_and_zeta_functions/links/53ea0da60cf28f342f4178ad/Properties-and-inequalities-of-generalized-k-gamma-beta-and-zeta-functions.pdf",
            "Abstract": "Recently R. Diaz and E. Pariguan introduced [2] the k-generalized Gamma function Γk (x), Beta function Bk (x, y) and Zeta function ζk (x, s) and gave some identities which they satisfy. We give some more properties and inequalities for the above k-generalized functions.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Zeros of Bessel function derivatives",
            "Publication year": 2018,
            "Publication url": "https://www.ams.org/proc/0000-000-00/S0002-9939-2017-13725-3/",
            "Abstract": "We prove that for  all zeros of the  th derivative of the Bessel function of the first kind  are real. Moreover, we show that the positive zeros of the  th and  th derivative of the Bessel function of the first kind  are interlacing when  and  is a natural number or zero. Our methods include the Weierstrassian representation of the  th derivative, properties of the Laguerre-Pólya class of entire functions, and the Laguerre inequalities. Some similar results for the zeros of the first and second derivatives of the Struve function of the first kind  are also proved. The main results obtained in this paper generalize and complement some classical results on the zeros of Bessel and Struve functions of the first kind. Some open problems related to Hurwitz's theorem on the zeros of Bessel functions are also proposed.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Corrigendum to “Bounds for functions involving ratios of modified Bessel functions”[J. Math. Anal. Appl. 385 (2)(2012) 737–742]",
            "Publication year": 2012,
            "Publication url": "https://core.ac.uk/download/pdf/82496208.pdf",
            "Abstract": "In the literature many inequalities and monotonicity properties for the functions Iν (x) and for functions involving them, have been proved by many authors (see the review paper [2] and [3, 12]), motivated by problems that arise in many scientific areas, as in finite elasticity [13], probability and statistics [5, 6, 15] and elsewhere (see [2, 12]). The authors have used different methods and the obtained results have been compared each other. All of these are given in [2] and [12]. So we mostly refer them and compare our results with the bounds given in [2, 9–12].",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:roLk4NBRz8UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Monotonicity of functions involving q-Gamma functions",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Chrysi-Kokologiannaki/publication/265953835_Monotonicity_of_functions_involving_q-Gamma_functions/links/579174f108ae4e917d047133/Monotonicity-of-functions-involving-q-Gamma-functions.pdf",
            "Abstract": "We give monotonicity properties of some functions involving q-Gamma functions. The results are q-analogue of results concerning Gamma function and generalize some known results.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simple proofs of classical results on zeros of Jν (x) and J ν (x)",
            "Publication year": 2014,
            "Publication url": "https://projecteuclid.org/journalArticle/Download?urlid=10.2478%2Ftmj-2014-0014",
            "Abstract": "The Bessel functions Jν (x) and their derivatives Jν (x) can be represented by infinite series and infinite products. Using these representations we give very simple proofs for known results concerning the zeros of the above functions.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Convexity of the Square of the First Zero of the Derivative of Bessel Function",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10652460213526",
            "Abstract": "Recently, in Canad. Math. Bull . XX (Y), (1998), 1-12, A. Elbert and P. D. Siafarikas, proved, among the other results, that the square of the first positive zero of Bessel function J x ( z ) is a convex function of x in the interval m 2< x h 0. Here we prove an analogous result for the square of the first positive zero of the derivative of J x ( z ), in the interval m 1< x h 0.",
            "Abstract entirety": 1,
            "Author pub id": "5bM3fdIAAAAJ:qjMakFHDy7sC",
            "Publisher": "Taylor & Francis"
        }
    ]
}]