[{
    "name": "Χρίστος Σχίζας",
    "romanize name": "Christos Schizas",
    "School-Department": "Computer Science",
    "University": "University of Cyprus",
    "Rank": "Καθηγητής",
    "Apella_id": 2728,
    "Scholar name": "Christos N. Schizas",
    "Scholar id": "RrUhoesAAAAJ",
    "Affiliation": "Professor of Computer Science, University of Cyprus",
    "Citedby": 3026,
    "Interests": [
        "Computational Intelligence",
        "Artificial Intelligence",
        "eHealth"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=RrUhoesAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Artificial neural network learning: A comparative review",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_27",
            "Abstract": "Various neural learning procedures have been proposed by different researchers in order to adapt suitable controllable parameters of neural network architectures. These can be from simple Hebbian procedures to complicated algorithms applied to individual neurons or assemblies in a neural structure. The paper presents an organized review of various learning techniques, classified according to basic characteristics such as chronology, applicability, functionality, stochasticity etc. Some of the learning procedures that have been used for the training of generic and specific neural structures, and will be reviewed are: Hebbian-like (Grossberg, Sejnowski, Sutton, Bienenstock, Oja & Karhunen, Sanger, Yuile et al., Hasselmo, Kosko, Cheung & Omidvar), Reinforcement learning, Min-max learning, Stochastic learning, Genetics-based learning, Artificial life-based learning. The various learning procedures will be …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Editorial intelligent biomedical systems",
            "Publication year": 2014,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54344",
            "Abstract": "Editorial intelligent biomedical systems Toggle navigation English Ελληνικά English English \nΕλληνικά Login Toggle navigation View Item Home Δημοσιεύσεις ΠΚ / UCY Publications 002 \nΣχολή Θετικών και Εφαρμοσμένων Επιστημών / Faculty of Pure and Applied Sciences Τμήμα \nΠληροφορικής / Department of Computer Science View Item Home Δημοσιεύσεις ΠΚ / UCY \nPublications 002 Σχολή Θετικών και Εφαρμοσμένων Επιστημών / Faculty of Pure and Applied \nSciences Τμήμα Πληροφορικής / Department of Computer Science View Item Article Editorial \nintelligent biomedical systems Thumbnail Date 2014 Author ORCID logo Kyriacou, Efthyvoulos \nC. ORCID logo Promponas, Vasilis J. Maglogiannis, I. ORCID logo Schizas, Christos N. \nORCID logo Pattichis, Constantinos S. Source International Journal on Artificial Intelligence \nTools Volume 23 Issue 3 Google Scholar check Metadata Show full item record Links https://../…",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest Editorial Introduction to the Special Section on Computational Intelligence in Medical Systems",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5230361/",
            "Abstract": "The six papers in this special section focus on the most recent applications of computational intelligent systems in medicine. Some papers accepted for this issue (10 in total) were published earlier by mistake.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated Segmentation of Folk Songs Using Artificial Neural Networks.",
            "Publication year": 2014,
            "Publication url": "https://www.scitepress.org/Papers/2014/50491/50491.pdf",
            "Abstract": "Two different systems are introduced, that perform automated audio annotation and segmentation of Cypriot folk songs into meaningful musical information. The first system consists of three artificial neural networks (ANNs) using timbre low-level features. The output of the three networks is classifying an unknown song as “monophonic” or “polyphonic”. The second system employs one ANN using the same feature set. This system takes as input a polyphonic song and it identifies the boundaries of the instrumental and vocal parts. For the classification of the “monophonic–polyphonic”, a precision of 0.88 and a recall of 0.78 has been achieved. For the classification of the “vocal–instrumental” a precision of 0.85 and recall of 0.83 has been achieved. From the obtained results we concluded that the timbre low-level features were able to capture the characteristics of the audio signals. Also, that the specific ANN structures were suitable for the specific classification problem and outperformed classical statistical methods.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploitation of medical crisp database for fuzzy diagnostic decision support systems",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ATkxCgAAQBAJ&oi=fnd&pg=PA83&dq=info:0LoB-bqly1sJ:scholar.google.com&ots=uYPaFe_nCT&sig=DxC_AfTZezekasnpVuzCwHyTQyc",
            "Abstract": "There are several types of Diagnostic Decision Support Systems (DDSS) but all move towards a common direction: provide assistance to the doctors/clinicians to make the right diagnosis for a specific patient, minimizing as much as possible the needed time for this. In doing so, some DDSS systems exploit existing crisp medical databases while others take an advantage of human knowledge and experience, by building fuzzy medical databases from scratch. It would be of interest though, as well as time saving, to combine these two together and examine how one can actually use an existing crisp medical dataset to transform it into a new fuzzy medical database with parameters being expressed and defined based on the clinicians’ way of thinking. A methodology implementing this task is proposed in this paper accompanied by the results of its application on a real crisp medical database.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Electronic health record: Facilitating the coding process",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701656/",
            "Abstract": "In this paper, we introduce an intelligent medical assistant tool that offers the ability to suggest appropriate medical diagnostic coding during the examination process through a friendly user interface. Furthermore the tool offers the capability to match medical coding definitions from one standard to another such as ICD 10 and SNOMED CT. The tool has three main functions: a) Easy Search, b) Coding Suggestion and c) Coding Interoperability.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of GSM and GPRS systems in emergency telemedicine",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Efthyvoulos-Kyriacou/publication/228870154_Evaluation_of_GSM_and_GPRS_systems_in_emergency_telemedicine/links/02bfe50cedc442e423000000/Evaluation-of-GSM-and-GPRS-systems-in-emergency-telemedicine.pdf",
            "Abstract": "Emerging technologies in wireless and mobile telecommunication networks, combined with the simultaneous rapid advances in information technology, are leading to many new solutions in the field of telemedicine. As a result the opportunities for improving further existing and supporting new advanced services for healthcare are widened. The objective of this study is to carry out a practical evaluation of the performance of the GSM and GPRS systems in the transmission/reception of images and video as well as Patient Record and biosignals in emergency cases. The data transfer rate achieved with GPRS were in the range of 32 Kbps (while for GSM 9.6 kbps) with the download time for typical images of a file size of 200 Kbytes to the mobile device to be in the region of 60 seconds. Similar performance was also recorded in the case of a moving station (simulating the ambulance). In conclusion, the physicians were very pleased by the benefits offered by the system through the freedom of access, anywhere and anytime even in motion.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Filter-based approach for ornamentation detection and recognition in singing folk music",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23192-1_47",
            "Abstract": "Ornamentations in music play a significant role for the emotion whi1ch a performer or a composer aims to create. The automated identification of ornamentations enhances the understanding of music, which can be used as a feature for tasks such as performer identification or mood classification. Existing methods rely on a pre-processing step that performs note segmentation. We propose an alternative method by adapting the existing two-dimensional COSFIRE filter approach to one-dimension (1D) for the automatic identification of ornamentations in monophonic folk songs. We construct a set of 1D COSFIRE filters that are selective for the 12 notes of the Western music theory. The response of a 1D COSFIRE filter is computed as the geometric mean of the differences between the fundamental frequency values in a local neighbourhood and the preferred values at the corresponding positions. We apply the …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Artificial neural networks in estimating marine propeller cavitation",
            "Publication year": 2002,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54594",
            "Abstract": "Cavitation in marine propellers can be a serious problem that may result in severe deterioration in performance. This is particularly important in heavily loaded propellers, commonly encountered in small craft. Efforts have been made to generate polynomials that fit experimental data on propeller performance and hence to facilitate the propeller selection procedures (Blount and Hubble, 1981). These polynomial fits are not accurate in capturing the performance of propellers, and also do not account for cavitating conditions. In the present work, neural networks have been developed that predict the performance of marine propellers in all tested conditions, including cavitation. The USN-series of experimental data (Denny et al, 1989) were applied on different neural network architectures and learning parameters, aiming at establishing a near optimum setup. The results of the networks are superior to those of the polynomial fit, and give an acceptable accuracy even in the cavitating conditions, thus enabling a naval architect/engineer to improve on the propeller selection process.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A modular neural network system for the analysis of nuclei in histopathological sections",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=5563212594036708545&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selective attention and consciousness: investigating their relation through computational modelling",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s12559-010-9063-2",
            "Abstract": "The present study aimed at investigating the possible connection between conscious awareness and attention through the implementation of a neurocomputational model of visual selective attention. The development of the model was based on recent neurophysiological findings that document the synchronization of neural activity in cortical areas of the brain and the presence of competitive interactions among stimuli at the early stages of visual processing. The model was used to simulate the findings of a behavioural experiment conducted by Naccache et al. in Psychol Sci 13:416–424 (2002), which have sparked a debate on the possible links between attention and consciousness. The model reproduced closely the pattern of the behavioural data while incorporating mechanisms that take into account the neural activity representing the early visual processing of stimuli and the effects of top–down …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "FOR SUCCESSFUL E-COMMERCE SYSTEMS DEVELOPMENT",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4756884949653761963&hl=en&oi=scholarr",
            "Abstract": "While there is a plethora of research works in e-commerce. there is lack of methods for revealing HSCO factors, which otherwise stay well hidden within the working environment analyzed. The risk of missing the requirements resulting from these factors leads us to propose a new methodology to uncover and analyze HSCO factors, as well as to translate them to system requirements. The methodology utilizes a new model called SpiderWeb. aspiring at recording critical factors that must be incorporated as functional or non-functional features in the e-commerce application under development. Taking into consideration the importance of immediacy in deploying e-commerce applications, an oriented form of ethnography analysis is introduced. which can be conducted in a non-time consuming manner to identify requirements sourcing from HSCO factors, based on a certain informational",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:rO6llkc54NcC",
            "Publisher": "World Scientific Publishing Company Incorporated"
        },
        {
            "Title": "Multipurpose health care telemedicine system",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1019597/",
            "Abstract": "In this study we present a multipurpose health care telemedicine system, which can be used for emergency or patient monitoring cases. Ambulances, Rural Health Centers (RHC) or other remote health location. Ships navigating in wide seas and airplanes in flight are common examples of possible emergency sites, while critical care telemetry and telemedicine home follow-ups are important issues of patient monitoring. The telemedicine system is a combined real-time and store and forward facility that consists of a base unit and a telemedicine (mobile) unit. The telemedicine unit (patient site) allows the transmission of vital biosignals (3-12 lead ECG, SPO2, NIBP, IBP, Temp) and still images of the patient from the incident place to the base unit (consultation site). The transmission is performed through GSM, Satellite links or POTS. Using this device a specialist doctor can telematically \"move\" to the patient site and …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The evaluation of the Cultural Journeys in the Information Society environment as an educational aid",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131504000776",
            "Abstract": "The Cultural Journeys in the Information Society is a dynamic hypermedia environment, which proposes the Electronic Roads as a meta-form for exploring cultural information that can form Cultural Journeys. The Electronic Roads meta-form facilitates travelers to explore the information space in a natural and continuous way similar to the exploration of physical roads. This meta-form is advantageous over existing cultural exploration approaches, which usually apply only to discrete information spaces, failing to provide users with continuous explorations and as a result users may lose their intended destinations. The proposed environment provides extendable cultural and historical content for three Mediterranean countries, i.e. Cyprus, Jordan and Egypt.Such a system could be ideal for teaching history and culture; therefore several Learning Activities have been developed in this context. The learning effectiveness …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A coincidence detector neural network model of selective attention",
            "Publication year": 2009,
            "Publication url": "https://escholarship.org/content/qt2j35f52r/qt2j35f52r.pdf",
            "Abstract": "A computational model of selective attention is implemented to account for findings from an experiment on selective attention that was conducted. The model successfully reproduces the latency data of human participants by relying on the interaction between a bottom-up saliency map and the top-down influences from spatial and semantic goals. The model offers a biologically-plausible way of operationalizing perceptual load and provides insights about the possible brain mechanisms that underlie related empirical findings.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prenatal diagnosis of aneuploidy using artificial neural networks in relation to health economics",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_182",
            "Abstract": "The early detection of fetal chromosomal abnormalities such as aneuploidies, has been an important subject in medicine over the last thirty years. A pregnant woman is advised by the doctor to perform an amniocentesis test, after the identification of increased risk for fetal aneuploidy. Even though the amniocentesis test is almost perfectly accurate, it has several drawbacks. It is an invasive test with around 1% risk for miscarriage; it is financially expensive and requires laboratories and special equipment. In this work we propose a non-invasive method for aneuploidy detection using a dataset with pre-natal examinations of pregnant women and artificial neural networks. We have used a dataset with 50,517 euploid and 691 aneuploid cases. Biological markers of the mother such as the age, blood proteins and ultrasonographic information from the fetus are used as input to the networks. A training set is used …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:ye4kPcJQO24C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Measuring the impact of blockchain on healthcare applications",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3309772.3309806",
            "Abstract": "Blockchain is a technology with potential for making ground breaking steps in addressing social, economic and healthcare challenges. The global information technology scene is being overcrowded with blockchain applications with special focus on the vast healthcare market [12]. The value of information related to healthcare creates a clear path for applying blockchain as a solution for some of the challenges in the healthcare sector, in particular with the goal of creating a fair and transparent way for sharing information and patient data. It is however a fact that while blockchain technology introduces additional complexity to the implementation healthcare software, the benefit the technology actually brings still remains unclear and difficult to evaluate. This vision paper demonstrates our research focus on providing a body of knowledge and tools to help evaluate this impact of blockchain on eHealth applications. In …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of e-Registries in building and upgrading services",
            "Publication year": 2017,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5381826/pdf/haematol.2017.s1.pdf#page=57",
            "Abstract": "This paper presents an electronic registry system for the purposes of the rare congenital conditions that require lifelong follow up and treatment. The main objective of the eRegistry focusses on the prevention of major rare anaemias (RAs) by facilitating the access, at a European level, to the best genetic counselling, diagnosis and clinical management of the patients with RA independently of their country of origin. This can be achieved by promoting an extension of the full Electronic Health Record system and specifically the electronic registries for RAs, across Europe for the purposes stated hence promoting service development for the benefit of patients. The eRegistry will serve as an epidemiological tool to improve the management of patient services and ultimately improve patient care.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending and enhancing a basic program analysis system",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive modeling of dilution effects in visual search",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34475-6_10",
            "Abstract": "A biologically plausible neural network model of selective attention has been implemented to account for discrepant findings on the source of distractor interference in visual search tasks. The model successfully simulated the findings from an experiment by Benoni and Tsal (2010) documenting the effects of dilution on distractor interference. In conjunction with previous implementations of the model, we have been able to offer a unifying account that settles the controversy between the Perceptual Load and the Dilution theories of selective attention.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Guest editorial introduction to the special issue on citizen centered e-health systems in a global healthcare environment: Selected papers from ITAB 2009",
            "Publication year": 2011,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54812",
            "Abstract": "The January 2011 Special Issue of IEEE Transactions on Information Technology in Biomedicine includes selected papers from Information Technology in Biomedicine (ITAB 2009), held in the month of October in Cyprus. The overall objective of ITAB 2009 was to cover the state of the art in Information Technology Applications in Biomedicine, under the theme 'Citizen centered e-health systems in a global healthcare environment'. The Issue contains paper by Karagiannis and colleagues that investigates the performance of empirical mode decomposition (EMD) on ECGs. The paper by Stylianides introduces a novel, open source middleware framework for communication with medical devices and an application using the middleware named intensive care window (ICW). Cunningham and colleagues propose a home-based tool designed to monitor and assess peripheral motor symptoms. Loizou and colleagues introduce the use of multiscale AM FM texture analysis of multiple sclerosis (MS) using MR images from the brain.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acknowledgment of editors and reviewers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5610574/",
            "Abstract": "Thanks and lists the editors and reviewers who contributed to IEEE Transactions on Information Technology in Biomedicine.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching and integrating eHealth technologies in undergraduate and postgraduate curricula and healthcare professionals’ education and training",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128131442000118",
            "Abstract": "This book chapter offers a different insight into the methodology of teaching eHealth by integrating digital innovation in healthcare education and training at the medical undergraduate level, the postgraduate level, and at the level of continuous professional education (CPE) in highly demanding clinical environments such as that of critical care. Many and significant challenges are posed to a healthcare profession student today, at both undergraduate and postgraduate levels, as one is required to learn and practice or even design the modern and technology-rich clinical environment. Even more challenges are faced by healthcare professionals that are responsible for “real patients” and require taking decisions on the job and occasionally under high pressure. Such decisions must be based on accurate and reliable data, complete and readily available. Conclusively, we discuss prospects of learning and practicing …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:0N-VGjzr574C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Application of fuzzy cognitive maps to the political-economic problem of Cyprus",
            "Publication year": 2004,
            "Publication url": "http://www.ifel.ru/fsscef2006/2004/FSSCEF_2.pdf#page=48",
            "Abstract": "The Cyprus problem exists since the early 1960s, but has been amplified after the Turkish invasion of the island in 1974. The politico-economic dynamics involved are related to the interests of both the Greek Cypriot community and the Turkish Cypriot community. Furthermore, there are antagonistic and cooperative interests among other countries involved in the conflict. These are primarily Greece, Turkey and the United Kingdom. The expected entry of Cyprus into the European Union, as well as the recent terrorist events, has made the involvement of Europe, USA, Russia and Israel important influential-dynamical factors. An attempt to model the dynamics of the problem, using Fuzzy Cognitive Maps has been made. The main parameters involved in the interrelated dynamics are nationalism, religiousness, knowledge of history, level of educational development, tourism, prospect of finding crude oil, other natural resources, Anatolian settlers, and the general interests of the countries involved, as well of course the general interests of two communities.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Color multiscale texture classification of hysteroscopy images of the endometrium",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4649384/",
            "Abstract": "The objective of this study was to investigate the diagnostic performance of a Computer Aided Diagnostic (CAD) system based on color multiscale texture analysis for the classification of hysteroscopy images of the endometrium, in support of the early detection of gynaecological cancer. A total of 416 Regions of Interest (ROIs) of the endometrium were extracted (208 normal and 208 abnormal) from 45 subjects. RGB images were gamma corrected and were converted to the YCrCb color system. The following texture features were extracted from the Y, Cr and Cb channels: (i) Statistical Features (SF), (ii) Spatial Gray Level Dependence Matrices (SGLDM), and (iii) Gray Level Difference Statistics (GLDS). The Probabilistic Neural Network (PNN), statistical learning and the Support Vector Machine (SVM) neural network classifiers were also applied for the investigation of classifying normal and abnormal ROIs in different …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile commerce applications and services: A design and development approach",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/43937820/Mobile_commerce_applications_and_service20160320-3201-1e61rq2.pdf",
            "Abstract": "Mobile Commerce is an evolving area of e-Commerce, where users can interact with the service providers through a mobile and wireless network, using mobile devices for information retrieval and transaction processing. M-Commerce services and applications can be adopted through different wireless and mobile networks, with the aid of several mobile devices. However, constraints of both mobile networks and devices influence their operational performance; therefore, there is a strong need for taking into consideration those constraints in the design and development phases of m-Commerce services and applications. Another important factor in designing m-Commerce services and applications is the identification of mobile users requirements. Furthermore, m-Commerce services and applications need to be classified based on the functionality they provide to the mobile users. This kind of classification results in two major classes: the directory and the transaction-oriented services and applications. This paper suggests a new approach for designing and developing m-Commerce services and applications. This approach relies on mobile users needs and requirements, the classification of the m-Commerce services and applications, as well as the current technologies for mobile and wireless computing and their constraints.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A machine learning approach for clustering western and non-western folk music using low-level and mid-level",
            "Publication year": 2013,
            "Publication url": "http://www.ecmlpkdd2013.org/wp-content/uploads/2013/09/MLMU_Neocleous.pdf",
            "Abstract": "This work describes an unsupervised method for clustering folk music from four non-European eastern countries, western music and folk music of Cyprus. The folk music of Cyprus is consisted by Greek-Cypriot folk music and Turkish-Cypriot folk music. We used low-level and mid-level features for our investigations and we applied two unsupervised methods, the so-called kmeans and the self organizing maps for creating cluster maps. From the results we observed that the Greek-Cypriot songs, the Turkish Cypriot songs and the Turkish makams are being clustered from the system in different clusters. Arabic and music from Iran are clustered in the same cluster and music from Syria is clustered together with music of Turkey. Western music is clustered in to two different clusters.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Claim for the Existence of\" Adversarial Examples\" in Deep Learning Neural Networks.",
            "Publication year": 2014,
            "Publication url": "https://www.scitepress.org/papers/2014/51525/51525.pdf",
            "Abstract": "A recent article in which it is claimed that adversarial examples exist in deep artificial neural networks (ANN) is critically examined. The newly discovered properties of ANNs are critically evaluated. Specifically, we point that adversarial examples can be serious problems in critical applications of pattern recognition. Also, they may stall the further development of artificial neural networks. We challenge the absolute existence of these examples, as this has not been universally proven yet. We also suggest that ANN structures, that correctly recognize adversarial examples, can be developed.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electronic roads in the information society: social, educational and technological aspects",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64602",
            "Abstract": "In this paper we present the major technological challenges to the formation of the Information Society and the ways in which social and pedagogical restrictions can serve to influence the outcome of those challenges from the design phase. We define the notion of electronic information roads and explore the form which these roads can take. Electronic roads can serve to define a new type of social group based on inherently different relationships centered around intellectual and other interests rather than the proximity of physical contact and direct communication. The implementation of electronic roads will require advancements in digital libraries, advanced networks and distributed systems programming.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:t6usbXjVLHcC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Electronic health record application support service enablers",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7318631/",
            "Abstract": "There is a huge need for open source software solutions in the healthcare domain, given the flexibility, interoperability and resource savings characteristics they offer. In this context, this paper presents the development of three open source libraries - Specific Enablers (SEs) for eHealth applications that were developed under the European project titled “Future Internet Social and Technological Alignment Research” (FI-STAR) funded under the “Future Internet Public Private Partnership” (FI-PPP) program. The three SEs developed under the Electronic Health Record Application Support Service Enablers (EHR-EN) correspond to: a) an Electronic Health Record enabler (EHR SE), b) a patient summary enabler based on the EU project “European patient Summary Open Source services” (epSOS SE) supporting patient mobility and the offering of interoperable services, and c) a Picture Archiving and Communications …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile computing: technology challenges, constraints, and standards",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-mobile-multimedia-second/21047",
            "Abstract": "Mobile communications and computing has changed forever the way people communicate and interact and it has made “any information, any device, any network, anytime, anywhere” an everyday reality which we all take for granted. This chapter discusses the main research and development in the mobile technology and standards that made ubiquity a reality: from wireless middleware to wireless client profiling to m-commerce services.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:isC4tDSrTZIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Variable target values neural network for dealing with extremely imbalanced datasets",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_102",
            "Abstract": "An original classification algorithm is proposed for dealing with extremely imbalanced datasets that often appear in biomedical problems. Its originality comes from the way a neural network is trained in order to get a decent hypothesis out of a dataset that comprises of a huge sized majority class and a tiny size minority class. This situation is especially probable when forming machine learning databases describing rare medical conditions. The algorithm is tested on a large dataset in order to predict the risk of preeclampsia in pregnant women. Conventional machine learning algorithms tend to provide poor hypothesis for extremely imbalanced datasets by favoring the majority class. The proposed algorithm is not trained on the basis of the mean squared error objective function and thus avoids the overwhelming effect of the highly asymmetric class sizes. The methodology provides preeclampsia detection …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:N5tVd3kTz84C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Computational modeling of visual selective attention",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050911005904",
            "Abstract": "An overview of a nerocomputational model of visual selective attention that has been properly implemented is presented in this abstract.Visual selective attention is a fundamental function of human cognition and a highly important brain mechanism, essential for the functioning of the human brain as a system. A comprehensive example of the role of human attention can be seen by noting that at each instant of conscious life, each person receives millions of external stimulations from his/her sensory systems, while only a limited amount is selected by attention for further processing that leads to conscious perception. If every stimulus was allowed to pass into perception, one would have been soon overflowed and in constant distraction. Adding to external stimulation all internal stimuli (e.g., thoughts), a person would end up in a totally unstable state. Selective attention is thus regarded as the main control mechanism …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:k_IJM867U9cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Neural Network Computational model of visual selective attention",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03969-0_32",
            "Abstract": "One challenging application for Artificial Neural Networks (ANN) would be to try and actually mimic the behaviour of the system that has inspired their creation as computational algorithms. That is to use ANN in order to simulate important brain functions. In this report we attempt to do so, by proposing a Neural Network computational model for simulating visual selective attention, which is a specific aspect of human attention. The internal operation of the model is based on recent neurophysiologic evidence emphasizing the importance of neural synchronization between different areas of the brain. Synchronization of neuronal activity has been shown to be involved in several fundamental functions in the brain especially in attention. We investigate this theory by applying in the model a correlation control module comprised by basic integrate and fire model neurons combined with coincidence detector neurons …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Feature mapping through maximization of the atomic interclass distances",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-17091-6_3",
            "Abstract": "We discuss a way of implementing feature mapping for classification problems by expressing the given data through a set of functions comprising of a mixture of convex functions. In this way, a certain pattern’s potential of belonging to a certain class is mapped in a way that promotes interclass separation, data visualization and understanding of the problem’s mechanics. In terms of enhancing separation, the algorithm can be used in two ways: to construct problem features to feed a classification algorithm or to detect a subset of problem attributes that could be safely ignored. In terms of problem understanding, the algorithm can be used for constructing a low dimensional feature mapping in order to make problem visualization possible. The whole approach is based on the derivation of an optimization objective which is solved with a genetic algorithm. The algorithm was tested under various datasets and it …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Proposal for an ehealth based ecosystem serving national healthcare",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8358757/",
            "Abstract": "The European Union (EU)'s keen concern about citizens' health and well-being advancement has been expressed at all levels. It has been understood that at present, these can only be achieved through coordinated actions at the individual member states' level based on EU directives, as well as through promoting and funding R&D and expanding the use of eHealth technologies. Despite the diversities and particularities among member states, common values such as universal access to good quality healthcare, equity, and solidarity have been widely accepted across EU. That demanded the adoption of policies and follow directives, which streamlined actions to bridge healthcare gaps, and facilitate cross-border healthcare. This paper articulates a framework for deriving a national healthcare system, based on interoperable Electronic Health Record (EHR) with safeguarding healthcare quality, enabling quadruple …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:0KyAp5RtaNEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multimedia Content Adaptation: Operation Selection in the MPEG-21 Framework.",
            "Publication year": 2005,
            "Publication url": "https://www.actapress.com/PDFViewer.aspx?paperId=21345",
            "Abstract": "MULTIMEDIA CONTENT ADAPTATION: OPERATION SELECTION IN THE MPEG-21 \nFRAMEWORK Anastasis A. Sofokleous Brunel University, Uxbridge, United Kingdom \nAnastasis.Sofokleous@brunel.ac.uk Marios C. Angelides Brunel University, Uxbridge, United \nKingdom marios.angelides@brunel.ac.uk Christos N. Schizas University of Cyprus, Nicosia, \nCyprus schizas@ucy.ac.cy ABSTRACT Whilst many content adaptation operations exist and a \nnumber of different approaches are currently being proposed, selecting the right content \nadaptation operation is largely an ad hoc process. In this paper we discuss issues pertinent to \ncontent adaptation operations and in particular the process of their selection by taking the view that \na selection process needs to be informed both by the results of the evaluation of generated content \nand the analysis of the content. The discussion is made in the context of MPEG-21 which of (…",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Testing the predictability of the Cyprus Stock Exchange: The case of an emerging market",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/859422/",
            "Abstract": "A systematic investigation of the effect of different neural network architecture alternatives for predicting the future course of stock prices in the Cyprus Stock Exchange (CSE) market is conducted. This market exhibited an abrupt increase in the general index price during the last year, thus forming a very interesting case for research purposes. The influence of various economic and political factors, from both the local and the international scene, have also been examined. The main conclusion drawn is that the CSE market is governed by unique conditions which when properly modeled can yield successful predictions.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimation of the daily heating and cooling loads using artificial neural networks",
            "Publication year": 2001,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/883",
            "Abstract": "The objective of this work is to use Artificial Neural Networks for the estimation of the daily heating and cooling loads. The daily loads of nine different building structures have been estimated using the TRNSYS program and a typical meteorological year of Cyprus. This set of data has been used to train a neural network. For each day of the year the maximum and minimum loads were obtained from which heating or cooling loads can be determined. All the buildings considered, had the same areas but different structural characteristics. Single and double walls have been considered as well as a number of different roof insulations. A multislab feedforward architecture having 3 hidden slabs has been employed. Each hidden slab comprised of 36 neurons. For the  training data set  the R2-values obtained were 0.9896 and 0.9918 for the maximum and minimum loads respectively. The method was validated by using actual (modeled) data for one building, for all days of the year, which the network has not seen before. The R2-values obtained in this case are 0.9885 and 0.9905 for the two types of loads respectively. The results indicate that the proposed method can be used for the required predictions for buildings of different constructions. At present the method was used primarily to investigate its suitability for this kind of predictions.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive computing for supporting eHealth",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s12553-016-0162-2",
            "Abstract": "Various terms have been used in the past for describing the adoption of sophisticated tools that make the life of a medical professional better that subsequently leads to a better life for the citizen. Terms such as Medical Informatics, Computer Aided Diagnosis, Artificial Intelligence in Medicine, Computational Intelligent Medical System, and Machine Learning in Medicine, have been used and are being used in an effort to facilitate the main players with better tools and methods. Cognitive computing is the simulation of human thought processes in a computerized model. Cognitive computing involves self-learning systems that use data mining, pattern recognition and natural language processing to mimic the way the human brain works. Different types of cognitive computing solutions offer various capabilities, such as, Learning and building knowledge from various structured and unstructured sources of information …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "A neurocomputational model of visual selective attention for human computer interface applications",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2407796.2407815",
            "Abstract": "An overview of a neurocomputational model of visual selective attention that has been properly implemented is presented in this report. We briefly explain the basic components and neural interactions that comprise the model and we discuss its possible applications for human computer interaction.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ethnicity as a factor for the estimation of the risk for preeclampsia: a neural network approach",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_49",
            "Abstract": "A large number of feedforward neural structures, both standard multilayer and multi-slab schemes have been applied to a large data base of pregnant women, aiming at generating a predictor for the risk of preeclampsia occurrence at an early stage. In this study we have investigated the importance of ethnicity on the classification yield. The database was composed of 6838 cases of pregnant women in UK, provided by the Harris Birthright Research Centre for Fetal Medicine in London. For each subject 15 parameters were considered as the most influential at characterizing the risk of preeclampsia occurrence, including information on ethnicity. The same data were applied to the same neural architecture, after excluding the information on ethnicity, in order to study its importance on the correct classification yield. It has been found that the inclusion of information on ethnicity, deteriorates the prediction yield in …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Implementing the MPEG-21 adaptation quality of service in dynamic environments",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11751632_13",
            "Abstract": "MPEG-21 embeds the AQoS schema tool which describes and associates conceptually major utilities required during the adaptation process, for example, adaptation operators, constraints and qualities. Defining an AQoS model, i.e. possible adaptation operators, predictable constraints and qualities that will be included in an instance of AQoS which accompanies a media file, and consequently initialising its values is a complex process. In this paper, we present our conceptual model design for implementing the AQoS.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Modeling socio-politico-economic systems with time-dependent fuzzy cognitive maps",
            "Publication year": 2012,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/3640",
            "Abstract": "Most of the formalisms of fuzzy cognitive maps (FCM) that had been proposed and applied in the past are relatively simple in the sense that they handle the various interacting and time-varying concepts as zeroth-order dynamical components. That is, they do not accommodate time delays and growth exponential time constants. In modeling real life systems, especially in the general domain of socio-politico-economics, the time delays are often important and need to be accounted. Also, the various sensitivities associating the system concepts may be time dependent. In the present work, a previously proposed FCM has been extended to include time delays, time constants and time-dependent sensitivities. The system has been applied to the Cyprus politico-economic dynamics, with emphasis on possible scenarios involving the finding and exploitation of oil/gas in the exclusive economic zone of Cyprus. The existence of natural gas - estimated at about 7 trillion cubic feet - has recently been preliminarily verified. In the interrelated dynamics, various important dynamical parameters have been taken into account, reflecting the interests of primarily the republic of Cyprus, as well as the interests of the Greek and Turkish Cypriot communities and other countries involved, such as Greece, Turkey, United Kingdom, USA, Russia, Israel and the European Union. The main parameters that had been considered in the interrelated dynamics are nationalism, religiousness, unemployment, external debt, oil extraction and the general interests of the countries involved and those of the two communities.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Autonomous Health Monitoring and Assistance Systems With IoT",
            "Publication year": 2021,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/frobt.2021.611352/full?utm_source=S-TWT&utm_medium=SNET&utm_campaign=ECO_FROBT_XXXXXXXX_auto-dlvrit",
            "Abstract": "The sustainability of the current healthcare system is being challenged by the growing percentage of the aging population. In addition to the financial sustainability entailed by such a trend, other challenges include the long delays in servicing patients, the consequent late detection of serious health issues, and the necessity of hospitalization. Despite certain risks, the majority of elderly people prefer to age in their own homes. As a matter of fact, studies show that elderly people who choose to keep living independently have longer life expectancies than those who join elderly homes. All these put together emphasize the need to develop technological solutions that autonomously monitor and enhance the well-being of the elderly in their homes.The uptake of the Internet of Things (IoT) opens new opportunities for how technology can assist people in improving their health and well-being along with improving the cost-effectiveness and quality of health and social services. These technological advancements result in various low-cost sensory equipment that benefit the healthcare of the aging population. Such technological innovation contributes to the development of applications, such as the administration of medication, voice command technologies, telemedicine, and others based on artificial intelligence. In particular, machine learning and predictive analysis combined with IoT will play an important role in the early detection of suspicious signs that, if left untreated, can lead to mobility, mental, and cognitive issues. Other applications may aggregate the high frequency, messy, and intermittent data. Such data can then be incorporated in the …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "A generic model of visual selective attention",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-12084-3_6",
            "Abstract": "We present a computational model for the understanding of the fundamental principles of visual selective attention. The model has important medical, social and engineering applications that could benefit the general public. The design of the model is guided by the state of the art in neurophysiological evidence and its performance has been evaluated by comparisons to behavioral data from psychological studies. The model effectively links low level neural interactions with behavioral data, thus providing concrete explanations for psychological phenomena. The model was used to simulate finding from several behavioral experiments on visual selective attention, with emphasis on those eliciting controversies in the scientific literature.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Multi-purpose HealthCare Telemedicine Systems with mobile communication link support",
            "Publication year": 2003,
            "Publication url": "https://biomedical-engineering-online.biomedcentral.com/articles/10.1186/1475-925x-2-7",
            "Abstract": "The provision of effective emergency telemedicine and home monitoring solutions are the major fields of interest discussed in this study. Ambulances, Rural Health Centers (RHC) or other remote health location such as Ships navigating in wide seas are common examples of possible emergency sites, while critical care telemetry and telemedicine home follow-ups are important issues of telemonitoring. In order to support the above different growing application fields we created a combined real-time and store and forward facility that consists of a base unit and a telemedicine (mobile) unit. This integrated system: can be used when handling emergency cases in ambulances, RHC or ships by using a mobile telemedicine unit at the emergency site and a base unit at the hospital-expert's site, enhances intensive health care provision by giving a mobile base unit to the ICU doctor while the telemedicine unit remains at the ICU patient site and enables home telemonitoring, by installing the telemedicine unit at the patient's home while the base unit remains at the physician's office or hospital. The system allows the transmission of vital biosignals (3–12 lead ECG, SPO2, NIBP, IBP, Temp) and still images of the patient. The transmission is performed through GSM mobile telecommunication network, through satellite links (where GSM is not available) or through Plain Old Telephony Systems (POTS) where available. Using this device a specialist doctor can telematically \"move\" to the patient's site and instruct unspecialized personnel when handling an emergency or telemonitoring case. Due to the need of storing and archiving of all data interchanged during …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:u5HHmVD_uO8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Electronic roads: intelligent navigation through multi-contextual information",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-003-0090-0",
            "Abstract": "This paper proposes a model for intelligent navigation through multi-contextual information that could form electronic roads in the information society. This paper aims to address the problem of electronic information roads, define their notion and the technical form they can take as well as present the tools developed for implementing such a system. The main objective of the proposed model is to give the traveler the capability of exploring the information space in a natural way where the information offered will remain continuously interesting. The system offers links to information in a dynamic and adaptive way. This is achieved by employing intelligent navigation techniques, which combine user profiling and meta-data. Electronic roads emphasize the presentation of multi-contextual information, i.e., information that is semantically related but of different nature at different locations and time. An electronic road …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Neural networks to estimate the influence of cervix length on the prediction of spontaneous preterm delivery before 37 weeks",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/61",
            "Abstract": "Neural networks were applied in an effort to predict the risk for early spontaneous preterm delivery using various demographic, clinical, and laboratory inputs. Furthermore, attention has been focused on the influence of cervical length (CL) for the prediction of spontaneous preterm delivery. Data for 59,313 cases of pregnant women were collected and processed. The final data used were those that were considered to offer clear indication on the significance of cervical length on the prediction. The cervical length was measured by sonography in the range of 22-24 weeks of gestation. Preliminary results showed a prediction rate of approximately 65% was attained through the application of a variety of neural network topologies. It has been found that if the cervical length is excluded from the input data, this results in an approximately 10% decrease in the prediction yield, as obtained from the neural network predictor, thus the sensitivity to cervical length is quite significant.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:p__nRnzSRKYC",
            "Publisher": "IEEE Conference Proceeding"
        },
        {
            "Title": "Healthcare telematic applications in Cyprus",
            "Publication year": 2002,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0038-1634455",
            "Abstract": " Objectives: a) To present a review of ongoing health telematic applications in Cyprus. b) To promote the use of these health telematic applications in the Cyprus region. c) To help in the spin off of other health telematic applications thus enabling the offering of a better health service to the citizens. Methods and Results: The health telematics applications include a medical system for emergency telemedicine (AMBULANCE and EMERGENCY-112 projects), a system for the evaluation of the risk of stroke by telemedicine (EROS), a diagnostic telepathology network in gynaecological cancer (TELEGYN), a collaborative virtual medical team for home healthcare of cancer patients (DITIS), and a health telematics training network (HEALTHNET). The paper refers to the set-up and characteristics of these applications and tries to relate them with the health policies that should be applied in Cyprus. Conclusions: It is …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Schattauer GmbH"
        },
        {
            "Title": "Mobile health systems: A brief overview",
            "Publication year": 2002,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4740/0000/Mobile-health-systems-a-brief-overview/10.1117/12.472960.short",
            "Abstract": "Rapid advances in information technology and telecommunications, and more specifically wireless and mobile communications, and their convergence (telematics) are leading to the emergence of a new type of information infrastructure that has the potential of supporting an array of advanced services for healthcare. The objective of this paper is to provide a snapshot of the applications of mobile technology in healthcare. A brief review of the spectrum of these applications and the potential benefits of these efforts will be presented, followed by success case studies in electronic patient record, emergency telemedicine, teleradiology, and home monitoring. It is anticipated that the progress carried out in these efforts, and the potential benefits of emerging mobile technologies will trigger the development of more applications, thus enabling the offering of a better service to the citizen.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A Fuzzy Cognitive Map System to Explore Certain Scenarios on the Cyprus Banking System.",
            "Publication year": 2014,
            "Publication url": "https://www.scitepress.org/Papers/2014/50397/50397.pdf",
            "Abstract": "1Department of Computer Science, University of Cyprus, 1 University Avenue, 2109, Nicosia, Cyprus 2Department of Mechanical Engineering and Materials Science and Engineering, Cyprus University of Technology, 30 Archbishop Kyprianou Str., 3036, Limassol, Cyprus 3The School of Humanities and Social Sciences, European University of Cyprus, PO Box: 22006, 1516, Nicosia, Cyprus",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-invasive trisomy 21 diagnosis using fuzzy cognitive maps",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_140",
            "Abstract": "A fuzzy Diagnostic Decision Support System (DDSS) has been developed, exploiting the possibilities of a specific algorithm which transforms a crisp dataset into fuzzy. The purpose of the developed fuzzy DDSS is the diagnosis of fetuses with Trisomy 21 (T21). The main reason behind the selection of this diagnosis problem is the need of sonographers to escape the preconditions of having specialized screening systems and being highly precise during prenatal screening tests. With the help of an intelligent fuzzy system, a sonographer can input the states of the prenatal screening tests in linguistic terms (which are based on his experience and knowledge) and get a diagnosis result.Fuzzy Cognitive Map (FCM) has been chosen to be the model of the fuzzy DDSS model for this diagnosis problem. Essentially, FCM is a network connecting fuzzy concepts with edges resembling their cause-effect …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A proposed extension of the CODAM model for human attention",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/b137171_15",
            "Abstract": "A new computational model of visual attention is proposed on a theoretical basis, based on the CODAM model (Taylor, 2002, [25], 2006). Also a more general mechanism is proposed for an attention model of two or more senses working concurrently. The additional mechanism is mainly based on the interaction of the attention mechanism in the brain with working memory.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Integrated electronic health record database management system: A proposal.",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ATkxCgAAQBAJ&oi=fnd&pg=PA187&dq=info:gfqRLsJl85cJ:scholar.google.com&ots=uYPaFe_nFQ&sig=WTyHXEPLGtaKt2cEOyvOJvUxdQE",
            "Abstract": "eHealth has attained significant importance as a new mechanism for health management and medical practice. However, the technological growth of eHealth is still limited by technical expertise needed to develop appropriate products. Researchers are constantly in a process of developing and testing new software for building and handling Clinical Medical Records, being renamed to Electronic Health Record (EHR) systems; EHRs take full advantage of the technological developments and at the same time provide increased diagnostic and treatment capabilities to doctors. A step to be considered for facilitating this aim is to involve more actively the doctor in building the fundamental steps for creating the EHR system and database. A global clinical patient record database management system can be electronically created by simulating real life medical practice health record taking and utilizing, analyzing the recorded parameters. This proposed approach demonstrates the effective implementation of a universal classic medical record in electronic form, a procedure by which, clinicians are led to utilize algorithms and intelligent systems for their differential diagnosis, final diagnosis and treatment strategies.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artificial Neural Network Learning: A Comparative",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=i6moCAAAQBAJ&oi=fnd&pg=PA300&dq=info:huf7Cp_uTK4J:scholar.google.com&ots=5piAQPYm0Y&sig=Ig86AuqNzHIkp6DQpQ0rjFVJnM8",
            "Abstract": "Various neural learning procedures have been proposed by different researchers in order to adapt suitable controllable parameters of neural network architectures. These can be from simple Hebbian procedures to complicated algorithms applied to individual neurons or assemblies in a neural structure. The paper presents an organized review of various learning techniques, classified according to basic characteristics such as chronology, applicability, functionality, stochasticity etc. Some of the learning procedures that have been used for the training of generic and specific neural structures, and will be reviewed are: Hebbian-like (Grossberg, Sejnowski, Sutton, Bienenstock, Oja & Karhunen, Sanger, Yuile et al., Hasselmo, Kosko, Cheung & Omidvar), Reinforcement learning, Min-max learning, Stochastic learning, Genetics-based learning, Artificial life-based learning. The various learning procedures will be critically compared, and future trends will be highlighted.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Springer"
        },
        {
            "Title": "A neural network model of the attentional blink phenomenon",
            "Publication year": 2009,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/5345",
            "Abstract": "The Attentional Blink refers to the finding that the perception of a target stimulus is often impaired when it is presented within a temporal window of 200-500 ms following another successfully-perceived stimulus. This interesting phenomenon has attracted much research in the fields of attention and perception but has also inspired the implementation of several computational models. In the present study we have implemented a model of selective attention that is capable of modelling a variety of findings related to the Attentional Blink. Importantly, the model produces synchronization of neural activity to simulate the interaction between a low-level visual system and a high-level goal-maintenance system during the deployment of attention. Synchronization of neural activity within and across brain areas is typically observed when carrying out various tasks that involve the attentional processing of information. Thus, the model provides a neurally and computationally plausible account for the Attentional Blink and potentially other attentional tasks.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:ZeXyd9-uunAC",
            "Publisher": "CRL Publishing"
        },
        {
            "Title": "A fuzzy cognitive map model for estimating the repercussions of Greek PSI on Cypriot bank branches in Greece",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41142-7_60",
            "Abstract": "Recently, Greece experienced a financial crisis unprecedented in its modern history. In May of 2010 Greece signed a bailout memorandum with Troika (a tripartite committee constituted by the European Central Bank, the European Commission and the International Monetary Fund). In February of 2012, they proceeded to a second bailout package along with a debt restructuring deal that included a private sector involvement (PSI). The overall loss, for the private investors, was equivalent to around 75%. Due to the strong economic ties between Greece and Cyprus, PSI had a substantial impact on the Cypriot economy. A fuzzy cognitive map (FCM) system has been developed and used to study the repercussions of the Greek PSI on the economic dynamics of Cyprus and more specifically on the probability of cutting off the Cypriot Bank branches that operate in Greece. The system allows one to observe how …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Two‐stage approach for risk estimation of fetal trisomy 21 and other aneuploidies using computational intelligence systems",
            "Publication year": 2018,
            "Publication url": "https://obgyn.onlinelibrary.wiley.com/doi/abs/10.1002/uog.17558",
            "Abstract": "To estimate the risk of fetal trisomy 21 (T21) and other chromosomal abnormalities (OCA) at 11–13 weeks' gestation using computational intelligence classification methods.As a first step, a training dataset consisting of 72 054 euploid pregnancies, 295 cases of T21 and 305 cases of OCA was used to train an artificial neural network. Then, a two‐stage approach was used for stratification of risk and diagnosis of cases of aneuploidy in the blind set. In Stage 1, using four markers, pregnancies in the blind set were classified into no risk and risk. No‐risk pregnancies were not examined further, whereas the risk pregnancies were forwarded to Stage 2 for further examination. In Stage 2, using seven markers, pregnancies were classified into three types of risk, namely no risk, moderate risk and high risk.Of 36 328 unknown to the system pregnancies (blind set), 17 512 euploid, two T21 …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:NJ774b8OgUMC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Filter-based approach for ornamentation detection and recognition in singing folk music",
            "Publication year": 2015,
            "Publication url": "https://www.um.edu.mt/library/oar/handle/123456789/26587",
            "Abstract": "Ornamentations in music play a significant role for the emotion which a performer or a composer aims to create. The automated identification of ornamentations enhances the understanding of music, which can be used as a feature for tasks such as performer identification or mood classification. Existing methods rely on a pre-processing step that performs note segmentation. We propose an alternative method by adapting the existing two-dimensional COSFIRE filter approach to onedimension (1D) for the automatic identification of ornamentations in monophonic folk songs. We construct a set of 1D COSFIRE filters that are selective for the 12 notes of the Western music theory. The response of a 1D COSFIRE filter is computed as the geometric mean of the differences between the fundamental frequency values in a local neighbourhood and the preferred values at the corresponding positions. We apply the proposed 1D COSFIRE filters to the pitch tracks of a song at every position along the entire signal, which in turn give response values in the range [0,1]. The 1D COSFIRE filters that we propose are effective to recognize meaningful musical information which can be transformed into symbolic representations and used for further analysis. We demonstrate the effectiveness of the proposed methodology in a new data set that we introduce, which comprises five monophonic Cypriot folk tunes consisting of 428 ornamentations. The proposed method is effective for the detection and recognition of ornamentations in singing folk music.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Key issues for the design and development of mobile commerce services and applications",
            "Publication year": 2005,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/14028",
            "Abstract": "This paper suggests a new approach for developing m-commerce services and applications based on a scheme that divides m-applications into directory- and transaction-oriented classes, identifies mobile user requirements, and takes into consideration the constraints of current technologies for mobile and wireless computing. The efficacy of the proposed approach in a real scenario is discussed. Copyright © 2005 Inderscience Enterprises Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:KUbvn5osdkgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning style recognition based on an adjustable three-layer fuzzy cognitive map",
            "Publication year": 2011,
            "Publication url": "https://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-02930a7f-6aa3-40bf-82b6-a3f36f1a7ece",
            "Abstract": "Identification of learning styles supports Adaptive Educational Hypermedia Systems compiling and presenting tutorials custom in cognitive characteristics of each individual learner. This work addresses the issue: identifying the learning style of students, following the Kolb’s learning cycle. To this purpose, we propose a three-layers Fuzzy Cognitive Map (FCM) in conjunction with a dynamic Hebbian rule for learning styles recognition. The form of FCMs is designed by humans who determine its weighted interconnections among concepts. But the human factor may not be as reliable as it should be. Thus, a FCM model of the system allowing the adjustment of its weights using additional learners’ characteristics such as the Learning Ability Factors. In this article, two consecutively interconnected FCM (in the form of a three layer FCM) are presented. The schema’s efficiency has been tested and compared to known results after a fine-tuning of the weights of the causal interconnections among concepts. The simulations results of training the process system verify the effectiveness, validity and advantageous characteristics of those learning techniques for FCMs. The online recognition of learning styles by using threelayer Fuzzy Cognitive Map improves the accuracy of recognition obtained using Bayesian Networks that uses quantitative measurements of learning style taken from statistical samples. This improvement is due to the fuzzy nature of qualitative characterizations (such as learning styles), and the presence of intermediate level nodes representing Learning Ability Factors. Such factors are easily recognizable characteristics of a learner to improve …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive Computing for Medicine-CoCoMed",
            "Publication year": 2017,
            "Publication url": "http://camed.webhosting.rug.nl/wp-content/uploads/2017/01/04.Schiza.pdf",
            "Abstract": "Various terms have been used in the past for describing the adoption of sophisticated tools that make the life of a medical professional better that subsequently leads to a better life for the citizen. Terms such as Medical Informatics, Computer Aided Diagnosis, Artificial Intelligence in Medicine, Computational Intelligent Medical System, and Machine Learning in Medicine, have been used and are being used in an effort to facilitate the main players with better tools and methods. Cognitive computing is the simulation of human thought processes in a computerized model. Cognitive computing involves self-learning systems that use data mining, pattern recognition and natural language processing to mimic the way the human brain works. Different types of cognitive computing solutions offer various capabilities, such as, Learning and building knowledge from various structured and unstructured sources of information, Understanding natural language and interact with humans, Capturing the expertise of top experts, Improving the cognitive processes for better decision making, and making it more uniform across different professions. The closets attempt to combine efforts is offered by Computational Intelligence (CI) where at least three of the well tested approaches are combined, being Artificial Neural Networks (ANN), Fuzzy Systems (FS), and Evolutionary Computing (EC). Therefore one can claim that CI= ANN+ FS+ EC. Our experience in applying the above in many real life environments generated some doubts whether the proposed equation is true because if it was true one could claim that CI is the same as Cognitive Computing (CC) which is not [1 …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:i2xiXl-TujoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A study on the effects of environmental factors for the forecasting of electric power load",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/879747/",
            "Abstract": "A feedforward multilayer neural network has been used for the estimation of the four-hour-ahead electric load in a power plant in the island of Crete. An attempt was made to use few variables for the input vector, while keeping the accuracy to acceptable levels. To this effect a sensitivity analysis of the input parameters was performed. The parameters investigated were both environmental (weather condition, minimum and maximum temperature) and seasonal (Julian day, holiday classification). The architecture of the network was a multi-slab feedforward structure using backpropagation. This served as the selected platform for comparisons. The network was trained with data that were pruned in both size and content. The correlation coefficient between actual and predicted power load was 0.987 when all the parameters were used for the training of the network. The network has also been compared to a multiple …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A biologically inspired neural network composed of dissimilar single neuron models",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1019026/",
            "Abstract": "A multilayer neural network has been developed that consists of slabs of single neuron models. Each slab is composed of a single type of neurons, which differs between the slabs. The network was trained using a biologically inspired, Hebbian-like, learning rule on EMG data and good training/testing classification performance was obtained. It was shown that the biologically inspired network, the novel architecture of which is derived from the functionally distinct hypercolumns of neurons in the brain, can be successfully applied on difficult classification tasks.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An overview of recent end-to-end wireless medical video telemedicine systems using 3G",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5628076/",
            "Abstract": "Advances in video compression, network technologies, and computer technologies have contributed to the rapid growth of mobile health (m-health) systems and services. Wide deployment of such systems and services is expected in the near future, and it's foreseen that they will soon be incorporated in daily clinical practice. This study focuses in describing the basic components of an end-to-end wireless medical video telemedicine system, providing a brief overview of the recent advances in the field, while it also highlights future trends in the design of telemedicine systems that are diagnostically driven.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integration of Biobanks in National eHealth Ecosystems Facilitating Long-Term Longitudinal Clinical-Omics Studies and Citizens' Engagement in Research Through eHealthBioR",
            "Publication year": 2021,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8521893/",
            "Abstract": "Biobanks have long existed to support research activities with BBMRI-ERIC formed as a European research infrastructure supporting the coordination for biobanking with 20 country members and one international organization. Although the benefits of biobanks to the research community are well-established, the direct benefit to citizens is limited to the generic benefit of promoting future research. Furthermore, the advent of General Data Protection Regulation (GDPR) legislation raised a series of challenges for scientific research especially related to biobanking associate activities and longitudinal research studies. Electronic health record (EHR) registries have long existed in healthcare providers. In some countries, even at the national level, these record the state of the health of citizens through time for the purposes of healthcare and data portability between different providers. The potential of EHRs in research is …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:86PQX7AUzd4C",
            "Publisher": "Frontiers Media SA"
        },
        {
            "Title": "A comparison of classical, neural and fuzzy control schemes for the position control of an underwater vehicle",
            "Publication year": 2006,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54616",
            "Abstract": "A comparative study for the automatic control of an underwater vehicle has been conducted. The vessel was equipped with only three thrusters (one on top, a second at port and a third at starboard) for the control of its position, a condition that made the problem very difficult to tackle. Furthermore, the system is highly non-linear. A control system has been simulated for the regulation of the marine thrusters so that they stabilize the vehicle at a desired position, irrespective of external disturbances. The dynamical equations of a model of the vessel, when disturbed by cable forces and manipulated by the thrust forces that are generated by the propellers are described. The various vehicle parameters needed to describe its dynamic behaviour (mass, center of mass, added coefficients) have been estimated. The control schemes that were implemented are the classical PID, a neural control system, and a fuzzy control. It was found that a combination of classical and intelligent control gave the best results.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive modeling of dilution effects in visual search",
            "Publication year": 2012,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/3637",
            "Abstract": "A biologically plausible neural network model of selective attention has been implemented to account for discrepant findings on the source of distractor interference in visual search tasks. The model successfully simulated the findings from an experiment by Benoni and Tsal (2010) documenting the effects of dilution on distractor interference. In conjunction with previous implementations of the model, we have been able to offer a unifying account that settles the controversy between the Perceptual Load and the Dilution theories of selective attention. 2012 Springer-Verlag.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:URolC5Kub84C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Region based Support Vector Machine algorithm for medical diagnosis on Pima Indian Diabetes dataset",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6399663/",
            "Abstract": "The problem of diagnosing Pima Indian Diabetes from data obtained from the UCI Repository of Machine Learning Databases[6] is handled with a modified Support Vector Machine strategy. Performance comparison with previous studies is presented in order to demonstrate the proposed algorithm's advantages over various classification methods. The goal of the paper is to provide the grasp of a methodology that can be efficiently used to raise classification success rates obtained by the use of conventional approaches such as Neural Networks, RBF networks and K-nearest neighbors. The suggested algorithm divides the training set into two subsets: one that arises from the joining of coherent data regions and one that comprises of the data portion that is difficult to be clustered. Consequently, the first subset is used to train a Support Vector Machine with a RBF kernel and the second subset is used to train another …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial neural networks for non-invasive chromosomal abnormality screening of fetuses",
            "Publication year": 2010,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/5346",
            "Abstract": "A large number of different neural network structures have been constructed, trained and tested to a large data base of pregnant women characteristics, aiming at generating a classifier-predictor for the presence of chromosomal abnormalities in fetuses, namely the Trisomy 21 (Down syndrome), Trisomy 18 (Edwards syndrome), Trisomy 13 (Patau syndrome) and the Turner syndrome. The database was composed of 31611 cases of pregnant women. 31135 women did not show any chromosomal abnormalities, while the remaining 476 were confirmed as having a chromosomal anomaly of T21, T18, T13, or Turner Syndrome. From the total of 31611 cases, 8191 were kept as a totally unknown database that was only used for the verification of the predictability of the network. In this set, 7 were of the Turner syndrome, 14 of the Patau syndrome, 42 of the Edwards syndrome and 71 of the Down syndrome. For each subject, 10 parameters were considered to be the most influential at characterizing the risk of occurrence of these types of chromosomal anomalies. The best results were obtained when using a multi-layer neural structure having an input, an output and three hidden layers. For the case of the totally unknown verification set of the 8191 cases, 98.1% were correctly identified. The percentage of abnormal cases correctly predicted was 85.1%. The unknown T21 cases were predicted by 78.9%, the T18 by 76.2%, the T13 by 0.0% and the Turner syndrome by 42.9%.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:L7CI7m0gUJcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Practical evaluation of GPRS use in a telemedicine system in Cyprus",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1222417/",
            "Abstract": "The unceasing emergence of new technologies in wireless and mobile telecommunication networks, combined with the simultaneous rapid advances in information technology, are leading to many new solutions in the field of telemedicine, thus offering more opportunities for improving further existing and supporting new advanced services for healthcare. The objective of this paper is to carry out a practical evaluation of the performance of the GSM and GPRS systems in the transmission/reception of X-ray images and video in emergency orthopedics cases. As expected, the performance of GPRS is superior to that of GSM. The data transfer rate achieved with GPRS were in the range of 32 Kbps with the download time for typical X-ray images of a file size of 200 Kbytes to the mobile device to be in the region of 60 seconds. Similar performance was also recorded in the case of a moving station (simulating the …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experience with Healthcare Telematics in Cyprus",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/30672093/2004_Experience_with_healthcare_telematics_in_cyprus.pdf",
            "Abstract": "In this paper a review of three healthcare telematic applications in Cyprus are presented. These include a medical system for emergency telemedicine (AMBULANCE and EMERGENCY-112 projects), a diagnostic telepathology network in gynaecological cancer (TELEGYN), and a collaborative virtual medical team for home healthcare of cancer patients (DITIS). The problems associated with the deployment of the former two in routine clinical practise as well as the reasons of success of the third project will be briefly discussed.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Modular Neural Network System for the Analysis of Nuclei in Histopathological Sections",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7908-1788-1_11",
            "Abstract": "The evaluation of immunocytochemically stained histopathological sections presents a complex problem due to many variations that are inherent in the methodology. This chapter describes a modular neural network system which is being used for the detection and classification of breast cancer nuclei named Biopsy Analysis Support System (BASS). The system is based on a modular architecture where the detection and classification stages are independent. Two different methods for the detection of nuclei are being used: the one approach is based on a feed forward neural network (FNN) which uses a block-based singular value decomposition (SVD) of the image, to signal the likelihood of occurrence of nuclei.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:GnPB-g6toBAC",
            "Publisher": "Physica, Heidelberg"
        },
        {
            "Title": "Synoptic classification and establishment of analogues with artificial neural networks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7643-8419-7_14",
            "Abstract": "Weather charts depicting the spatial distribution of various meteorological parameters constitute an indispensable pictorial tool for meteorologists, in diagnosing and forecasting synoptic conditions and the associated weather. The purpose of the present research is to investigate whether training artificial neural networks can be employed in the objective identification of synoptic patterns on weather charts. In order to achieve this, the daily analyses at 0000UTC for 1996 were employed. The respective data consist of the grid-point values of the geopotential height of the 500 hPa isobaric level in the atmosphere. A uniform grid-point spacing of 2.5°×2.5° is used and the geographical area covered by the investigation lies between 25°N and 65°N and between 20°W and 50°E, covering Europe, the Middle East and the Northern African Coast. An unsupervised learning self-organizing feature map algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Birkhäuser Basel"
        },
        {
            "Title": "Medical content searching, retrieving, and sharing over the internet: lessons learned from the mEducator through a scenario-based evaluation",
            "Publication year": 2015,
            "Publication url": "https://www.jmir.org/2015/10/e229",
            "Abstract": "Background: The mEducator Best Practice Network (BPN) implemented and extended standards and reference models in e-learning to develop innovative frameworks as well as solutions that enable specialized state-of-the-art medical educational content to be discovered, retrieved, shared, and re-purposed across European Institutions, targeting medical students, doctors, educators and health care professionals. Scenario-based evaluation for usability testing, complemented with data from online questionnaires and field notes of users’ performance, was designed and utilized for the evaluation of these solutions.Objective: The objective of this work is twofold:(1) to describe one instantiation of the mEducator BPN solutions (mEducator3. 0-“MEdical Education LINnked Arena” MELINA+) with a focus on the metadata schema used, as well as on other aspects of the system that pertain to usability and acceptance, and (2) to present evaluation results on the suitability of the proposed metadata schema for searching, retrieving, and sharing of medical content and with respect to the overall usability and acceptance of the system from the target users.Methods: A comprehensive evaluation methodology framework was developed and applied to four case studies, which were conducted in four different countries (ie, Greece, Cyprus, Bulgaria and Romania), with a total of 126 participants. In these case studies, scenarios referring to creating, sharing, and retrieving medical educational content using mEducator3. 0 were used. The data were collected through two online questionnaires, consisting of 36 closed-ended questions and two open-ended questions …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:9vf0nzSNQJEC",
            "Publisher": "JMIR Publications Inc., Toronto, Canada"
        },
        {
            "Title": "First trimester noninvasive prenatal diagnosis: a computational intelligence approach",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7172440/",
            "Abstract": "The objective of this study is to examine the potential value of using machine learning techniques such as artificial neural network (ANN) schemes for the noninvasive estimation, at 11-13 weeks of gestation, the risk for euploidy, trisomy 21 (T21), and other chromosomal aneuploidies (O.C.A.), from suitable sonographic, biochemical markers, and other relevant data. A database1 consisted of 51,208 singleton pregnancy cases, while undergoing first trimester screening for aneuploidies has been used for the building, training, and verification of the proposed method. From all the data collected for each case from the mother and the fetus, the following 9 are considered by the collaborating obstetricians as the most relevant to the problem in question: maternal age, previous pregnancy with T21, fetal crown-rump length, serum free β-hCG in multiples of the median (MoM), pregnancy-associated plasma protein-A in MoM …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Universal Electronic Health Record (U-EHR): A global medical database management system",
            "Publication year": 2018,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/62454",
            "Abstract": "George Z. Panos, Eirini C. Schiza, Aristide Ilias, Paraskevi Chra, George Pavlides, Christos N. Schizas",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:5qfkUJPXOUwC",
            "Publisher": "APPIS"
        },
        {
            "Title": "A patient centered electronic health system: an example for cyprus.",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ApzYBAAAQBAJ&oi=fnd&pg=PA111&dq=info:6VgO-Qc6EZMJ:scholar.google.com&ots=ch9yoLVt0K&sig=ZvkJ2BTCrGitUUmr1PbwmKSjpn8",
            "Abstract": "The design and implementation of a healthcare system needs to follow a specific philosophy regarding its operational structure and must be adapted gradually with one step at a time, depending on the level of maturity of a country on certain key issues. The main goal of this paper is to present an overall recommendations framework for implementing an Electronic Health System at national level, guided by the Patient Centered Philosophy. Certain prerequisites for implementing such systems are analyzed together with guiding principles for identifying the maturity level of an organization or country. The maturity level analysis for Cyprus is presented and is accompanied by some recommendations that determine the steps needed to prepare the ground for a complete patient centered national healthcare system.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational modeling of visual selective attention based on correlation and synchronization of neural activity",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_26",
            "Abstract": "Within the broad area of computational intelligence, it is of great importance to develop new computational models of human behaviour aspects. In this report we look into the recently suggested theory that neural synchronization of activity in different areas of the brain occurs when people attend to external visual stimuli. Furthermore, it is suspected that this cross-area synchrony may be a general mechanism for regulating information flow through the brain. We investigate the plausibility of this hypothesis by implementing a computational model of visual selective attention that is guided by endogenous and exogenous goals (i.e., what is known as top down and bottom-up attention). The theoretical structure of this model is based on the temporal correlation of neural activity that was initially proposed by Niebur and Koch (1994). While a saliency map is created in the model at the initial stages of processing …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Implementing a Software Cache for Genetic Programming Algorithms for Reducing Execution Time.",
            "Publication year": 2014,
            "Publication url": "https://www.scitepress.org/Papers/2014/50812/50812.pdf",
            "Abstract": "A cache holding reusable computations that are carried out during the execution of a genetic algorithm is implemented and maintained in order to improve the performance of the genetic algorithm itself. The main idea is that the operational genome is actually consisting of small computational blocks that tend to be interchanged and reused several times before they complete (or not) their lifecycle. By computing these blocks once and keeping them in memory for future possible reuse, the algorithm is allowed to run up to fifty times faster according experimental results maintaining a general case execution time reduction of four times. The consistency of the cache is maintained through simple rules that validate entries in a very straight forward manner during the genetic operations of cross over and mutation.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "De-speckle filtering in ultrasound imaging of the carotid artery",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1106259/",
            "Abstract": "The main objective of this paper is to evaluate the classification performance of de-speckle filtering on ultrasound imaging of the carotid atherosclerotic plaque. The following procedure was investigated on 230 images (recorded from 115 symptomatic, and 115 asymptomatic subjects): (i) six different de-speckle filters were used based on first order and higher order local statistics, anisotropic diffusion, and geometric properties; (ii) nine different texture feature sets were extracted, and (iii) the k-nearest neighbor classifier was used to classify a plaque as symptomatic or asymptomatic. The despeckle filters based on higher order statistics, anisotropic speckle diffusion, and geometric properties gave a slightly higher percentage of correct classifications score than the original images.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Short CV and Research Interests",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=11949077686550744741&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multipurpose health care telemedicine system",
            "Publication year": 2001,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13834",
            "Abstract": "In this study we present a multipurpose health care telemedicine system, which can be used for emergency or patient monitoring cases. Ambulances, Rural Health Centers (RHC) or other remote health location, Ships navigating in wide seas and Airplanes in flight are common examples of possible emergency sites, while critical care telemetry and telemedicine home follow-ups are important issues of patient monitoring. The telemedicine system is a combined real-time and store and forward facility that consists of a base unit and a telemedicine (mobile) unit. The telemedicine unit (patient site) allows the transmission of vital biosignals (3-12 lead ECG, SPO2, NIBP, IBP, Temp) and still images of the patient from the incident place to the base unit (consultation site). The transmission is performed through GSM, Satellite links or POTS. Using this device a specialist doctor can telematically \"move\" to the patient site and instruct medical personnel when handling a patient. The consultation site is equipped with a multimedia database able to store and manage the data collected by the system. The system was validated in four different countries using a standardized medical protocol.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantitative analysis of brain white matter lesions in multiple sclerosis subjects: Preliminary findings",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4570645/",
            "Abstract": "In this study the value of magnetic resonance image (MRI) shape and texture analysis was assessed in multiple sclerosis (MS) subjects, both in differentiating between normal and abnormal tissue and in assessing disease progression. Shape and texture analysis was carried out in normal and diseased lesions in transverse sections of T2-weighted magnetic resonance (MR) images acquired from 10 symptomatic untreated subjects with clinically isolated syndrome (CIS) scanned twice, with an interval of 6-12 months. All detected brain lesions were manually segmented by an experienced neurologist and confirmed by a neuro-radiologist, whilst different shape and texture features were extracted from the segmented lesions. The results showed that there was no significance difference between shape features of 0 and 6-12 months. For some texture features there was significance difference between normal tissue …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cultural journeys in the information society",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/880451/",
            "Abstract": "This paper describes the Cultural Journeys in the Information Society (CJIS) project. CJIS project is an INCO project (973324) funded by the ECC and its aims to address the problem of electronic information roads at various levels and to develop a prototype system of such roads. The prototype will concentrate at first on cultural and historical information and the social relevance of such roads in education and training. This paper defines the notion of electronic information roads and explores the technical form which these roads can take. An electronic road is the user's navigation path through a multimedia environment. More precisely, it is a series of links to the system's information units (IU) the user chooses to follow through. IUs are the building blocks of the available information content and consist of the actual data (e.g. segment of video, image, sound or text) with an attached metadata index (semantic or system …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "E-commerce engineering: A short vs long software process for the development of e-commerce applications",
            "Publication year": 2003,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13830",
            "Abstract": "The immediacy in developing e-commerce applications, the quality of the services offered by these systems band the need for continuous evolution are primary issues that must be fully analysed and understood prior and during the development process. In this context, the present work suggests a new development framework which aims at estimating the level of complexity a certain e-commerce system encompasses and driving the selection of a long or short software process in terms of time and effort. The proposed framework utilizes a special form of Business Process Re-engineering (BPR) to define and assess critical business and organizational factors within small-to-medium enterprises (SMEs) whishing to go ecommerce. This set of factors is enriched with other critical issues belonging to the quality requirements of the system and to the application type of services it aspires to offer. The set of critical factors identified is used to estimate the average complexity level of the system using numerical values to describe the contribution of each factor to the overall complexity. The level of complexity estimated dictates the adoption of either a short or a long version of the well-known WebE process for analysing, designing and implementing the e-commerce system required by an SME.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Important issues to be considered in developing fuzzy cognitive maps",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6007694/",
            "Abstract": "The formalism of fuzzy cognitive maps as used for the modeling of various dynamical systems is presented with a critical point of view. Various issues related to terminology, concepts, sensitivities, time dependence, iteration procedures, and stability, are systematically considered with critical mind, aiming at making the overall system models be more realistic and useful, and to initiate discussions that can lead to clarifications and to uniformities. Emphasis is given to applications in social, political, economic and engineering systems.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A fuzzy cognitive map model of the repercussions of Greek PSI on Cypriot economy",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6705202/",
            "Abstract": "This paper introduces an alternative methodology for developing fuzzy cognitive maps (FCM) for modeling socio-politico-economic systems. The methodology is novel with respect to the proper identification, definition and initialization of the concepts and sensitivities, as well as on the updating rule. It is based on realistic and objective knowledge extraction from the experts. Within this work certain steps are suggested to be followed by the FCM developer(s) and the experts for achieving a more reliable FCM system. The features of the proposed methodology are applied and tested on a complicate system taken from the recent Cyprus and Greece economic realities. More specifically several scenarios were developed and applied to investigate the effects of the Greek PSI on a multitude of other parameters. The study was done in February of 2012, on several parameters of the Cyprus economy. The most interesting …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modular domain-to-domain translation network",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-019-04358-8",
            "Abstract": "Domain-to-domain translation methods map images from a source domain to corresponding images from a target domain. The two domains contain images from the same classes, but these images look different. Recent approaches use generative adversarial networks in various configurations and architectures to perform the translation. By using GANs, they inevitably inherit their problems like training instability and mode collapse. We propose a novel approach to the problem that does not use a GAN. Instead, it relies on an hierarchical architecture that encapsulates information of the target domain by using individually trained networks. This hierarchical architecture is then trained as one unified deep network. Using this approach, we show that images from the original domain are translated to the target domain both for the case when there is a one-to-one correspondence between the images of the two domains …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Scenario-based assessment for user-testing of medical educational content-sharing solutions",
            "Publication year": 2012,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/4450",
            "Abstract": "The mEducator Best Practice network implemented standards and reference models in the field of e-learning to develop innovative solutions that enable specialized state-of-the-art medical educational content to be discovered, retrieved, shared and re-used across European institutions. Its target groups include medical students, doctors, educators and health-care professionals. A number of innovative assessment methods, including scenario-based assessment for usability testing complimented with data from online questionnaires, interviews, screen capturing and automated tracking of activity are currently designed and utilized for the evaluation of these solutions. This paper reports on the preliminary findings of usability testing of an instantiation of an mEducator solution (Drupal) conducted by 35 graduate students of an e-health course at an EU university. Usability testing was conducted through scenarios referring to creating, sharing and retrieving medical educational content using mEducator. Implications for designing scenario-based assessment to target different user groups are offered.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:j8SEvjWlNXcC",
            "Publisher": "IATED"
        },
        {
            "Title": "Introductory editorial to the special issue on systems medicine for the delivery of better healthcare services",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s12553-016-0173-z",
            "Abstract": "Medical and Biological Engineering and Computing cover complementary disciplines that hold great promise for the advancement of research and development in complex medical and biological systems. Research and development in these areas are impacting the science and technology by advancing fundamental concepts in translational medicine, by helping us understand human physiology and function at multiple levels, by improving tools and techniques for the detection, prevention and treatment of disease. This special issue is based on a selected number of papers under the main theme BSystems",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:hkOj_22Ku90C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Artificial neural networks for non-invasive chromosomal abnormality screening of fetuses",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5596357/",
            "Abstract": "A large number of different neural network structures have been constructed, trained and tested to a large data base of pregnant women characteristics, aiming at generating a classifier-predictor for the presence of chromosomal abnormalities in fetuses, namely the Trisomy 21 (Down syndrome), Trisomy 18 (Edwards syndrome), Trisomy 13 (Patau syndrome) and the Turner syndrome.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile Computing: Technology Challenges",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=11016162522480624817&hl=en&oi=scholarr",
            "Abstract": "Mobile communications and computing has changed forever the way people communicate and interact and it has made\" any information, any device, any network, anytime, anywhere\" an everyday reality which we all take for granted. This chapter discusses the main research and development in the mobile technology and standards that made ubiquity a reality: from wireless middleware to wireless client profiling to m-commerce services.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Information Science Reference"
        },
        {
            "Title": "First trimester diagnosis of trisomy-21 using artificial neural networks",
            "Publication year": 2010,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/5340",
            "Abstract": "Langdon Down in 1866 reported on a syndrome in which individuals have skin appearing to be too large for the body, a nose small and a flat face. This is a chromosomal disorder caused by the presence of all or part of an extra 21st chromosome, and is known as the Down syndrome, or trisomy 21, or trisomy G. In the last fifteen years it has become possible to observe these features by ultrasound examination in the third month of intrauterine life. About 75% of trisomy 21 fetuses have absent nasal bone. In the present work, neural network schemes that have been applied to a large data base of findings from ultrasounds of fetuses, aiming at generating a predictor for the risk of Down syndrome are reported. A good number of feed forward neural structures, both standard multilayer and multi-slab, were tried for the prediction. The database was composed of 23513 cases of fetuses in UK, provided by the Fetal Medicine Foundation in London. For each subject, 19 parameters were measured or recorded. Out of these, 19 parameters were considered as the most influential at characterizing the risk for this type of chromosomal defect. The best results obtained were with a multi-slab neural structure. In the training set there was a correct classification of the 98.9% cases of trisomy 21 and in the test set 100%. The prediction for the totally unknown verification test set was 93.3%.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:EYYDruWGBe4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Modeling socio-politico-economic systems with time-dependent fuzzy cognitive maps",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6250798/",
            "Abstract": "Most of the formalisms of fuzzy cognitive maps (FCM) that had been proposed and applied in the past are relatively simple in the sense that they handle the various interacting and time-varying concepts as zeroth-order dynamical components. That is, they do not accommodate time delays and growth exponential time constants. In modeling real life systems, especially in the general domain of socio-politico-economics, the time delays are often important and need to be accounted. Also, the various sensitivities associating the system concepts may be time dependent. In the present work, a previously proposed FCM has been extended to include time delays, time constants and time-dependent sensitivities. The system has been applied to the Cyprus politico-economic dynamics, with emphasis on possible scenarios involving the finding and exploitation of oil/gas in the exclusive economic zone of Cyprus. The …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:kzcrU_BdoSEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing the Analysis Phase of E-Commerce Systems Development with Human, Social, Cultural and Organizational Factors",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=7182709679976405406&hl=en&oi=scholarr",
            "Abstract": "E-commerce systems’ poor and incomplete design fail to meet users expectations and businesses goals. A major factor of failure of these systems is ignoring important requirements that result from human, cultural, social and organizational factors. The present work introduces a new Web engineering methodology for performing requirements elicitation through a model called SpiderWeb. This is a cross-relational structure comprised of three main axons: Country Characteristics, User Requirements and Application Domain. The purpose of this model is to provide a simple way for analysts to identify these requirements which otherwise could be missed or given little attention. Factors gathering is performed based on a certain form of ethnography analysis, which is conducted in a short-scale and time-preserving manner, considerating the importance of immediacy in deploying e-commerce applications. Two e …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Correction\" The electronic road: personalized content browsing\"",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1261107/",
            "Abstract": "Correction \"The electronic road: personalized content browsing\" Page 1 Correction In the \nJuly–September 2003 issue, the article “Internet Delivery of MPEG-4 Object-Based Multimedia” \nby Yasser Pourmohammadi-Fallah, Kambiz Asrar-Haghighi, and Hussein Alnuweiri showed \nthe three boxes in Figure 2, p. 70, labeled as “Compression layer.” The correct version is \nreprinted here. IEEE MultiMedia regrets this error. 53 January–March 2004 Compression layer \nSync layer Delivery layer Media-aware, delivery-unaware ISO/IEC 14496-3 audio ISO/IEC \n14496-2 visual Media-unaware, delivery-unaware ISO/IEC 14496-1 system Media-unaware, \ndelivery-aware ISO/IEC 14496-6 system Elementary stream interface (ESI) DMIF application \ninterface (DAI) Figure 2. MPEG-4 terminal architecture. Correction In the October–December \n2003 issue—in the article “The Electronic Road: Personalized Content Browsing” by Manolis , ’…",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The electronic road: personalized content browsing",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1237550/",
            "Abstract": "Conventional search engines locate terms in queried documents without taking into account their actual semantic content. Search engines also retrieve multimedia documents that aren't necessarily related to each other by semantic continuity. An efficient content-browsing system based on semantic content analysis, user profiling, and adaptation could provide users with more effective content-browsing capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile computing for m-commerce",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/mobile-computing-commerce/26608",
            "Abstract": "The ubiquitous nature of modern mobile computing has made “any information, any device, any network, anytime, anywhere” a well-known reality. Traditionally, mobile devices are smaller, and data transfer rates are much lower. However, mobile and wireless networks are becoming faster in terms of transfer rates, while mobile devices are becoming smaller, more compact, less power consuming, and, most importantly, user-friendly. As more new applications and services become available every day, the number of mobile device owners and users is increasing exponentially. Furthermore, content is targeted to user needs and preferences by making use of personal and location data. The user profile and location information is becoming increasingly a necessity. The aim of this article is to present an overview of key mobile computing concepts, in particular, those of relevance to m-commerce. The following sections …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A fuzzy cognitive map system to explore the repercussions of Greek PSI and Bank recapitalization on the Cyprus economy",
            "Publication year": 2014,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/9592",
            "Abstract": "Recently, Greece experienced a serious financial crisis that forced the country to sign a bailout memorandum with Troika (European Commission, International Monetary Fund and European Central Bank who formed a group of international lenders that laid down stringent austerity measures when they provided bailouts for indebted European states). The term Troika, which comes from the Russian meaning 'group of three', was increasingly used during the recent Eurozone crisis. In February of 2012, the country proceeded to a second bailout package. At the same time a debt restructuring was applied, that included a private sector involvement (PSI) that resulted in 75% overall loss. Due to the strong economic ties between Greece and Cyprus, PSI had a substantial impact on the Cypriot economy. A fuzzy cognitive map (FCM) system has been developed and used to study the repercussions of the Greek PSI on the economic dynamics of Cyprus and more specifically on the Cypriot banking sector. A novel FCM methodology has been used as regards to the proper identification, definition and initialization of the concepts and sensitivities, as well as on the updating rule. Different scenarios were implemented aiming to examine how certain core factors of Cyprus economy interact with Greek PSI and between them. The results were confirmed by comparing them with the actual events. Thus, they proved to be very promising and justify the usefulness of FCM for this particular kind of problems.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:fEOibwPWpKIC",
            "Publisher": "CRL Publishing"
        },
        {
            "Title": "A patient centered electronic health: eHealth system development",
            "Publication year": 2015,
            "Publication url": "https://content.iospress.com/articles/technology-and-health-care/thc919",
            "Abstract": "BACKGROUND: Medical practice and patient-doctor relationship will continue improving while technology is integrated in our everyday life. In recent years the term eHealth landmarked a new era with improved health provider's skills and knowledge, and increased patient participation in medical care activities.OBJECTIVE: To show why the design and implementation of a healthcare system needs to follow a specific philosophy dictated by the level of eHealth maturity of a country and its citizens.METHODS: Based on the maturity level, an adaptable framework for implementing an Electronic Health System at national level is derived, guided by the Patient Centered Philosophy as defined and introduced by the EU directives. Implementation prerequisites are analyzed together with guiding principles for identifying the maturity level of an organization or country.RESULTS: Cyprus being a small EU country, it can be …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:tkaPQYYpVKoC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A national electronic health record system for cyprus",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_326",
            "Abstract": "This paper presents part of the work done for the “Electronic Health Record (EHR) at National Level project” under the Framework Program for Research, Technological Development and Innovation 2009-2010 of the Research Promotion Foundation. A summary of the limitations and threats of the local infrastructure that compromise the future deployment of a National EHR in Cyprus are analyzed. Some of the derived solutions in respect to a number of difficulties that seem to prevent the adaptation of a national Electronic Health Record System for Cyprus are presented. Lessons learned from this exercise can be very beneficial when other countries attempt to do the same exercise.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "eHealth Services for the European Reference Network on Rare Anaemias (eENERCA).",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ATkxCgAAQBAJ&oi=fnd&pg=PA153&dq=info:ZFx_18GpVzUJ:scholar.google.com&ots=uYPaFe_nIN&sig=XnuHixm41NIlaQ99qytj8mJk2wc",
            "Abstract": "This paper presents an electronic registry system for the purposes of the eENERCA for rare congenital conditions that require lifelong follow up and treatment. The main objective of the eENERCA project focusses on the prevention of major rare anaemias (RAs) by facilitating the access, at a European level, to the best genetic counselling, diagnosis and clinical management of the patients with RA independently of their country of origin. This can be achieved by promoting an extension of the full Electronic Health Record system and specifically the electronic registries for RAs, across Europe for the purposes stated hence promoting service development for the benefit of patients. The proposed eRegistry will serve as an epidemiological tool to improve the management of patient services and ultimately improve patient care.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A brief overview of m-Health e-Emergency Systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4407422/",
            "Abstract": "Rapid advances in wireless communications and networking technologies, linked with advances in computing and medical technologies facilitate the development and offering of emerging mobile systems and services in the healthcare sector. The objective of this paper is to provide an overview of the current status and challenges of mobile health systems (m-health) in emergency healthcare systems and services (e-emergency).",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Content-based retrieval of breast cancer biopsy slides",
            "Publication year": 2000,
            "Publication url": "https://content.iospress.com/articles/technology-and-health-care/thc00197",
            "Abstract": "The Biopsy Analysis Support System (BASS), previously used for image analysis of immunohistochemically stained sections of breast carcinoma, has been extended to include indexing and content-based retrieval of biopsy slide images from a database of 57 captured cases. Images from histopathological biopsy slides are described and these are accessed in terms of the properties of either individual nuclei or groups of cell nuclei present in the slide. Visual similarity of cases is specified in terms of a diagnostic index, commonly known as the H-score, which incorporates the heterogeneity of nuclear staining intensity, as well as the percentage of nuclei staining at specific intensities. The system provides a platform that can be exploited in telepathology and teleconsultation, but further research is needed to explore its full potential and accuracy in a diagnostic clinical environment.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:eflP2zaiRacC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Wireless Telemedicine Systems: a brief overview",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=13956351830163546565&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deployment of generic cross border ehealth services in cyprus",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Panayides-2/publication/318419753_Deployment_of_Generic_Cross_Border_eHealth_Services_in_Cyprus/links/59c8a799aca272c71bca9e11/Deployment-of-Generic-Cross-Border-eHealth-Services-in-Cyprus.pdf",
            "Abstract": "The main objective of this project is to support Cyprus efforts to be part of a secure peer-to-peer network allowing the exchange of Patient Summaries [1] and/or ePrescriptions [2], which will pave the way to reach the following general objectives:(i) enable seamless cross-border care and secure access to patient health information between European healthcare systems;(ii) Contribute to patient safety by reducing the frequency of medical errors and by providing quick access to patient health information, as well as by increasing the accessibility of a patient's own prescriptions, also when abroad;(iii) Provide medical personnel with life-saving information in emergency situations and reduce the repetition of diagnostic procedures. The work activities underlying this application implement the main organisational, semantic and technical guidelines and specifications related to Directive 2011/24/EU on the application of patients’ rights in cross-border healthcare.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Classification capacity of a modular neural network implementing neurally inspired architecture and training rules",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1296687/",
            "Abstract": "A three-layer neural network (NN) with novel adaptive architecture has been developed. The hidden layer of the network consists of slabs of single neuron models, where neurons within a slab-but not between slabs- have the same type of activation function. The network activation functions in all three layers have adaptable parameters. The network was trained using a biologically inspired, guided-annealing learning rule on a variety of medical data. Good training/testing classification performance was obtained on all data sets tested. The performance achieved was comparable to that of SVM classifiers. It was shown that the adaptive network architecture, inspired from the modular organization often encountered in the mammalian cerebral cortex, can benefit classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A generic tool for building fuzzy cognitive map systems",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16239-8_9",
            "Abstract": "A generic system for simulating complex dynamical systems along the paradigm of fuzzy cognitive maps (FCM) has been created and tested. The proposed system enables a user to design appropriate FCM structures, by specifying the desired concepts and the various parameters such as sensitivities, as well as a variety of shaping functions. The user is able to see the results, change the parameters, modify the functions, and rerun the system using an alteration of the final results and make new conclusions. The system is introduced and demonstrated using a simple real case. The results of a usability test of the system suggest that the system is capable of simulating complicated FCM structures in an effective manner, helping the user to reduce the degree of risks during decision making.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "E-commerce engineering: A short vs long software process for the development of e-commerce applications",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/53513",
            "Abstract": "The immediacy in developing e-commerce applications, the quality of the services offered by these systems band the need for continuous evolution are primary issues that must be fully analysed and understood prior and during the development process. In this context, the present work suggests a new development framework which aims at estimating the level of complexity a certain e-commerce system encompasses and driving the selection of a long or short software process in terms of time and effort. The proposed framework utilizes a special form of Business Process Re-engineering (BPR) to define and assess critical business and organizational factors within small-to-medium enterprises (SMEs) whishing to go ecommerce. This set of factors is enriched with other critical issues belonging to the quality requirements of the system and to the application type of services it aspires to offer. The set of critical factors identified is used to estimate the average complexity level of the system using numerical values to describe the contribution of each factor to the overall complexity. The level of complexity estimated dictates the adoption of either a short or a long version of the well-known WebE process for analysing, designing and implementing the e-commerce system required by an SME.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Escola Superior de Tecnologia do Instituto Politecnico de Setubal"
        },
        {
            "Title": "Neural networks to estimate the influence of cervix length on the prediction of spontaneous preterm delivery before 37 weeks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4570663/",
            "Abstract": "Neural networks were applied in an effort to predict the risk for early spontaneous preterm delivery using various demographic, clinical, and laboratory inputs. Furthermore, attention has been focused on the influence of cervical length (CL) for the prediction of spontaneous preterm delivery. Data for 59,313 cases of pregnant women were collected and processed. The final data used were those that were considered to offer clear indication on the significance of cervical length on the prediction. The cervical length was measured by sonography in the range of 22-24 weeks of gestation. Preliminary results showed a prediction rate of approximately 65% was attained through the application of a variety of neural network topologies. It has been found that if the cervical length is excluded from the input data, this results in an approximately 10% decrease in the prediction yield, as obtained from the neural network predictor …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial neural networks to investigate the significance of PAPPA and b-hCG for the prediction of chromosomal abnormalities",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6033464/",
            "Abstract": "A systematic approach has been done, to investigate different neural network structures for the appraisal of the significance of the free b-human chorionic gonadotrophin (b-hCG) and the pregnancy associated plasma protein-A (PAP-PA) as important parameters for the prediction of the existence of chromosomal abnormalities in fetuses. The database that has been used was highly unbalanced. It was composed of 35,687 cases of pregnant women. In the vast majority of cases (35,058) there had not been any chromosomal abnormalities, while in the remaining 629 (1.76%) some kind of chromosomal defect had been confirmed. 8,181 cases were kept as a totally unknown database that was used only for the verification of the predictability of each network, and for evaluating the importance of PAPP-A and b-hCG as significant predicting factors. In this unknown data set, there were 76 cases of chromosomal defects …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timbre and Tonal Similarities Between the Turkish, Western and Cypriot Monophonic Songs Using Machine Learning Techniques",
            "Publication year": 2013,
            "Publication url": "https://dspace.library.uu.nl/bitstream/handle/1874/276246/fma2013_proceedings.pdf#page=102",
            "Abstract": "The aim of this work is mainly to explore timbre and tonal similarities between Cypriot folk songs in comparison with Turkish and Western monophonic songs using a computational approach. Several studies exist that identify similarities between the Cypriot folk music and Byzantine music [Kallinikos, T.(1951), Tobolis S.(1980)]. On the other hand, very little information exists on the possible influence of eastern music such as Arabic and Turkish on Cypriot folk music. The main musical instruments that are used in the Cypriot folk music are the lute, violin, a kind of wooden Cypriot flute called “pithkiavli” and a Cypriot percussion instrument called “tamboucha”. The existence of the lute and violin in the Cypriot folk music creates a complex combination between Greek and Turkish traditional rhythms. In a previous study [Neocleous et. al (2012)], non equal temperament between notes was identified in some of the Cypriot folk songs, using pitch histograms. The present work is focused on the Cypriot flute “pithkiavli”[Michael, E.(2008).]. This is compared to the Turkish“ney”[http://compmusic. upf. edu/node/55] as well as to western wood instruments such as flute, saxophone, bassoon and oboe.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Testing the Predictability of the Cyprus Stock Exchange: The Case of an Emerging Market",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/846233.849152",
            "Abstract": "A systematic investigation of the effect of different neural network architecture alternatives for predicting the future course of stock prices in the Cyprus Stock Exchange (CSE) market is conducted. This market exhibited an abrupt increase in the general index price during the last year, thus forming a very interesting case for research purposes. The influence of various economic and political factors, from both the local and the international scene, has also been examined. The main conclusion drawn is that the CSE market is governed by unique conditions which when properly modeled can yield successful predictions.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conditional generative denoising autoencoder",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8924906/",
            "Abstract": "We present a generative denoising autoencoder model that has an embedded data classifier in its architecture in order to take advantage of class-based discriminating features and produce better data samples. The proposed model is a conditional generative model and is sampled with a Markov chain Monte Carlo (MCMC) process according to a label that denotes the desired (or undesired) class or classes. In this sense, any chosen predefined class or characteristic may have a positive or negative effect on the image generation process, meaning that it can be instructed to be present or absent from the generated sample. We argue that allowing discriminative information in the form of feature detectors to be present in the latent representation of the autoencoder can be generally beneficial. This technique is an alternative approach to variational autoencoders (VAEs) that enforce a prior on the latent distribution. We …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:S16KYo8Pm5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling dilution effects in perceptual load search tasks",
            "Publication year": 2012,
            "Publication url": "https://escholarship.org/content/qt0512c362/qt0512c362.pdf",
            "Abstract": "A computational model of selective attention has been previously used to provide a concrete and comprehensive account for perceptual load findings in visual search tasks (Neokleous, Koushiou, Avraamides, & Schizas, 2009). Here, the same model was used to simulate findings from an experiment in which perceptual load effects were attributed to distractor dilution (Benoni & Tsal, 2010). By modeling at the neural level the continuous inhibitory interactions that take place among visual stimuli competing for cortical representation, the model reproduced successfully the behavioural pattern of results. The model thus offers a biologically-plausible way to reconcile findings that contradict Perceptual Load theory with those that support it.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent noninvasive diagnosis of aneuploidy: raw values and highly imbalanced dataset",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7795231/",
            "Abstract": "The objective of this paper is to introduce a noninvasive diagnosis procedure for aneuploidy and to minimize the social and financial cost of prenatal diagnosis tests that are performed for fetal aneuploidies in an early stage of pregnancy. We propose a method by using artificial neural networks trained with data from singleton pregnancy cases, while undergoing first trimester screening. Three different datasets 1  with a total of 122 362 euploid and 967 aneuploid cases were used in this study. The data for each case contained markers collected from the mother and the fetus. This study, unlike previous studies published by the authors for a similar problem differs in three basic principles: 1) the training of the artificial neural networks is done by using the markers' values in their raw form (unprocessed), 2) a balanced training dataset is created and used by selecting only a representative number of euploids for the …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Key issues for the design and development of mobile commerce services and applications",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMC.2005.006586",
            "Abstract": "This paper suggests a new approach for developing m-commerce services and applications based on a scheme that divides m-applications into directory- and transaction-oriented classes, identifies mobile user requirements, and takes into consideration the constraints of current technologies for mobile and wireless computing. The efficacy of the proposed approach in a real scenario is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Ethnicity as a factor for the estimation of the risk for preeclampsia: A neural network approach",
            "Publication year": 2010,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/5339",
            "Abstract": "A large number of feedforward neural structures, both standard multilayer and multi-slab schemes have been applied to a large data base of pregnant women, aiming at generating a predictor for the risk of preeclampsia occurrence at an early stage. In this study we have investigated the importance of ethnicity on the classification yield. The database was composed of 6838 cases of pregnant women in UK, provided by the Harris Birthright Research Centre for Fetal Medicine in London. For each subject 15 parameters were considered as the most influential at characterizing the risk of preeclampsia occurrence, including information on ethnicity. The same data were applied to the same neural architecture, after excluding the information on ethnicity, in order to study its importance on the correct classification yield. It has been found that the inclusion of information on ethnicity, deteriorates the prediction yield in the training and test (guidance) data sets but not in the totally unknown verification data set.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Artificial neural networks to investigate the importance and the sensitivity to various parameters used for the prediction of chromosomal abnormalities",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33412-2_5",
            "Abstract": "A selection of artificial neural network models were built and implemented for systematically study the contribution and the sensitivity of the main influencing parameters as important contributing factors for the non-invasive prediction of chromosomal abnormalities. The parameters that had been investigated are: the previous medical history of the pregnant mother, the nasal bone, the tricuspid flow, the ductus venosus flow, the PAPP-A value, the b-hCG value, the crown rump length (CRL), the changes in nuchal translucency (deltaNT) and the mother’s age. The main conclusions drawn are: 1) The deltaNT is the most significant factor for the overall prediction, while the CRL the least significant. 2) The previous medical history of the pregnant mother is not a significant factor for the prediction of the abnormal cases. 3) The nasal bone, the tricuspid flow and the ductus venosus flow contribute significantly in the …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:f2IySw72cVMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Artificial neural networks in estimating marine propeller cavitation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1007800/",
            "Abstract": "Cavitation in marine propellers can be a serious problem that may result in severe deterioration in performance. This is particularly important in heavily loaded propellers, commonly encountered in small craft. Efforts have been made to generate polynomials that fit experimental data on propeller performance and hence to facilitate the propeller selection procedures (Blount and Hubble, 1981). These polynomial fits are not accurate in capturing the performance of propellers, and also do not account for cavitating conditions. In the present work, neural networks have been developed that predict the performance of marine propellers in all tested conditions, including cavitation. The USN-series of experimental data (Denny et al, 1989) were applied on different neural network architectures and learning parameters, aiming at establishing a near optimum setup. The results of the networks are superior to those of the …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Neural networks in comparing USN and Wageningen B-Series marine propellers",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1223440/",
            "Abstract": "The USN-series of experimental data on marine propeller performance (Denny et al, 1989) were compared with fitted Wageningen B-series data. A Kohonen network has been used to attempt finding non-obvious similarities between the two data sets. The USN-series has been tested under cavitating conditions, while the available B-series not. A non-linear fit of the USN-series, including information on cavitation number /spl sigma/, has been developed and compared with a neural network function approximation. Using the Kohonen classification results, the non-linear regression was re-applied with slightly improved results. In overall, the feedforward neural network architecture mapping gave the best fit both in a statistical correlation measure and in the maximum percentage deviation measure.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The electronic road: Personalized content browsing (vol 10, pg 49, 2003)",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=8899796407078638362&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:BwyfMAYsbu0C",
            "Publisher": "IEEE COMPUTER SOC"
        },
        {
            "Title": "Neural networks to investigate the effects of smoking and alcohol abuse on the risk for preeclampsia",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5394421/",
            "Abstract": "Following the application of a large number of neural network schemes that have been applied to a large data base of pregnant women, aiming at generating a predictor for the risk of preeclampsia occurrence at an early stage, we investigated the importance of the parameters of smoking and alcohol intake on the classification yield. A number of feedforward neural structures, both standard multilayer and multi-slab, were tried for the prediction. The database was composed of 6838 cases of pregnant women in UK, provided by the Harris Birthright Research Centre for Fetal Medicine in London. For each subject, 24 parameters were measured or recorded. Out of these, 15 parameters were considered as the most influential at characterizing the risk of preeclampsia occurrence, including the characteristics on whether the pregnant woman was an active smoker or not, and on whether she was consuming alcohol. The …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Privacy and Data Protection in Healthcare: eHealth for All-Keynote Address.",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ATkxCgAAQBAJ&oi=fnd&pg=PA7&dq=info:k-HLhnbxlB8J:scholar.google.com&ots=uYPaFe_nJQ&sig=ysd2Lb6fF4fr9KKobe9aNvFt0Qk",
            "Abstract": "The benefits of accumulated medical records are self-evident, but we need to spare a thought, too, for the amount of risk they create. Privacy and protection of personal data is of the utmost importance both to the European Union and to each of its Member States-and maintaining the privacy of sensitive health data is becoming an ever greater challenge, particularly in the area of cloud computing. Is it possible to preserve privacy at all nowadays? Do Member States consider the possibility that the level of data protection may influence whether data becomes open? The session that dealt with these issues during the eHealth Forum held in Riga in May 2015, provided an opportunity to discuss open healthcare systems and the possibilities offered by accumulated data throughout Europe. In a special, Ministerial Track Panel Discussion:\" Privacy and Data Protection in Healthcare\", the related issues were discussed and debated further. The increasing number of accumulated medical records creates not only benefits but also risks. Both privacy and protection of personal data is of value in the European Union and each of its Member States. Maintaining the privacy of sensitive health data is becoming a challenge also for the increasingly used cloud computing. The day when all the information systems will be stored in the cloud is close. Do the Member States consider the possibility that the level of data protection may influence data becoming open? Is it at all possible to preserve privacy nowadays? Security systems and legislation issues will continue arise while technology is incorporate in our everyday life. Data theft and alteration had been major …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent Biomedical Systems",
            "Publication year": 2014,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213014020035",
            "Abstract": "The special issue is based on a selected number of papers presented at the 12th IEEE International Conference on BioInformatics and BioEngineering (BIBE 2012), November 11–13, 2012, Cyprus (http://bibe2012. cs. ucy. ac. cy/). BIBE was organized and sponsored by IEEE, the IEEE Computer Society, the University of Cyprus and the Biological & AI Foundation (BAIF), co-organized and co-sponsored by the Frederick University, Cyprus, the Hellenic Society for Computational Biology and Bioinformatics (HSCBB), and the Technical University of Cyprus, Cyprus. BIBE 2012 was technically co-sponsored by the IEEE Engineering in Medicine and Biology Society (IEEE EMBS) and the International Federation for Medical and Biological Engineering (IFMBE). It was supported by the IEEE EMBS Cyprus Chapter, the IEEE CIS Cyprus Chapter, the IEEE Cyprus Section, the Cyprus Society of Medical Informatics, and the …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:738O_yMBCRsC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Personalized medicine-a challenge for cyprus",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ApzYBAAAQBAJ&oi=fnd&pg=PA12&dq=info:eP8S8T-5iXMJ:scholar.google.com&ots=ch9yoLVt3H&sig=5eJsJG4UwdPj1iGU4f__Yb5AYew",
            "Abstract": "We were told at school,“If you want to solve a problem you have to identify it first”, you are then halfway towards the solution. This implied of course that the other half of the solution is a straight forward exercise, or it can be provided by a standard predetermined procedure which can be found on a shelf of ready-made solutions. This procedure, even though it has limitations, was followed extensively in solving medical problems and proved to be successful especially in cases where the available options for the solution were limited, and the only criteria to determine the final solution were cost, convenience, time, availability, etc. In other words the solution-treatment was primarily based on predetermined options, and not patient based.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:J-pR_7NvFogC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A novel telemedicine system for the handling of emergency cases",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=9006345083701254644&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:0EnyYjriUFMC",
            "Publisher": "World Health Organization"
        },
        {
            "Title": "Deriving quantitative structure-activity relationship models using genetic programming for drug discovery",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4407401/",
            "Abstract": "Genetic Programming is a heuristic search algorithm inspired by evolutionary techniques that has been shown to produce satisfactory solutions to problems related to several scientific domains [1]. Presented here is a methodology for the creation of Quantitative Structure-Activity Relationship (QSAR) models for the prediction of chemical activity, using Genetic Programming. QSAR analysis is crucial for drug discovery since good QSAR models enable human experts to select compounds with increased chances of being active for further investigations. Our technique has been tested using the Selwood dataset, a benchmark dataset for the QSAR field [2]. The results indicate that the QSAR models created are accurate, reliable and simple and can thus be used to identify molecular descriptors correlated with measured activity and for the prediction of the activity of untested molecules. The QSAR models we generated …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Marker selection for the detection of trisomy 21 using generalized matrix learning vector quantization",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7966322/",
            "Abstract": "In this work we explore the relevance of markers that are used for the early detection of fetal chromosomal abnormalities. For medical applications, it is important to optimize the number of used markers with respect to the number of necessary clinical examinations. We use the Generalized Matrix Learning Vector Quantization (GMLVQ) method to identify the most relevant markers from a set of 18 clinical examinations. We cross-validated our results using ten different training and test sets and we repeated our experiments using different parameters of GMLVQ. We identified the seven most relevant markers and we found that with these seven markers we obtain results that are comparable with the results that can be achieved with the full set of 18 markers. The results are in line with previous work that is found in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless telemedicine systems: an overview",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1003651/",
            "Abstract": "Rapid advances in information technology and telecommunications - and, more specifically, wireless and mobile communications - and their convergence (\"telematics\") are leading to the emergence of a new type of information infrastructure that has the potential of supporting an array of advanced services for healthcare. The objective of this paper is to provide a snapshot of the applications of wireless telemedicine systems. A review of the spectrum of these applications and the potential benefits of these efforts is presented, followed by successful case studies in electronic patient record, emergency telemedicine, teleradiology, and home monitoring. It is anticipated that the progress carried out in these efforts and the potential benefits of emerging mobile technologies will trigger the development of more applications, thus enabling the offering of a better service to the citizen.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "First trimester diagnosis of trisomy-21 using artificial neural networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_146",
            "Abstract": "Langdon Down in 1866 reported on a syndrome in which individuals have skin appearing to be too large for the body, a nose small and a flat face. This is a chromosomal disorder caused by the presence of all or part of an extra 21st chromosome, and is known as the Down syndrome, or trisomy 21, or trisomy G. In the last fifteen years it has become possible to observe these features by ultrasound examination in the third month of intrauterine life. About 75% of trisomy 21 fetuses have absent nasal bone.In the present work, neural network schemes that have been applied to a large data base of findings from ultrasounds of fetuses, aiming at generating a predictor for the risk of Down syndrome are reported. A good number of feed forward neural structures, both standard multilayer and multi-slab, were tried for the prediction. The database was composed of 23513 cases of fetuses in UK, provided by …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Yearly performance prediction of thermosyphon domestic water heating systems with neural networks and minimum system testing",
            "Publication year": 2000,
            "Publication url": "http://ptp.irb.hr/upload/mape/solari/11_Soteris_Kalogirou_YEARLY_PERFORMANCE_PREDICTION_OF_THERMOS.pdf",
            "Abstract": "The objective of this work is to use Artificial Neural Networks (ANN) for the yearly performance prediction of thermosyphonic type solar domestic water heating (SDWH) systems. Twentyseven SDWH systems have been tested and modelled according to the procedures outlined in the standard ISO 9459-2 at three locations in Greece. These data were used for training and testing the networks. Three neural networks were trained to perform different tasks. The first one predicts the system performance characteristics on a daily basis whereas the other two predict the system long-term performance. The collector areas of the considered systems were varying between 1.81 m2 and 4.38 m2. Open and closed thermosyphonic systems have been considered both with horizontal and vertical storage tanks. In this way the networks were trained to accept and handle a number of unusual cases. From the trained networks three dynamic library link (DLL) files were produced and used in different workbooks of the same spreadsheet, using the CALL function. The results from the first workbook, which are produced from the input data described above, are used in the other two to produce the annual results thus reducing drastically the experimental data required. The method was validated by using actual data for one system, which the networks have not seen before. The accuracy obtained indicate that the prediction of the solar energy output of the system for a draw-off equal to the volume of the storage tank is within 3.5% and for the same parameter and the average quantity of the hot water per month for the two demand water temperatures is within 7.8%. These …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy cognitive maps in estimating the repercussions of oil/gas exploration on politico-economic issues in Cyprus",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6007655/",
            "Abstract": "Some important politico-economic dynamics, in relation to different scenarios involving the finding and exploitation of oil/gas in the exclusive economic zone of Cyprus, have been modeled and examined through the use of suitable fuzzy cognitive maps. In the interrelated dynamics, various important dynamical parameters have been taken into account, reflecting the interests of the republic of Cyprus, as well as the interests of the Greek and Turkish Cypriot communities. In some respects these interests are antagonistic, while in others could be cooperative. The interests of other countries involved in the Cyprus politico economic problem have also been taken into account. These are primarily Greece, Turkey, United Kingdom, USA, Russia, Israel and the European Union. The main parameters involved in the interrelated dynamics are nationalism, religiousness, knowledge of history, level of educational development …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile computing with MPEG-21",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11596042_58",
            "Abstract": "In the field of multimedia content provision, many researchers investigate numerous techniques for adapting the content based on device, network, environment and user characteristics. In this paper, we present an MPEG-21 middleware design for dynamic content adaptation and we demonstrate a true mobile multimedia client that is able to communicate information about device and network characteristics and provide the necessary tools for the configuration of user preferences.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Neural networks to estimate the risk for preeclampsia occurrence",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5178820/",
            "Abstract": "A number of neural network schemes have been applied to a large data base of pregnant women, aiming at generating a predictor for the estimation of the risk of occurrence of preeclampsia at an early stage. The database was composed of 6838 cases of pregnant women in UK, provided by the Harris Birthright Research Centre for Fetal Medicine in London. For each subject, 24 parameters were measured or recorded. Out of these, 15 parameters were considered as the most influencing at characterizing the risk of preeclampsia occurrence. A number of feedforward neural structures, both standard multi-layer and multi-slab, were tried for the prediction. The best results obtained were with a multi-slab neural structure. In the training set there was a correct classification of the 83.6% cases of preeclampsia and in the test set 93.8%. The preeclampsia cases prediction for the totally unknown verification test was 100%.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data protection issues of integrated electronic health records (EHR)",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_153",
            "Abstract": "An Electronic Health Record (EHR) of a patient in perspective maintains the medical history of the citizen electronically in medical databanks serviced locally or is cloud based. The ownership and the access control should belong to the citizen and this should be done under the supervision of his personal doctor. Audit trails and security measures must be implemented for making sure that EHR systems properly collect, store, retain and use the patient health information for the better service of the citizen when in need of medical treatment. EU and other countries are determined to find solutions, impose policies and standards as to implement EHR at national level and international levels. In this article the main security issues are presented, the EU directives and legislations in data protection and privacy from the use of EHR are considered, and proposed solutions are analyzed. Finally, it is explained why …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Scenario-based evaluation for user testing of medical educational content-sharing solutions",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=12714952433375635609&hl=en&oi=scholarr",
            "Abstract": "The mEducator Best Practice network implemented standards and reference models in the field of e-learning to develop innovative solutions that enable specialized state-of-the-art medical educational content to be discovered, retrieved, shared and re-used across European institutions. Its target groups include medical students, doctors, educators and health-care professionals. A number of innovative assessment methods, including scenario-based assessment for usability testing complimented with data from online questionnaires, interviews, screen capturing and automated tracking of activity are currently designed and utilized for the evaluation of these solutions. This paper reports on the preliminary findings of usability testing of an instantiation of an mEducator solution (Drupal) conducted by 35 graduate students of an e-health course at an EU university. Usability testing was conducted through scenarios …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IATED"
        },
        {
            "Title": "A security tunnel for conducting mobile business over the TCP protocol",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Pitsillides/publication/228359876_A_security_tunnel_for_conducting_mobile_business_over_the_TCP_protocol%27/links/0912f50f0480feff19000000/A-security-tunnel-for-conducting-mobile-business-over-the-TCP-protocol.pdf",
            "Abstract": "This paper discusses security issues in the Mobile Business area with emphasis on the significance of mobile commerce and provides a framework to address and analyse common security problems of m-Business services and applications. We propose a new model to address efficiently some security problems in mobile environments, which rescinds Gateway/Proxy intermediates and establishes a secure end-to-end communication between mobile users and service providers over the TCP protocol. In this context, an application prototype is developed in J2ME, which implements and demonstrates the proposed model.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:hMod-77fHWUC",
            "Publisher": "na"
        },
        {
            "Title": "Towards The Identification Of Human, Social, Cultural And Organizational Requirements For Successful E-Commerce Systems Development",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812562586_0011",
            "Abstract": "E-commerce systems' poor and incomplete design fail to meet users expectations and businesses goals. A major factor of failure of these systems is ignoring important requirements that result from human, cultural, social and organizational factors. The present work introduces a new Web engineering methodology for performing requirements elicitation through a model called SpiderWeb. This is a cross-relational structure comprised of three main axons: Country Characteristics, User Requirements and Application Domain. The purpose of this model is to provide a simple way for analysts to identify these hidden requirements which otherwise could be missed or given little attention. Factors gathering is performed based on a certain form of ethnography analysis, which is conducted in a short-scale and time-preserving manner, taking into consideration the importance of immediacy in deploying e-commerce …",
            "Abstract entirety": 0,
            "Author pub id": "RrUhoesAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparison of classical, neural and fuzzy control for an underwater vehicle",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.497.9195&rep=rep1&type=pdf",
            "Abstract": "A comparative study for the automatic control of an underwater vehicle has been conducted. The vessel had only three thrusters for the control of its position, something that made the problem very difficult. Furthermore the system is highly non-linear. A control system has been simulated for the regulation of the marine thrusters so that they stabilize the vehicle at a desired position, irrespective of external disturbances. The dynamical equations of a model of the vessel, when disturbed by cable forces and by the thrusts generated by the propellers, are described. The various vehicle parameters needed to describe its dynamics (mass, center of mass, added coefficients) have been estimated. The control schemes implemented were the classical PID, neural control, and fuzzy control. It was found that a combination of classical and intelligent control gave the best results.",
            "Abstract entirety": 1,
            "Author pub id": "RrUhoesAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        }
    ]
}]