[{
    "name": "Χρήστος Νικολόπουλος",
    "romanize name": "Christos Nikolopoulos",
    "School-Department": "Μαθηματικών",
    "University": "aegean",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 6112,
    "Scholar name": "Christos V. Nikolopoulos",
    "Scholar id": "TJKJTewAAAAJ",
    "Affiliation": "University of the Aegean",
    "Citedby": 378,
    "Scholar url": "https://scholar.google.com/citations?user=TJKJTewAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On the quenching of a nonlocal parabolic problem arising in electrostatic MEMS control",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X16000365",
            "Abstract": "We consider a nonlocal parabolic model for a micro–electro-mechanical system. Specifically, for a radially symmetric problem with monotonic initial data, it is shown that the solution quenches, so that touchdown occurs in the device, in a situation where there is no steady state. It is also shown that quenching occurs at a single point and a bound on the approach to touchdown is obtained. Numerical simulations illustrating the results are given.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:ufrVoPGSRksC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A model for melting of an inhomogeneous material during modulated temperature differential scanning calorimetry",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0307904X03002051",
            "Abstract": "In the present work a model considering the melting of an inhomogeneous material, such as a mixture or solution, during modulated temperature differential scanning calorimetry (MTDSC), is derived and analysed. It is considered that during the melting of such a material a mushy region is formed and initially the behaviour of the material at the microscale is analysed. Then with the method of averaging a phase field type model is constructed for the macroscale, which consists of a system of partial differential equations and this is solved numerically. Finally the results are used to simulate the signal of MTDSC.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The application of an age-structured model to the north Aegean anchovy fishery: an evaluation of different management measures",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0025556412000338",
            "Abstract": "The objective of this paper is the integration of existing biological and fishery knowledge of anchovy into a unified modelling framework in order to advance our understanding of species’ population dynamics under different fishing strategies. The model simulates the anchovy biomass by combining an age-specific growth equation and a continuous age-structured population model based on the McKendrick–Von Foerster equation. Model predictions were compared to the biomass estimates and annual catches during the period 2003–2008. The present work provided direct evidence for the significance of the prespawning period as a critical life period for the management of anchovy stock in the Aegean Sea. It was found that the introduction of additional management measures could increase the profits in the long run for the fishery. However, for these to become apparent they will require a minimum of four years …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Macroscopic models for a mushy region in concrete corrosion",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10665-014-9743-0.pdf",
            "Abstract": "Macroscopic models for the corrosion of concrete due to sulphation, describing the formation of a mushy region, are derived and studied by further expanding previous related studies. These models are derived from averaging using the multiple-scales method applied on microscopic Stefan-type problems to capture the effects of the microscopic transformation of calcite into gypsum. The resulting macroscopic model for the diffusion and production of the sulphate inside the concrete is coupled with a time-dependent Eikonal equation describing the evolution of the reaction at each point of the concrete wall. In certain cases and for specific geometries of the microstructure, the Eikonal equation admits analytical solutions, and the model takes the form of a macroscopic non-local problem. The models derived are solved numerically with the use of a finite-element method, and the results for various microstructure …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Estimates of blow-up time for the radial symmetric semilinear heat equation in the\" open-spectrum\" case",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=9243031128646606411&hl=en&oi=scholarr",
            "Abstract": "We estimate the blow-up timefor the reaction diffusion equation Ut= Aw-f A/(w), when f is a positive, increasing and convexJunction growingfast enough and A> A*, where A\" is a critical valuefor the parameter A€(0, A*),(open spectrum). Estimates ofthe blow-up time are obtained by using comparison methods. Some numerical results are also presented. RESUME. Notts calculons le temps de I'explosion (blow-up) pour I'equation de la diffusion reactive Ut= Aw+ A/(w), quand f est unefonction positive croissanle rapidement el convexe &A> A*, au A* est la valeur critique pour le parametre A< E (0, A*),(spectre ouvert). Nous obtenons des estimations du temps d'explosion en utilisant des methodes de comparaison. Nous presentons aussi quelques resultats numeriques.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:Se3iqnhoufwC",
            "Publisher": "Iste Publishing Company"
        },
        {
            "Title": "Colloidal Transport in Locally Periodic Evolving Porous Media---An Upscaling Exercise",
            "Publication year": 2020,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/17M1161531",
            "Abstract": "We derive an upscaled  model describing the aggregation and deposition of colloidal particles within a porous medium allowing for the possibility of local clogging of the pores. At the level of the pore scale, we extend an existing model for colloidal dynamics  including the  evolution of free interfaces separating  colloidal particles deposited on solid boundaries (solid spheres) from the colloidal particles transported through the gaseous parts of the porous medium.  As a result of deposition, the solid spheres grow, therefore reducing the space available for transport in the gaseous phase. Upscaling procedures are applied and several classes of macroscopic models together with effective transport tensors are obtained, incorporating explicitly the local growth of the solid spheres. The resulting models are solved numerically and various simulations are presented. In particular, they are able to detect clogging regions …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:WF5omc3nYNoC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "A multiscale quasilinear system for colloids deposition in porous media: Weak solvability and numerical simulation of a near-clogging scenario",
            "Publication year": 2022,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1468121821001206",
            "Abstract": "We study the weak solvability of a macroscopic, quasilinear reaction–diffusion system posed in a 2 D porous medium which undergoes microstructural problems. The solid matrix of this porous medium is assumed to be made out of circles of not-necessarily uniform radius. The growth or shrinkage of these circles, which are governed by an ODE, has direct feedback to the macroscopic diffusivity via an additional elliptic cell problem. The reaction–diffusion system describes the macroscopic diffusion, aggregation, and deposition of populations of colloidal particles of various sizes inside a porous media made of prescribed arrangement of balls. The mathematical analysis of this two-scale problem relies on a suitable application of Schauder’s fixed point theorem which also provides a convergent algorithm for an iteration method to compute finite difference approximations of smooth solutions to our multiscale model …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Mathematical modelling of the Germasogeia aquifer",
            "Publication year": 2017,
            "Publication url": "http://miis.maths.ox.ac.uk/miis/711/",
            "Abstract": "Two challenges related to improving the management of the Germasogeia aquifer were presented to the Study Group by the Cyprus Water Development Department (WDD), the public organisation responsible for managing the wa- ter resources in Cyprus. The  rst challenge was how to optimally recharge the aquifer in order to compensate for the extraction of drinking and irrigation water whilst preventing sea water intrusion. In order to address this challenge we developed model for the water in the aquifer. Note that by exploiting the long, thin nature of the aquifer we only develop two-dimensional models in this work. We  rst develop a simple model based on Darcy  ows for porous media which gives the water table height for given dam seepage rate, recharge and extraction rates; we neglect seawater intrusion. We then use the steady version of this model to develop an optimized recharge strategy with which we can identify minimal recharge required for a desired extracted water volume such that the minimum prescribed water table is respected. We explore 4 di erent scenarios and we  nd that in certain cases there can be a considerable reduction in the amount of recharged water compared to the current empirical strategy the Water Development Department is employing, where water is recharged and extracted in equal proportions. To incorporate the e ects of seawater intrusion, which can be very damaging to the water quality, we next develop transient two- dimensional models of saturated-unsaturated groundwater  ow and solve them numerically using the open source software SUTRASuite and the commercial package ANSYS FLUENT; the …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A model for housing allocation of a homeless population due to a natural disaster",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1468121802000780",
            "Abstract": "In the present work we derive and analyze a model considering housing allocation of homeless families due to a natural disaster; we use data from the earthquake of September 1999, in Athens, Greece. We derive a non-linear system of ordinary differential equations and analyze the stability of this system. Also we find an approximate solution of the model for a case study as well as and a numerical solution. Finally we consider possible extensions and improvements of the model making it more realistic.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A model for melting of a pure material during modulated temperature differential scanning calorimetry",
            "Publication year": 2002,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/S003613990038195X",
            "Abstract": "We model the melting of a pure material during modulated temperature differential scanning calorimetry (MTDSC) as a one-dimensional two-phase Stefan problem. For the case in which the latent heat is large, we obtain an analytical approximate solution using perturbation methods. For small latent heat we solve the problem numerically by the enthalpy method. Also we analyze the solution for small times. Finally, the results are used to simulate MTDSC signal during the melting.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:UebtZRa9Y70C",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "On the quenching behaviour of a semilinear wave equation modelling MEMS technology",
            "Publication year": 2014,
            "Publication url": "https://chesterrep.openrepository.com/bitstream/handle/10034/333835/kavallaris,lacey,nikopoulos,tzanetis2015.pdf?sequence=6",
            "Abstract": "In this work we study the semilinear wave equation of the form utt= uxx+ λ/(1− u) 2, with homogeneous Dirichlet boundary conditions and suitable initial conditions, which, under appropriate circumstances, serves as a model of an idealized electrostatically actuated MEMS device. First we establish local existence of the solutions of the problem for any λ> 0. Then we focus on the singular behaviour of the solution, which occurs through finite-time quenching, ie when|| u (·, t)||∞→ 1 as t→ t∗−<∞, investigating both conditions for quenching and the quenching profile of u. To this end, the non-existence of a regular similarity solution near a quenching point is first shown and then a formal asymptotic expansion is used to determine the local form of the solution. Finally, using a finite difference scheme, we solve the problem numerically, illustrating the preceding results.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:MXK_kJrjxJIC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "A model for optimal stopping in advertisement",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1468121809000911",
            "Abstract": "In this work we propose a model for optimal advertisement in new product diffusion based on the Bass model and assuming that the effect of the environmental pressure in the diffusion of the product is subject to a stochastic dependence. The optimal stopping problem is reduced to a free boundary problem which is analyzed and solved numerically, in order to determine an optimal stopping rule for the advertisement campaign. The numerical solution is obtained through a policy iteration like contraction scheme, the convergence properties of which are studied in detail. Furthermore, the expected time until the optimal stopping of the campaign is estimated. Finally, a combined optimal stopping and control problem for the optimization of the advertisement effectiveness is also proposed and solved numerically. Our results are expected to provide useful guidelines for campaign managers, for the choice of effectiveness …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Asymptotic analysis and estimates of blow‐up time for the radial symmetric semilinear heat equation in the open‐spectrum case",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.854",
            "Abstract": "We estimate the blow‐up time for the reaction diffusion equation ut=Δu+ λf(u), for the radial symmetric case, where f is a positive, increasing and convex function growing fast enough at infinity. Here λ>λ*, where λ* is the ‘extremal’ (critical) value for λ, such that there exists an ‘extremal’ weak but not a classical steady‐state solution at λ=λ* with ∥w(⋅, λ)∥∞→∞ as 0<λ→λ*−. Estimates of the blow‐up time are obtained by using comparison methods. Also an asymptotic analysis is applied when f(s)=es, for λ−λ*≪1, regarding the form of the solution during blow‐up and an asymptotic estimate of blow‐up time is obtained. Finally, some numerical results are also presented. Copyright © 2007 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:Y0pCki6q_DkC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "A study of a nonlocal problem with Robin boundary conditions arising from MEMS technology",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1906.12093",
            "Abstract": "In the current work we study a nonlocal parabolic problem with Robin boundary conditions. The problem arises from the study of an idealized electrically actuated MEMS (Micro-Electro-Mechanical System) device. Initially we study the steady-state problem in one dimension and we present some numerical results regarding its bifurcation diagram. Next the dimensional nonlocal problem steady-state problem is investigated and a Pohozaev-type identity is first obtained which then facilitates derivation of an estimate of the pull-in voltage for radially symmetric domains. Later the time-dependent problem is investigated and global-in-time as well as quenching results are obtained again for general and radially symmetric domains. We close the current work with a numerical investigation of the presented nonlocal model via an adaptive numerical method. Various numerical experiments are presented verifying the obtained analytical results.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Numerical solution of a non-local elliptic problem modeling a thermistor with a finite element and a finite volume method",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-540-71992-2_143.pdf",
            "Abstract": "Let D:=(− 1, 1), and the following non-local elliptic boundary value problem: w (x)+ λ f (w (x))",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Blow-up time estimates for a non-local reactive-convective problem modelling sterilization of food",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/39826937/Behaviour_of_solutions_of_a_non-local_di20151109-5303-a1c5kz.pdf",
            "Abstract": "We consider a non-local equation with initial and boundary conditions of the form ρ (u) ut+(1−∫ x",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Instytut Matematyczny Polskiej Akademii Nauk"
        },
        {
            "Title": "A study of a nonlocal problem with Robin boundary conditions arising from technology",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.7393",
            "Abstract": "In the current work, we study a nonlocal parabolic problem with Robin boundary conditions. The problem arises from the study of an idealized electrically actuated MEMS (micro‐electro‐mechanical system) device, when the ends of the device are attached or pinned to a cantilever. Initially, the steady‐state problem is investigated estimates of the pull‐in voltage are derived. In particular, a Pohožaev's type identity is also obtained, which then facilitates the derivation of an estimate of the pull‐in voltage for radially symmetric N‐dimensional domains. Next a detailed study of the time‐dependent problem is delivered and global‐in‐time as well as quenching results are obtained for generic and radially symmetric domains. The current work closes with a numerical investigation of the presented nonlocal model via an adaptive numerical method. Various numerical experiments are presented, verifying the previously derived …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hyperbolic non-local problem modelling MEMS technology",
            "Publication year": 2011,
            "Publication url": "https://www.jstor.org/stable/44239977",
            "Abstract": "In this work we study a non-local hyperbolic equation of the form  with homogeneous Dirichlet boundary conditions and appropriate initial conditions. The problem models an idealized electrostatically actuated MEMS (Micro-Electro-Mechanical System) device. Initially we present the derivation of the model. Then we prove local existence of solutions for λ > 0 and global existence for  for some positive , with zero initial conditions; similar results are obtained for other initial data. For larger values of the parameter λ, i.e., when  for some constant , and with zero initial conditions, it is proved that the solution of the problem quenches in finite time; again similar results are obtained for other initial data. Finally the problem is solved numerically with a finite difference scheme. Various simulations of the solution of the problem are presented, illustrating the relevant theoretical …",
            "Abstract entirety": 0,
            "Author pub id": "TJKJTewAAAAJ:0EnyYjriUFMC",
            "Publisher": "The Rocky Mountain Mathematics Consortium"
        },
        {
            "Title": "Estimates of blow-up time for a non-local reactive–convective problem modelling Ohmic heating of foods",
            "Publication year": 2006,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-edinburgh-mathematical-society/article/estimates-of-blowup-time-for-a-nonlocal-reactiveconvective-problem-modelling-ohmic-heating-of-foods/2FCED9D7D78B86B45A381ABFCFB38328",
            "Abstract": "In this work, we estimate the blow-up time for the non-local hyperbolic equation of ohmic type, . Some numerical results are also given.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Impacts of noise on quenching of some models arising in MEMS technology",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2012.10922",
            "Abstract": "In the current work we study a stochastic parabolic problem. The underlying problem is actually motivated by the study of an idealized electrically actuated MEMS (Micro-Electro-Mechanical System) device in the case of random fluctuations of the potential difference controlling the device. We first present the mathematical model and then we deduce some local existence results. Next for some particular versions of the model, regarding its boundary conditions, we derive quenching results as well as estimations of the probability for such singularity to occur. Additional numerical study of the problem in one dimension follows, investigating the problem further with respect to its quenching behaviour.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimates of blow-up time for a non-local problem modelling an Ohmic heating process",
            "Publication year": 2002,
            "Publication url": "https://www.cambridge.org/core/journals/european-journal-of-applied-mathematics/article/estimates-of-blowup-time-for-a-nonlocal-problem-modelling-an-ohmic-heating-process/F5E04BD55405EFDB3D05D831CBD92474",
            "Abstract": "We consider an initial boundary value problem for the non-local equation, ut = uxx+λf(u)/(∫1-1f       (u)dx)2, with Robin boundary conditions. It is known that there exists a critical value of the parameter λ, say λ*, such that for λ > λ* there is no stationary solution and       the solution u(x, t) blows up globally in finite time t*, while for λ < λ* there exist stationary solutions. We find, for decreasing f and for λ > λ*, upper and lower bounds for t*, by using comparison methods. For f(u) = e−u, we give an asymptotic estimate: t* ∼ tu(λ−λ*)−1/2 for 0 < (λ−λ*) [Lt ] 1, where tu is a constant. A numerical estimate is obtained using a Crank-Nicolson scheme.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "UPPER AND LOWER BOUNDS OF BLOW-UP TIME IN A NON-LOCAL THERMISTOR PROBLEM",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812777140_0018",
            "Abstract": "We consider the non-local equation,  with Robin boundary conditions. It is known that for  the solution  blows up globally in finite time . We find, for decreasing  and for , upper and lower bounds for , by using comparison methods.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Behaviour of a non-local equation modelling linear friction welding",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8179429/",
            "Abstract": "A non-local parabolic equation modelling linear friction welding is studied. The equation applies on the half line and contains a non-linearity of the form   . For f(u) = e u , global existence and convergence to a steady state are proved. Numerical calculations are also carried out for this case and for f(u) = (– u) 1/a .",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:3fE2CSJIrl8C",
            "Publisher": "OUP"
        },
        {
            "Title": "ſº f (s) ds< co, there exists a critical value of the parameter X> 0, say X*, such that for X> X* there is no stationary solution and the solution w (ac, t) blows up globally in finite time tº, while for X• X* there exist stationary solutions. Estimates for t” were found for X greater than the critical value X* and fixed",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vfzICgAAQBAJ&oi=fnd&pg=PA355&dq=info:_KwWuZwqw8kJ:scholar.google.com&ots=_6g9YjUciq&sig=Es3PkiU30YrEmQyY5IjP79TqJDg",
            "Abstract": "We consider the non-local initial boundary value problem, u (r, t)+...(r, t)= x-Hº-0< a. 3 1, t> 0,(1.1 a)(ſ. f (uſa, t)) dr) u (0, t)= 0, t> 0,(1.1 b) w (x, 0)= u0 (a)> 0, 0< a. 31,(1.1 c)",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:8k81kl-MbHgC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Mathematical modelling of a mushy region formation during sulphation of calcium carbonate",
            "Publication year": 2014,
            "Publication url": "https://www.aimsciences.org/journals/displayArticlesnew.jsp?paperID=10602",
            "Abstract": "The subject of the present paper is the derivation and asymptotic analysis of a mathematical model for the formation of a mushy region during sulphation of calcium carbonate. The model is derived by averaging, with the use of the multiple scales method, applied on microscopic moving-boundary problems. The latter problems describe the transformation of calcium carbonate into gypsum on the microscopic scale. The derived macroscopic model is solved numerically with the use of a finite element method. The results of some simulations and a relevant discussion are also presented.1. Introduction. Corrosion of monuments is an important aspect that should be studied in relation with the conservation and restoration of cultural heritage. There are a lot of factors that cause this process and in general it is quite difficult to determine all of them together with their significance and study the problem in its full complexity. Certainly one of them is air pollution. Various pollutants existing in the atmosphere especially in big cities like Athens, Rome, etc can react, under certain conditions, with calcium carbonate and create damage, corrosion in natural building stones, marble monuments etc.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:YsMSGLbcyi4C",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "A mushy region in concrete corrosion",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0307904X1000154X",
            "Abstract": "In this work a mathematical model already known for the corrosion of sewer pipes is further considered, enriched and an approximate analytical solution is given based on a quasi-steady approximation. Furthermore an extension of this model is constructed allowing the formation of a mushy region, i.e. a region in which the material is only partly corroded throughout the process. This more general model is derived via an averaging process by microscopic considerations and has the form of a macroscopic phase field model. The derived model in its various forms is solved numerically with a finite element method and the results, predicting corrosion within a reasonable range, are presented.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Macroscopic models for calcium carbonate corrosion due to sulfation. Variation of diffusion and volume expansion",
            "Publication year": 2019,
            "Publication url": "https://www.cambridge.org/core/journals/european-journal-of-applied-mathematics/article/macroscopic-models-for-calcium-carbonate-corrosion-due-to-sulfation-variation-of-diffusion-and-volume-expansion/818AA0FE3B6BDD0AC30AF8B33D17152D",
            "Abstract": "The subject of the present paper is the derivation and analysis of mathematical models for the formation of a mushy region during calcium carbonate corrosion. More specifically there is emphasis on the variation of the overall diffusion resulting from the changing shape of a single pore due to corrosion process and on the resulting volume expansion of the material as the outcome of the transformation of calcium carbonate to gypsum. These models are derived by averaging, with the use of the multiple scales method applied on microscopic moving-boundary problems. The latter problems describe the transformation of calcium carbonate into gypsum in the microscopic scale. The derived macroscopic models are solved numerically with the use of an implicit in time, finite element method. The results of the simulations for various microstructure geometries in the micro-scale and a discussion are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "A 1D model for polymer melting during modulated temperature differential scanning calorimetry",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8146189/",
            "Abstract": "A 1D model for the melting of polymers, assuming the polymer crystals take the form of lamellæ or thin sheets of material, is discussed. The model is derived on the assumption that the melting point of a lamella depends upon its thickness, that a lamella melts the instant this temperature is exceeded and that lamellæ with higher melting points grow by accumulating surplus of melt. The model is analysed for a temperature control that is the sum of a linear and a sinusoidal function of time as in modulated temperature differential scanning calorimetry, which is a technique for measuring thermal properties of materials. This work is an extension of a previous paper, by the same authors, considering a homogeneous model, based on the same assumptions. Some predictions regarding the output of such calorimetry are made.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:u5HHmVD_uO8C",
            "Publisher": "OUP"
        },
        {
            "Title": "TIME-ESTIMATES OF BURNT FOOD FOR A NONLOCAL REACTIVE-CONVECTIVE PROBLEM FROM THE FOOD INDUSTRY",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0037",
            "Abstract": "We estimate the blow-up time for a non-local hyperbolic problem of Ohmic type, . It is known, that for ,  positive and , there exists a critical value of the parameter , say λ*, such that for λ > λ* there is no stationary solution and the solution  blows up globally in finite time t*, while for λ ≤ λ* there exist stationary solutions. Estimates for t* were found for λ greater than the critical value λ* and fixed initial data u0(x) ≥ 0. The estimates are obtained by comparison and by numerical methods.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A model for polymer melting during modulated‐temperature differential scanning calorimetry",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8146352/",
            "Abstract": "A model for the melting of polymers, assuming the polymer crystals take the form of lamellæ, or thin sheets, of material, is discussed. The model is derived on the assumption that the melting point of a lamella depends upon its thickness, that a lamella melts the instant this temperature is exceeded, and that lamellæ with higher melting points grow by accumulating surplus melt. The model is analysed for a temperature control that is the sum of a linear and a sinusoidal function of time, as in modulated‐temperature differential scanning calorimetry, which is a new experimental technique for measuring thermal properties of materials. Some predictions regarding the output of such calorimetry for polymer melting are made.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:kNdYIx-mwKoC",
            "Publisher": "OUP"
        },
        {
            "Title": "Numerical Solution of a Nonlocal Problem Modelling Ohmic Heating of Foods",
            "Publication year": 2009,
            "Publication url": "https://www.degruyter.com/document/doi/10.2478/cmam-2009-0025/html",
            "Abstract": " An upwind and a Lax-Wendroff scheme are introduced for the solution of a one-dimensional non-local problem modelling ohmic heating of foods. The schemes are studied regarding their consistency, stability, and the rate of convergence for the cases that the problem attains a global solution in time. A high resolution scheme is also introduced and it is shown that it is total-variation-stable. Finally some numerical experiments are presented in support of the theoretical results.",
            "Abstract entirety": 1,
            "Author pub id": "TJKJTewAAAAJ:qjMakFHDy7sC",
            "Publisher": "De Gruyter"
        }
    ]
}]