[{
    "name": "Αμαλία Μήλιου",
    "romanize name": "Amalia Miliou",
    "School-Department": "Πληροφορικής",
    "University": "ΑΠΘ",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 12326,
    "Scholar name": "Amalia Miliou",
    "Scholar id": "LbuyVqsAAAAJ",
    "Affiliation": "Aristotle University of Thessaloniki",
    "Citedby": 1773,
    "Interests": [
        "Optical Communications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=LbuyVqsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "DPSK-Demodulation based on Ultra-Compact micron-scale SOI platform",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7121955/",
            "Abstract": "We present the error-free demodulation of a 10Gb/s DPSK-signal based on a novel Delayed Interferometer with ultra-small footprint. The device is fabricated on thick um-scale SOI platform and exhibits similar dimension with nanophotonic based DIs.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "OCON: an optically controlled optical network",
            "Publication year": 1999,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366499000535",
            "Abstract": "The centralized filtering of the transmitted packets has been the base of a family of high-performance protocols for Wavelength Division Multiplexing (WDM) Star Networks (G.I. Papadimitriou, D.G. Maritsas, WDM star networks: hybrid random access and reservation protocols with high throughput and low delay, Computer Networks and ISDN Systems, 28(6) (1996) 773–787; G.I. Papadimitriou, Centralized packet filtering protocols: a new family of mac protocols for WDM star networks, Computer Communications, in press). Protocols of this family have been proved to achieve a significantly higher performance than the well-known contention-oriented or round-robin protocols. However, the need for electronic control of the filtering mechanism as well as the use of slowly tunable optical filters have been limiting factors in their performance. Further, as the network hub of WDM Star Networks represents a single point of …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Tactile displays: a short overview and recent developments",
            "Publication year": 2005,
            "Publication url": "http://www.nano-micro.gr/papers/Chouvardas_icta05.pdf",
            "Abstract": "Tactation is the sensation perceived by the sense of touch. Tactation is based on the skin receptors. The skin nerves can be stimulated by mechanical, electrical or thermal stimuli. Apart from fibers for pain, skin has six more types of receptors. A review of the state of the art concerning the physiological and technological principles, considerations and characteristics, as well as latest implementations of micro-actuator based tactile graphic displays and the relative software interfaces structures and representations is presented. Fabrication technologies are reviewed in order to demonstrate the potential in tactile applications. Existing electronic Braille displays for accessibility are limited to text-based information. Graphic tactile displays enable for viewing images by the sense of touch on a reusable surface and substitution of the visual/auditory sense. Applications include education, engineering/artistic design, web surfing, and viewing of art and photographs. Tactile substitution can be used in augmenting accessibility for the blind or deaf in order to:(a) to enhance access to computer graphical user interfaces,(b) to enhance mobility in controlled environments. In general tactation based interfaces may allow communication of visual information to the brain in situations where the visual or hearing system is already overloaded such as race car drivers, airplane pilots, operating rooms, virtual reality and tele-presence.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-throughput and low-latency 60GHz small-cell network architectures over radio-over-fiber technologies",
            "Publication year": 2017,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10128/101280I/High-throughput-and-low-latency-60GHz-small-cell-network-architectures/10.1117/12.2253022.short",
            "Abstract": "Future broadband access networks in the 5G framework will need to be bilateral, exploiting both optical and wireless technologies. This paper deals with new approaches and synergies on radio-over-fiber (RoF) technologies and how those can be leveraged to seamlessly converge wireless technology for agility and mobility with passive optical networks (PON)-based backhauling. The proposed convergence paradigm is based upon a holistic network architecture mixing mm-wave wireless access with photonic integration, dynamic capacity allocation and network coding schemes to enable high bandwidth and low-latency fixed and 60GHz wireless personal area communications for gigabit rate per user, proposing and deploying on top a Medium-Transparent MAC (MT-MAC) protocol as a low-latency bandwidth allocation mechanism. We have evaluated alternative network topologies between the central office (CO …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "10 Gb/s All Optical Flip Flop Employing two Coupled SOAs",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=3082866638742912112&hl=en&oi=scholarr",
            "Abstract": "This paper presents a novel and simple Set-Reset Flip-Flop employing two Semiconductor Optical Amplifiers (SOAs), whose right sides are coupled together through two 90/10 couplers, while the external signals are introduced at the left sides of the SOAs. The present architecture exploits the optical bistability between a slightly and a fully saturated regime of the SOAs. Its speed-limit is determined by the SOA recovery time and the length of the shared coupled stage. Featuring distinctive simplicity for reduced footprint and low power consumption, it is ideal for photonic integration and operation at multi-Gb/s speeds.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical Wireless System Performance, Deployment, and Optimization",
            "Publication year": 2022,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-74648-3_9",
            "Abstract": "As the 5G milestone approaches, there needs to be concerted effort towards practical deployment strategies and optimization in order to fully capitalize on the 5G benefits and KPIs (key performance indicators). This chapter aims to provide just that; the authors provide new insights on the performance of the optical wireless link and how this can be deployed as an integrated mobile architecture to provide small cell coverage to highly dense hotspot areas. Not only we investigate the system performance and practical deployment approaches, but we also address their optimization based on ML approaches. Virtual resource management and big data represent prominent 5G paradigms that offer new opportunities in terms of network management and optimization. In this chapter, we consider how ML can play a major role in network optimization by bringing intelligence to the limelight and by investigating how learned …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:HE397vMXCloC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Tb/s switching fabrics for optical interconnects using heterointegration of plasmonics and silicon photonics: The FP7 PLATON approach",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5698810/",
            "Abstract": "We present recent work that is carried out within the FP7 project PLATON on novel Tb/s switch fabric architectures and technologies for optical interconnect applications, employing heterointegration of plasmonics, silicon photonics and electronics.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "In-Fiber Interferometric-Based Sensors: Overview and Recent Advances",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2304-6732/8/7/265",
            "Abstract": " This article is an extensive overview of the different types of in-fiber interferometric-based sensors and their technology. In-fiber interferometric-based sensors are a rapidly growing field, as these sensors exhibit many desirable characteristics compared to their regular fiber-optic counterparts and are being implemented in many promising devices. These sensors have the capability to make extremely accurate measurements on a variety of physical or chemical quantities such as refractive index, temperature, pressure, curvature, concentration, etc. This article is a comprehensive overview of the different types of in-fiber interferometric sensors that presents and discusses recent developments in the field. Basic configurations, a brief approach of the operating principle and recent applications are introduced for each interferometric architecture, making it easy to compare them and select the most appropriate one for the application at hand. ",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Column address selection in optical RAMs with positive and negative logic row access",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655960/",
            "Abstract": "An optical RAM row access gate followed by a column address selector for wavelength-division-multiplexing (WDM)-formatted words employing a single semiconductor optical amplifier-Mach-Zehnder interferometer (SOA-MZI) is presented. RAM row access is performed by the SOA-MZI that grants random access to a 4-bit WDM-formatted optical word employing multiwavelength cross-phase-modulation (XPM) phenomena, whereas column decoding is carried out in a completely passive way using arrayed waveguide grating. Proof-of-concept experimental verification for both positive and negative logic access is demonstrated for 4 × 10 Gb/s optical words, showing error-free operation with only 0.4-dB-peak-power penalty and requiring a power value of 25 mW/Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fabrication and characterization of K+-Na+ ion-exchange waveguides",
            "Publication year": 1988,
            "Publication url": "https://scholar.google.com/scholar?cluster=2621273330911580683&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical RAM row access with WDM-enabled all-passive row/column decoders",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6728729/",
            "Abstract": "In this letter, we present new architectural perspectives in optical static RAM configurations by exploiting the wavelength dimension in address domain. We present a 2 × 4 optical RAM row decoder (RD) that relies its operation on an all-passive wavelength-selective filtering matrix ( λ-matrix), receiving WDM-formatted address bits (Wordline) as input. The 2 × 4 RD is followed by an semiconductor optical amplifier Mach-Zehnder interferometer access gate and a column decoding unit to provide complete optical RAM row access. Proof-of-concept experimental verification of a 2 × 4 optical RAM RD is shown at 10 Gb/s, providing error-free operation with a peak power penalty lower than 0.2 dB.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital all-optical physical-layer network coding for 2Gbaud DQPSK signals in mm-wave radio-over-fiber networks",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427717300875",
            "Abstract": "We propose the first digital All-Optical Physical-layer Network Coding (AOPNC) scheme for up to 2Gbaud Differential Quadrature Phase Shift Keyed – Sub-Carrier Modulated (DQPSK-SCM) signals in future Radio-over-Fiber (RoF) networks. The proposed encoding unit employs Delay Interferometers (DIs) for the DQPSK-to-OOK conversion, a first stage of Semiconductor Optical Amplifier-Mach Zehnder Interferometers (SOA-MZIs) as optical OOK-XOR and OOK-NXOR logic gates, and a second stage of SOA-MZIs as phase regenerators of the final four-level phase-formatted encoded signal. The proposed encoding operation is performed on-the-fly at the Central Office (CO) and the resulting packet is broadcasted at the end-users, where the electrical decoding takes place. The proof of concept scheme is demonstrated for 4 Gb/s Non-Return-to-Zero (NRZ) DQPSK-SCM signals modulated on a 60 GHz Sub-Carrier …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Fiber Wireless A-RoF/IFoF Uplink Transmission of up to 0.6 Gb/s User Data Rate Over a 32-Element 60 GHz Beam-Steering Antenna for 5G Fronthaul Networks",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_100",
            "Abstract": "We experimentally demonstrate an uplink transmission of a Fiber Wireless A-RoF/IFoF fronthaul link for 5G networks using a 32-element 60 GHz phased array antenna in the 1-m long wireless channel and 10 km of SMF spool for the optical link. At first, we characterize the link frequency response using a single tone measurement and perform a dynamic characterization using an 100Mbd QPSK, 8PSK and 16-QAM signal, resulting in 200 Mb/s, 300 Mb/s and 400 Mb/s user data rate, meeting the uplink user-rate KPI-requirements for 5G mm wave networks. Beam-steering capabilities for the Fiber Wireless link are shown for a 300 Mbd QPSK transmission and 15° degrees incident angle, showing flexibility for 5G mm Wave networks.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "First demonstration of all-optical digital network coding in radio over fiber networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7356665/",
            "Abstract": "We propose and experimentally demonstrate the first all optical digital network coding between OOK-NRZ Subcarrier Modulated (SCM) signals for Radio over Fiber (RoF) networks using a Semiconductor Optical Amplifier-Mach Zehnder Interferometer (SOA-MZI) as an XOR encoder. Successful encoding and decoding is demonstrated for 1 Gb/s data on a 10 GHz sub-carrier for synchronous and asynchronous NRZ data.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tactile displays: Overview and recent advances",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141938207000613",
            "Abstract": "Tactation is the sensation perceived by the sense of touch, and is based on the skin’s receptors. Touch is a common medium used by the general population and the sensory impaired. Tactile substitution can be used by the blind or deaf in order to: (a) enhance access to computer graphical user interfaces and (b) enhance mobility in controlled environments.The skin nerves can be stimulated through six types of receptors by mechanical, electrical, or thermal stimuli. Modalities, such as vibration and pressure, can stimulate these receptors. Advances in tactile communication using implementations of the actuating devices have been developed via several new technologies. These technologies include static or vibrating pins, focused ultrasound, electrical stimulation, surface acoustic waves, and other.This paper is a review of the state-of-the-art in the physiological and technological principles, considerations and …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Nonlinear Dynamics for Information Processing",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21922-1_9",
            "Abstract": "In this chapter we describe the technology of information processing in dynamical systems. A method for storing and processing information is proposed, in which digital information blocks are unambiguously related to dynamic attractors (periodic orbits and chaotic attractors) of nonlinear dynamical systems. Actually, a dynamical system is designed with prescribed dynamic attractors in its phase space. Dynamical systems with such cycles attain some interesting features regarding information processing, such as associative memory (retrieval of the whole stored image when a small part of it is given), search by content, novelty filter, etc. The designed dynamical systems can be used as memory cells for texts, pictures and other kinds of information. We give practical examples of using this approach to create information search engines, information archives with associative access to the stored data, and other …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optical interconnect and memory components for disaggregated computing",
            "Publication year": 2017,
            "Publication url": "http://ikee.lib.auth.gr/record/292883",
            "Abstract": "We demonstrate recent advances in the area of optical RAM-based cache memory technology and in the area of optical interconnect technologies for allowing the deployment of a disintegrated computational setting where offchip optical cache modules can be connected to cache-light Chip Multiprocessors and DRAM modules. We report on recent experimental results obtained within the FP7 project RAMPLAS and we discuss the disintegration roadmap relying on optical PCB technologies and Si-integrated AWGR and transceiver chips pursued within the recently started project ICT-STREAMS. Finally, we demonstrate the application of optical memory setups in routing applications by proposing optical CAM memories towards the implementation of complete ultra-fast routing look-up tables directly in the optical domain.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:08ZZubdj9fEC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "III–V-on-Si photonic crystal nanocavity laser technology for optical static random access memories",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7517367/",
            "Abstract": "Heterogeneous integration of III-V semiconductors on silicon has gained considerable momentum fueled by the need to implement fully functional photonic devices and circuits in a CMOS compatible platform. In this communication, we report on a III-V photonic crystal (PhC) nanocavity, heterogeneously integrated on a silicon-on-insulator platform, to form a PhC nanocavity laser capable of exhibiting two elementary static random access memory (SRAM) cell functions individually, namely switching and latching operations under a high-speed, bit-level regime. As such, the PhC nanocavity laser is examined as a generic logic functions building block, suitable toward multiGb/s energy-efficient, optical SRAM cells with minimal device footprint. The proposed device occupies a total area of only 6.2 μm 2  , rendering in this way the demonstrated memory element the smallest among the integrated optical memories …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fiber wireless A-RoF/IFoF uplink of 0.4 Gb/s 16-QAM and 0.6 Gb/s QPSK over a 32-element 60GHz phased array antenna for 5G fronthaul networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8892146/",
            "Abstract": "We experimentally demonstrate an end-to-end Fiber Wireless A-RoF/IFoF fronthaul link using a 32-element 60GHz phased array antenna and characterize for the first time its linearity using two tone measurements, resulting in an 100Mbd uplink transmission of a 16-QAM signal and a 300Mdb QPSK with beamsteering of 15° degrees across 1km fiber and 1m V-band link, meeting the uplink user-rate KPI-requirements for 5G mmWave networks.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multicast-enabling optical switch design employing Si buffering and routing elements",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8307416/",
            "Abstract": "We demonstrate experimentally an optical switch architecture that employs μm-silicon-on-insulator (SOI)-based circuitry for both buffering and routing purposes and operates with 10-Gb/s optical packets in both uniand multi-cast switching forwarding modes. It comprises a hybrid broadcast-and-select (BS)/wavelength-routed architecture, with the BS layout being responsible for identifying the desired cluster of outgoing ports, while the wavelength-routed switch part forwards then the data to the specific outgoing port. Contention resolution at the BS switch part is offered through an μm-SOI integrated optical delay line bank and wavelength-routing is realized by means of a μm-SOI 3 × 3 echelle grating router, while semiconductor optical amplifier Mach-Zehnder interferometers are employed for wavelength conversion purposes. The switch architecture has been experimentally validated with 10-Gb/s optical data …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical 3-bit counter using two cascaded stages of SOA-MZI-based T-flip-flops",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6110694/",
            "Abstract": "We present a 3-bit all-optical counter comprising two cascaded stages of a novel optical T-Flip-Flop that employs one SOA-MZI and a feedback loop. Experimental verification is demonstrated at 8MHz using a fiber-based feedback loop implementation.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A chaotic communication system with enhanced security features",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/43223682/A_chaotic_communication_system_with_enha20160229-14112-19ablqr.pdf",
            "Abstract": "In this work we present the implementation of a chaotic communication system with enhanced security features. The enhancement in the security of the system at hand is achieved neither by increasing chaos dimensionality nor by making synchronization of transmitter and receiver more sensitive to system parameters but by introducing a set of parameters used in the encoding and decoding of the message signal. We also introduce a time delay parameter in the dynamical system which on the one hand improves the chaotic behavior of the system and on the other, adds further security in the encoding-decoding scheme. In our work, we modify the non-autonomous 2\" order non-linear oscillator system presented by G. Mycolaitis, et al in Proc. of 7\" Int. Workshop on Non-linear Dynamics of Electronic Systems, which is particularly suitable for digital communications.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "40 Gb/s NRZ wavelength conversion using a differentially-biased SOA-MZI: theory and experiment",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5740551/",
            "Abstract": "We present theoretical and experimental performance analysis of 40 Gb/s Non-Return-to-Zero (NRZ) All-Optical Wavelength Conversion (AOWC) using a differentially-biased SOA-MZI. A frequency domain transfer function model for both the standard single-control SOA-MZI-based AOWC and for the differentially-biased SOA-MZI is analytically derived, exploiting first order perturbation theory techniques and showing that only the differentially-biased scheme can yield an almost flat low-pass filtering response enabling wavelength conversion at 40 Gb/s. The theoretically obtained results are also confirmed through experiments that demonstrate successful 40 Gb/s AOWC functionality for NRZ data signals only when a differentially-biased SOA-MZI configuration is employed, whereas an error-floor is obtained when 40 Gb/s NRZ AOWC with the standard single-control SOA-MZI scheme is attempted. The 1.7 dB negative …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical digital network coding for very high-throughput mm-wave Fiber-Wireless networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7537349/",
            "Abstract": "We realized an all-optical digital physical-layer network coding in Fiber-Wireless networks by employing two SOA-MZI XOR gates. Encoding and decoding operations are demonstrated for 1Gb/s data on 10GHz subcarrier and extended to 60GHz with simulations.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Chapter Semiconductor Optical Amplifier (SOA)–Based Amplification of Intensity-Modulated Optical Pulses—Deterministic Timing Jitter and Pulse Peak Power Equalization Analysis",
            "Publication year": 2015,
            "Publication url": "https://library.oapen.org/handle/20.500.12657/49135",
            "Abstract": "This chapter presents the fate of the charge carriers from the moment of its photogeneration in the perovskite to injection and transport into electrodes. Time-resolved electrical measurement techniques, terahertz (THz) spectroscopy and microwave (MW) conductivity, are primarily used to deconvolute ultrafast processes and to directly access behavior of charged species from the ps to µs timescales. Transient absorption and photoluminescence spectroscopy were also utilized to gain insight on carrier population dynamics and radiatively recombining charges. Photogenerated charged species were converted into highly mobile charges (µe = 12.5 cm2V-1s-1 and µh = 7.5 cm2V-1s-1) almost instantaneously (< 0.2 ps), while the remaining loosely bounded excitons dissociate into mobile charges after 2-3 ps. This high mobility is maintained for at least 1 ns as obtained by THz spectroscopy, while its lifetime is at least few tens of µs as measured by the MW conductivity technique. Lowering the temperature increases carrier mobilities with T-1.6.Dependence and a 75 meV barrier energy is required for temperature-activated recombination. Finally, injection of hole from MAPbI3 to Spiro-OMeTAD was found to be ultrafast and the state and population of dark holes dictate its recombination.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:J-pR_7NvFogC",
            "Publisher": "InTechOpen"
        },
        {
            "Title": "Secure transmission of analog information using chaos",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/secure-transmission-analog-information-using/43304",
            "Abstract": "In this work the authors present a thorough experimental study of a practical realization of a complex analog signal transmission system using dynamic chaos. It is demonstrated that the chaotic synchronous response could be used as a basis for the design of secure communication channels. The results presented in this work confirm the possibility of secure wireless communications in RF band, while they allow the authors to analyze in detail the restrictions and problems connected with the quality of synchronization of the transmitter and the receiver of the wireless communication systems. The effect of the perturbing factors on the transmission quality is investigated theoretically. It is shown that the main reason of the transmission’s quality degradation is the chaotic response desynchronization associated with the phenomenon of “on-off” intermittency. It is found that under the effect of the perturbing factors, the level …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Monolithically Integrated InP Bistable Photonic Waveguide Memory",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9555605/",
            "Abstract": "In this article, we experimentally demonstrate, for the first time, an all-optical bistable monolithically integrated photonic waveguide memory of distinctive simplicity, relying on two travelling waveguide Semiconductor Optical Amplifiers with Cross Gain modulation (SOA-XGM) phenomena. Experimental proof-of-principle memory operation and wavelength switching operation are demonstrated at 5Gb/s, featuring an Extinction Ratio of 6 dB and a 4.6 dB BER penalty, in the case of the memory operation, as well as a power penalty of 3.5 dB at 10 −9  BER value, in the case of the wavelength switching. Being entirely designed and fabricated using standard library-based components, the proposed photonic memory fits within a 3.5 mm waveguide configuration of a generic monolithic InP platform, while its overall footprint is     mm 2  demonstrating a footprint reduction of 40% compared to previous hybrid SOA-MZI …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Passive Devices and Waveguides Mode Converter and Multiplexer With a Subwavelength Phase Shifter for Extended Broadband Operation............................. D. González-Andrade, R. Fernández de Cabo, J. Vilas, I. Olivares, A. Dias, JM Luque-González, JG Wangüemert-Pérez, A. Ortega-Moñux, Í. Molina-Fernández, R. Halir, P. Cheben, and AV Velasco 1262 Relaxed Tolerance Low-Loss Adiabatic Si3N4 to Polymer Waveguide Coupler for Dense Interconnects...............",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9570832/",
            "Abstract": "Table of contents Page 1 NOVEMBER 15, 2021 VOLUME 33 NUMBER 22 IPTLEL (ISSN \n1041-1135) PAPERS Active Photonic Devices Ultra-Low Threshold and Temperature-Stable \nInGaN Blue and Green Laser Diodes ....................................... ......................................................... A. \nCastiglia, M. Malinverni, M. Rossetti, M. Duelk, and C. Velez 1235 Monolithically Integrated InP \nBistable Photonic Waveguide Memory ........................................................ ............... T. Moschos, \nC. Pappas, G. Mourgias-Alexandris, T. Alexoudi, C. Vagionas, A. Miliou, and N. Pleros 1274 \nPassive Devices and Waveguides Mode Converter and Multiplexer With a Subwavelength \nPhase Shifter for Extended Broadband Operation ............ ................. D. González-Andrade, R. \nFernández de Cabo, J. Vilas, I. Olivares, A. Dias, JM Luque-González, JG Wangüemert-Pérez, \nA. Ortega-Moñux, Í. Molina-Fernández, R. Halir, P. Cheben, and AV Velasco 1262 Low-to .…",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analog IFoF/mmWave 5G Optical Fronthaul Architecture for Hot-Spots Using Multi-channel OFDM-Based WDM Signals.",
            "Publication year": 2019,
            "Publication url": "http://ikee.lib.auth.gr/record/305516/files/Analog_Postprint.pdf",
            "Abstract": "An analog Intermediate-Frequency-over-Fiber (IFoF)–based fronthaul 5G architecture for high traffic hot-spot environments is presented. The proposed optical fronthaul link utilizes Photonic Integrated Circuit (PIC) Wavelength Division Multiplexing (WDM) Externally Modulated Laser (EML)-based optical transmitters at a centralized Base Band Unit (BBU) and Reconfigurable Optical Add-Drop Multiplexers (ROADMs) at the Remote Radio Head (RRH) side located in the hot-spot area. By employing two WDM links, where each wavelength carries six 0.5 Gbaud IF bands of Orthogonal Frequency Division Multiplexing (OFDM) with 16–QAM Sub-Carrier (SC) modulation, a total data rate of 96 Gb/s was achieved. Error Vector Magnitude (EVM) measurements were carried out, exhibiting acceptable performance below the EVM FEC limit of 12.5%. A power budget study was also performed, suggesting up to 9.5 km fiber lengths between the BBU and the hot-spot network. The proposed architecture complies with the high capacity and low latency requirements of the 5G vision, thus may be an efficient solution for 5G fronthauling of heavy traffic hot-spot areas.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WDM-enabled optical RAM architectures for ultra-fast, low-power optical cache memories",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6603029/",
            "Abstract": "The processor-memory performance gap, commonly referred to as “Memory Wall” problem, owes to the speed mismatch between processor and electronic RAM clock frequencies. In that perspective, optical RAMs storing and retrieving information in the form of light with ps-scale memory access times seem to hold the potential for replacing small-size caches, offering at the same time a cache memory system being fully-compatible with optically interconnected CPU-memory architectures. In this article, we present our recent work on optical RAM cell configurations exploiting silicon-based integrated switching and latching elements with SOAs serving as the active devices. We review both their experimental and underlying theoretical framework and proceed with the demonstration of new optical cache architectural paradigms enabled by the introduction of WDM principles in the storage area. The higher than 40GHz …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-chip SOI delay line bank for optical buffers and time slot interchangers",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8106776/",
            "Abstract": "We demonstrate integrated silicon-on-insulator (SOI) spiral waveguides with record-high 2.6-ns/mm 2  on-chip delay efficiency performing as delay bank stage in variable optical delay buffering and time-slot interchanger applications with 10-Gb/s optical packets. The micro-scale SOI chip comprises three integrated waveguide delay elements of different lengths, providing variable delays of 6.5, 11.3, and 17.2 ns, respectively. Utilizing two semiconductor optical amplifier Mach-Zehnder interferometer wavelength converters and on-chip packet delay, error-free on-chip variable delay buffering from 6.5 to 17.2 ns and successful time-slot interchanging for 10-Gb/s optical packets are presented.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Potassium-sodium ion-exchanged waveguides and integrated optical components.",
            "Publication year": 1993,
            "Publication url": "https://elibrary.ru/item.asp?id=5805563",
            "Abstract": "Degree: Ph. D.DegreeYear: 1991Institute: University of FloridaThe K -Na  ion exchange process is very attractive for fabrication of passive integrated optical components with assured reproducibility within specified tolerance. Main advantages are the small diffusion rates, use of pure KNO  molten bath, and single-mode fiber-compatible mode sizes.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonlinear electronic circuit, Part I: Multiple routes to chaos",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X0800730X",
            "Abstract": "A nonlinear electronic oscillator, suitable for synchronized chaotic communication, is studied. This circuit is capable of transmitting discrete chaotic signals, although the chaotic modes of operation are controlled in an analog way. In Part I of this review paper the three routes to chaotic operation that appear, namely the period doubling, intermittency and crisis induced intermittency, are thoroughly studied and discussed. In all three routes to chaos the appropriate experimental distributions were calculated. Moreover, the chaotic nature of the circuit operation was evaluated by using the Grassberger–Procaccia method. Calculation of the corresponding minimum embedding dimension, the Kolmogorov–Sinai entropy as well as the maximal Lyapunov exponent give useful information in order to fully characterize the circuit operation.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Semiconductor Optical Amplifier (SOA)–based amplification of intensity-modulated optical pulses—deterministic timing jitter and pulse peak power equalization analysis",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=QmqQDwAAQBAJ&oi=fnd&pg=PA109&dq=info:bD6DAS3WsCQJ:scholar.google.com&ots=kIyJKhBzt3&sig=3gOgEi1U5teLVmxN9jsm7GZ0_RQ",
            "Abstract": "During the last few years, large-scale efforts towards realizing high-photonic integration densities have put SOAs in the spotlight once again. Hence, the need to develop a complete framework for SOA-induced signal distortion to accurately evaluate a system’s performance has now become evident. To cope with this demand, we present a detailed theoretical and experimental investigation of the deterministic timing jitter and the pulse peak power equalization of SOA-amplified intensity-modulated optical pulses. The deterministic timing jitter model relies on the pulse mean arrival time estimation and its analytic formula reveals an approximate linear relationship between the deterministic timing jitter and the logarithmic values of intensity modulation when the SOA gain recovery time is faster than the pulse period. The theoretical analysis also arrives at an analytic expression for the intensity modulation reduction (IMR), which clearly elucidates the pulse peak power equalization mechanism of SOA. The IMR analysis shows that the output intensity modulation depth is linearly related to the respective input modulation depth of the optical pulses when the gain recovery time is faster than the pulse period. This novel theoretical platform provides a qualitative and quantitative insight into the SOA performance in case of intensity-modulated optical pulses.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:yD5IFk8b50cC",
            "Publisher": "InTech"
        },
        {
            "Title": "Memory speed analysis of optical RAM and optical flip-flop circuits based on coupled SOA-MZI gates",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6017088/",
            "Abstract": "We demonstrate analytical frequency-domain transfer function expressions for an optical random access memory (RAM) cell that employs two SOA-based ON/OFF switches and two coupled SOA-MZI gates forming an optical flip-flop. Our theoretical model relies on first-order perturbation theory approximations applied for the first time to coupled optical switching structures, resulting to an optical RAM cell frequency response that allows for a qualitative and quantitative analysis of optical RAM memory speed and performance characteristics and their dependence on certain RAM cell device parameters. We show that the transfer function of an optical RAM cell and its incorporated flip-flop device exhibits periodic resonance frequencies resembling the behavior of optical ring resonator configurations. Its free spectral range is mainly dictated by the length of the waveguide that enables the coupling of the two SOA-MZI …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental In-Out Synchronization-Intermittencybetween two bidirectionally coupled circuits",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Amalia-Miliou/publication/235978168_Experimental_In_-_Out_Synchronization_-_Intermittency_between_Two_Bidirectionally_Coupled_Circuits/links/00b7d52a1bed236478000000/Experimental-In-Out-Synchronization-Intermittency-between-Two-Bidirectionally-Coupled-Circuits.pdf",
            "Abstract": "In this paper the in-out intermittent synchronization of two coupled, nonlinear, double-scroll, chaotic operating, circuits is experimentally studied. The synchronized circuits are bidirectionally coupled via a linear resistor. In order to determine the kind of intermittency demonstrated laminar lengths versus the deviation of the control parameter from its critical value, and the mean laminar length distribution, are studied.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:HDshCWvjkbEC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "A WDM RoF system for heterogeneous 5 GHz/60 GHz wireless applications in MTMAC-enabled networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033227/",
            "Abstract": "We present a heterogeneous passive WDM RoF system that is capable of simultaneously delivering broadband wireless 500 Mb/s services at 5 GHz RF carriers and 2.5 Gb/s LAN traffic at 60 GHz RF carriers over a standard single mode fiber. Our system employs phase modulation formats and optical frequency multiplication in order to increase the transmission distance and reduce the chromatic dispersion, allowing also for the use of cost-effective low-frequency RF components at the CO premises. Detailed performance evaluation results are derived by means of simulations that confirm the successful transmission of both RF carriers with less than 2 dB power penalty over a long distance optical path. The proposed system is fully compatible with the requirements of Medium-Transparent MAC protocols proposed for seamlessly and dynamically allocating resources in 60 GHz RoF LANs.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling tactile information flow using ontologies",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.78.5345&rep=rep1&type=pdf",
            "Abstract": "Tactile displays are interfaces that enable users to access information that is displayed through the human skin using the sense of tactation. In order for the software to better simulate and adjust to the tactile information generation, flow and perception and also drive tactile interfaces, we need a formal definition of tactile information. In this article, we propose a model for tactile information flow using ontologies. In our case, ontologies refer to the shared understanding of knowledge for tactile information. The proposed model analyzes the existing knowledge in tactile information and helps defining the types of elements that take part in the tactile information flow. The new proposed model can be used to identify how tactile displays can enhance perception of information and human-computer interaction, enable a machine to use this knowledge in applications and assist the development of software for tactile displays.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A 10Gb/s Optical Random-Access Memory using a saturated SOA-MZI fast Access Gate and a monolithic InP Flip-Flop",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8750503/",
            "Abstract": "We experimentally demonstrate an all-optical static Random-Access Memory (RAM)cell using a monolithic integrated InP Flip-Flop and a fast strongly-saturated push-pull SOA-MZI Access-Gate, reporting 10Gb/s error-free Write/Read operation and the fastest RAM cell to date.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "4× 10 Gb/s WDM Fiber Wireless multi-IFoF Reconfigurable Fronthaul using a low-loss Si3N4 ROADM for mmWave 5G",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2021-W1J.6",
            "Abstract": "Four 10 Gb/s multi-IFoF 16-QAM WDM Fiber-Wireless links are transmitted through 10km fiber and 50cm directional V-band antennas and flexibly reconfigured by a Si 3 N 4 ROADM, towards record 40 Gb/s wavelength-routed fronthaul capacity for mmWave 5G.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:5ugPr518TE4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A 5 Gb/s monolithically integrated InP SOA-based bistable photonic waveguide memory",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_SI-2021-STu1G.5",
            "Abstract": "We experimentally demonstrate for the first time a simple bistable monolithic integrated InP photonic memory relying on two semiconductor optical amplifiers with traveling waveguide configuration. Proof of principle operation is presented at 5 Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:XiVPGOgt02cC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Networks and Switching",
            "Publication year": 0,
            "Publication url": "https://scholar.archive.org/work/ltrabfxjpjamhocxq3czfudg7y/access/wayback/https://ieeexplore.ieee.org/ielx7/50/9173860/09173861.pdf",
            "Abstract": "SEPTEMBER 1, 2020 VOLUME 38 NUMBER 17 JLTEDG (ISSN 0733-8724) Networks and \nSwitching Reconfigurable Integrated Optical Interfero Page 1 SEPTEMBER 1, 2020 VOLUME 38 \nNUMBER 17 JLTEDG (ISSN 0733-8724) Networks and Switching Reconfigurable Integrated \nOptical Interferometer Network-Based Physically Unclonable Function . . . . . . . . . . . . . . . . . . . . \n................................................................................AM Smith and HS Jacinto 4599 Theoretical and \nExperimental Analysis of Burst-Mode Wavelength Conversion via a Differentially-Biased SOA-MZI \n. . ....... A. Tsakyridis, M. Moralis-Pegios, C. Vagionas, E. Ruggeri, G. Mourgias-Alexandris, \nA. Miliou, and N. Pleros 4607 Systems and Subsystems A Photonic-Based Wideband RF \nSelf-Interference Cancellation Approach With Fiber Dispersion Immunity . . . . Y. Chen 4618 \nSub-Nyquist Ultra-Wideband Sparse Signal Reception via Variable Frequency Comb . . . …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bridging the HASM: An OWL ontology for modeling the information pathways in haptic interfaces software",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417412010147",
            "Abstract": "Haptics technology has received enormous attention to enhance human computer interaction. The last decade has witnessed a rapid progress in haptic application software development due to the fact that the underlying technology has become mature and has opened up novel research areas. In an attempt to organize the path between cause and effect we envision a need for a standard for haptic application software modeling. In order for the software to better enhance the tactile information sensation, flow and perception and also make interaction between humans and haptics more efficient and natural, we need a formal representation of the haptics domain. This article proposes the use of HASM, a haptic applications software modeling ontology to formally model the haptics domain in order to be used during the specifications and design phases of developing software applications for haptic interfaces. The …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:_kc_bZDykSQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A 1.3 mu m directional coupler polarization splitter by ion exchange",
            "Publication year": 1993,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/212530/",
            "Abstract": "A glass waveguide polarization splitter for operation in the 1.3 mu m wavelength region is reported. The device, which has a symmetric directional coupler configuration, exploits the stress-induced birefringence in K/sup +/-Na/sup +/, ion-exchanged waveguides, giving rise to an adequate difference in the coupling lengths for the two polarizations. Starting from the measured potassium concentration (refractive index) profile of the structure and utilizing a combination of the multilayer stack theory and the effective-index method, the normal mode propagation constants and mode field profiles are calculated to determine the polarization splitting length and the extinction ratio, and the results are compared with the experimental data. It is shown that in a given coupler, the splitting occurs at several wavelengths in the 1.0-1.45 mu m range. A 25 mm-long coupler, fabricated by thermal diffusion of K/sup +/ ions in BK7 glass …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital optical physical-layer network coding for mm-wave radio-over-fiber signals in fiber-wireless networks",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-34-20-4765",
            "Abstract": "We demonstrate a digital Optical Physical-layer Network Coding (OPNC) for mm-wave fiber-wireless signals modulated with up to 2.5 Gb/s On/OFF Keyed (OOK) data. The proposed OPNC concept uses an all-optical XOR gate comprising a Semiconductor Optical Amplifier-Mach Zehnder Interferometer (SOA-MZI) with SOAs being driven at low moderate electrical currents in order to perform the all-optical encoding between the OOK envelopes of the data, ignoring the high-frequency Sub-Carrier (SC) signal. In this scheme, network coding is performed on-the-fly at the central office and the resultant packet is broadcasted at the client nodes, where the decoding takes place. We demonstrate experimental results of OPNC using OOK data signals modulated on a 10 GHz SC with the aid of a second all-optical XOR gate for the decoding process at the client's site, reporting error-free performance for both synchronous …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WDM-enabled optical RAM and optical cache memory architectures for Chip Multiprocessors",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7193417/",
            "Abstract": "The rapid increase in processor throughput is currently exceeding the electronic memory speed progress, forming the well-known “Memory Wall” problem, forcing current Chip Multiprocessor (CMP) configurations to consume more than 50% of the chip real-estate for caching purposes. In that perspective, optical RAMs storing and retrieving information in the form of light with ps-scale memory access times seem to hold the potential for replacing small-size caches, offering at the same time a cache memory system being fully-compatible with optically interconnected CPU-memory architectures. In this article, we present our recent work spanning from WDM-enabled optical RAM bank architectures with optical all-passive row/column decoder modules to a complete 16GHz optical cache memory physical layer design for Chip Multiprocessor configurations and up to the Si-based integrated optical RAM cell architectures …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamics of the solution of Bratu’s equation",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X08007323",
            "Abstract": "In the present report we examine the dynamics exhibited by the solution of Bratu’s equation. It represents a one-dimensional map with control parameter θ. For certain values of the parameter θ it exhibits successive bifurcations and shows chaotic regimes. This behaviour was confirmed by calculating the corresponding Lyapunov exponent, power spectra and cobweb diagrams, indicating similarities with other well-known one-dimensional maps.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Reconfigurable Fiber Wireless IFoF Fronthaul with 60 GHz Phased Array Antenna and Silicon Photonic ROADM for 5G mmWave C-RANs",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9374991/",
            "Abstract": "We demonstrate experimentally a bandwidth-reconfigurable mmWave Fiber Wireless (FiWi) fronthaul bus topology for spectrally efficient and flexibly reconfigurable 5G Centralized-Radio Access Networks (C-RAN). The proposed fronthaul architecture includes four 1 Gb/s Intermediate Frequency over Fiber (IFoF) channels that can be flexibly allocated among two in-series Reconfigurable Optical Add/Drop Multiplexer (ROADM) integrated nodes, supporting in total 8 V-band 32-element Phased Array Antenna (PAA) terminals. The ROADM was fabricated as an integrated photonic device exploiting the ultra-low loss Si3N4 TriPleX waveguide integration platform and an architectural layout based on cascaded MZI interleavers. The device has flat top response of 32.5 GHz with a Free Spectral Range (FSR) of 100 GHz and fiber-to-fiber losses of 5 dB, while the V-band PAA supports analog RF beamsteering capabilities …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "All optical flip flop with two coupled travelling waveguide SOA-XGM switches",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=qels-2012-JW4A.2",
            "Abstract": "We demonstrate a novel optical SR-flip flop with simple architecture, employing only two SOA XGM switches. Proof-of-principle operation is experimentally demonstrated at 8 Mb/s and numerically evaluated at 10 Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Design and Optimization of Open-cladded Plasmonic Waveguides for CMOS Integration on Si 3 N 4 Platform",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s11468-018-0863-7",
            "Abstract": "Herein, we present a design analysis and optimization of open-cladded plasmonic waveguides on a Si3N4 photonic waveguide platform targeting CMOS-compatible manufacturing. For this purpose, two design approaches have been followed aiming to efficiently transfer light from the hosting photonic platform to the plasmonic waveguide and vice versa: (i) an in-plane, end-fire coupling configuration based on a thin-film plasmonic structure and (ii) an out-of-plane directional coupling scheme based on a hybrid slot waveguide. A comprehensive numerical study has been conducted, initially deploying gold as the reference metal material for validating the numerical models with already published experimental results, and then aluminum and copper have been investigated for CMOS manufacturing revealing similar performance. To further enhance coupling efficiency from the photonic to the plasmonic part …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Optical RAM cell with Dual-Wavelength Bit Input and three SOA XGM switches",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6476260/",
            "Abstract": "We experimentally demonstrate a novel optical static RAM cell that exploits wavelength diversity in the incoming optical streams towards reducing the number of active elements, requiring only three SOA XGM gates for successful Read/Write operation.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamics of the solution of Bratu's equation",
            "Publication year": 2009,
            "Publication url": "http://acikerisim.iku.edu.tr/handle/11413/1222",
            "Abstract": "In the present report we examine the dynamics exhibited by the solution of Bratu's equation. It represents a one-dimensional map with control parameter theta. For certain values of the parameter theta it exhibits successive bifurcations and shows chaotic regimes. This behaviour was confirmed by calculating the corresponding Lyapunov exponent, power spectra and cobweb diagrams, indicating similarities with other well-known one-dimensional maps. (C) 2008 Elsevier Ltd. All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:3s1wT3WcHBgC",
            "Publisher": "PERGAMON-ELSEVIER SCIENCE LTD, THE BOULEVARD, LANGFORD LANE, KIDLINGTON, OXFORD OX5 1GB, ENGLAND"
        },
        {
            "Title": "Optical RAM row access using WDM-enabled all-passive row/column decoders",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8982/89821R/Optical-RAM-row-access-using-WDM-enabled-all-passive-row/10.1117/12.2037879.short",
            "Abstract": "Towards achieving a functional RAM organization that reaps the advantages offered by optical technology, a complete set of optical peripheral modules, namely the Row (RD) and Column Decoder (CD) units, is required. In this perspective, we demonstrate an all-passive 2×4 optical RAM RD with row access operation and subsequent all-passive column decoding to control the access of WDM-formatted words in optical RAM rows. The 2×4 RD exploits a WDM-formatted 2-bit-long memory WordLine address along with its complementary value, all of them encoded on four different wavelengths and broadcasted to all RAM rows. The RD relies on an all-passive wavelength-selective filtering matrix (λ-matrix) that ensures a logical ‘0’ output only at the selected RAM row. Subsequently, the RD output of each row drives the respective SOA-MZI-based Row Access Gate (AG) to grant/block the entry of the incoming data …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:mB3voiENLucC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "An InP Reflective SOA-EAM for 10 Gb/s Colorless Multi-IFoF/mmWave Fiber-Wireless Uplink in 5G Networks",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_SI-2021-SW3A.6",
            "Abstract": "We experimentally present a 10-Gb/s Fiber Wireless IFoF/V-band uplink of four 625Mbaud 16QAM signals with a linear, high-power monolithically integrated reflective electro-absorption modulator with semiconductor optical amplifier for 5G mmWave fronthaul networks.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A Deeply Saturated Differentially-Biased SOA-MZI for 20 Gb/s Burst-Mode NRZ Traffic",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/502806",
            "Abstract": "We experimentally demonstrate an optical Burst-Mode Wavelength Converter (BMWC) that simultaneously provides power equalization and wavelength conversion of Non-Return to Zero-On/Off Keying (NRZ-OOK) data and operates up to 20 Gb/s. It employs a balanced, differentially-biased, Semiconductor Optical Amplifier-Mach Zehnder Interferometer (SOA-MZI) operating in deeply saturated regime and its performance is evaluated at 10 Gb/s and 20 Gb/s with loud/soft peak–power ratios up to 9 dB and 5 dB, respectively. Bit Error Rate (BER) measurements reveal error free operation with up to 6.1 dB BER improvement at 10 Gb/s and 3.51 dB at 20 Gb/s, while the use of a single SOA-MZI yields 50% reduction in the number of active components against state-of-the-art BMWCs. Finally, the proposed BMWC is evaluated in non-dispersion compensated 25 km fiber transmission experiment, providing error-free operation with 1.43 dB BER improvement, validating its capabilities for potential employment in Passive Optical Networks (PON) and 5G fronthaul networks. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:XiSMed-E-HIC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "SOA-MZI-based nonlinear optical signal processing: a frequency domain transfer function for wavelength conversion, clock recovery, and packet envelope detection",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5662829/",
            "Abstract": "We present analytic expressions for the frequency-domain transfer function of semiconductor optical amplifier Mach-Zehnder interferometric (SOA-MZI) switches that employ a single optical control signal and a continuous wave input optical beam. Our analysis relies on first-order perturbation theory approximations applied both to the SOA response as well as to the SOA-MZI characteristics, yielding a frequency response that enables a qualitative insight into the different SOA-MZI operational regimes. The final transfer function expression is utilized for the analysis and evaluation of the multifunctional potential of SOA-MZI switches, concluding with the necessary conditions for supporting a number of completely different SOA-MZI-based nonlinear signal processing applications that have been demonstrated experimentally: wavelength conversion, packet envelope detection (PED), and clock recovery (CR). The …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A 320Gb/s-throughput 2x2 Silicon-Plasmonic Router Architecture for Optical Interconnects",
            "Publication year": 0,
            "Publication url": "https://www.academia.edu/download/43765121/A_320_Gbs-Throughput_Capable_2_2_Silicon20160315-9827-jltwhw.pdf",
            "Abstract": "We demonstrate a 2x2 silicon-plasmonic router architecture with 320Gb/s throughput capabilities for optical interconnect applications. The proposed router platform relies on a novel dual-ring Dielectric-Loaded Surface Plasmon Polariton (DLSPP) 2x2 switch heterointegrated on a Silicon-on-Insulator (SOI) photonic motherboard that is responsible for traffic multiplexing and header processing functionalities. We present experimental results of a Poly-methyl-methacrylate (PMMA)-loaded dual-resonator DLSPP waveguide structure that uses two racetrack resonators of 5.5 μm radius and 4μm-long straight sections and operates as a passive add/drop filtering element. We derive its frequency-domain transfer function, confirm its add/drop experimental spectral response, and proceed to a circuit-level model for dual-ring DLSPP designs supporting 2x2 thermo-optic switch operation. The validity of our circuit-level modeled 2x2 thermo-optic switch is verified by means of respective full vectorial three-dimensional Finite Element Method (3D-FEM) simulations. The router setup is completed by means of two 4x1 SOI multiplexing circuits, each one employing four cascaded 2nd order micro-ring configurations with 100GHz spaced resonances. Successful interconnection between the DLSPP switching matrix and the SOI circuitry is performed through a butt-coupling design that, as shown via 3D-FEM analysis, allows for small coupling losses of as low as 2.2 dB. The final router architecture is evaluated through a co-operative simulation environment, demonstrating successful 2x2 routing for two incoming 4-wavelength Non-Return-to-Zero (NRZ) optical packet …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Theory and sensitivity optimization of plasmo-photonic Mach-Zehnder interferometric sensors.",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9440769/",
            "Abstract": "We demonstrate a novel theoretical framework for refractive index Mach-Zehnder interferometric (MZI) sensors that can accurately calculate the sensor FSR and sensitivity while taking into account waveguide effective index dispersion and dip splitting effects. In contrast to the state-of-the-art mathematical equation that relates sensitivity with FSR, our analysis concludes to a mathematical expression that retains its validity and accuracy both in low and large FSR sensor layouts, suggesting its suitability for use in optimizing sensor performance even in the high-sensitivity, high-FSR configurations. This is validated by applying our theory to integrated plasmo-photonic MZI sensors with FSR values up to hundreds of nm, confirming our theoretical results through accurate numerical and circuit-level simulations and demonstrating how sensitivity can be boosted to >105 nm/RIU values exploiting dispersion engineering of …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:1qzjygNMrQYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "GENERATION OF CHAOTIC OSCILLATIONS IN DYNAMICAL SYSTEM WITH FIELD-EFFECT TRANSISTOR AS AN ACTIVE ELEMENT.",
            "Publication year": 2009,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15591948&AN=36674371&h=K5EbAZ%2B07m%2FwnTOalNIC%2F21ddIkG%2Be6SoG1NE%2FvLJnyuLPEf84QnuAWCeJY5DtCIxn44e%2Fw3PG5klMLixHNJ7w%3D%3D&crl=c",
            "Abstract": "Chaotic oscillator scheme with field-effect transistor as an active element is considered. Electric scheme of the generator is a variant of capacitive oscillator. Its mathematical model described by three ordinary differential equations along with its circuit model taking into account the internal structure of the transistor and temperature and frequency effects are studied. Scaling relations that make it possible to scale the frequency band of chaotic generation and to use transistors with different steepnesses of the current-voltage characteristic are derived.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-wavelength access gate for WDM-formatted words in optical RAM row architectures",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8621/86210D/Multi-wavelength-access-gate-for-WDM-formatted-words-in-optical/10.1117/12.2002580.short",
            "Abstract": "Optical RAM has emerged as a promising solution for overcoming the “Memory Wall” of electronics, indicating the use of light in RAM architectures as the approach towards enabling ps-regime memory access times. Taking a step further towards exploiting the unique wavelength properties of optical signals, we reveal new architectural perspectives in optical RAM structures by introducing WDM principles in the storage area. To this end, we demonstrate a novel SOAbased multi-wavelength Access Gate for utilization in a 4x4 WDM optical RAM bank architecture. The proposed multiwavelength Access Gate can simultaneously control random access to a 4-bit optical word, exploiting Cross-Gain-Modulation (XGM) to process 8 Bit and Bit channels encoded in 8 different wavelengths. It also suggests simpler optical RAM row architectures, allowing for the effective sharing of one multi-wavelength Access Gate for each …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:kNdYIx-mwKoC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Fiber-compatible K/sup+/-Na/sup+/ion-exchanged channel waveguides: fabrication and characterization",
            "Publication year": 1989,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/34050/",
            "Abstract": "A systematic study of waveguides fabricated by K/sup +/-Na/sup +/ exchange in soda-lime silicate and BK7 glasses is presented. The measured K/sup +/ concentration profile, the refractive index profile, and the diffusion profile obtained by solving the one-dimensional diffusion equation are correlated to explain the differences in the index profiles in the two glasses. The mobility of the potassium ions was measured by fabricating waveguides using electromigration. Surface waveguides formed by diffusion from a molten KNO/sub 3/ salt bath were buried by applying an electric field. Single-mode channel waveguides for operation at a wavelength of 1.3 mu m that exhibit excellent mode matching with conventional optical fibers, achieving a fiber-waveguide insertion loss of less than 1 dB for a 20-mm-long waveguide, have been obtained.< >",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "System level evaluation of optical RAM circuits based on cross coupled SOAs and SOA-MZIs in the time and frequency domain",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6876444/",
            "Abstract": "One of the key issues in Central Processing Unit (CPU) chips is the “Memory Wall” problem, where the clock frequency of RAM circuits cannot keep up in pace with the clock of the multiple cores. The current approach by chip architects to tackle this obstacle is to increase constantly the size of the cache memories on the dye in order to prevent the cores standing in idle state, while expecting data from the RAM circuit. However, this solution is totally inefficient considering that the dye area of the chip is very precious and could be used alternative for the integration of additional cores, transceivers etc. that would radically enhance the performance of current CPUs. A disruptive solution for data storage within the chip is the introduction of optics in the processor layout by embedding photonic RAM circuits operating at multiple tens of GHz frequencies that would unleash the processing performance of CPU cores at high …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Some Advanced Functionalities of Optical Amplifiers",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=16636302222060317298&hl=en&oi=scholarr",
            "Abstract": "With the explosion of information traffic, the role of optical amplifiers becomes very significant in fulfilling the demand of faster optical signals and data processing in the field of communication. This book covers different advanced functionalities of optical amplifiers as well as their emerging applications in optical communication networks. The first chapter deals with an efficient and validated time-domain numerical modelling of semiconductor optical amplifiers (SOAs) and SOA-based circuits, while the second chapter is based on the working of gallium nitride-based semiconductor optical amplifiers. The role of SOAs for the next generation of high-data-rate optical packet-switched network is presented in Chapter 3. Chapter 4 covers the all-optical semiconductor optical amplifier based on quantum dots (QD-SOA) and its function as an arithmetic processor. In Chapter 5, the authors have presented the role of SOAs in …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:BrmTIyaxlBUC",
            "Publisher": "InTech"
        },
        {
            "Title": "Optical logic circuits: a new approach to the control of fiber optic LANs",
            "Publication year": 1998,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/727673/",
            "Abstract": "The centralized filtering of the transmitted packets has been the base of a family of high-performance protocols for WDM star networks. Protocols of this family have been proved to achieve a significantly higher performance than the well-known contention-oriented or round-robin protocols. However, the need for electronic control of the filtering mechanism as well as the use of slowly tunable acoustooptic filters have been limiting factors in their performance. Furthermore, since the network hub of WDM star networks represents a single point of failure, the extensive use of electronic circuits at this point reduces the reliability of the system. In this paper, an all-optical centralized protocol is introduced. According to this protocol, the passing of the transmitted packets to the star coupler is controlled by means of optical logic circuits, without the need of optical to electronic translation or electronic processing of the network …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultra-compact III‒V-on-Si photonic crystal memory for flip-flop operation at 5 Gb/s",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=oe-24-4-4270",
            "Abstract": "We report on a photonic crystal (PhC) nanolaser based on the heterogeneous integration of a III-V PhC nanocavity on SOI, configured to operate as a Set-Reset Flip-Flop (SR-FF). The active layer is a nanobeam cavity made of a 650nm × 285nm InP-based wire waveguide evanescently coupled to 500nm × 220nm SOI wire waveguides, demonstrating a record-low footprint of only 6.2μm^2. Injection locking enables optical bistability allowing for memory operation with only 6.4fJ/bit switching energies and <50ps response times. Bit-level SR-FF memory operation was evaluated at 5Gb/s with PRBS-resembling data patterns, revealing error free operation with a negative power penalty.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "The intermittency route to chaos of an electronic digital oscillator",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218127408021178",
            "Abstract": "An electronic oscillator producing digital signals, formed by a second-order, nonlinear, nonautonomous, closed loop topology that is based on two integrators and nonlinear elements (a comparator and a XOR gate), was experimentally investigated. For a certain frequency and amplitude range of the periodic driving signal, the intermittency route to chaos was observed and studied.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Analog fiber-wireless downlink transmission of IFoF/mmWave over in-field deployed legacy PON infrastructure for 5G fronthauling",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-12-10-D57",
            "Abstract": "We present a fixed mobile convergence topology for analog intermediate frequency over fiber (A-IFoF)/millimeter-wave (mmWave) transmission, benefiting from the reuse of the deployed passive optical network (PON) infrastructure, towards future mobile fronthaul architectures. Powerful fully programmable gate array boards located inside the access nodes convert the Ethernet-based traffic to orthogonal frequency-division multiplexing (OFDM)-modulated intermediate frequency (IF) waveforms, supporting the A-IFoF propagation through the optical legacy infrastructure. Coexistence of the 5G traffic with the residential legacy traffic for the field propagation is achieved through utilization of unused C-band channels and wavelength-division multiplexing. To this extent, we experimentally demonstrate the downlink operation of a converged A-IFoF/mmWave link, over Telecom Italia’s legacy infrastructure located at Turin …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:geHnlv5EZngC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A Flexible and Reconfigurable Si3N4 ROADM-enabled 5G mmWave IFoF Fiber Wireless Fronthaul with 60 GHz beamsteering capabilities",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9333186/",
            "Abstract": "A bandwidth-reconfigurable mmWave Fiber Wireless fronthaul bus topology of four 1 Gb/s 16-QAM streams transmitted through two cascaded low-loss Si 3 N 4 -ROADM stages and a 60 GHz Phased Array Antenna with 90° steering is experimentally demonstrated the first time for 5G C-RANs.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:q3oQSFYPqjQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tactile display applications: A state of the art survey",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30578460/10.1.1.60.2942.pdf",
            "Abstract": "Tactation is the sensation perceived by the sense of touch. Kinesthetic information describes the relative positions and movements of body parts as well as muscular effort when touching and manipulating objects. Haptic perception involves both tactile perception through the skin and kinesthetic perception of the position and movement of the joints and muscles, through the skin of our fingers and the position of our fingers. A tactile display is a human-computer interface that utilizes tactile only signals to reproduce the tactile parameters of an object such as shape, surface texture, roughness and temperature. Tactile interfaces are used in virtual environments, and as a complement or substitution of the visual or auditory presentation of information. In this paper we present a review of the state of the art regarding the latest applications and software for tactile interfaces, in areas such as graphic display, medicine, military and engineering aiding the sensory impaired.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CTRQ 2009",
            "Publication year": 0,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/ctrq/2009/3696z011/12OmNwwd2Q3",
            "Abstract": "list-reviewer IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer \nSociety Digital Library Jobs Tech News Resource Center Press Room Browse By Date \nAdvertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My \nSubscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE \nIEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date \nAdvertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home \n2.Proceedings 3.ctrq 2009 list-reviewer 2009, pp. xi-xii, DOI Bookmark: 10.1109/CTRQ.\nKeywords IEEE, Authors Abstract The conference offers a note of thanks and lists its reviewers. \nReviewers ,CTRQ 2009 , ,Ahmed Al-Dubai,, Napier University/Merchiston ,Campus- Edinburgh, \nUnited Kingdom ,Mugurel Ionut Andreica,, University \"Politehnica\" of Bucharest (UPB), ,,, , …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonlinear FDTD method for the simulation of the optical effects in silicon waveguides",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2491845.2491850",
            "Abstract": "As the interest for Silicon-On-Insulator (SOI) waveguides is increasing, it would be valuable to have an explicit simulation method to provide a framework for quick and low cost analysis of the optical effects in silicon waveguides. This paper focuses on modeling the inherent optical properties of silicon waveguides using the finite-difference-time-domain (FDTD) method. Emphasis was placed on nonlinearities which are: Kerr effect, Two Photon Absorption (TPA), Stimulated Raman Scattering, Free Carrier Absorption (FCA) and Free Carrier Plasma (FCP). These effects have been included directly in an extended FDTD simulator through time-dependent Maxwell's equations and using the nonlinear constitutive relation. The objective is to develop a time-domain algorithm for investigating the complex physical phenomena inherited in silicon waveguides before photonic devices are fabricated. The FDTD method is an …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Linearity Measurements on a 5G mmWave Fiber Wireless IFoF Fronthaul Link with analog RF beamforming and 120 degrees steering",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9178371/",
            "Abstract": "Towards the 5G millimeter Wave (mmWave) era, analog transport offers a spectrally efficient scheme for converged Fiber Wireless (FiWi) networks. Signal integrity is traditionally considered as a limiting factor due to various non-linearities attributed to the microwave photonic link, expected to be further exacerbated by the RF-chain of beamforming Phased Array Antennas (PAAs). The letter proposes the end-to-end evaluation of FiWi analog links as unified communication channels rather than separately for the radio or optical part, presenting a link with a 32-element 60 GHz PAA, 1 m V-band distance, 10 km fiber and 10 dB dynamic range. The measurements reveal a third order Intercept Point (IIP3) of 4.8 dBm, compared to 22.8 dBm exclusively for the optics, pinpointing the V-band radio as the main source of degradation rather than the microwave photonic link. Single user uplink is also benchmarked using 300 …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Desynchronization crisis induced intermittency in a master–slave PLL configuration",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077908004864",
            "Abstract": "The experimental study of intermittency in the phase error signal, in a PLL master–slave configuration, is reported. Both master and slave phase-locked loop topologies are implemented by well known commercial PLLs, directly coupled to one another. The chaotic phenomenon appears in the limit of the operating range of a widely known and used configuration of two PLLs, resulting in a loss of synchronization between the two output frequencies. This intermittent behavior is induced by a crisis, between two attractors in the corresponding phase-space.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:4TOpqqG69KYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Dynamics on relaxed Newton’s method derivative, chaos and complex systems I. Interdisciplinary chaos symposium",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=3903000295038572910&hl=en&oi=scholarr",
            "Abstract": "In the present report the dynamic behaviour of the one dimensional family of maps f (x)= b (x+ ar}'is examined, for representative values of the control parametres a, b and A..",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Flexible 360° 5G mmWave small Cell Coverage through WDM 4× 1 Gb/s Fiber Wireless Fronthaul and a Si3N4 OADM-Assisted Massive MIMO Phased Array Antenna",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9083636/",
            "Abstract": "Four Wavelength Division Multiplexed 1Gb/s QAM16 streams are transmitted through 10km fiber, an Optical Add/Drop Multiplexer and a V-band beamsteering antenna with 90° steering, demonstrating the first 5G Fiber-Wireless A-RoF architecture with 360° coverage.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:vRqMK49ujn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical RAM and optical CAM Architectures for Disintegrated Computing and High-Speed Routing Applications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8473777/",
            "Abstract": "The unprecedented amounts of data and aggregated traffic being generated have pushed current computing and networking infrastructure to their limits, challenging their scaling in terms of bandwidth and energy. Within this context, optical Random-access memories (RAMs) and optical Content-Addressable memories (CAMs) appear as promising solutions to serve for retaining data at high capacities and supporting computing and networking applications. In this article, we present our recent work on optical RAM and optical CAM architectures towards realizing disintegrated computing and high-speed routing applications, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "5G mm wave networks leveraging enhanced fiber-wireless convergence for high-density environments: The 5G-PHOS approach",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8436713/",
            "Abstract": "Analog optical fronthaul for 5G network architectures is currently being promoted as a bandwidth- and energy-efficient technology that can sustain the data-rate, latency and energy requirements of the emerging 5G era. This paper presents 5G-PHOS project approach, which relies on a new optical fronthaul architecture that can effectively synergize optical transceiver, optical add/drop multiplexer and optical beamforming integrated photonics towards a DSP-assisted analog fronthaul, administered by means of a Medium Transparent Dynamic Bandwidth Allocation (MT-DBA) protocol for seamless and medium-transparent 5G small-cell networks.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The relaxed Newton method derivative: Its dynamics and non-linear properties",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X07000612",
            "Abstract": "The dynamic behaviour of the one-dimensional family of maps f (x)= c 2 [(a− 1) x+ c 1]− λ/(α− 1) is examined, for representative values of the control parameters a, c 1, c 2 and λ. The maps under consideration are of special interest, since they are solutions of the relaxed Newton method derivative being equal to a constant a. The maps f (x) are also proved to be solutions of a non-linear differential equation with outstanding applications in the field of power electronics. The recurrent form of these maps, after excessive iterations, shows, in an x n versus λ plot, an initial exponential decay followed by a bifurcation. The value of λ at which this bifurcation takes place depends on the values of the parameters a, c 1 and c 2. This corresponds to a switch to an oscillatory behaviour with amplitudes of f (x) undergoing a period doubling. For values of a higher than 1 and at higher values of λ a reverse bifurcation occurs. The …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Optical cache memory peripheral circuitry: Row and column address selectors for optical static RAM banks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6642075/",
            "Abstract": "We demonstrate WDM-enabled all-passive optical row and column address selector (RAS/CAS) circuits for use as optical static RAM (SRAM) bank peripherals in future optical cache memory implementations. We show that the introduction of the wavelength dimension in both the memory address and data word fields can lead to RAS and CAS architectures that rely exclusively on all-passive wavelength-selective configurations. An all-optical 2 × 4 RAS comprising a wavelength-selective filtering matrix (λ-matrix) and a wavelength-based CAS unit formed by a simple AWG element are demonstrated in proof-of-principle experiments at 10 Gb/s with error-free operation at 10  -9  BER value using two different types of WDM SRAM row Access Gate (AG): a cross-phase modulation SOA-MZI gate and a single SOA cross-gain modulation gate, with the first providing the higher performance compared to SOA module and the …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Broadband 5Gb/s Optical RAM Cell over the C-band",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_SI-2021-STu1G.4",
            "Abstract": "A broadband optical RAM cell comprising a monolithic InP Flip-Flop and a Random Access Gate is experimentally presented with at least 5 Gb/s error-free operation and less than 4.5 dB power penalty across the whole C-band.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:bnK-pcrLprsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Multi-user IFoF uplink transmission over a 32-element 60GHz phased array antenna enabling both Frequency and Spatial Division Multiplexing",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9125508/",
            "Abstract": "We experimentally present the A-RoF/IFoF uplink transmission of three 60GHz terminals with 200Mb/s QPSK through a 32-element antenna with beamsteering up to a 60 o -angle and 10km fiber, comparing for the first time the frequency and spatial division multiplexing for multi-user uplink for 5G mmWave networks.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:738O_yMBCRsC",
            "Publisher": "IET"
        },
        {
            "Title": "Crisis induced intermittency in a fourth-order autonomous electric circuit",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077906001470",
            "Abstract": "The chaotic dynamics of a fourth-order autonomous nonlinear electric circuit has been studied. The circuit consists of two active elements, one linear negative conductance and one nonlinear resistor exhibiting a symmetrical piecewise-linear v–i characteristic and two capacitances C1 and C2, which serve as the control parameters of the system. Experimental time series and the corresponding phase portraits were used to register the intermittent behaviour of the corresponding dynamical system between two interacting subattractors. The distribution of the times τ, between successive transitions from the one subattractor to the other indicates that a crisis induced intermittency occurs in the studied circuit.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Chapter Efficient and Validated Time Domain Numerical Modeling of Semiconductor Optical Amplifiers (SOAs) and SOA-based Circuits",
            "Publication year": 2015,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/49142/49540.pdf?sequence=1",
            "Abstract": "Semiconductor optical amplifiers (SOAs) have been extensively used in a wealth of tele‐com and datacom applications as a powerful building block that features large optical gain, all-optical gating function, fast response, and ease of integration with other func‐tional semiconductor devices. As fabrication technologies are steadily maturing toward enhanced yield, SOAs are foreseen to play a pivotal role in complex photonics integrated circuits (PICs) of the near future. From a design standpoint, accurate numerical modeling of SOA devices is required toward optimizing PICs response from a system perspective, while enhanced circuit complexity calls for efficient solvers. In this book chapter, we present established experimentally validated SOA numerical modeling techniques and a gain parameterization procedure applicable to a wide range of SOA devices. Moreover, we describe multigrid concepts and implicit schemes that have been only recently pre‐sented to SOA modeling, enabling adaptive time stepping at the SOA output, with dense sampling at transient phenomena during the gain recovery and scarce sampling during the steady-state response. Overall, a holistic simulation methodology approach along with recent research trends are described, aiming to form the basis of further develop‐ments in SOA modeling.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:a0OBvERweLwC",
            "Publisher": "InTechOpen"
        },
        {
            "Title": "Heterogeneous 60 GHz/5 GHz broadband optical wireless systems supporting dynamic bandwidth allocation",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6876455/",
            "Abstract": "We present our recent work in developing and demonstrating a fully converged heterogeneous high-throughput 60 GHz / 5 GHz optical wireless transmission system that allows for dynamic bandwidth allocation towards supporting Cloud RAN architectures. In addition to modulation/demodulation of the baseband optical signals, this system is responsible for the conversion of the optical phase modulated low frequency sub-carriers signals into higher frequency wireless signals and their transmission into the air. Finally, its design is capable of supporting Medium-Transparent MAC protocol mechanisms allowing for a seamless interplay between optical and wireless.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multikilohertz all-optical modulator in semiconductor doped glass channel waveguide",
            "Publication year": 1993,
            "Publication url": "https://ieeexplore.ieee.org/document/252409/",
            "Abstract": "A polarisation independent all-optical modulator is presented with 100% modulation depth at multikilohertz repetition rate in semiconductor doped glass channel waveguide. An interpretation of the modulation mechanism is given.< >",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IET"
        },
        {
            "Title": "Digital chaotic synchronized communication system",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.660.5338&rep=rep1&type=pdf",
            "Abstract": "The experimental study of a secure chaotic synchronized communication system is presented. The synchronization between two digital chaotic oscillators, serving as a transmitter-receiver scheme, is studied. The oscillators exhibit rich chaotic behavior and are unidirectionally coupled, forming a master-slave topology. Both the input information signal and the transmitted chaotic signal are digital ones.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Nonlinear electronic circuit, Part II: synchronization in a chaotic MODEM scheme",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X09007196",
            "Abstract": "In this work we present a thorough investigation of the effect of noise (internal or external) on the synchronization of a drive–response configuration system (unidirectional coupling between two identical systems). Moreover, since in every practical implementation of a communication system, the transmitter and receiver circuits (although identical) operate under slightly different conditions it is essential to consider the case of the mismatch between the parameters of the transmitter and the receiver. In our work we consider the non-autonomous 2nd order nonlinear oscillator system presented in [G. Mycolaitis, A. Tamasevicious, A. Cenys, A. Namajunas, K. Navionis, A. N. Anagnostopoulos, Globally synchronizable non-autonomous chaotic oscillator, in: Proc. of 7th International Workshop on Nonlinear Dynamics of Electronic Systems, Denmark, July 1999, pp. 277–280] which is particularly suitable for digital …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:UebtZRa9Y70C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Memory speed analysis of optical T-Flip-Flop circuits based on an SOA-MZI and a feedback loop",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6608280/",
            "Abstract": "We demonstrate a frequency-domain transfer function analysis for optical T-Flip-Flops relying on feedback loops, along with experimental verification. Our analysis confirms experimental results, showing that optimized circuit design can enable optical T-Flip-Flop memory speeds higher than 40GHz.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The nonlinear current behaviour of a driven R–L-Varactor in the low frequency range",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1468121807002143",
            "Abstract": "The nonlinear behaviour of an R–L-Varactor circuit, simulated by Multisim 7.0 at a driving frequency that is below the circuit resonance frequency, is reported and evaluated. A new high amplitude oscillation is observed and attributed to the emergence of a large diode junction capacitance. Increasing the driving signal amplitude, the circuit is led to a non-periodic mode of operation, producing trajectories of increasing chaotic content in a four-dimensional phase space. At specific amplitudes a two-dimensional tori was monitored, where trajectories are periodic, like in a two oscillator system with commensurate frequencies. Poincaré cross-sections, FFT spectra and correlation dimension calculations, suggest the quasi-periodicity route to chaos.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:hC7cP41nSMkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Earthquake tolerant energy aware algorithms: A new approach to the design of WDM backbone networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8424893/",
            "Abstract": "The increasing energy cost of networking facilities, in conjunction with environmental instability and climate change, have led to many research efforts targeting the reduction of the energy consumption in telecommunication networks. Wavelength division multiplexing (WDM) optical networks is the key solution for the continuously growing bandwidth demands of backbone networks. However, the rise of traffic has led to the augmentation of energy consumption in such networks. Moreover, backbone networks in countries with high seismicity suffer from unexpected link failures caused by earthquakes, which in turn, cause a huge amount of bandwidth loss and service disruptions. In this paper, a new power aware algorithm is introduced, which uses actual seismic information in order to maintain tolerant connectivity of the backbone network after a large scale earthquake occurs, while supporting energy efficiency. The …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical digital physical-layer network coding for DPSK mm-wave radio-over-fiber networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8025159/",
            "Abstract": "We demonstrate the first all-optical digital physical-layer network coding (AOPNC) for Differential Phase Shift Keyed (DPSK) Sub-Carrier Modulated (SCM) signals in mm-wave Radio-over-Fiber (RoF) networks. AOPNC is performed at the Central Office (CO) by employing a Delay Interferometer (DI) for phase-to-amplitude conversion, two Semiconductor Optical Amplifier-Mach Zehnder Interferometers (SOA-MZIs) performing the XOR and XNOR operation between the OOK converted signals and a third SOA-MZI for the phase regeneration of the encoded phase-formatted XOR signal. Encoding and decoding are evaluated via simulations for 2.5 Gb/s NRZ-DPSK data modulated on 60 GHz SC for both synchronous and asynchronous operation.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An end-to-end 5G fiber wireless A-RoF/IFoF link based on a 60 GHz beamsteering antenna and an InP EML",
            "Publication year": 2020,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11307/113070A/An-end-to-end-5G-fiber-wireless-A-RoF-IFoF/10.1117/12.2544866.short",
            "Abstract": "An IFoF/V-band link is experimentally presented in a 100MBd QPSK downlink transmission across 7km fiber by a high-power EML and over-the-air by 60GHz beamforming antenna with 32-radiating elements, comprising the first demonstration of a cost-effective end-to-end directional Fiber-Wireless link for dense 5G millimeter-wave networks.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:tOudhMTPpwUC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Barrier Engineered Infrared Photodetectors Based on Type-II InAs/GaSb Strained Layer Superlattices................................................... N. Gautam, S. Myers, AV Barve, B. Klein, EP Smith, DR Rhiger, HS Kim, Z.-B. Tian, and S. Krishna 211 Optical Communications and Modeling Using LCDF-TEQ to Reduce CP Length for 20.48-Gb/s Direct Detection Optical OFDM Systems Over 1200 km",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6417967/",
            "Abstract": "Table of contents Page 1 FEBRUARY 2013 VOLUME 49 NUMBER 2 IEJQA7 (ISSN 0018-9197) \nPAPERS Semiconductor Lasers Numerical Analysis of Suppression Effects on Optical \nFeedback Noise by Superposition of High Frequency Current in Semiconductor Lasers ...................................................................................... \nSMS Imran and M. Yamada 196 VCSELs 3-D Vectorial Optical Model for High-Contrast \nGrating Vertical-Cavity Surface-Emitting Lasers ....................................... ....................................................................................... \nP. Debernardi, R. Orta, T. Gründl, and M.-C. Amann 137 Role of Suppressed Mode in the \nPolarization Switching Characteristics of Optically Injected VCSELs ................................ ........................................................................................................ \nAA Qader, Y. Hong, and KA Shore 205 Solid State Lasers Measurement of Up Conversion \nin Er:YAG and Influence on Laser Performance ...................................................…",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamics On Relaxed Newton's Method Derivative",
            "Publication year": 2006,
            "Publication url": "http://acikerisim.iku.edu.tr/handle/11413/430",
            "Abstract": "In the present report the dynamic behaviour of the one dimensional family of maps f(x) = b(x + ar}' is examined, for representative values of the control parametres a, b and A.. These maps are of special interest, since theyare solutions of N;j = 2 , where N;j is the Relaxed Newton's method derivative. The maps f(x) are proved to be solutions of the non-linear df(x) fJ[.r/..I](1+A)/A fJ 1 b-1/A differential equation, dx - '. J \\Xi , where = /l. •. The reccurent form of these maps, Xn = b(xn_i + arA, after excessive iterations, shows in a Xn vs. A. plot, an initial exponential decay followed by a bifurcation. The value ofA. at which this bifurcation takes place, depends on the values of the parameters a, b. This corresponds to a switch to an oscillatory behaviour with amplitudes of f (X) undergoing a period doubling. For values of a slightly higher than i and at higher A.'s areverse bifurcation occurs and a bleb is formed. This behaviour is …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:qUcmZB5y_30C",
            "Publisher": "İstanbul Kültür Üniversitesi Yayınları"
        },
        {
            "Title": "XPM-and XGM-based optical RAM memories: frequency and time domain theoretical analysis",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6828730/",
            "Abstract": "We demonstrate a frequency and time domain analysis for optical random access memory (RAM) cells that rely on semiconductor optical amplifier (SOA)-based switches but employ different switching mechanisms. The first RAM cell utilizes SOA cross gain modulation (XGM) switches both for the access gate as well as latching mechanism, whereas the second RAM cell configuration utilizes SOA-Mach-Zehnder interferometer cross phase modulation (XPM) switches. The frequency domain analysis exploits first-order perturbation theory approximations towards deriving the RAM cell frequency response, which is shown to exhibit in both RAM cell layouts a comb like resonant behavior. The free spectral range is dictated by the coupling length between the coupled switches that form the latching element, whereas the finesse depends on the temporal response of the switching mechanism employed. The qualitative …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical T flip-flop using a single SOA-MZI and a feedback loop",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ECOC-2011-We.10.P1.37",
            "Abstract": "We present an all-optical T flip-flop that requires a single toggling driving signal and is based on a SOA-MZI and a feedback loop. Experimental proof-of-principle verification is demonstrated at 7.969 Mb/s using a fiber-based feedback implementation.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Secure communication by chaotic synchronization: Robustness under noisy conditions",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1468121806000551",
            "Abstract": "In this work we present a thorough investigation of the effect of noise (internal or external) on the synchronization of a drive-response configuration system (unidirectional coupling between two identical systems). Moreover, since in every practical implementation of a communication system, the transmitter and receiver circuits (although identical) operate under slightly different conditions it is essential to consider the case of the mismatch between the parameters of the transmitter and the receiver. In our work we consider the non-autonomous second order non-linear oscillator system presented by G. Mycolaitis et al. in Proceedings of Seventh International Workshop on Nonlinear Dynamics of Electronic Systems [Globally synchronizable non-autonomous chaotic oscillator, Denmark, July 1999, pp. 277–280], which is particularly suitable for digital communications. Binary information is encoded by combining square …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Chapter Digital All-Optical Physical-Layer Network Coding",
            "Publication year": 2018,
            "Publication url": "https://library.oapen.org/handle/20.500.12657/49235",
            "Abstract": "Network coding (NC) has recently attracted intense research focus for its potential to provide network throughput enhancements, security and reduced network congestions, improving in this way the overall network performance without requiring additional resources. In this chapter, the all-optical physical-layer network coding (AOPNC) technique is presented, focusing on digital encoding schemes that are based on optical XOR logical gates. It is also discussed how digital AOPNC can be implemented between sub-carrier-modulated (SCM) optical signals in radio-over-fiber (RoF) networks, circumventing the enhanced complexity arising by the use of SCM signals and the asynchrony that might exist between the data arriving at the encoding unit. AOPNC demonstrations are described for simple on/off keyed (OOK)-SCM data signals, as well as for more sophisticated higher-order phase modulation formats aiming to further improve spectrum efficiency and transmission capacity.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "The relaxed Newton method derivative",
            "Publication year": 2008,
            "Publication url": "http://ikee.lib.auth.gr/record/248890",
            "Abstract": "The dynamic behaviour of the one-dimensional family of maps is examined, for representative values of the control parameters, and. The maps under consideration are of special interest, since they are solutions of the relaxed Newton method derivative being equal to a constant. The maps are also proved to be solutions of a non-linear differential equation with outstanding applications in the field of power electronics. The recurrent form of these maps, after excessive iterations, shows, in an versus plot, an initial exponential decay followed by a bifurcation. The value of at which this bifurcation takes place depends on the values of the parameters and. This corresponds to a switch to an oscillatory behaviour with amplitudes of undergoing a period doubling. For values of higher than 1 and at higher values of a reverse bifurcation occurs. The corresponding branches converge and a bleb is formed for values of the …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:8AbLer7MMksC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "A 5G C-RAN Architecture for Hot-Spots: OFDM based Analog IFoF PHY and MAC Layer Design",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8802037/",
            "Abstract": "Centralized Radio Access Network (C-RAN) comprises one of the main technologies for high capacity and low latency fronthauling in 5G networks. In this paper, we propose and evaluate an optical fronthaul 5G C-RAN architecture that targets to meet the bandwidth, latency and energy requirements of high traffic hot-spot areas. The proposed architecture employs Intermediate-Frequency-over-Fiber (IFoF) signal generation by Photonic Integrated Circuit (PIC) Wavelength Division Multiplexing (WDM) optical transmitters at the Base-Band Unit (BBU), while a novel design of Reconfigurable Optical Add-Drop Multiplexers (ROADMs) is used at the Remote Radio Head (RRH) site. An aggregate capacity up to 96 Gb/s has been reported by employing two WDM links with 4-band Orthogonal Frequency Division Multiplexing (OFDM) 64-QAM 0.5 Gbaud signals, showing error vector magnitude performance within the …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of the number of keys in a chaotic cryptographic method",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34017-8_6",
            "Abstract": "Data stream coder based on chaotic synchronous response is considered. An estimate of the number of keys available in this scheme is obtained by cascading the basic building block of the system and thus repeating the encoding procedures. Efficiency of the discussed algorithm (in the sense of computational expenses) is evaluated and compared to known cryptographic algorithms. As it is shown, the efficiency increases in the case of smaller number of repetitions and greater number of encoding function parameters.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optical RAM devices and architectures: A way to solve the “Memory Wall” problem?",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6608312/",
            "Abstract": "Optical RAM appears to be the alternative approach towards overcoming the “Memory Wall” of electronics, suggesting the use of light in RAM cell mechanisms to enable memory access times in the psec-regime. In this paper we present our recent work on optical RAM cell configurations relying on SOA-based switching and latching elements. We review both their experimental and theoretical framework and discuss on the new architectural perspectives in RAM encoding/decoding structures by introducing the WDM principles in the storage area.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tactile Information Flow Ontology",
            "Publication year": 0,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.80.8359&rep=rep1&type=pdf",
            "Abstract": "Tactile displays are interfaces that enable users to access information through the human skin using the sense of tactation. In order for the software to better enhance the tactile information generation, flow and perception and also drive tactile interfaces, we need a formal definition of tactile information. In this article, we propose a model for tactile information flow using ontologies. The proposed model analyzes the existing knowledge in tactile information and helps defining the types of information that take part in the tactile information flow. The new model can be used to identify how tactile displays can enhance perception of information and human-computer interaction and assist the development of software for tactile displays.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Channel Equalization for converged OFDM-Based 5G mm-wave A-RoF System at 60 GHz",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9375831/",
            "Abstract": "In this article, we are presenting, using simulations, a converged analogue radio-over-fiber (A-RoF) 5G mm-wave system at 60GHz and we are compensating the dispersion in the optical link with a simple least mean square (LMS) equalizing algorithm applied in Matlab inversing the transmission channel impairments. Quadrature Amplitude Modulation (QAM) 4 and 16 are used in the Orthogonal Frequency Division Multiplexing (OFDM) subcarriers and greatest communication distance of 25 km and 15 km are achieved respectively after equalization.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "15-dB amplification at 1.06 mu m in ion-exchanged silicate glass waveguides",
            "Publication year": 1993,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/212684/",
            "Abstract": "The authors report a 15-dB amplification and a pump efficiency almost 30 times larger than that reported previously at 1.06 mu m in ion-exchanged waveguides. The potassium-sodium exchanged channel guides used were fabricated by thermal diffusion in a 2% Nd/sup 3+/-doped silicate glass. Measurements of the refractive index profile, in the waveguides, absorption and fluorescence spectra, fluorescence lifetime, and optical gain are presented.< >",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optics in computing: From photonic network-on-chip to chip-to-chip interconnects and disintegrated architectures",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-37-2-363",
            "Abstract": "Following a decade of radical advances in the areas of integrated photonics and computing architectures, we discuss the use of optics in the current computing landscape attempting to redefine and refine their role based on the progress in both research fields. We present the current set of critical challenges faced by the computing industry and provide a thorough review of photonic Network-on-Chip (pNoC) architectures and experimental demonstrations, concluding to the main obstacles that still impede the materialization of these concepts. We propose the employment of optics in chip-to-chip (C2C) computing architectures rather than on-chip layouts toward reaping their benefits while avoiding technology limitations on the way to manycore set-ups. We identify multisocket boards as the most prominent application area and present recent advances in optically enabled multisocket boards, revealing successful 40 …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A 5G C-RAN optical fronthaul architecture for hotspot areas using OFDM-based analog IFoF waveforms",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/543380",
            "Abstract": "Analog fronthauling is currently promoted as a bandwidth and energy-efficient solution that can meet the requirements of the Fifth Generation (5G) vision for low latency, high data rates and energy efficiency. In this paper, we propose an analog optical fronthaul 5G architecture, fully aligned with the emerging Centralized-Radio Access Network (C-RAN) concept. The proposed architecture exploits the wavelength division multiplexing (WDM) technique and multicarrier intermediate-frequency-over-fiber (IFoF) signal generation per wavelength in order to satisfy the demanding needs of hotspot areas. Particularly, the fronthaul link employs photonic integrated circuit (PIC)-based WDM optical transmitters (Txs) at the baseband unit (BBU), while novel reconfigurable optical add-drop multiplexers (ROADMs) cascaded in an optical bus are used at the remote radio head (RRH) site, to facilitate reconfigurable wavelength switching functionalities up to 4 wavelengths. An aggregate capacity of 96 Gb/s has been reported by exploiting two WDM links carrying multi-IF band orthogonal frequency division multiplexing (OFDM) signals at a baud rate of 0.5 Gbd with sub-carrier (SC) modulation of 64-QAM. All signals exhibited error vector magnitude (EVM) values within the acceptable 3rd Generation Partnership Project (3GPP) limits of 8%. The longest reach to place the BBU away from the hotspot was also investigated, revealing acceptable EVM performance for fiber lengths up to 4.8 km. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:WbkHhVStYXYC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Frequency and time domain analysis of all optical memories based on SOA and SOA-MZI switches",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6886069/",
            "Abstract": "We investigate theoretically the maximum speed of high-speed optical RAM cell layouts relying on SOA and SOA-MZI elements, based on a qualitative frequency and a quantitative time domain analysis.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dual-wavelength bit input optical RAM with three SOA-XGM switches",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6193124/",
            "Abstract": "We demonstrate a novel all-optical static RAM cell that exploits wavelength diversity in the incoming optical streams towards reducing the number of active elements. The circuit requires only three semiconductor optical amplifiers-cross gain modulation gates for successful read/write operation, yielding a 25% reduction in power consumption compared to state-of-the-art configurations. Proof-of-concept experimental verification is presented at 8 Mb/s using fiber-interconnected off-the-shelf bulk components.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantum Cryptography: The Ultimate Solution to Secure Data Transmission?",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Amalia-Miliou/publication/228382926_Quantum_Cryptography_The_Ultimate_Solution_to_Secure_Data_Transmission/links/0912f50ff883e9f7cd000000/Quantum-Cryptography-The-Ultimate-Solution-to-Secure-Data-Transmission.pdf",
            "Abstract": "Quantum Cryptography is assumed as a next generation cryptographic system that may replace the public key protocol. The advantage of quantum cryptography over traditional key exchange methods is that the exchange of information can be shown to be secure in a very strong sense, without making assumptions about the intractability of certain mathematical problems. Today, Quantum Cryptography is rapidly moving out of the lab and into the telecommunications mainstream offering commercial quantum cryptography and key distribution systems based solely on quantum first principles. The question is: could Quantum Cryptography be the ultimate solution to secure data transmission? This paper presents some recent developments in the field and investigates the guarantees offered by the proposed protocols.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical RAM and flip-flops using bit-input wavelength diversity and SOA-XGM switches",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6251991/",
            "Abstract": "In this paper, we demonstrate a novel RAM cell based only on three traveling waveguide semiconductor optical amplifier-cross gain modulation (SOA-XGM) switches. The RAM cell features wavelength diversity in the incoming bit signals and provides Read/Write operation capability with true random access exclusively in the optical domain. Two of the SOA-XGM switches are coupled together through an 70/30 coupler to form an asynchronous flip-flop, which serves as the memory unit. Random access to the memory unit is granted by a third SOA-ON/OFF switch and all three SOAs together form the proposed RAM cell. Proof-of-principle operation is experimentally demonstrated at 8 Mb/s using commercial fiber-pigtailed components. The distinctive simplicity of the proposed RAM cell architecture suggests reduced footprint. The proposed flip-flop layout holds all the credentials for reaching multi-Gb/s operational …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling the non-linear behavior of a driven varactor resonator at low frequencies",
            "Publication year": 2006,
            "Publication url": "http://apothesis.teicm.gr/xmlui/handle/123456789/71",
            "Abstract": "The nonlinear behaviour of an R–L-Varactor circuit, simulated by Multisim 7.0 at a driving frequency that is below the circuit resonance frequency, is reported and evaluated. A new high amplitude oscillation is observed and attributed to the emergence of a large diode junction capacitance. Increasing the driving signal amplitude, the circuit is led to a non-periodic mode of operation, producing trajectories of increasing chaotic content in a four-dimensional phase space. At specific amplitudes a two-dimensional tori was monitored, where trajectories are periodic, like in a two oscillator system with commensurate frequencies. Poincar´e crosssections, FFT spectra and correlation dimension calculations, suggest the quasi-periodicity route to chaos.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical RAM row access and column decoding for WDM-formatted optical words",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=NFOEC-2013-JW2A.56",
            "Abstract": "We present a multi-wavelength SOA-MZI-based access gate and an AWG-based column decoder that control random access of 4× 10Gb/s WDM-formatted words into a 4-bit optical RAM row. Error-free decoding with 0.4 dB peak power penalty is presented.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Converged optical-wireless access networks enabling fixed and 60 GHz connectivity in WDM-PONs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7550667/",
            "Abstract": "Future broadband access networks in the 5G framework will need to be bilateral, exploiting both optical and wireless technologies. This paper deals with new approaches and synergies on radio-over-fiber (RoF) technologies and how those can be leveraged to seamlessly converge wireless technology for agility and mobility with passive optical networks for stability, extended coverage and ultra-high speeds. The proposed convergence paradigm is based upon a holistic network architecture mixing mm-wave wireless access with photonic integration, dynamic capacity allocation and network coding schemes to enable high bandwidth fixed and 60GHz wireless personal area communications for gigabit rate per user. We have evaluated the link between the central office (CO) and the access point module (APM) of the proposed architecture by using both SCM OOK-SSB and BPSK modulation formats obtaining error …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ontological representation of tactile information for software development",
            "Publication year": 2009,
            "Publication url": "https://content.iospress.com/articles/applied-ontology/ao068",
            "Abstract": "The last years a growing body of research has been developed on tactile displays and interfaces, which can give physical form to digital information. In spite of the numerous tactile devices that have been constructed, the development of formal definition for tactile information still remains an open issue. In order for the software to better enhance the tactile information sensation, flow and perception and also drive tactile interfaces we need a formal representation of tactile information. The tactile information ontology proposed in this article analyzes the existing knowledge in tactile information domain, specifies the conceptual structure, and defines the processes that take part in the tactile information flow. Furthermore, the developed ontological representation encodes knowledge into computer understandable form and will allow the sharing and reuse of this knowledge by software tools. The proposed model will be …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Optical buffering and time-slot interchanger with integrated si-based delay lines",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=PS-2017-PTu1D.2",
            "Abstract": "We demonstrate an optical buffer and a time-slot-interchanger utilizing Si-based spiral delay lines integrated on a micro-scale SOI platform and providing variable delays ranging between 6.5 nsec and 17.2 ns. 10Gbp/s error-free operation is reported.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optically-enabled bloom filter label forwarding using a silicon photonic switching matrix",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8060976/",
            "Abstract": "Simplified forwarding schemes relying on Bloom filter (BF)-based labels emerge as a promising approach for coping with the substantial increase in lookup table memory requirements associated with the growing number of end-hosts in DataCenters. In this paper, we present for the first time the successful implementation of a BF-label forwarding scheme over a silicon photonic switch fabric and we demonstrate its functionality with 10 Gb/s data packets that carry BF-encoded labels. The optically enabled BF-label forwarding setup utilizes a Si-based 4 × 4 electro-optic switch directly controlled by an amplifier-less and digital-to-analog-converter-less high speed Field Programmable Gate Array board. The FPGA is responsible for extracting the BF-label from the incoming packets and for carrying out the BF-based forwarding function, determining the appropriate switching state towards conveying incoming packets to …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The intermittent behavior of a second-order non-linear non-autonomous oscillator",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077906007922",
            "Abstract": "The experimental time-series produced by a second-order non-linear, non-autonomous, closed-loop electronic circuit were recorded and subsequently evaluated. The correlation and embedding dimensions, as well as the corresponding Kolmogorov entropies of the oscillating system, have been numerically calculated and compared to the corresponding Lyapunov exponents.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "5G small-cell networks exploiting optical technologies with mmWave massive MIMO and MT-MAC protocols",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_79",
            "Abstract": "Analog optical fronthaul for 5G network architectures is currently being promoted as a bandwidth- and energy-efficient technology that can sustain the data-rate, latency and energy requirements of the emerging 5G era. This paper deals with a new optical fronthaul architecture that can effectively synergize optical transceiver, optical add/drop multiplexer and optical beamforming integrated photonics towards a DSP-assisted analog fronthaul for seamless and medium-transparent 5G small-cell networks. Its main application targets include Urban and Hot-Spot Area networks, promoting the deployment of mmWave massive MIMO Remote Radio Heads (RRHs) that can offer wireless data-rates ranging from 25 to 100 Gb/s and beyond depending on the fronthaul technology employed (e.g. spatial or wavelength division multiplexing transport). Small-cell access and resource allocation is ensured via a Medium …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Memory speed analysis of an optical flip-flop employing a SOA-MZI and a feedback loop",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6380524/",
            "Abstract": "We present analytical expressions for the frequency-domain transfer function of an optical flip-flop (O-FF) cell that employs an semiconductor optical amplifier-Mach-Zehnder interferometer gate and a feedback loop. Our analysis relies on first-order perturbation theory approximations applied for the first time to optical switching structures employing feedback-loop, resulting to an O-FF frequency response that allows for a qualitative and quantitative analysis of memory speed and performance characteristics and their dependence on certain device parameters. We show that the transfer function of the O-FF exhibits periodic resonance frequencies resembling the behavior of optical linear cavity configurations and its free spectral range is mainly dictated by the length of the waveguide that forms the feedback loop, revealing this loop length as the main memory speed determining factor. Experimental verification is …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Development of a Finite Element Method Mode Solver Application for Optical Waveguides.",
            "Publication year": 2013,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.403.2705&rep=rep1&type=pdf",
            "Abstract": "Finite Element Method constitutes one of the most powerful numerical methods when there is need for approximate solutions of a problem. In this work an application with a user-friendly graphical interface, developed in Matlab, is presented which facilitates the calculation and graphical presentation of the propagation constants and modes of various types of optical waveguides using FEM. To check the validity of our simulations the results have been compared with those presented in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterization of a non-autonomous second-order non-linear circuit for secure data transmission",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077906001469",
            "Abstract": "A second-order non-linear non-autonomous electronic circuit, which contains an amplifier, two integrators and a comparator, is studied. For a certain set of values for the circuit’s parameters (amplitude and frequency of the driving signal and R C values), the circuit’s output signal is non-periodic. From the numerically calculated output signal, the correlation dimension and the Kolmogorov entropy are derived. Their values prove that the dynamical system realized by the studied circuit is a deterministic chaotic one. Moreover, the influence of artificial white noise on the original signal was investigated and the results show that only noise levels higher than 1% begin to affect the signal significantly.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:Se3iqnhoufwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Multi-user V-band uplink using a massive MIMO antenna and a fiber-wireless IFoF fronthaul for 5G mmWave small-cells",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9055223/",
            "Abstract": "We experimentally demonstrate a multi-user Fiber Wireless IFoF/mmWave uplink comprising a 32-element 60 GHz Phased Array Antenna (PAA) and 10 km of fiber for 5G fronthaul networks, supporting beamsteering within a 120° sector and 0.6 Gb/s uplink capacity within a 5 dB bandwidth of 2 GHz. The flexibility of the link is highlighted in two 3-user scenarios with 0.6 Gb/s uplink traffic: A Frequency Division Multiplexing (FDM) scheme with the PAA receiving isotropically at different frequencies and a Spatial Division Multiplexing (SDM) scheme where the same V-band frequency is re-used by all three users but are selectively received by the PAA using beamsteering. Error-free transmission with 100 Mbaud QPSK per user is demonstrated for both cases, forming the first comparison of FDM and SDM towards multi-user 5G mmWave/IFoF networks.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "applications in science and engineering",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=6426425784952582603&hl=en&oi=scholarr",
            "Abstract": "CHAOS, SOLITONS & FTALS applications in science and engineering VOLUME 4 CONTENTS VOLUME 4NUMBERI MS El Naschie W. Ebeling K. Young and JP Crutchfield G. Nicolis and P. Gaspard D. MacKernan VS Anishchenko, W. Ebeling and AB Neiman B. Pompe H. Herzel, AO Schmitt and W. Ebeling B. Schapiro OE Rossler R. Wackerbauer, A. Witt, H. Atmanspacher, J. Kurths and H. Scheingraber VOLUME 4NUMBER2 MS El Naschie R. Radha and M. Lakshmanan 181 1994 Chaos and Order in Symbolic Sequences 1 Editorial 3 Preface 41 5 Fluctuation spectroscopy Toward a probabilistic approach to complex systems 59 Sensitive response to time dependent pertur bations and spectral properties of deterministic chaos 69 Power law distributions of spectral density and higher order entropies 83 On some entropy methods in data analysis 97 Finite sample effects in sequence analysis 115 An approach to …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical Communications and Networking",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9219749/",
            "Abstract": "Optical Communications and Networking Page 1 VOL. 12, NO. 10, OCTOBER 2020/J. OPT. \nCOMMUN. NETW. Journal of Optical Communications and Networking Volume 12 Number \n10 October 2020 FUTURE PON ARCHITECTURES ENABLED BY ADVANCED \nTECHNOLOGY SPECIAL ISSUE Analog fiber-wireless downlink transmission of IFoF/mmWave \nover in-field deployed legacy PON infrastructure for 5G fronthauling.................................................................................................................................................................................................D57 \nK. Kanta, A. Pagano, E. Ruggeri, M. Agus, I. Stratakos, R. Mercinelli, C. Vagionas, P. \nToumasis, G. Kalfas, G. Giannoulis, A. Miliou, G. Lentaris, D. Apostolopoulos, N. Pleros, D. \nSoudris, and H. Avramopoulos Super-PON: an evolution for access networks [Invited].........................................................................................................................D66 \nClaudio DeSanti, Liang Du, Jhon Guarin, Jason Bone, .…",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A 320 Gb/s-Throughput Capable 22 Silicon-Plasmonic Router Architecture for Optical Interconnects",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6012500/",
            "Abstract": "We demonstrate a 2 × 2 silicon-plasmonic router architecture with 320 Gb/s throughput capabilities for optical interconnect applications. The proposed router platform relies on a novel dual-ring Dielectric-Loaded Surface Plasmon Polariton (DLSPP) 2 × 2 switch heterointegrated on a Silicon-on-Insulator (SOI) photonic motherboard that is responsible for traffic multiplexing and header processing functionalities. We present experimental results of a Poly-methyl-methacrylate (PMMA)-loaded dual-resonator DLSPP waveguide structure that uses two racetrack resonators of 5.5 μm radius and 4 μ m-long straight sections and operates as a passive add/drop filtering element. We derive its frequency-domain transfer function, confirm its add/drop experimental spectral response, and proceed to a circuit-level model for dual-ring DLSPP designs supporting 2 × 2 thermo-optic switch operation. The validity of our circuit-level …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modulation and Equalization Techniques for mmWave ARoF",
            "Publication year": 2022,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-74648-3_8",
            "Abstract": "Fifth generation (5G) is the emerging mobile communications platform that aims to meet the market requirements in terms of enhanced broadband connectivity based on harnessing small cell and mmWave technology. These two in synergy will provide high capacity gain not only through the hyperdense deployment of small cell but also through accessing large swathes of untapped spectrum at mmWave frequencies. The envisaged architecture entails an integrated optical wireless network architecture, where optical technology will complement radio in order to handle the new demands on capacity over the backhaul and fronthaul network, leading to the notion of analog radio over fiber (ARoF). The goal of this chapter is to provide novel approaches to optimize the performances of mmWave ARoF systems that includes developing enabling technology from a digital to signal processing (DSP) and device perspective.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Frequency Domain Systems Theory Perspective for Semiconductor Optical Amplifier-Mach Zehnder Interferometer Circuitry in Routing and Signal Processing Applications",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=WBeaDwAAQBAJ&oi=fnd&pg=PA53&dq=info:H4S2FFcPBP0J:scholar.google.com&ots=wgIRrYppjM&sig=ySdtDLsfYBVpOSVTr3ZsXraocf8",
            "Abstract": "Although SOAs have been initially introduced as integrated modules mainly for optical amplification purposes, they have been widely used in all optical signal processing applications, like all-optical switching and wavelength conversion, utilizing the exhibited nonlinearities such as gain saturation, cross-gain (XGM) and cross-phase modulation (XPM). These nonlinear effects that present the most severe problem and limit the usefulness of SOAs as optical amplifiers in lightwave systems can be proven attractive in optically transparent networks. The origin of the nonlinearities lies in the SOA gain saturation and in its correlation with the phase of the propagating wave, since the carrier density changes induced by the input signals are affecting not only the gain but also the refractive index in the active region of the SOA. The carrier density dynamics within the SOA are very fast (picosecond scale) and thus the gain responds in tune with the fluctuations in the input power on a bit by bit basis even for optical data at 10 or 40 Gb/s bit-rates (Ramaswami & Sivarajan, 2002).If more than one signal is injected into the SOA, their nonlinear interaction will lead to XPM between the signals. However, in order to take advantage of the XPM phenomenon and create functional devices, the SOAs have to be placed in an interferometric configuration such as a Mach-Zehnder Interferometer (MZI) that converts phase changes in the signals to intensity variations at its output exploiting interference effects. Semiconductor Optical Amplifier-based Mach-Zehnder Interferometers (SOA-MZIs) have been widely used in the past years as all-optical high speed switches for signal …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:35N4QoGY0k4C",
            "Publisher": "BoD–Books on Demand"
        },
        {
            "Title": "All-optical T-flip-flop using a single SOA-MZI-based latching element",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6151805/",
            "Abstract": "The authors demonstrate a novel all-optical T-flip-flop (TFF) layout utilizing a single optical latching element that comprises an integrated semiconductor optical amplifier and Mach-Zehnder inteferometer and a feedback loop. Experimental proof-of-concept verification is presented at 8 Mb/s using off-the-shelf bulk components and a fiber-based feedback implementation. The proposed TFF architecture requires the minimum number of active components and just a single toggling signal as input. Its simple circuit design is amenable with photonic integration and holds the credentials for operation at multi-Gb/s speeds.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and simulation of a tactile display based on a CMUT array",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207217.2012.669714",
            "Abstract": "In this article, we present the design of a tactile display based on a CMUT-phased array. The array implements a ‘pixel’ of the display and is used to focus airborne ultrasound energy on the skin surface. The pressure field, generated by the focused ultrasound waves, is used to excite the mechanoreceptors under the skin and transmit tactile information. The results of Finite Element Analysis (FEA) of the Capacitive Micromachined Ultrasonic Transducer (CMUT) and the CMUT-phased array for ultrasound emission are presented. The 3D models of the device and the array were developed using a commercial FEA package. Modelling and simulations were performed using the parameters from the POLYMUMPS surface micromachining technology from MEMSCAP. During the analysis of the phased array, several parameters were studied in order to determine their importance in the design of the tactile display. The …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:GnPB-g6toBAC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Flexible 360o 5G mmWave small cell coverage through WDM 4x1 Gb/s Fiber Wireless fronthaul and a Si3N4 OADM-assisted massive MIMO Phased Array Antenna",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2020-T4A.5",
            "Abstract": "Four Wavelength Division Multiplexed 1Gb/s QAM16 streams are transmitted through 10km fiber, an Optical Add/Drop Multiplexer and a V-band beamsteering antenna with 90 steering, demonstrating the first 5G Fiber-Wireless A-RoF architecture with 360o coverage.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:eflP2zaiRacC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "III-V/SOI Photonic Crystal nanolaser for high-speed wavelength conversion and memory operation",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2016-Tu2K.1",
            "Abstract": "We experimentally demonstrate wavelength conversion and bit-level memory operation in a hybridly integrated III-V on SOI photonic crystal nanolaser with total footprint of 6.2 μm 2 and record-energy of 6.4 fJ/bit, showing error-free operation at 5Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Bringing WDM into optical static RAM architectures",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6376075/",
            "Abstract": "Optical RAM appears to be the alternative approach towards overcoming the “Memory Wall” of electronics, suggesting use of light in RAM architectures to enable ps-regime memory access times. In this communication we take advantage of the wavelength properties of optical signals to present new architectural perspectives in optical RAM structures by introducing the WDM principles in the storage area. To this end, we report on a 4 × 4 WDM optical RAM bank architecture that exploits a novel SOA-based multi-wavelength Access Gate (WDM-AG) and a dual wavelength SOA-based SET-RESET All-Optical Flip Flop (AOFF) as fundamental building blocks. The WDM-AG enables simultaneous random access to a 4-bit optical word encoded in 8 different wavelengths, allowing for the four AOFFs of each RAM row to effectively share the same Access Gate. The scheme is shown to support a 10 Gbit/s operation for the …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deterministic timing jitter analysis of SOA-amplified intensity-modulated optical pulses",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6322996/",
            "Abstract": "We demonstrate a detailed theoretical and experimental analysis of the deterministic timing jitter induced on intensity-modulated optical pulse streams when propagating through a SOA. The mathematical analysis reveals an approximate linear relationship between jitter and pulse intensity modulation when the SOA gain recovery time is shorter than the pulse period. The theoretical results have been confirmed by experimental deterministic timing jitter measurements for intensity modulation levels up to 8 dB, showing good agreement between theory and experiment.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A programmable Si-photonic node for SDN-enabled Bloom filter forwarding in disaggregated data centers",
            "Publication year": 2017,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10109/101090X/A-programmable-Si-photonic-node-for-SDN-enabled-Bloom-filter/10.1117/12.2252043.full?sessionGUID=8bb4517e-0c58-d1ca-6961-4782588a8a19&webSyncID=83e91ada-982a-00bd-ac62-5683bb6383dd&sessionGUID=8bb4517e-0c58-d1ca-6961-4782588a8a19",
            "Abstract": "Programmable switching nodes supporting Software-Defined Networking (SDN) over optical interconnecting technologies arise as a key enabling technology for future disaggregated Data Center (DC) environments. The SDNenabling roadmap of intra-DC optical solutions is already a reality for rack-to-rack interconnects, with recent research reporting on interesting applications of programmable silicon photonic switching fabrics addressing board-to-board and even on-board applications. In this perspective, simplified information addressing schemes like Bloom filter (BF)-based labels emerge as a highly promising solution for ensuring rapid switch reconfiguration, following quickly the changes enforced in network size, network topology or even in content location. The benefits of BF-based forwarding have been so far successfully demonstrated in the Information-Centric Network (ICN) paradigm, while theoretical …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:f2IySw72cVMC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "The Effect Of Noise And Parameter Mismatch On The Synchronization Of The Drive-Response Chaotic System",
            "Publication year": 2006,
            "Publication url": "http://acikerisim.iku.edu.tr/handle/11413/426",
            "Abstract": "We present a thorough investigation of the effect ofnoise (internal or extemal) on the synchronization of a drive-response configuration system (unidirectional coupling between two identIcal systems). Moreover, since in every practical implementation of a communication system, the transmitter and receiver circuits (although identical) operate under slightly different conditions it is essential to consider the case of the mismatch between the parameters of the transmitter and the receiver. In OUT work we consider the non-autonomous 2nd order non-linear oscillator system presented by G. Mycolaitis, et aZ in Pmc. onth Int. Workshop on Non-linear Dynamics ofElectronic Systems, which is particularly suitable for digital communications.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:NaGl4SEjCO4C",
            "Publisher": "İstanbul Kültür Üniversitesi Yayınları"
        },
        {
            "Title": "Internal crisis in a second-order non-linear non-autonomous electronic oscillator",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077906007430",
            "Abstract": "The internal crisis of a second-order non-linear non-autonomous chaotic electronic circuit is studied. The phase portraits consist of two interacting sub-attractors, a chaotic and a periodic one. Maximal Lyapunov exponents were calculated, for both the periodic and the chaotic waveforms, in order to confirm their nature. Transitions between the chaotic and the periodic sub-attractors become more frequent by increasing the circuit driving frequency. The frequency distribution of the corresponding laminar lengths and their average values indicate that an internal crisis takes place in this circuit, manifested in the intermittent behaviour of the corresponding orbits.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A 5G fiber wireless 4Gb/s WDM fronthaul for flexible 360 coverage in V-band massive MIMO small cells",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-39-4-1081",
            "Abstract": "Towards relieving the bandwidth limitations in 5G mobile fronthaul networks, a Fiber Wireless (FiWi) small cell architecture is presented, relying on spectrally efficient analog transport on intermediate frequency over fiber (IFoF) and a millimeter wave (mmWave) phased array antenna (PAA) interfaced with a low-loss optical add/drop multiplexer (OADM) on Si_3N_4/SiO_2 TriPleX platform with 5 dB fiber-to-fiber losses. Specifically, four 1 Gb/s FiWi links, each carrying a 250 MBd 16-QAM signal on 5.8 GHz IFoF, are wavelength division multiplexed (WDM) and transported across a 10 km Single Mode Fiber (SMF), before being demultiplexed into the constituent channels in the OADM device and subsequently wirelessly transmitted by the PAA over a 1 m-long V-band link with 90° degree beamsteering capability. Featuring 4x 1Gb/s user rate with beamsteering to meet the respective 5G key performance indicator (KPI …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrated optical content addressable memories (CAM) and optical random access memories (RAM) for ultra-fast address look-up operations",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/207874",
            "Abstract": "Electronic Content Addressable Memories (CAM) implement Address Look-Up (AL) table functionalities of network routers; however, they typically operate in the MHz regime, turning AL into a critical network bottleneck. In this communication, we demonstrate the first steps towards developing optical CAM alternatives to enable a re-engineering of AL memories. Firstly, we report on the photonic integration of Semiconductor Optical Amplifier-Mach Zehnder Interferometer (SOA-MZI)-based optical Flip-Flop and Random Access Memories on a monolithic InP platform, capable of storing the binary prefix-address data-bits and the outgoing port information for next hop routing, respectively. Subsequently the first optical Binary CAM cell (B-CAM) is experimentally demonstrated, comprising an InP Flip-Flop and a SOA-MZI Exclusive OR (XOR) gate for fast search operations through an XOR-based bit comparison, yielding an error-free 10 Gb/s operation. This is later extended via physical layer simulations in an optical Ternary-CAM (T-CAM) cell and a 4-bit Matchline (ML) configuration, supporting a third state of the “logical X” value towards wildcard bits of network subnet masks. The proposed functional CAM and Random Access Memories (RAM) sub-circuits may facilitate light-based Address Look-Up tables supporting search operations at 10 Gb/s and beyond, paving the way towards minimizing the disparity with the frantic optical transmission linerates, and fast re-configurability through multiple simultaneous Wavelength Division Multiplexed (WDM) memory access requests. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:D03iK_w7-QYC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Design of a Tactile Display Based on a High Power CMUT Array",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377396/",
            "Abstract": "In this paper we present the optimization of a Capacitive Micro machined Ultrasonic Transducer (CMUT) array that performs as a tactile display using an electrical equivalent circuit model and the SPICE program. The array implements a \"pixel\" of the display and is used to focus airborne ultrasound energy on the skin surface. The design of the array is optimized for high output so that the pressure field generated by the focused ultrasound waves excites the mechanoreceptors under the skin and transmits tactile information. The geometry of the individual transducer and the array are optimized so that the medium presents maximum impedance and the membrane oscillates with maximum deflection. Finite element analysis of the CMUT and the CMUT phased array is used to verify the SPICE results. In order to verify the feasibility of the design, the pressure at focal point is compared with the pressure threshold required …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gel silica waveguides",
            "Publication year": 1988,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/0878/0000/Gel-Silica-Waveguides/10.1117/12.943960.short",
            "Abstract": "We report the first observation of modification of the surface-refractive index of sol-gel silica glasses for waveguide fabrication. Techniques for fabrication and measurements of attenuation and index change are reported. Preliminary results are encouraging showing the viabilitysof the sol-gel technology in integrated optical applications.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Integrated photonic look-up memory architectures to relieve the memory bottlenecks",
            "Publication year": 2020,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11364/113640J/Integrated-photonic-look-up-memory-architectures-to-relieve-the-memory/10.1117/12.2557795.short",
            "Abstract": "Optical Random Access Memories (RAMs) have been conceived as high-bandwidth alternatives of their electronic counterparts, raising expectations for ultra-fast operation that can resolve the ns-long electronic RAM access bottleneck. In addition, with electronic Address Look-Up tables operating still at speeds of only up to 1 GHz, the constant increase in optical switch i/o data rates will yield severe latency and energy overhead during forwarding operations. In this invited paper, we present an overview of our recent research, introducing an all-optical RAM cell that performs both Write and Read functionalities at 10Gb/s, reporting on a 100% speed increase compared to state-of-the-art optical/electrical RAM demonstrations. Moreover, we present an all-optical Ternary-CAM cell that operates again at 10 Gb/s, doubling the speed of the fastest optical/electrical CAMs so far. To achieve this, we utilized a monolithically …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:tS2w5q8j5-wC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Timing Jitter of SOA-amplified intensity modulated optical pulses",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2012-JTh2A.13",
            "Abstract": "The origin of timing jitter during SOA amplification of ps-long intensity modulated pulses is identified. Both experimental and analytical theoretical jitter results are presented, revealing an almost linear relationship between jitter and pulse intensity modulation.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:k_IJM867U9cC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "10 Gb/s optical random access memory (RAM) cell",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-44-7-1821",
            "Abstract": "Optical random access memories (RAMs) have been conceived as high-bandwidth alternatives of their electronic counterparts, raising expectations for ultra-fast operation that can resolve the ns-long electronic RAM access bottleneck. However, experimentally demonstrated optical RAMs have been limited to up to 5 GHz only, failing to validate the speed advantages over electronics. In this Letter, we demonstrate the first all-optical RAM cell that performs both Write and Read functionalities at 10 Gb/s, reporting on a 100% speed increase compared to state-of-the-art optical RAM demonstrations. To achieve this, the proposed RAM cell deploys a monolithically integrated InP optical Flip-Flop and a Semiconductor optical amplifier-Mach–Zehnder Interferometer (SOA-MZI) On/Off switch configured to operate as a strongly saturated differentially-biased access gate. Error-free operation is demonstrated at 10 Gb/s for both …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "5G small-cell networks leveraging optical technologies with mm-wave massive MIMO and MT-MAC protocols",
            "Publication year": 2018,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10559/105590B/5G-small-cell-networks-leveraging-optical-technologies-with-mm-wave/10.1117/12.2297276.short",
            "Abstract": "Analog optical fronthaul for 5G network architectures is currently being promoted as a bandwidth- and energy-efficient technology that can sustain the data-rate, latency and energy requirements of the emerging 5G era. This paper deals with a new optical fronthaul architecture that can effectively synergize optical transceiver, optical add/drop multiplexer and optical beamforming integrated photonics towards a DSP-assisted analog fronthaul for seamless and medium-transparent 5G small-cell networks. Its main application targets include dense and Hot-Spot Area networks, promoting the deployment of mmWave massive MIMO Remote Radio Heads (RRHs) that can offer wireless data-rates ranging from 25Gbps up to 400Gbps depending on the fronthaul technology employed. Small-cell access and resource allocation is ensured via a Medium-Transparent (MT-) MAC protocol that enables the transparent …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:abG-DnoFyZgC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Modeling of the index change in K+–Na+ ion-exchanged glass",
            "Publication year": 1991,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ao-30-6-674",
            "Abstract": "We have measured the surface index change and birefringence in K^+–Na^+ ion-exchanged waveguides and compared the results with theory. The contribution to the index change caused by the polarizability/volume changes (Δnp) is calculated using two theoretical models which use empirical relations based on the glass composition. In both cases, we encounter large discrepancies between the predicted and measured values which are attributed to the inherent deficiency in the models, which assume free expansion of the glass in calculating the volume changes. Recognizing that the net volume change is much smaller, we accurately measure its value and show that both models can be used to predict Δnp with the same accuracy, provided that the correct volume change is used. We show that the limitation in accuracy is dictated by measurement errors and uncertainties in the values of the ionic radii and …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optimizing the design of a tactile display based on a capacitive micromachined ultrasonic transducer array",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jnm.1873",
            "Abstract": "In this paper, the design and simulation of a tactile display that is based on a capacitive micromachined ultrasonic transducer (CMUT) array is presented. The array implements a ‘pixel’ of the display and is used to focus airborne ultrasound energy on the skin surface. The pressure field generated by the focused ultrasound waves excites the mechanoreceptors under the skin and transmits tactile information. The geometry of the individual transducer and the array are optimized so that the medium presents maximum impedance and the membrane oscillates with maximum deflection. Optimization is achieved using an electrical equivalent circuit model and the Berkeley Simulation Program with Integrated Circuit Emphasis (SPICE) code. Finite element analysis of the CMUT and the CMUT phased array is used to verify the SPICE results. The pressure at focal point is compared with the pressure threshold required for …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical interconnect and memory technologies for next generation computing",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7550267/",
            "Abstract": "We demonstrate recent advances in the area of optical RAM-based cache memory technology and in the area of optical interconnect technologies for allowing the deployment of a disintegrated computational setting where off-chip optical cache modules can be connected to cache-light Chip Multiprocessors and DRAM modules. We report on recent experimental results obtained within the FP7 project RAMPLAS and we discuss the disintegration roadmap relying on optical PCB technologies and Si-integrated AWGR and transceiver chips pursued within the recently started project ICT-STREAMS. Finally, we demonstrate the application of optical memory setups in routing applications by proposing optical CAM memories towards the implementation of complete ultra-fast routing look-up tables directly in the optical domain.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Non-volatile integrated photonic memory using GST phase change material on a fully etched Si3N4/SiO2 waveguide",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_si-2020-STh3R.4",
            "Abstract": "We experimentally demonstrate an integrated photonic non-volatile memory using GST phase change material on a fully etched Si 3 N 4/SiO 2-cladded waveguide for lower switching power and CMOS-compatibility, reporting interchangable switching from amorphous to crystalline state.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "An optically controlled module for wavelength conversion circuits",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1493775/",
            "Abstract": "We report an innovative solely optical architecture to implement the centralized wavelength conversion module of the CWC (controlled wavelength conversion) protocol [Papadimitriou, G.I. et al., 1999]. The proposed module was designed to distribute the conversion wavelengths to the corresponding converters in an unbiased manner taking into consideration the information carried by the control wavelength. The design of the optically controlled module is based on the use of optical logic circuits. These optical circuits distribute the available wavelengths by eliminating the need of optical to electronic translation of the network's feedback information and thus reducing drastically processing time. Furthermore, due to the all-optical nature of the network hub the reliability of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Theoretical and experimental analysis of burst-mode wavelength conversion via a differentially-biased SOA-MZI",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9095398/",
            "Abstract": "This article presents a theoretical and experimental analysis of an all optical Burst Mode Wavelength Converter (BMWC), exploiting a deeply saturated differentially biased Semiconductor Optical Amplifier - Mach-Zehnder Interferometer (SOA-MZI) configuration to provide both power equalization and wavelength conversion (WC) for intensity modulated input signals. The device operation and performance have been mathematically analyzed through a novel theoretical framework that considers finite extinction ratio signals entering a deeply saturated differentially biased SOA-MZI. Based on the theoretical model, the BMWC is capable of both power equalization and WC of intensity modulated input pulses with > 9 dB loud/soft ratio. The theoretical results were verified experimentally for 10 Gb/s Non-Return to Zero (NRZ) intensity modulated data, revealing successful power equalization and WC for up to 8 dB loud/soft …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scaling the sensitivity of integrated plasmo-photonic interferometric sensors",
            "Publication year": 2019,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/acsphotonics.8b01683",
            "Abstract": "We present a new optical biosensing integration approach with multifunctional capabilities using plasmonic and photonic components on the same chip and a new methodology to design interferometric biosensors exhibiting record high sensitivity and enhanced resolution relying on a planar surface plasmon polariton (SPP) waveguide. First, we use this approach to demonstrate a proof of concept integrated plasmo-photonic liquid refractive index sensor based on a silicon nitride (Si3N4) Mach–Zehnder Interferometer (MZI). A 70 μm long, gold metal stripe is incorporated in the sensing arm serving as the transducer element. A variable optical attenuator and a thermo-optic phase shifter are deployed in the Si3N4 reference arm for performance optimization. The variable optical attenuator stage targets high extinction ratio of the resonance at the interferometer output by balancing the power between the two arms …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:p2g8aNsByqUC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Designing an all-optical packet filtering module for WDM broadcast-and-select star networks",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399200000736",
            "Abstract": "An all-optical packet filtering module for WDM broadcast-and-select star networks is introduced. At each time instant, only one packet per wavelength is allowed to pass to the star coupler. Therefore, collisions are avoided and the network performance is improved. The proposed module is based on the use of optical logic circuits for controlling the passing of the transmitted packets to the star coupler, without the need of optical to electronic translation or electronic processing of the network feedback information. In this way, the processing time is drastically reduced, while the need for slowly tunable optical filters is eliminated. Furthermore, due to the all-optical nature of the network hub, the reliability of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A novel optically controlled wavelength conversion circuit for WDM star networks",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003040180401185X",
            "Abstract": "We report an innovative solely optical architecture to implement the centralized wavelength conversion module of the controlled wavelength conversion protocol [G.I. Papadimitriou, A.S. Pomportsis, Wavelength-conversion-based, Photonic. Netw. Commun. 1 (4) (1999) 263]. The proposed module was designed to distribute the conversion wavelengths to the corresponding converters in an unbiased manner taking into consideration the information carried by the control wavelength. The design of the optically controlled wavelength conversion circuit is based on the use of optical logic circuits. These optical circuits distribute the available wavelengths by eliminating the need of optical to electronic translation of the network’s feedback information and thus reducing drastically processing time. Furthermore, due to the all-optical nature of the network hub the reliability of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "LBuyVqsAAAAJ:4JMBOYKVnBMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Digital information transmission using discrete chaotic signal",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/digital-information-transmission-using-discrete/43311",
            "Abstract": "In this work the authors thoroughly investigated a digital information transmission system using discrete chaotic signal over cable. As an example in their work the authors consider the non-autonomous 2nd order non-linear oscillator system presented in Tamaševicious, Cenys, Mycolaitis, and Namajunas (1998) which is particularly suitable for digital communications and present the experimental results regarding synchronization. The effect of noise (internal or external) on the synchronization of the drive-response system (unidirectional coupling between two identical systems) is analyzed and since in every practical implementation of a communication system, the transmitter and receiver circuits (although identical) operate under slightly different conditions the case of the mismatch between the parameters of the transmitter and the receiver is considered. Moreover, there is a study of the robustness of the system …",
            "Abstract entirety": 0,
            "Author pub id": "LBuyVqsAAAAJ:-f6ydRqryjwC",
            "Publisher": "IGI Global"
        }
    ]
}]