[{
    "name": "Δημήτριος Βράκας",
    "romanize name": "Dimitrios Vrakas",
    "School-Department": "Πληροφορικής",
    "University": "ΑΠΘ",
    "Rank": "Επίκουρος Καθηγητής (Μόνιμος)",
    "Apella_id": 20819,
    "Scholar name": "Dimitris Vrakas",
    "Scholar id": "RCSbvNsAAAAJ",
    "Affiliation": "School of Informatics, Aristotle University of Thessaloniki",
    "Citedby": 1227,
    "Interests": [
        "Artificial Intelligence",
        "AI Planning",
        "Ambient Intelligence",
        "Robotics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=RCSbvNsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "VLEPPO: A visual language for problem representation",
            "Publication year": 2007,
            "Publication url": "http://ktilinux.ms.mff.cuni.cz/~bartak/PLANSIG2007/downloads/Proceedings.pdf#page=66",
            "Abstract": "AI planning constitutes a field of interest as its techniques can be applied to many areas. Contemporary systems that are being developed deal with certain aspects of planning and focus mainly on dealing with advanced features such as resources, time and numerical expressions. This paper presents VLEPpO, a Visual Language for Enhanced Planning problem Orchestration. VLEPpO is a visual programming environment that allows the user to easily define planning domains and problems, acquire their PDDL representations, as well as receive solutions, utilizing web services infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rule-based approaches for energy savings in an ambient intelligence environment",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574119214000777",
            "Abstract": "This paper presents a novel real-world application for energy savings in a Smart Building environment. The proposed system unifies heterogeneous wireless sensor networks under a Semantic Web Service middleware. Two complementary and mutually exclusive rule-based approaches for enforcing energy-saving policies are proposed: a reactive agent based on production rules and a deliberative agent based on defeasible logic. The system was deployed at a Greek University, showing promising experimental results (at least 4% daily savings). Although the percentage of energy savings may seem low, the greatest merit of the method is ensuring that no energy is wasted by constantly enforcing the policies.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:mB3voiENLucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A synergy of planning and ontology concept ranking for semantic web service composition",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-88309-8_5",
            "Abstract": "This paper presents a prototype system that exploits planning and an ontology concept ranking algorithm for composing semantic Web services (PORSCE). The system exploits the inferencing capabilities of a Description Logics Reasoner in order to compute the subsumption hierarchy of the ontologies whose concepts are used in the OWL-S Profile descriptions as input and output concepts. The concept ranking algorithm is applied over this hierarchy in order to determine similar concepts based on different degrees of semantic matching relaxation, such as subclass or sibling hierarchical relationships. The domain independent planning system’s role is to semantically search the space of possible compositions of Web services, generating plans according to the desirable level of relaxation.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A survey of service composition in ambient intelligence environments",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10462-011-9283-1",
            "Abstract": "This article presents a comparative review of systems performing service composition in Ambient Intelligence Environments. Such environments should comply to ubiquitous or pervasive computing guidelines by sensing the user needs or wishes and offering intuitive human-computer interaction and a comfortable non-intrusive experience. To achieve this goal service orientation is widely used and tightly linked with AmI systems. Some of these employ the Web Service technology, which involves well-defined web technologies and standards that facilitate interoperable machine to machine interaction. Other systems regard services of different technologies (e.g. UPnP, OSGi etc) or generally as abstractions of various actions. Service operations are sometimes implemented as software based functions or actions over hardware equipment (e.g. UPnP players). However, a single service satisfies an atomic only …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Attention in Recurrent Neural Networks for Energy Disaggregation",
            "Publication year": 0,
            "Publication url": "https://intelligence.csd.auth.gr/wp-content/uploads/2020/12/attention-for-NILM.pdf",
            "Abstract": "Energy disaggregation refers to the separation of appliance-level data from an aggregate energy signal originated from a single-meter, without the use of any other devicespecific sensors. Due to the fact that deep learning caught great attention in the last decade, numerous techniques using Artificial Neural Networks (ANN) have been developed to accomplish this task. Whereas most of the current research focuses on achieving better performance, the goal of this paper is to design a computationally light deep neural network based on attention mechanism. A thorough analysis shows how the proposed model is implemented and compares the performance of two different attention layers in the problem of energy disaggregation. The novel architecture achieves fast training and inference with minor performance trade-off when compared against other computationally expensive state-of-the-art models.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A visualization environment for planning",
            "Publication year": 2005,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213005002491",
            "Abstract": "This article presents ViTAPlan-2, a visual tool for adaptive  planning that is build on top of HAPRC, a rule-configurable  planning system, which automatically adapts to each problem,  in order to achieve best performance. Apart from HAPRC, ViTAPlan  can be interfaced with any other planning system that supports the  PDDL language. More than just being a user friendly environment  for executing the underlying planner, the tool serves as a  unified planning environment for encoding a new problem problem,  solving it, visualizing the solution and monitoring its execution on a simulation of the problem's word. The tool consists of various  sub-systems, each one accompanied by a graphical interface,  that collaborate with each other and assist the user, whether  he is a knowledge engineer, a domain expert, an academic or even  an end user in industry, to carry out complex planning tasks.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:0EnyYjriUFMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Bi-Directional Heuristic Planning in State-Spaces",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/I-Vlahavas/publication/255600796_BiDirectional_Heuristic_Planning_in_State-Spaces/links/541ac0e70cf2218008bfddfd/BiDirectional-Heuristic-Planning-in-State-Spaces.pdf",
            "Abstract": "One of the most promising trends in Domain Independent AI Planning, nowadays, is state–space heuristic planning. The planners of this category construct general but efficient heuristic functions, which are used as a guide to traverse the state space either in a forward or a backward direction. Although specific problems may favor one or the other direction, there is no clear evidence why any of them should be generally preferred. This paper proposes a hybrid search strategy that combines search in both directions. The search begins from the Initial State in a forward direction and proceeds with a weighted A* search until no further improving states can be found. At that point, the algorithm changes direction and starts regressing the Goals trying to reach the best state found at the previous step. The direction of the search may change several times before a solution can be found. Two domain-independent heuristic functions based on ASP/HSP planners enhanced with a Goal Ordering technique have been implemented. The whole bi-directional planning system, named BP, was tested on a variety of problems adopted from the recent AIPS-00 planning competition with quite promising results.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web service composition plans in owl-s",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29966-7_16",
            "Abstract": "One of the main visions of Semantic Web has been the ability of software agents to compose atomic web services in order to facilitate the automation of complex tasks. One of the approaches used in the past in order to automatically construct composite web services has been AI planning. The most important advantage of this approach is its dynamic character that reduces the interference of the user. Although there have been various attempts to utilize planning algorithms and systems in the composition process, there has been little work in the field of converting web service composition plans in OWL-S. This paper studies the use of two well established standards in expressing plans and composite web services, namely the Planning Domain Definition Language (PDDL) and the Ontology Web Language for Services (OWL-S) and suggests a method for translating the produced PDDL plans of any planning …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An integrated approach to automated semantic web service composition through planning",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5744077/",
            "Abstract": "The paper presents an integrated approach for automated semantic web service composition using AI planning techniques. An important advantage of this approach is that the composition process, as well as the discovery of the atomic services that take part in the composition, are significantly facilitated by the incorporation of semantic information. OWL-S web service descriptions are transformed into a planning problem described in a standardized fashion using PDDL, while semantic information is used for the enhancement of the composition process as well as for approximating the optimal composite service when exact solutions are not found. Solving, visualization, manipulation, and evaluation of the produced composite services are accomplished, while, unlike other systems, independence from specific planners is maintained. Implementation was performed through the development and integration of two …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rule induction for automatic configuration of planning systems",
            "Publication year": 2003,
            "Publication url": "http://lpis.csd.auth.gr/publications/TR-LPIS-142-03.pdf",
            "Abstract": "This paper presents a methodology for building an adaptive planning system, which automatically fine-tunes its planning parameters according to the morphology of the problem in hand, through a combination of Planning, Machine Learning and Knowledge-Based techniques. The adaptation is guided by a rule-based system that sets planner configuration parameters based on measurable characteristics of the problem instance. The knowledge of the rule system has been acquired through a rule induction algorithm. Specifically, the approach of propositional rule learning was applied to a dataset produced by results from experiments on a large number of problems from various domains, including those used in the three International Planning Competitions. The validity of our methodology is assessed through thorough experimental results that demonstrate the boost in performance of the planning system in problems of both known and unknown domains.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:4TOpqqG69KYC",
            "Publisher": "Technical report, Dept. of Informatics, Aristotle University of Thessaloniki"
        },
        {
            "Title": "Imaging time-series for NILM",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20257-6_16",
            "Abstract": "Non Intrusive Load Monitoring is the field that encompasses energy disaggregation and appliance detection. In recent years, Deep Neural Networks have improved the classification performance, using the standard data representation that most datasets provide; that being low-frequency or high-frequency data. In this paper, we explore the NILM problem from the scope of transfer learning. We propose a way of changing the feature space with the use of an image representation of the low-frequency data from UK-Dale and REDD datasets and the pretrained Convolutional Neural Network VGG16. We then train some basic classifiers and use the metric F1 score to test the performance of this representation. Multiple tests are performed to test the adaptability of the models to unseen houses and different datasets. We find that the performance is on par and in some cases outperforms that of popular deep NN …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Hyperparameter Tuning using Quantum Genetic Algorithms",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8995229/",
            "Abstract": "Correctly tuning the hyperparameters of a machine learning model can improve classification results. Typically hyperparameter tuning is made by humans and experience is needed to fine tune them. Algorithmic approaches have been extensively studied in the literature and can find better results. In our work we employ a quantum genetic algorithm to address the hyperparameter optimization problem. The algorithm is based on qudits instead of qubits, allowing more available states. Experiments were performed on two datasets MNIST and CIFAR10 and results were compared against classic genetic algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proceedings of the 9th Hellenic Conference on Artificial Intelligence, SETN 2016, Thessaloniki, Greece, May 18-20, 2016",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=2731853471107832757&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:RGFaLdJalmkC",
            "Publisher": "ACM"
        },
        {
            "Title": "A planning problem validator based on reachability analysis",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2903220.2903237",
            "Abstract": "AI planning is the field that focuses on creating abstract representations of various processes. As such, it is obvious that it is a broad field and demands specialized tools to be used in order to ease the process of designing domains and problems. The literature shows that most of these tools do not offer an option to re-examine and validate the result of the aforementioned designing process.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artificial intelligence for advanced problem solving techniques",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ZnRYBPlrk9kC&oi=fnd&pg=PP1&dq=info:sBfGRFIyWl8J:scholar.google.com&ots=FvbfFSHpNf&sig=7KBPKcP5WCvvXJhNHyol-ooxxpk",
            "Abstract": "One of the most important functions of artificial intelligence, automated problem solving, consists mainly of the development of software systems designed to find solutions to problems. These systems utilize a search space and algorithms in order to reach a solution. Artificial Intelligence for Advanced Problem Solving Techniques offers scholars and practitioners cutting-edge research on algorithms and techniques such as search, domain independent heuristics, scheduling, constraint satisfaction, optimization, configuration, and planning, and highlights the relationship between the search categories and the various ways a specific application can be modeled and solved using advanced problem solving techniques.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Translating Web Services Composition Plans to OWL-S Descriptions.",
            "Publication year": 2011,
            "Publication url": "https://www.scitepress.org/Papers/2011/31874/31874.pdf",
            "Abstract": "Web Services technology has led to simpler and more rapid development of Web Applications with improved functionality by which several platforms through the globe can communicate to exchange data and cooperate for problem solving. Methods for automated web services composition are studied so as to enhance this type of software development. Many studies focus on converting the composition problem to a planning problem and solving it using known planning algorithms. This paper suggests a method for translating the produced PDDL plans of the above algorithms to OWL-S descriptions of the final composite web services. The result is a totally new web service that can later be discovered and invoked or even take part in a new composition.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic web service composition using planning and ontology concept relevance",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5286036/",
            "Abstract": "This paper presents PORSCE II, a system that combines planning and ontology concept relevance for automatically composing semantic web services. The presented approach includes transformation of the web service composition problem into a planning problem, enhancement with semantic awareness and relaxation and solution through external planners. The produced plans are visualized and their accuracy is assessed.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Policies production system for ambient intelligence environments",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_20",
            "Abstract": "This paper presents a tool for designing Policies that govern the operation of an Ambient Intelligence (AmI) environment in order to minimize energy consumption and automate every-day tasks in smart settlements. This tool works on top of a semantic web services middleware and interacts with the middleware’s ontology in order to facilitate the designing, monitoring and execution of user defined rules that control the operation of a network of heterogeneous sensors and actuators. Furthermore, it gives the user the capability to organize these rules in tasks, in order to aggregate and discern relative rules. The main objective of this system is to provide a better monitoring and management of the resources, so as to achieve energy efficiency and reduce power consumption. The work presented in this paper is part of the Smart IHU project, which is developed at International Hellenic University.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Semantically aware web service composition through AI planning",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213014500158",
            "Abstract": "Web service composition is a significant problem as the number of available web services increases; however, manual composition is not an efficient option. Automated web service composition can be performed using AI Planning techniques, utilizing descriptions of available atomic web services, enhanced with semantic awareness and relaxation. This paper discusses a unified, semantically aware approach, handling both semantic (OWL-S & SAWSDL) and non-semantic (WSDL) web service descriptions. In the first case, ontology analysis is adopted to semantically enhance the planning domains and problems, in order to deal with cases where exact syntactic input-to-output matching is not feasible. In the non-semantic descriptions case, semantic information is acquired utilizing alternative sources such as lexical thesauri. Concept similarity measures are applied and utilized to achieve the desired degree of …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:4JMBOYKVnBMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Energy profile representation in vector space",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201050",
            "Abstract": "Word2vec is a computationally efficient way to represent words in vector space. Word embeddings are now considered an integral part of many Natural Language Processing problems. Its applicability has been successfully extended to other sequential problems, mainly in the discrete space. In this paper, the applicability of word2vec in time-series is examined, specifically for energy related problems. A novel framework, called Energy2vec, is presented and future improvements are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lazy adaptive multicriteria planning",
            "Publication year": 2004,
            "Publication url": "http://lpis.csd.auth.gr/publications/tsoumakas-ecai04.pdf",
            "Abstract": "This paper describes a learning system for the automatic configuration of domain independent planning systems, based on measurable features of planning problems. The purpose of the Lazy Adaptive Multicriteria Planning (LAMP) system is to configure a planner in an optimal way, concerning two quality metrics (ie execution speed and plan quality), for a given problem according to user-specified preferences. The training data are produced by running the planner under consideration on a set of problems using all possible parameter configurations and recording the planning time and the plan length. When a new problem arises, LAMP extracts the values for a number of domain-expert specified problem features and uses them to identify the а nearest problems solved in the past. The system then performs a multicriteria combination of the performances of the retrieved problems according to user-specified weights that specify the relative importance of the quality metrics and selects the configuration with the best score. Experimental results show that LAMP improves the performance of the default configuration of two already well-performing planning systems in a variety of planning problems.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Use of multimedia and the world wide web in civil engineering learning",
            "Publication year": 2005,
            "Publication url": "https://ascelibrary.org/doi/abs/10.1061/(ASCE)1052-3928(2005)131:2(129)",
            "Abstract": "The case study method, which has been proven to be a very useful learning tool, can be further enhanced with the use of multimedia and the World Wide Web. This paper demonstrates multimedia and Web-based enhancement with the design and construction of a port, a large-scale civil engineering project. The main purpose was to create an educational tool that brings into the classroom a “real-life” design and construction problem, including the construction field, operation of equipment, and details of construction methods. This enables civil engineering students to better understand the details of the planning, design, and construction of a complicated project. Furthermore, through the use of evaluation tests, feedback on the students’ understanding of the case study can be provided to both the students and the educator. This application can be expanded beyond an academic environment for use as a learning …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:WF5omc3nYNoC",
            "Publisher": "American Society of Civil Engineers"
        },
        {
            "Title": "System architecture for a smart university building",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15825-4_64",
            "Abstract": "This paper presents a system architecture that provides smart building monitoring and management. The proposed solution integrates heterogeneous geographically disparate sensor networks and devices, and enables optimal operations of the building while reducing its energy footprint. The platform is based on Semantic Web Services composition using AI Planning, that integrates and manages WiFi, RFiD and ZigBee networks providing connectivity to the devices. The goal is to develop a model that follows the latest guidelines in the area of Information Communication Technologies (ICT) for sustainable growth, energy efficiency and better quality of life.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The PORSCE II framework: Using AI planning for automated semantic web service composition",
            "Publication year": 2013,
            "Publication url": "https://www.cambridge.org/core/journals/knowledge-engineering-review/article/porsce-ii-framework-using-ai-planning-for-automated-semantic-web-service-composition/5A80CDF3D9710EF6DDF6B5D3796AE784",
            "Abstract": "This paper presents PORSCE II, an integrated system that performs automatic Semantic Web service composition exploiting artificial intelligence (AI) techniques, specifically planning. Essential steps in achieving Web service composition include the translation of the Web service composition problem into a solver-ready planning domain and problem, followed by the acquisition of solutions, and the translation of the solutions back to Web service terms. The solutions to the problem, that is, the descriptions of the desired composite service, are obtained by means of external domain-independent planning systems, they are visualized and finally evaluated. Throughout the entire process, the system exploits semantic information extracted from the semantic descriptions of the available Web services and the corresponding ontologies, in order to perform composition under semantic awareness and relaxation.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:ufrVoPGSRksC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "The Tomaco Hybrid Matching Framework for SAWSDL Semantic Web Services",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=10995878620407084366&hl=en&oi=scholarr",
            "Abstract": "This work aims to advance Web Service retrieval, also known as Matching, in two directions. First, it introduces a matching algorithm for SAWSDL, which adapts and extends known concepts with novel strategies. Effective logic-based and syntactic strategies are introduced and combined in a novel hybrid strategy, targeting an envisioned well-defined, real-world scenario for matching. The algorithm is evaluated in a universal environment for matching algorithms, SME2, in an objective, reproducible manner. Evaluation ranks Tomaco high amongst state of the art, especially for early recall levels (first in macro-averaging precision, up to 0.7 recall). Secondly, this work introduces the Tomaco web application, which aims to promote wide-spread adoption of Semantic Web Services while targeting the lack of user-friendly applications in this field, by integrating a variety of configurable matching algorithms proposed in this …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reinforcement learning and automated planning: A survey",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/reinforcement-learning-automated-planning/5322",
            "Abstract": "This article presents a detailed survey on Artificial Intelligent approaches, that combine Reinforcement Learning and Automated Planning. There is a close relationship between those two areas as they both deal with the process of guiding an agent, situated in a dynamic environment, in order to achieve a set of predefined goals. Therefore, it is straightforward to integrate learning and planning, in a single guiding mechanism and there have been many approaches in this direction during the past years. The approaches are organized and presented according to various characteristics, as the used planning mechanism or the reinforcement learning algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A benchmark framework to evaluate energy disaggregation solutions",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20257-6_2",
            "Abstract": "Energy Disaggregation is the task of decomposing a single meter aggregate energy reading into its appliance level subcomponents. The recent growth of interest in this field has lead to development of many different techniques, among which Artificial Neural Networks have shown remarkable results. In this paper we propose a categorization of experiments that should serve as a benchmark, along with a baseline of results, to efficiently evaluate the most important aspects for this task. Furthermore, using this benchmark we investigate the application of Stacking on five popular ANNs. The models are compared on three metrics and show that Stacking can help improve or ensure performance in certain cases, especially on 2-state devices.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "BOnSAI: a smart building ontology for ambient intelligence",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2254129.2254166",
            "Abstract": "This work introduces an ontology for incorporating Ambient Intelligence in Smart Buildings. The ontology extends and benefits from existing ontologies in the field, but also adds classes needed to sufficiently model every aspect of a service-oriented smart building system. Namely, it includes concepts modeling all functionality (ie services, operations, inputs, outputs, logic, parameters and environmental conditions), QoS (resources, QoS parameters), hardware (smart devices, sensors and actuators, appliances, servers) users and context (user profiles, moods, location, rooms etc.). The ontology is instantiated and put to use at the Smart Building setting of the International Hellenic University, enabling knowledge representation in machine-interpretable form and hence is expected to enhance service-based intelligent applications.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An operator distribution method for parallel planning",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.589.5988&rep=rep1&type=pdf",
            "Abstract": "This paper presents the Operator Distribution Method for Parallel Planning (ODMP), a parallelization method especially suitable for heuristic planners. ODMP distributes the process of finding and applying the ground applicable actions to a given state, to the set of the available processors. The operator schemas of the domain are distributed to the available processors in a dynamic manner. In order to utilize a larger number of processors and to achieve better load balancing, the set of the domain’s operators is initially expanded by considering all the possible instantiations of their first argument. The proposed method, ODMP, is an effective parallelization method for heuristic planners, but it can also be applied to planners that embody other search strategies as well. We implemented ODMP in a best first planner that uses a domain specific heuristic for logistics problems and tested its efficiency on a variety of problems, adopted from the AIPS-98 planning competition.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Iridescent: a Tool for Rapid Semantic Web Service Descriptions",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.248.6389&rep=rep1&type=pdf",
            "Abstract": "Although the Semantic Web and Web Service technologies have already formed a synergy towards Semantic Web Services, their use remains limited. Potential adopters are usually discouraged by the plurality of methodologies and the lack of tools which in turn force them to acquire expert knowledge and commit to exhausting manual labor. This work proposes a novel, functional and user-friendly tool, named Iridescent, intended for both expert and nonexpert users to rapidly create and edit Semantic Web Service descriptions, following the SAWSDL recommendation. The tool‟ s aim is twofold: to enable users manually create descriptions in a visual manner, providing a complete alternative to coding, and to semi-automate the process by matching elements and concepts and suggesting annotations. A state-of-the-art survey has been carried out to reveal critical requirements and compare Iridescent to existing tools. Usage scenarios demonstrate how Iridescent enhances the authoring process and in turn enables Intelligence eg in an Ambient Intelligence environment. Finally, the tool was methodically tested for usability and evaluated by a range of expert and non-expert users.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PASER: a curricula synthesis system based on automated problem solving",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJTCS.2007.014217",
            "Abstract": "This paper presents PASER, a system for automatically synthesising curricula using AI Planning and Machine Learning techniques based on an ontology of educational resources metadata. Given the initial state of the problem (learner's profile, preferences, needs and abilities), the available actions (study an educational resource, take an exam, join an e-learning course, etc.) and the goals (obtain a certificate, learn a subject, acquire a skill, etc.), the planning module of PASER constructs a complete educational curriculum that achieves the goals. The Machine Learning module of PASER matches textually described learning requests, objectives and prerequisites to concepts of the ontology.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "On the Parallelization of Greedy Regression Tables",
            "Publication year": 1999,
            "Publication url": "http://lpis.csd.auth.gr/publications/pgrt.pdf",
            "Abstract": "This paper presents PGRT, a parallel version of a best first planner based on the Greedy Regression Tables approach. The parallelization method of PGRT distributes the task of extracting applicable actions to a given state among the available processors. Although the number of operators limits the scalability of PGRT, it has proven to be quite efficient for low scale parallelization. A modified Operator Reordering method has been used in order to achieve further increase in the efficiency of the parallel algorithm. We illustrate the speedup of PGRT on a variety of hard logistics problems, adopted from the AIPS-98 planning competition.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A system for energy savings in an ambient intelligence environment",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-23447-7_10",
            "Abstract": "This work presents an Ambient Intelligence system that targets energy consumption awareness and savings. The system was deployed at the School of Science and Technology of the International Hellenic University and follows a three-layer approach. The first layer hosts devices (currently smart plugs, sensor boards and smart clampers) suited for the purpose. The second layer, namely the aWESoME middleware (a WEb Service MiddlewarE), resolves interoperability issues on the first layer, by universally exposing all actuator functions and sensor data through Web Services. Finally, a prototype application, named iDEALISM, has been developed to reside on the topmost layer. iDEALISM presents and manages all heterogeneous devices in the same place, enabling users to make comparisons, and take informed decisions on saving energy.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "IRISPortal: a semantic portal for industrial risk cases management",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2254129.2254164",
            "Abstract": "In this paper, we describe the architecture and functionality of IRISPortal, a semantic portal that allows the management of industrial risk cases by exploiting state-of-the-art semantic technologies, such as the OWL 2 language and the OWLIM semantic repository. The portal allows the web-based management of risk cases that are modeled in terms of a risk ontology, assisting the domain experts to perform administrative tasks, such as adding, deleting and updating risk cases. Furthermore, the portal provides the functionality to the end-users for searching and browsing the modeled risk cases and their corresponding characteristics, based on the semantic relationships that derive from the ontology model after the reasoning procedure.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "BOnSAI: a Smart Building Ontology for Ambient Intelligence",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/39905111/BOnSAI_a_smart_building_ontology_for_amb20151111-24984-txo2af.pdf",
            "Abstract": "This work introduces an ontology for incorporating Ambient Intelligence in Smart Buildings. The ontology extends and benefits from existing ontologies in the field, but also adds classes needed to sufficiently model every aspect of a service-oriented smart building system. Namely, it includes concepts modeling all functionality (ie services, operations, inputs, outputs, logic, parameters and environmental conditions), QoS (resources, QoS parameters), hardware (smart devices, sensors and actuators, appliances, servers) users and context (user profiles, moods, location, rooms etc.). The ontology is instantiated and put to use at the Smart Building setting of the International Hellenic University, enabling knowledge representation in machineinterpretable form and hence is expected to enhance service-based intelligent applications.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web services for adaptive planning",
            "Publication year": 2004,
            "Publication url": "http://lpis.csd.auth.gr/publications/tsoumakas-ecai04workshop.pdf",
            "Abstract": "This paper presents the design and development of an adaptive planning system using the technology of Web services. The Web-based adaptive planning system consists of two modules that can work independently. The first one is called HAP-WS and is the Web service interface to the domain independent planner HAP (Highly Adjustable Planner) that can be customized through the adjustment of several parameters, either manually or automatically. In the manual mode, the user itself adjusts planner parameters giving explicitly the values. In the automatic mode, the second subsystem, called LAMP-WS, computes the values of the planning parameters of HAP. LAMP-WS is the Web service interface to the learning system LAMP (Lazy Adaptive Multicriteria Planning) that can automatically configure a planning system using instance-based learning on past performance data of that system. The two subsystems are implemented as independent Web services, which can be used stand-alone and reside in different servers in potentially different geographical locations.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MAPPING AGRICULTURAL AREAS USING AN AUTOMATED UNMANNED AERIAL VEHICLE",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=16800001761555344418&hl=en&oi=scholarr",
            "Abstract": "Mapping procedure consist an essential operation towards fully automated navigation within any operational environment. This paper focuses on the development of a system, as a first approach, for the one-way communication between an unmanned aerial vehicle (UAV) and an unmanned ground vehicle (UGV) for the detection and registration of operational environment entities and the extraction of the geographical coordinates as a basis information for the subsequent automated navigation of the ground vehicle. The case study took place in a commercial orchard installed with walnut trees located in Central Greece. As a mandatory scenario for the tree’s identification, was characterized the hypothesis of distinct, arranged circle like trees’ vegetation within the field. The developed system consist an inaugural process towards fully automated operations in agricultural fields. In addition, it contributes to the two-way …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A smart university platform for building energy monitoring and savings",
            "Publication year": 2016,
            "Publication url": "https://content.iospress.com/articles/journal-of-ambient-intelligence-and-smart-environments/ais375",
            "Abstract": "This paper presents a novel, integrated platform for energy monitoring, management and savings in the context of a Smart University Building. Namely, the proposed Smart International Hellenic University (IHU) platform integrates an intelligent, rule-based agent that enforces savings, while a variety of applications offers user interaction with the system and the means for monitoring and management. The application layer is built over a common Web Service middleware, incorporating semantic interoperability. Monitoring applications visualize raw and aggregated sensor readings, such as building energy disaggregation, environmental measurements and data center efficiency. Extensive monitoring capabilities allow users to take immediate action and devise policies towards energy-savings. Such policies are, then, autonomously enforced by the intelligent, hybrid agent, which is capable of both deliberative (long …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:GnPB-g6toBAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "An Applied Energy Management Approach in Intelligent Environments based on a Hybrid Agent Architecture",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Efstratios-Kontopoulos/publication/281616720_An_Applied_Energy_Management_Approach_in_Intelligent_Environments_based_on_a_Hybrid_Agent_Architecture/links/55eff4fc08aef559dc44f268/An-Applied-Energy-Management-Approach-in-Intelligent-Environments-based-on-a-Hybrid-Agent-Architecture.pdf",
            "Abstract": "This paper presents a framework for ambient sensing and managing a University building aimed at energy savings and user comfort. The system builds upon previous work, using a Semantic Web Service middleware for unifying the various heterogeneous sensor and actuator networks. Two applications are introduced in the framework, the Manager App and the Rule App. The latter incorporates a hybrid intelligent agent that enables both reactive and deliberate manipulation of the environment, based on user-configurable policies expressed in defeasible logic. The Manager App provides users with advanced control and renders the system sustainable. Specifically, it allows bypassing the policies and manually administrating the infrastructure, eg during exceptional or emergency cases. The framework is deployed and evaluated at a University course office, guaranteeing 20% daily energy savings on controlled devices, aggregated to 17% total per room savings.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning Rules for Adaptive Planning.",
            "Publication year": 2003,
            "Publication url": "https://www.aaai.org/Papers/ICAPS/2003/ICAPS03-009.pdf",
            "Abstract": "This paper presents a novel idea, which combines Planning, Machine Learning and Knowledge-Based techniques. It is concerned with the development of an adaptive planning system that can fine-tune its planning parameters based on the values of specific measurable characteristics of the given planning problem. Adaptation is guided by a rule-based system, whose knowledge has been acquired through machine learning techniques. Specifically, the algorithm of classification based on association rules was applied to a large dataset produced by results from experiments on a large number of problems used in the three AIPS Planning competitions. The paper presents experimental results with the adaptive planner, which demonstrate the boost in performance of the planning system.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "aWESoME: A web service middleware for ambient intelligence",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417413000936",
            "Abstract": "This work presents a Web Service Middleware infrastructure for Ambient Intelligence environments, named aWESoME. aWESoME is a vital part of the Smart IHU project, a large-scale Smart University deployment. The purpose of the proposed middleware within the project is twofold: for one, to ensure universal, homogeneous access to the system’s functions and secondly, to fulfill functional and non-functional requirements of the system. Namely, the infrastructure itself should consume significantly low power (as it is meant for energy savings in addition to automations), without compromising reliability and fast response time. The infrastructure should enable fast and direct discovery, invocation and execution of services. Finally, on hardware level, the wireless sensor and actuator network should be optimally configured for speed and reliability as well. The proposed solution employs widely used web open standards …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:qUcmZB5y_30C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A heuristic for planning based on action evaluation",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46148-5_7",
            "Abstract": "This paper proposes a domain independent heuristic for regression planners, which is based on action evaluation. The heuristic obtains estimates for the cost of applying each action of the domain by performing a forward search in a relaxed version of the initial problem. The estimates for the actions are then utilized in a backward search on the original problem. The heuristic, which has been further refined by a fact ordering and several domain-analysis techniques, has been implemented in AcE (Action Evaluation), a regression, heuristic planner. AcE has been thoroughly tested on a variety of planning problems, from the AIPS competitions with quite promising results.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Combining progression and regression in state-space heuristic planning",
            "Publication year": 2014,
            "Publication url": "https://www.aaai.org/ocs/index.php/ECP/ECP01/paper/view/7295",
            "Abstract": "One of the most promising trends in Domain Independent AI Planning, nowadays, is state-space heuristic planning. The planners of this category construct general but efficient heuristic functions, which are used as a guide to traverse the state space either in a forward or a in backward direction. Although specific problems may favor one or the other direction, there is no clear evidence why any of them should be generally preferred. This paper proposes a hybrid search strategy that combines search in both directions. The search begins from the Initial State in a forward direction and proceeds with a weighted A* search until no further improving states can be found. At that point, the algorithm changes direction and starts regressing the Goals trying to reach the best state found at the previous step. The direction of the search may change several times before a solution can be found. Two domain-independent heuristic functions based on ASP/HSP planners enhanced with a Goal Ordering technique have been implemented. The whole bi-directional planning system, named BP, was tested on a variety of problems adopted from the recent AIPS-00 planning competition with quite promising results. The paper also discusses the subject of domain analysis for state-space planning and proposes two methods for the elimination of redundant information from the problem definition and for the identification of independent sub-problems.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applications of Complex Adaptive Systems Yin Shan Ang Yang 159904-962-7 978-1-59904-962-5 $99.95 Jan 2008 IGI Publishing",
            "Publication year": 0,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.641.4363&rep=rep1&type=pdf",
            "Abstract": "InfoSci-Books Scheduled Additions for 2008 Page 1 IGI Global Titles Scheduled for Release to \nInfoSci-Books January 1, 2008 through December 31, 2008 Category Title Editor / Author 1 Editor \n/ Author 2 ISBN (h/c) ISBN 13 (h/c) Retail Price (h/c) Pub Date Imprint Artificial Intelligence \nApplications of Complex Adaptive Systems Yin Shan Ang Yang 159904-962-7 \n978-1-59904-962-5 $99.95 Jan 2008 IGI Publishing Artificial Intelligence Artificial Intelligence for \nAdvanced Problem Solving Techniques Dimitris Vrakas Ioannis Pl. Vlahavas 1-59904-705-5 \n978-1-59904-705-8 $180.00 Jan 2008 Information Science Reference Artificial Intelligence \nEncyclopedia of Decision Making and Decision Support Technologies Frederic Adam Patrick \nHumphreys 1-59904-843-4 978-1-59904-843-7 $565.00 Jan 2008 Information Science Reference \nArtificial Intelligence Intelligent Complex Adaptive Systems Ang Yang Yin Shan 1-59904-…",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "HAP RC: an automatically configurable planning system",
            "Publication year": 2005,
            "Publication url": "https://content.iospress.com/articles/ai-communications/aic335",
            "Abstract": "This paper presents an adaptive planning system, called HAP RC, which automatically fine-tunes its planning parameters according to the morphology of the problem in hand, through a combination of Planning, Machine Learning and Knowledge-Based techniques. The adaptation is guided by a rule-based system that sets planner configuration parameters based on measurable characteristics of the problem instance. The knowledge of the rule system has been acquired through a rule induction algorithm. Specifically, the approach of propositional rule learning was applied to a dataset produced by results from experiments on a large number of problems from various domains, including those used in the three International Planning Competitions. The improvement of the adaptive system over the original planner is assessed through thorough experiments in problems of both known and unknown domains.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Iridescent: A tool for rapid semantic annotation of web service descriptions",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2479787.2479797",
            "Abstract": "Although the Semantic Web and Web Service technologies have already formed a synergy towards Semantic Web Services, their use remains limited. Potential adopters are usually discouraged by the number of different methodologies and the lack of tools, which both force them to acquire expert knowledge and commit to exhausting manual labor. This work proposes a novel functional and user-friendly graphical tool, named Iridescent, intended for both expert and non-expert users, to create and edit Semantic Web Service descriptions, following the SAWSDL recommendation. The tool's aim is twofold: to enable users manually create descriptions in a visual manner, providing a complete alternative to coding, and to semi-automate the process by matching elements and concepts and suggesting annotations. A state-of-the-art survey has been carried out to reveal critical points and requirements. The tool's …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Attention in Recurrent Neural Networks for Energy Disaggregation",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-61527-7_36",
            "Abstract": "Energy disaggregation refers to the separation of appliance-level data from an aggregate energy signal originated from a single-meter, without the use of any other device-specific sensors. Due to the fact that deep learning caught great attention in the last decade, numerous techniques using Artificial Neural Networks (ANN) have been developed to accomplish this task. Whereas most of the current research focuses on achieving better performance, the goal of this paper is to design a computationally light deep neural network based on attention mechanism. A thorough analysis shows how the proposed model is implemented and compares the performance of two different attention layers in the problem of energy disaggregation. The novel architecture achieves fast training and inference with minor performance trade-off when compared against other computationally expensive state-of-the-art models.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards automatic synthesis of educational resources through automated planning",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_42",
            "Abstract": "This paper reports on the results of an ongoing project for the development of a platform for e-Learning, which automatically constructs curricula based on available educational resources and the learners needs and abilities. The system under development, called PASER (Planner for the Automatic Synthesis of Educational Resources), uses an automated planner, which given the initial state of the problem (learner’s profile, preferences, needs and abilities), the available actions (study an educational resource, take an exam, join an e-learning course, etc.) and the goals (obtain a certificate, learn a subject, acquire a skill, etc.) constructs a complete educational curriculum that achieves the goals. PASER is compliant with the evolving educational metadata standards that describe learning resources (LOM), content packaging (CP), educational objectives (RDCEO) and learner related information (LIP).",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An ontology-based planning system for e-course generation",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417407002588",
            "Abstract": "Researchers in the area of educational software have always shown great interest in the automatic synthesis of learning curricula. During the recent years, with the extensive use of metadata and the emergence of the Semantic Web, this vision is gradually turning into a reality. A number of systems for curricula synthesis have been proposed. These systems are based on strong relations defined in the metadata of learning objects, which allow them to be combined with other learning objects, in order to form a complete educational program. This article presents PASER, a system for automatically synthesizing curricula using AI Planning and Semantic Web technologies. The use of classical planning techniques allows the system to dynamically construct learning paths even from disjoint learning objects, meeting the learner’s profile, preferences, needs and abilities.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Entropy Based Feature Pooling in Speech Command Classification",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-80129-8_71",
            "Abstract": "In this research a novel deep learning architecture is proposed for the problem of speech commands recognition. The problem is examined in the context of internet-of-things where most devices have limited resources in terms of computation and memory. The uniqueness of the architecture is that it uses a new feature pooling mechanism, named entropy pooling. In contrast to other pooling operations, which use arbitrary criteria for feature selection, it is based on the principle of maximum entropy. The designated deep neural network shows comparable performance with other state-of-the-art models, while it has less than half the size of them.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "SAED: Self-Attentive Energy Disaggregation",
            "Publication year": 0,
            "Publication url": "https://intelligence.csd.auth.gr/wp-content/uploads/2021/10/SAED__Self_Attentive_Energy_Disaggregation.pdf",
            "Abstract": "The field of energy disaggregation deals with the approximation of appliance electric consumption using only the aggregate consumption measurement of a mains meter. Recent research developments have used deep neural networks and outperformed previous methods based on Hidden Markov Models. On the other hand deep learning models are computationally heavy and require huge amounts of data. The main objective of the current paper is to incorporate the attention mechanism into neural networks in order to reduce their computational complexity. For the attention mechanism two different versions are utilized, named Additive and Dot Attention. The experiments show that they perform on par, while the Dot mechanism is slightly faster. The two versions of self-attentive neural networks are compared against two state-of-the-art energy disaggregation deep learning models. The experimental results show that the proposed architecture achieves faster or equal training and inference time and with minor performance drop depending on the device or the dataset.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visual Representation of web service composition problems through VLEPpO",
            "Publication year": 2007,
            "Publication url": "http://ftp.informatik.rwth-aachen.de/Publications/CEUR-WS/Vol-302/paper6.pdf",
            "Abstract": "This paper discusses the problem of the automatic composition of Semantic Web Services. Web Services constitute a new computing paradigm, which provides a standardized framework that facilitates the interoperability among software systems and machines that are accessible through the Internet. Semantics can significantly improve software reuse and discovery and allow the automatic composition of Web Services in order to produce large scale applications. The use of VLEPpO for the automatic composition of Web Services is proposed. VLEPpO is a visual programming tool for designing planning problems using visual elements and simple mouse operations. In the tool the user simply defines the properties of the available Web Services and the global goals of the application. Then VLEPpO automatically forms the description as a planning problem, solves it by calling an appropriate planning system and exports the solution either to a Web Service execution monitoring system or to a UDDI registry.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The tomaco hybrid matching framework for SAWSDL semantic web services",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7104178/",
            "Abstract": "This work aims to advance Web Service retrieval, also known as Matching, in two directions. First, it introduces a matching algorithm for SAWSDL, which adapts and extends known concepts with novel strategies. Effective logic-based and syntactic strategies are introduced and combined in a novel hybrid strategy, targeting an envisioned well-defined, real-world scenario for matching. The algorithm is evaluated in a universal environment for matching algorithms, SME2, in an objective, reproducible manner. Evaluation ranks Tomaco high amongst state of the art, especially for early recall levels (first in macro-averaging precision, up to 0.7 recall). Secondly, this work introduces the Tomaco web application, which aims to promote wide-spread adoption of Semantic Web Services while targeting the lack of user-friendly applications in this field, by integrating a variety of configurable matching algorithms proposed in this …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Theoretical Analysis of Pooling Operation Using Information Theory",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8995270/",
            "Abstract": "Several modern deep learning architectures incorporate the operation of pooling in order to achieve sufficient, minimal and invariant representations. Nevertheless, its importance has only been verified empirically, without solid theoretical evidence. This paper presents a comprehensive theoretical analysis, investigates the mechanism of pooling from the information theory point of view and proposes a novel pooling operation based on entropy. In comparison with other versions of pooling, it automatically adapts to the features and creates more compact representations. The theoretical outcomes are validated utilizing both shallow and deep architectures.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PORSCE II: Using planning for semantic web service composition",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.595.7740&rep=rep1&type=pdf",
            "Abstract": "This paper presents PORSCE II, an integrated system that performs automatic semantic web service composition through planning. In order to achieve that, an essential step is the translation of the web service composition problem into a planning problem. The planning problem is then solved using external domain-independent planning systems, and the solutions are visualized and evaluated. The system exploits semantic information to enhance the translation and planning processes.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Graphical Interface for Adaptive Planning",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.9.4274&rep=rep1&type=pdf",
            "Abstract": "This paper describes a friendly graphical interface for HAP, a rule-configurable planning system, which automatically adapts to each problem, in order to achieve best performance. HAP analyzes the problem and uses a rule system in order to make the most appropriate choices for planning. The graphical interface enables the user to use and even interfere in the process of fine tuning the planning system. Furthermore, the interface allows the user to manually configure and experiment with the system and also to define its own domains and problems through an easy-to-use visual tool.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PATH PLANNING FOR AGRICULTURAL VEHICLES BASED ON GENERATED PERCEPTION MAPS",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=8745625588822390114&hl=en&oi=scholarr",
            "Abstract": "Agricultural field operations, such as spraying, harvesting and seeding, can potentially be automated and executed either by conventional machinery equipped with automation systems, or by autonomous machines. An automated operation must be planned and organized in a manner that, on one hand reduces risk and failure potential and, on the other hand, optimizes productivity and efficiency. However, the diversity of the natural out-door environment and the huge amount of diversified in type data required to picture the operational environment, comprise the hardest challenges for the deployment of fully automated agricultural operations.In the context of this paper an algorithmic approach was developed aiming at solving one of the various problems encountered in the autonomous agricultural operations. Specifically, the problem addressed is the navigation in the semi-structured environment of orchards. The …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Development of a New Framework for Managing Risks in the European Industry: The IRIS RISK PARADIGM",
            "Publication year": 2013,
            "Publication url": "http://www.vce.at/iris/pdf/irisbook/iris_chapter02.pdf",
            "Abstract": "Risk management approaches adopted in the European industries are fragmented, thus representing a roadblock in the establishment of an Integrated European Industrial Risk Reduction System that would allow for: a) greater synergies between the industries, b) reduction of the production-cost of the European industrial product, and c) advanced safety conditions and standards for production, maintenance and use of the industrial product.The IRIS Risk Paradigm was conceived as an idea aiming to respond to the demand of a holistic approach for managing risks in the European industry, in order to overcome the above mentioned fragmentation and its consequent constraints. By the term “holistic”, a comprehensive theoretical and application tool is defined that would assist risk managers in their job at all steps of the risk management process. Given that such an approach is innovative and first-of-a-kind, it comprises a paradigm, ie a typical example or pattern to follow that describes distinct concepts.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent techniques for planning",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-MdQtA2GfT0C&oi=fnd&pg=PR1&dq=info:M2Gw6c72YXwJ:scholar.google.com&ots=v8U1ChVprf&sig=ogFjXLUz_8U_kcQ_zWwbtbGmkxs",
            "Abstract": "The Intelligent Techniques for Planning presents a number of modern approaches to the area of automated planning. These approaches combine methods from classical planning such as the construction of graphs and the use of domain-independent heuristics with techniques from other areas of artificial intelligence. This book discuses, in detail, a number of state-of-the-art planning systems that utilize constraint satisfaction techniques in order to deal with time and resources, machine learning in order to utilize experience drawn from past runs, methods from knowledge systems for more expressive representation of knowledge and ideas from other areas such as Intelligent Agents. Apart from the thorough analysis and implementation details, each chapter of the book also provides extensive background information about its subject and presents and comments on similar approaches done in the past.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Non-intrusive human activity recognition and abnormal behavior detection on elderly people: A review",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10462-019-09724-5.pdf",
            "Abstract": "With the world population aging at a fast rate, ambient assisted living systems focused on elderly people gather more attention. Human activity recognition (HAR) is a component connected to those systems, as it allows identification of the actions performed and their utilization on behavioral analysis. This paper aims to provide a review on recent studies focusing on HAR and abnormal behavior detection specifically for seniors. The frameworks proposed in the literature are presented. The results are also discussed and summarized, along with the datasets and metrics used. The absence of a universal evaluation framework makes direct comparison not feasible, thus an analysis is made trying to divide the literature using a taxonomy. Solutions on the challenges identified are proposed, while discussing future work.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Signal2vec: time series embedding representation",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20257-6_7",
            "Abstract": "The rise of Internet-of-Things (IoT) and the exponential increase of devices using sensors, has lead to an increasing interest in data mining of time series. In this context, several representation methods have been proposed. Signal2vec is a novel framework, which can represent any time-series in a vector space. It is unsupervised, computationally efficient, scalable and generic. The framework is evaluated via a theoretical analysis and real world applications, with a focus on energy data. The experimental results are compared against a baseline using raw data and two other popular representations, SAX and PAA. Signal2vec is superior not only in terms of performance, but also in efficiency, due to dimensionality reduction.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "ViTAPlan: A Visual Tool for Adaptive Planning",
            "Publication year": 2003,
            "Publication url": "http://delab.csd.auth.gr/~bci1/Panhellenic/167vrakas.pdf",
            "Abstract": "This paper presents a friendly visual tool for HAP, a ruleconfigurable planning system, which automatically adapts to each problem, in order to achieve best performance. HAP analyzes the problem and uses a rule system in order to configure the planning parameters in a way that best suites the morphology of the problem. The visual tool enables the user to use the planning system, get advice from the built-in rule system and even interfere with it. ViTAPlan also contains a visual designer, based on the Planning Domain Definition Language, that enables the user to create new planning domains and problems in a graphical way and get visual representations of existing ones. Furthermore the tool contains a module that simulates the execution of the plan and illustrates the changes in the world, which follow the application of each action in the plan.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sliding window approach for online energy disaggregation using artificial neural networks",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201011",
            "Abstract": "Energy disaggregation is the process of extracting the power consumptions of multiple appliances from the total consumption signal of a building. Artificial Neural Networks (ANN) have been very popular for this task in the last decade. In this paper we propose two recurrent network architectures that use sliding window for real-time energy disaggregation. We compare this approach to existing techniques using six metrics and find that it scores better for multi-state devices. Finally, we compare ANNs that use Gated Recurrent Unit neurons against those using Long Short-Term Memory neurons and find that they perform equally.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lambros Skarlas",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410250/",
            "Abstract": "Additional Reviewers Page 1 xviii Additional Reviewers Poulia Adamopoulou Christos Alexakos \nMona Alkhattabi May Yacoub Al-Nashashibi Isabelle Alvarez Gianluca Amato Andreas Andreou \nPanagiotis Antonellis Dimitrios Antoniou Michael Armella Sebastian Bader Simone Bassis \nGiampaolo Bella Christos Berberidis Daniel Le Berre Gilles Bisson Sebastian Blohm Cezary \nBoldak Alessio Bottrighi Maroua Bouzid Sebastian Brandt Wolfram Burgard Stéphane Cardon \nShermann Chan Chee-Fon Chang Kasturi Chatterjee Hung-Yun Cheng Steve Cheng Assef \nChmeiss Guillaume Cleuziou Costas Cotropoulos Marian Viorel Craciun Jing Dai Dimitrios \nDakopoulos Stavros Dimitriadis Carmel Domshlak Charalampos Doukas George-Peter \nEconomou Christina Evangelou Matthieu Exbrayat Jean-Luc Falcone Carlos Ferreira Giorgos \nFlouris Dimitrios Fotakis Vassilis Fotopoulos Paulina Fragou Matteo Gagliolo Kehan --Li …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent techniques for planning",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=16273896308046935694&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic awareness in automated web service composition through planning",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_16",
            "Abstract": "PORSCE II is a framework that performs automatic web service composition by transforming the composition problem into AI planning terms and utilizing external planners to obtain solutions. A distinctive feature of the system is that throughout the entire process, it achieves semantic awareness by exploiting semantic information extracted from the OWL-S descriptions of the available atomic web services and the corresponding ontologies. This information is then used in order to enhance the planning domain and problem. Semantic awareness facilitates approximations when searching for suitable atomic services, as well as modification of the produced composite service. The alternatives for modification include the replacement of a certain atomic service that takes part in the composite service by an equivalent or a semantically relevant service, the replacement of an atomic service through planning, or the …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Using the k-nearest problems for adaptive multicriteria planning",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_15",
            "Abstract": "This paper concerns the design and development of an adaptive planner that is able to adjust its parameters to the characteristics of a given problem and to the priorities set by the user concerning plan length and planning time. This is accomplished through the implementation of the k nearest neighbor machine learning algorithm on top of a highly adjustable planner, called HAP. Learning data are produced by running HAP offline on several problems from multiple domains using all value combinations of its parameters. When the adaptive planner HAP is faced with a new problem, it locates the k nearest problems, using a set of measurable problem characteristics, retrieves the performance data for all parameter configurations on these problems and performs a multicriteria combination, with user-specified weights for plan length and planning time. Based on this combination, the configuration with the best …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "AI in Greece: The Case of Research on Linked Geospa al Data",
            "Publication year": 2018,
            "Publication url": "https://ojs.aaai.org/index.php/aimagazine/article/view/2801",
            "Abstract": "Artificial Intelligence has been an active research field in Greece for over forty years, and there are more than thirty AI groups throughout the country covering almost all subareas of AI. One milestone for AI research in Greece was in 1988, when the Hellenic Artificial Intelligence Society (EETN) was founded as a non-profit, scientific organization on devoted to organizing and promo ng AI research in Greece and abroad. This article explores current lines of AI research in Greece and gives some history of Greek AI research since 1968.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "LadyBug. An Intensity based Localization Bug Algorithm",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9212115/",
            "Abstract": "Localization and navigation is a crucial task of autonomous robots. This paper introduces LadyBug a novel bug algorithm. Using the Received Signal Strength Indication (RSSI) of an electromagnetic signal, the algorithm is able to accurately calculate the position of the beacon emitting the aforementioned signal. Various experiments were performed with a simulated robot equipped only with local sensors. The proposed algorithm was compared with similar approaches with very promising results.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PORSCE II: Using planning for semantic web service composition",
            "Publication year": 0,
            "Publication url": "https://www.academia.edu/download/42558797/ICKEPS2009_hatzi_p38-45.pdf",
            "Abstract": "This paper presents PORSCE II, an integrated system that performs automatic semantic web service composition through planning. In order to achieve that, an essential step is the translation of the web service composition problem into a planning problem. The planning problem is then solved using external domain-independent planning systems, and the solutions are visualized and evaluated. The system exploits semantic information to enhance the translation and planning processes.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A visual programming system for automated problem solving",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417409010938",
            "Abstract": "Although new AI planning algorithms and techniques are being developed and improved rapidly, there is a lack of efficient and easy to use systems able to incorporate and utilize them. Furthermore, while visual representation facilitates design, maintenance and comprehension of planning domains and problems, very few systems incorporate it. This paper presents VLEPPO, an integrated system aiming at visually modeling planning domains and problems through a convenient graphical interface, while maintaining compatibility with the Planning Domain Definition Language (PDDL), with import and export features. Solutions to planning problems can be obtained by invoking different planners employing the web services technology. The demonstration of the system is performed through a case study involving web service composition viewed as a planning problem.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Machine learning approaches for non-intrusive load monitoring: from qualitative to quantitative comparation",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10462-018-9613-7",
            "Abstract": "Non-intrusive load monitoring (NILM) is the prevailing method used to monitor the energy profile of a domestic building and disaggregate the total power consumption into consumption signals by appliance. Whilst the most popular disaggregation algorithms are based on Hidden Markov Model solutions based on deep neural networks have attracted interest from researchers. The objective of this paper is to provide a comprehensive overview of the NILM method and present a comparative review of modern approaches. In this effort, many obstacles are identified. The plethora of metrics, the variety of datasets and the diversity of methodologies make an objective comparison almost impossible. An extensive analysis is made in order to scrutinize these problems. Possible solutions and improvements are suggested, while future research directions are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Hybrid ace: Combining search directions for heuristic planning",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1467-8640.2005.00275.x",
            "Abstract": "One of the most promising trends in Domain‐Independent AI Planning, nowadays, is state‐space heuristic planning. The planners of this category construct general but efficient heuristic functions, which are used as a guide to traverse the state space either in a forward or in a backward direction. Although specific problems may favor one or the other direction, there is no clear evidence why any of them should be generally preferred. This paper presents Hybrid‐AcE, a domain‐independent planning system that combines search in both directions utilizing a complex criterion that monitors the progress of the search, to switch between them. Hybrid AcE embodies two powerful domain‐independent heuristic functions extending one of the AcE planning systems. Moreover, the system is equipped with a fact‐ordering technique and two methods for problem simplification that limit the search space and guide the algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:_kc_bZDykSQC",
            "Publisher": "Blackwell Publishing, Inc."
        },
        {
            "Title": "Evaluating state-of-the-art classifiers for human activity recognition using smartphones",
            "Publication year": 2019,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp.2019.0098",
            "Abstract": "Human activity recognition using smartphones and wearables is a field gathering a lot of attention. Although a plethora of systems have been proposed in the literature, comparing their results is not an easy task. As a universal evaluation framework is absent, direct comparison is not feasible. This paper compares state-of-the-art classifiers already used on mobile human activity recognition, under the same conditions. In addition, an Android application was developed and the method yielding the best results was evaluated in real world in a semi-supervised environment. Results shown that deep learning techniques have better performance and could be transferred to a phone without many modifications.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A framework for access control with inference constraints",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6032355/",
            "Abstract": "In this paper we present an approach for investigating the feasibility of reducing inference control to access control, as the latter is a more desirable means of preventing unauthorized access to sensitive data. Access control is preferable over inference control in terms of efficiency, but it fails to offer confidentiality in the presence of inference channels. We argue that during the design phase of a data schema and the definition of user roles, inference channels should be considered. An approach is introduced that can be integrated into a risk assessment exercise to assist in determining the roles and/or attributes that lower the risks associated with information disclosure from inference. The residual risk from the remaining inference channels could be treated by well known inference control mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special Issue on Advances of AI Theories and Applications (SETN 2016) Guest Editors: Antonis Bikakis, Nick Bassiliades and Dimitris Vrakas Preface",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=14200762569714775787&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:35N4QoGY0k4C",
            "Publisher": "WORLD SCIENTIFIC PUBL CO PTE LTD"
        },
        {
            "Title": "Machine learning for adaptive planning",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/intelligent-techniques-planning/24460",
            "Abstract": "This chapter is concerned with the enhancement of planning systems using techniques from Machine Learning in order to automatically configure their planning parameters according to the morphology of the problem in hand. It presents two different adaptive systems that set the planning parameters of a highly adjustable planner based on measurable characteristics of the problem instance. The planners have acquired their knowledge from a large data set produced by results from experiments on many problems from various domains. The first planner is a rule-based system that employs propositional rule learning to induce knowledge that suggests effective configuration of planning parameters based on the problem’s characteristics. The second planner employs instance-based learning in order to find problems with similar structure and adopt the planner configuration that has proved in the past to be effective …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:4DMP91E08xMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A visual programming tool for designing planning problems for semantic web service composition",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/visual-languages-interactive-computing/31045",
            "Abstract": "This chapter is concerned with the issue of knowledge representation for AI Planning problems, especially those related to Semantic Web Service composition. It discusses current approaches in encoding planning problems using the PDDL formal language and it presents ViTAPlan, a user-friendly visual tool for planning. More than just being a user friendly environment for executing the underlying planner, the tool serves as a unified planning environment for encoding a new problem, solving it, visualizing the solution and monitoring its execution on a simulation of the problem’s world. The tool consists of various sub-systems, each one accompanied by a graphical interface, which collaborate with each other and assist the user, either a knowledge engineer, a domain expert, an academic or even an end-user in industry, to carry out complex planning tasks, such as composing complex Semantic Web Services from …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards adaptive heuristic planning through machine learning",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/42207533/hap.pdf",
            "Abstract": "In domain independent heuristic planning there is a number of planning systems with very good performance on some problems and very poor on others. Few attempts have been made in the past to explain this phenomenon. In this paper we use machine learning techniques to discover knowledge hidden in the dynamics of the planning process that would relate specific characteristics of a planning problem with specific properties of a planning system that lead to good or bad performance. By this, we aim at shedding light to some of the dark areas of heuristic planning and develop an adaptive planner that would be able to optimize its configuration according to the problem at hand.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel planning via the distribution of operators",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09528130110063074",
            "Abstract": "This paper describes Operator Distribution Method for parallel Planning (ODMP), a parallelization method for efficient heuristic planning. The method innovates in that it parallelizes the application of the available operators to the current state and the evaluation of the successor states using the heuristic function. In order to achieve better load balancing and a lift in the scalability of the algorithm, the operator set is initially enlarged, by grounding the first argument of each operator. Additional load balancing is achieved through the reordering of the operator set, based on the expected amount of imposed work. ODMP is effective for heuristic planners, but it can be applied to planners that embody other search strategies as well. It has been applied to GRT, a domain-independent heuristic planner, and CL, a heuristic planner for simple logistics problems, and has been thoroughly tested on a set of logistics problems …",
            "Abstract entirety": 0,
            "Author pub id": "RCSbvNsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "The Smart IHU Project Architecture for Energy and Ambient Intelligence Applications",
            "Publication year": 0,
            "Publication url": "https://intelligence.csd.auth.gr/wp-content/uploads/2019/03/thanosSmart1TR.pdf",
            "Abstract": "This paper presents a complete architecture for a Smart University Building. The real-world deployment is based on a wide range of wireless sensor and actuator networks, integrated by a middleware based on the Service-Oriented Architecture of Web Services. The middleware provides the necessary basis for various energy monitoring, management and savings applications as well as Intelligent Agents in the context of Ambient Intelligence.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On time series representations for multi-label NILM",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-020-04916-5",
            "Abstract": "Given only the main power consumption of a household, a non-intrusive load monitoring (NILM) system identifies which appliances are operating. With the rise of Internet of things, running energy disaggregation models on the edge is more and more essential for privacy concerns and economic reasons. However, current NILM solutions use data-hungry deep learning models that can recognize only one device and are impossible to run on a device with limited resources. This research investigates in-depth multi-label NILM systems and suggests a novel framework which enables a cost-effective solution. It can be deployed on an embedded device, and thus, privacy can be preserved. The proposed system leverages dimensionality reduction using Signal2Vec, is evaluated on two popular public datasets and outperforms another state-of-the-art multi-label NILM system.",
            "Abstract entirety": 1,
            "Author pub id": "RCSbvNsAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer London"
        }
    ]
}]