[{
    "name": "Θρασύβουλος Κωνσταντίνος Τσιάτσος",
    "romanize name": "Thrasyvoulos Konstantinos Tsiatsos",
    "School-Department": "Πληροφορικής",
    "University": "ΑΠΘ",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 10379,
    "Scholar name": "Thrasyvoulos Tsiatsos",
    "Scholar id": "KlqgXzwAAAAJl",
    "Affiliation": "Aristotle University of Thessaloniki",
    "Citedby": 1959,
    "Interests": [
        "ICT in education",
        "Game Based Learning",
        "Virtual Learning Environments",
        "Mobile Learning",
        "Learning Technologies"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=KlqgXzwAAAAJl&hl=en",
    "Publications": [
        {
            "Title": "Greek Traditional Dances Capturing and a Kinematic Analysis Approach of the Greek Traditional Dance “Syrtos”(Terpsichore Project)",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_49",
            "Abstract": "Intangible Cultural Heritage (ICH) content means “the practices, representations, expressions, knowledge, skills – as well as the instruments, objects, artifacts and cultural spaces associated therewith”. Although ICH content, especially traditional folklore performing arts, is commonly considered worthy of preservation by UNESCO and the EU Treaty, most of the current research efforts are on the focus is on tangible cultural assets. The aim of Terpsichore project is to, analyze, design, research, train, implement and validate an innovative framework for affordable digitization, modelling, archiving, e-preservation and presentation of ICH content related to folk dances, in a wide range of users. The Aristotle University of Thessaloniki was involved in the performance of Greek traditional dances and the three-dimensional capturing and editing. The three-dimensional recordings were held at the Laboratory of “Motor …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:vbGhcppDl1QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluation Plan and Preliminary Evaluation of a Network of Remote Labs in the Maghrebian Countries.",
            "Publication year": 2014,
            "Publication url": "http://users.auth.gr/tsiatsos/CD-Papers/4_Journals/J30-to_appear.pdf",
            "Abstract": "The need for adopting virtual and remote labs in engineering education is high in Algeria, Morocco and Tunisia. This paper proposes the evaluation plan of a network of remote labs in the Maghrebian countries. This plan is based on the significant research that has been done until now concerning the evaluation of remote labs. More specifically the proposed evaluation strategy of the project will focus on five different but interrelated directions (a) usability of remote labs;(b) learners’ attitude towards remote labs;(c) technical evaluation of remote labs operation;(d) evaluation of the e-learning content namely the teaching units previously described; and (e) learning outcome. Furthermore, this paper presents preliminary evaluation results based on this evaluation plan and resulted from a pilot case study.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ανοικτή Εκπαίδευση: το περιοδικό για την Ανοικτή και εξ Αποστάσεως Εκπαίδευση και την Εκπαιδευτική Τεχνολογία",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Thrasyvoulos-Tsiatsos/publication/304065744_Teleconference_in_support_of_distance_learning_Views_of_educators/links/580e822608ae7525273d287c/Teleconference-in-support-of-distance-learning-Views-of-educators.pdf",
            "Abstract": "In this study we recorded the views of the educators that use teleconference as an educational medium to support distance learning. The data were collected using the semi-structured interview and the results showed that teleconferencing could be a strong complementary tool to support flexible learning as well as distance education, by enhancing the interaction among learners. All the interviewees consider teleconference as a\" helpful assistant\" in the educational process and suggested that the educators should be well prepared before the tele-lecture, as well as prepare and guide the learners in order to conduct a smooth teleconferencing session. From the interviews, several advantages and disadvantages of the teleconference’s use as an educational tool emerged. The main advantages consist of the independence of space and time while conducting learning sessions, the easy access to and sharing of educational content, the interaction between educator and learners as well as among the learners and the reduced transportations along with time saving. On the other hand, some important disadvantages refer to the participants being unfamiliar with technology, lack of technological support, limited network resources causing disconnections and adding stress to participants, the uncertainty of the participants regarding the effectiveness of teleconference in education and the lack of face-to-face communication.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting virtual internationalization of education by implementing and playing serious games",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6402169/",
            "Abstract": "This paper describes the international electronic collaboration between professors of two universities and their students in order to organize and implement a serious game activity. The paper also presents the concept of the serious game, the game play scenario as well as the assessment of the whole activity from the pedagogical and technological viewpoint.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementing a PLE: A VLE-based approach",
            "Publication year": 2008,
            "Publication url": "http://users.auth.gr/users/4/7/043774/public_html/CD-Papers/5_Papers/C41.pdf",
            "Abstract": "Virtual Learning Environments have been adopted by hundreds of educational institutions worldwide. However, the emergence of Web 2.0 and the ideas of lifelong learning and informal learning have created new educational needs and led to the emergence of Personal Learning Environments. In this paper a PLE implementation is presented based on the Moodle open-source learning management system. This implementation was evaluated by a number of postgraduate students of our institution and the results of this evaluation are included in the paper.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anxiety awareness in education: a prototype biofeedback device",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-6501-0_18",
            "Abstract": "Students’ anxiety recognition may provide significant support for self-regulation and teaching and coaching quality. From physiology it is known that high anxiety usually results in increasing skin conductivity to electrical current. Furthermore, people under stressful conditions usually show increased heart-rate values. The purpose of this chapter is to present a prototype device that measures the anxiety level of a person by collecting bio-signals. The device has been evaluated by persons engaged in learning activities in order to investigate whether and how it could augment the educational process. This work concludes that student’s anxiety recognition and regulation seems to be an important factor in implementing personalized learning activities.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Christopher Lee Quintana Ann Rivet Nicolai Scheele Daniel Schneider",
            "Publication year": 0,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/wmte/2004/1989xii/12OmNrJRPnb",
            "Abstract": "Reviewers IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer \nSociety Digital Library Jobs Tech News Resource Center Press Room Advertising About Us \nIEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions \nMagazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer \nSociety More Jobs Tech News Resource Center Press Room Advertising About Us Cart All \nAdvanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.wmte 2004 \nReviewers 2004, pp. xii, DOI Bookmark: 10.1109/WMTE.Keywords Authors xii,Reviewers ,Louis \nAbrahamson ,Terry Anderson ,Larry Berger ,Edo Biagioni ,Bill Bobrowsky ,Jacqueline Bourdeau \n,Fei-Ching Chen ,Weiqin Chen ,Cyrille Desmoulins ,Wolfgang Effelsberg ,Valerio Eletti ,Chris \nEliot ,Umer Farooq ,Eri Giannaka ,Sylvain Giroux ,Tiong Goh ,Joshua Gottdenker ,Hada ,…",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting collaborative learning processes in CVEs by augmenting student avatars, with nonverbal communication features",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5572557/",
            "Abstract": "This paper proposes virtual metaphors, appearance features, gestures and animations that can be used for avatars in Computer Supported Collaborative Learning three dimensional Environments. Our aim is to enrich avatars' support to nonverbal communication, as well as to enhance and improve students' collaborative interaction. Within this context, by implementing virtual avatars representations and “non real” world existing tools in Second Life, we conducted a case study at the level of tertiary education.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Utilizing multiplayer video game design principles to enhance the educational experience in 3D virtual computer supported collaborative learning environments",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6268193/",
            "Abstract": "The goal of this paper is to determine how the effective design principles of popular video game franchises can be adopted and adapted in order to enhance the students' educational experience in 3D virtual Computer Supported Collaborative Learning (CSCL) environments. This paper also analyzes how combining the fundamental characteristics of video games and gamer personalities may allow instructional developers and teachers to explore exciting new opportunities for collaborative learning on the Web and within 3D CSCL environments.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and Expert Evaluation of a Serious Game for Halting Harassment and Abuse in Sports",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-67209-6_60",
            "Abstract": "It is a fact that there is a necessity of raising awareness and implementing prevention initiatives to fight gender-based violence in and through sport. The main purpose of this paper is to describe the process of the HALT serious game creation, which is a game implemented for supporting mainly young athletes to be aware towards harassment and abuse in sport. In the HALT serious game, which can be identified as 2D, telltale game, the main game element is that the player must make decisions and rate how appropriate he/she finds certain incidents that happens in four different mini stories that depict harassment and abuse in sports. Finally, an expert evaluation was made to the game. The objective of the expert evaluation was to assess validity evidence of the serious game as a tool to provide knowledge and raise awareness of users on matters of harassment and abuse in sports and test the game’s …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Massive open online course for basketball injury prevention strategies (BIPS)",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_60",
            "Abstract": "Basketball is one of the most popular sports in Europe and is enjoyed by players of all ages and skill levels. Basketball is a fast game with frequent and aggressive body contacts, so injuries can and do occur. C4BIPS (                   http://c4bips.csd.auth.gr/                                    ) is an Erasmus Plus Sport Small Collaborative Partnership project that focuses on the area of “protecting athletes, especially the youngest, from health and safety hazards by improving training and competition conditions”. The main goal of C4BIPS project is to create a Massive Open Online Course for Basketball Injury Prevention Strategies (BIPS).The aim of this study is to present the project, highlight the importance of BIPS, describe its preliminary results on BIPS understanding by professional athletes, conduct a state of the art about e-learning platforms and summarize C4BIPS future work.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Fostering collaborative learning in Second Life: Metaphors and affordances",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131510000643",
            "Abstract": "In this paper we examine the transferability of the Jigsaw and Fishbowl collaborative learning techniques to the Second Life platform. Our aim is to assess the applicability of Second Life for collaborative learning by developing virtual tools and metaphors and exploiting the representational richness of this novel medium. In order to enhance the existing metaphors and affordances of SL, our research team implemented educational spaces, avatar clothing, and tools for non-verbal communication and visualisation. By implementing a blended learning evaluation approach we attempted to answer three research questions focusing on student collaboration, avatar representation and learning space awareness. We can conclude that SL can supplement and/or augment face to face interactions, improving upon previous approaches in distance collaboration and communication. Furthermore, although our team augmented …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Interactive Mobile Communication Technologies and Learning: Proceedings of the 11th IMCL Conference",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=wRBMDwAAQBAJ&oi=fnd&pg=PR5&dq=info:nxEHSnPtYX8J:scholar.google.com&ots=y70wgv9xcy&sig=HydwzjUxGYil2llXv2XruashDuc",
            "Abstract": "Interactive mobile technologies have now become the core of many—if not all—fields of society. Not only do the younger generation of students expect a mobile working and learning environment, but also the new ideas, technologies and solutions introduced on a nearly daily basis also boost this trend. Discussing and assessing key trends in the mobile field were the primary aims of the 11th International Conference on Interactive Mobile Communication, Technologies and Learning (IMCL2017), which was held in Thessaloniki from 30 November to 01 December 2017. Since being founded in 2006, the conference has been devoted to new approaches in interactive mobile technologies, with a focus on learning. The IMCL conferences have in the meanwhile become a central forum of the exchange of new research results and relevant trends, as well as best practices. This book contains papers in the fields of: Future Trends and Emerging Mobile Technologies Design and Development of Mobile Learning Apps and Content Mobile Games—Gamification and Mobile Learning Adaptive Mobile Environments Augmented Reality and Immersive Applications Tangible, Embedded and Embodied Interaction Interactive Collaborative and Blended Learning Digital Technology in Sports Mobile Health Care and Training Multimedia Learning in Music Education 5G Network Infrastructure Case Studies Real-World Experiences The content will appeal to a broad readership, including policymakers, academics, educators, researchers in pedagogy and learning theory, school teachers, the learning industry, further education lecturers, etc.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:-FonjvnnhkoC",
            "Publisher": "Springer"
        },
        {
            "Title": "Teleconference in support of distance learning: Views of educators Η τηλεδιάσκεψη στην υποστήριξη της εξ αποστάσεως εκπαίδευσης: Απόψεις των εκπαιδευτών",
            "Publication year": 0,
            "Publication url": "http://users.auth.gr/tsiatsos/CD-Papers/4_Journals/J27.pdf",
            "Abstract": "In this study we recorded the views of the educators that use teleconference as an educational medium to support distance learning. The data were collected using the semi-structured interview and the results showed that teleconferencing could be a strong complementary tool to support flexible learning as well as distance education, by enhancing the interaction among learners. All the interviewees consider teleconference as a\" helpful assistant\" in the educational process and suggested that the educators should be well prepared before the tele-lecture, as well as prepare and guide the learners in order to conduct a smooth teleconferencing session. From the interviews, several advantages and disadvantages of the teleconference’s use as an educational tool emerged. The main advantages consist of the independence of space and time while conducting learning sessions, the easy access to and sharing of educational content, the interaction between educator and learners as well as among the learners and the reduced transportations along with time saving. On the other hand, some important disadvantages refer to the participants being unfamiliar with technology, lack of technological support, limited network resources causing disconnections and adding stress to participants, the uncertainty of the participants regarding the effectiveness of teleconference in education and the lack of face-to-face communication.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effects of 8-week plyometric training on tennis agility performance, improving evaluation throw the Makey Makey",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11935-5_27",
            "Abstract": "Tennis is an intermittent sport characterized by repeated high-intensity efforts during a variable period of time. Aiming to be competitive and successful, tennis players need a mixture of speed, agility, and power combined with high aerobic fitness. Plyometrics are training techniques used by athletes in all types of sports to increase strength and explosiveness. The objectivity of the performance measure varies through measures such as: time, checklists, or established criteria. Makey Makey is an invention kit for everyone, is an electronic invention tool and toy that allows users to connect everyday objects to computer programs. The aim of this study was twofold. Firstly the purpose of this study was to examine the effects of a 8-week plyometric training program on tennis specific agility. Secondly, this study was directed towards examining objectivity evaluation among three different evaluators/coaches and …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:uLbwQdceFCQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Aspects of a collaborative learning environment using distributed virtual environments",
            "Publication year": 2001,
            "Publication url": "https://www.learntechlib.org/p/8362/",
            "Abstract": "A decisive factor for new technologies is always the added value with respect to the efficiency and capacity of traditional technologies. This also is true when considering the impact of new technologies in training applications. New types of applications have been developed along the last few years to incorporate information technology in the learning environment. The growing need for communication, visualisation and organisation features in the field of learning and training environments, the e-learning approach, has led to the application of virtual reality and the use of multi-user real-time communication platforms to support these needs. This paper presents the first approach of such a system as well as useful technologies and standards for its implementation.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:XiSMed-E-HIC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Enriching synchronous collaboration in online courses with configurable conversational agents",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49663-0_34",
            "Abstract": "This work presents a novel approach for employing conversational agent technology in the context of Massive Open Online Courses (MOOCs), aiming to support learners that work in groups to sustain productive forms of peer dialogue. An exploratory study is presented featuring 56 undergraduate computer science students, who interacted with a conversational agent in the context of an online course. The study investigates the practicability of using configurable conversational agents to provide collaborative learning support and serves as an opportunity to compare two intervention strategies: (a) converging agent interventions, presented in the form of tips relating closely to the topic of the activity and (b) diverging agent interventions, which do not relate directly to the activity topic and pose new domain-relevant questions. The study findings suggest that a convergent agent is often perceived as more helpful by the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Review of Collaborative Virtual Environment (CVE) Evaluation Methodologies.",
            "Publication year": 2008,
            "Publication url": "http://www.seerc.org/new/refbase/files/tsiatsosth/2008/197_TsiatsosTh+KonstantinidisA.2008.pdf",
            "Abstract": "This paper presents several methodologies concerning the evaluation of Collaborative Virtual Environments (CVEs). In doing so, the authors aim to compensate for the absence of a CVE evaluating standard, with the goal of aiding future evaluators in their task. Initially, the paper discusses the general benefits of CVEs and computer supported collaborative learning (CSCL). Based on the examined research it continues with suggested evaluation criteria and the division of evaluation into partitions. Following that, we discuss recommended evaluator profiles and data mining practices. The paper concludes with a description of appropriate data analysis procedures. In the final section, some closing remarks are made and future work is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilizing virtual worlds for game based learning: Grafica, a 3D educational game in second life",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6268194/",
            "Abstract": "This paper presents the design, implementation and evaluation of a three dimensional collaborative knowledge game, called \"GrAFiCA\", that utilizes the Second Life collaborative virtual environment. The presented study is part of a larger research project focusing on designing and evaluating game based learning in virtual worlds. Our aim is to investigate the effectiveness of three dimensional game-based learning techniques through a detailed collaborative game scenario, at the level of tertiary education.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementing collaborative e-learning techniques in collaborative virtual environments: The case of Second Life",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5359256/",
            "Abstract": "This paper reviews and compares the most promising collaborative virtual environment platforms, which have been used or proposed for supporting educational activities in terms of their potential to support collaborative e-learning. The most promising environment according to the results of this review is Second Life. Second Life is further examined by validating the platform's features, philosophy and policies against some basic design principles for collaborative virtual learning environments in order to better assess its design adequacy for online learning. Furthermore, this paper presents the features that we have implemented within the Second Life platform, in order to facilitate the jigsaw collaborative e-learning scenario. Finally, we present a case study concerning the evaluation of Second Life by undergraduate students in order to assess its potential to support collaborative e-learning techniques.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New Era of the Nano-Electronic Devices–One of the Most Adaptive Learning Areas for the Next Period",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_3",
            "Abstract": "The Moore’s law rigorously fulfilled and in 2021 the CMOS technology seems to reach its ultimate limit. What’s next? All specialists anticipate that a circuit from 2031 will not keep the same performances offered by the last 2.5 nm CMOS from 2021. Proposals are multiple, alternative nano-devices are well-known, nanoscale technologies open amazing future facilities. Confluence of nano-electronics with organic semiconductors and biomaterials seems to be inherent. The paper intends to reply to this extraordinary challenging.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:4MWp96NkSFoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Implementing Cognitive Exercises in Electronic Form for Supporting Patients with Alzheimer's Disease: The Greek Case",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/implementing-cognitive-exercises-in-electronic-form-for-supporting-patients-with-alzheimers-disease/129272",
            "Abstract": "Main goal of this chapter is the development of computerized cognitive exercises for rehabilitation of patients with Alzheimer's disease. More specifically, in traditional rehabilitation settings cognitive exercises are administered by using the paper-and-pencil procedure. This chapter is focused on the transferring of these interventions to an electronic form, enriched with multimedia and interactions that cannot be achieved in the printed form. The presented work tries to automate the procedure and facilitate the psychologist's work. Computer-based intervention programs can exploit all the possibilities of adjusting the difficulty levels of exercise, the speed, the images, using audible signals, accelerating the processing of results for psychologists and much more that add value to creation of such programs. This chapter explores whether and how this kind of exercises can be successfully transferred in an electronic form.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Implementation of 3D mesh streaming and compression techniques in NVEs",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cav.112",
            "Abstract": "In this paper, we present a framework that integrates three‐dimensional (3D) mesh streaming and compression techniques and algorithms into our EVE‐II networked virtual environments (NVEs) platform, in order to offer support for large‐scale environments as well as highly complex world geometry. This framework allows the partial and progressive transmission of 3D worlds as well as of separate meshes, achieving reduced waiting times for the end‐user and improved network utilization. We also present a 3D mesh compression method focused on network communication, which is designed to support progressive mesh transmission, offering a fast and effective means of reducing the storage and transmission needs for geometrical data. This method is integrated in the above framework and utilizes prediction to achieve efficient lossy compression of 3D geometry. Copyright © 2006 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "The 15th International Scientific Conference eLearning and Software for Education Bucharest, April 11-12, 2019",
            "Publication year": 0,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=783340",
            "Abstract": "Doping is defined as the use of prohibited substances and methods to enhance or maintain sporting performance. Recent research evidence in social and behavioural sciences highlighted the underlying psychological mechanisms and processes that is associated with the decision making process towards doping, as well as as well as the factors that would act protectively to prevent doping. This evidence can be utilized to inform, design and evaluate tailored anti-doping educational interventions. Anti-doping education has largely relied on traditional educational approaches such as face-to-face interaction and e-learning material. Current challenges in anti-doping education involve a) the development of modern educational tools suitable for the new generation of athletes, b) the use of state-of-art learning pedagogies that will enable effective engagement, learning and retention of the learned material, c) a …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teachers' support using interaction analysis and visualization tools in educational group blogging",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6530197/",
            "Abstract": "Blogging is quite popular and group blogging has interesting potential for collaborative learning. This paper investigates the possibility of implementing Interaction Analysis techniques in educational group-blogging systems, as a tool for supporting teachers especially for engineering education. The main objective of the pilot study is to provide evidence that teachers could be facilitated, in the process of evaluating and assessing students' interaction and participation, through an Interaction Analysis plugin developed for the WordPress blogging platform. Overall, preliminary findings indicate that the prototype WordPress plugin and its integrated Interaction Analysis indicators, described in this paper, can significantly assist teachers in evaluating collaborative learning activities under the scope of engineering education.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Technology’s Role on Physical Activity for Elderly People",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_66",
            "Abstract": "The purpose of this study is to investigate the effectiveness of two physical exercise interventions in the elderly, one with the traditional way of exercising and the other with the use of new technologies and by comparing the two interventions and evaluating the most beneficial effects in their functioning ability and their quality of life. The exercise protocols included activities to improve aerobic capacity, muscle strength, mobility (flexibility) and coordination skills (balance). Forty-four elderly women aged 60–80 years old agreed to participate, grouped by twenty-two elderly in each intervention. They evaluated at baseline (pre assessment), as well as at the end of the intervention (post assessment). Both interventions took place at Day Care Centers and lasted 10–12 weeks (min 30 sessions, 2–3 times/week, 60’). The results of this study are in line with the reports of similar studies of the last decade pertaining to …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Best practices and strategies for broadband deployment: Lessons learned from around the world",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/adoption-usage-global-impact-broadband/48301",
            "Abstract": "Broadband deployment is a necessity nowadays. It could help each country, municipality and region to grow and offer better quality of life to the citizens. Today, the emphasis on the development of broadband networks is on fixed Fibre To The Home solutions The lessons learned from countries that are leaders in broadband penetration and Fibre To The Home deployment could be proven very useful for under-served communities, regions and countries where the broadband penetration is low. Therefore, this chapter summarises the lessons learned from implementing (a) country-wide strategies formulated at the national level, and (b) local strategies formulated by the municipalities. Concerning the role of national and local governments, it should be noted that nowadays it is very urgent the involvement of government in the development of broadband infrastructure. Proposed noteworthy remarkable cases are …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "TeSC-2014 Organizing Committee",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7057060/",
            "Abstract": "TeSC 2014 Organizing Committee and Reviewers Page 1 TeSC-2014 Organizing \nCommittee Workshop Organizers Stavros Demetriadis, Aristotle University of Thessaloniki, \nGreece Yannis Dimitriadis, University of Valladolid, Spain Armin Weinberger, University of \nSaarland, Germany Program Committee Santi Caballé Llobet, Universitat Oberta de \nCatalunya, Spain Thanasis Daradoumis, University of the Aegean, Greece Stavros \nDemetriadis, Aristotle University of Thessaloniki, Greece Yannis Dimitriadis, University of \nValladolid, Spain Frank Fischer, Ludwig-Maximilians, Universität München, Germany \nAndreas Harrer, Clausthal University of Technology, Germany Davinia Hernández-Leo, \nUniversitat Pompeu Fabra, Barcelona, Spain Marcelo Milrad, Linnaeus University, Sweden \nDonatella Persico, Istituto per la Tecnologie Didattiche (ITD), Italy Francesca Pozzi, Istituto \nper la Tecnologie Didattiche (ITD), Italy Symeon -…",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The impact of background music on an active video game",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_3",
            "Abstract": "Video games are the most accepted form of entertainment. However, there are games not designed primarily for entertainment purposes and these are called serious games. In particular, developers have created video games that promote exercise and healthy lifestyles, called Active Video Games or “exergames”. After 1970’s developers added music to their games. The goal was to create an emotional engagement and give players a better experience. Background music, proved to be one of the most important features of a game, because it causes emotional responses. The element of music attributed to increased stimulation and mood is the tempo (fast or slow). The fast tempo affects positive space-related abilities compared to the slowest pace. ",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A simulation modelling tool for Distributed Virtual Environments",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1569190X12000287",
            "Abstract": "Distributed Virtual Environments simulate the behaviour and activities of a great number of users interacting in a virtual world over a wide area network. The size of the virtual worlds and the tremendous number of users that these environments are called to support require additional bandwidth and computational resources. For supporting large-scale Distributed Virtual Environments, extended infrastructure is needed in terms of both hardware and software. However, both researchers and application designers do not always have access to such an extended infrastructure and the assessment and evaluation of developed performance improvement techniques becomes extremely difficult. To address this issue, this paper presents a simulation modelling tool, called STEADiVE for networked servers Distributed Virtual Environments that could be used by designers for evaluating the performance of their approaches …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:dhFuZR0502QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Implementing a game for supporting learning in mathematics",
            "Publication year": 2014,
            "Publication url": "https://academic-publishing.org/index.php/ejel/article/view/1695",
            "Abstract": "This paper focuses on the design, implementation and evaluation of an online game for elementary and middle school mathematics. Its aim is twofold:(a) the development of the prototype of a flexible and adaptable computer game, and (b) the evaluation of this prototype, as to its usability and technical aspects. The particular computer game was created in an attempt to facilitate the teaching of mathematics, a subject that is often regarded as complicated by students of all ages. Apart from the game, an administration website was also constructed, so that the educator can configure the game, without that requiring any programming skills. More specifically, the educator can use the administration website in order to alter several of the games parameters, such as the content and total number of its questions. The game was evaluated in real school settings, both through a pilot study with 12 students and a longterm intervention with 37 students that lasted 14 weeks. The results indicated that the students opinion about the game was positive, and suggest that with some extensions the game could be used as an effective learning tool. Finally, some corresponding conclusions and future improvements to the game are being discussed on the basis of the findings.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilising Virtual Communities of Practice to Facilitate Clean Sport Education in Europe",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-67209-6_58",
            "Abstract": "Education represents the cornerstone of recent efforts to promote “clean sport” and curb the onset and use of performance enhancement drugs (PEDs) among both elite and amateur athletes and exercisers. Although several initiatives have been developed to promote relevant anti-doping and clean sport education over the last 10 years, there have been limited synergies and cross-fertilisation of knowledge. As a result, the existing knowledge base around anti-doping education remains rather fragmented. The Erasmus+ Sport project “IMPACT” represents an innovative approach to de-fragment anti-doping education knowledge, and to enable knowledge flows among key sport stakeholders, athletes, and exercisers. Specifically, the project utilised, for the first time, offline and web-based Communities of Practice to identify good practices in anti-doping education and to enable knowledge sharing and …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The challenges of the digital transformation in education",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=6244355839294912228&hl=en&oi=scholarr",
            "Abstract": "This book offers the latest research and new perspectives on Interactive Collaborative Learning and Engineering Pedagogy. We are currently witnessing a significant transformation in education, and in order to face today’s real-world challenges, higher education has to find innovative ways to quickly respond to these new needs. Addressing these aspects was the chief aim of the 21st International Conference on Interactive Collaborative Learning (ICL2018), which was held on Kos Island, Greece from September 25 to 28, 2018.Since being founded in 1998, the conference has been devoted to new approaches in learning, with a special focus on collaborative learning. Today the ICL conferences offer a forum for exchanging information on relevant trends and research results, as well as sharing practical experiences in learning and engineering pedagogy.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Metadata correction: design and evaluation of a simulation for pediatric dentistry in virtual worlds",
            "Publication year": 2013,
            "Publication url": "https://www.jmir.org/2013/11/e268",
            "Abstract": "Due to necessary scheduled maintenance, the JMIR Publications website will be unavailable from Wednesday, July 01, 2020 at 8: 00 PM to 10: 00 PM EST. We apologize in advance for any inconvenience this may cause you.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:SeFeTyx0c_EC",
            "Publisher": "JMIR Publications Inc., Toronto, Canada"
        },
        {
            "Title": "The 3D Motion Capturing Process of Greek Traditional Dance “Syrtos in Three” and a Proposed Method for the Sex Identification of Performing Dancers (Terpsichore Project)",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-52575-0_31",
            "Abstract": " The UNESCO considers as part of the cultural heritage of a place, the intangible cultural heritage (ICH) which is a practice, an expression or representation and knowledge or skill, as well as instruments, objects and cultural places. The cultural heritage includes the traditions or living expressions inherited from the ancestors and passed on to the descendants, not only the monuments or collections of objects. Such features are oral traditions, social practices, arts, festive events and generally, knowledge and practices concerning nature and the universe or the knowledge and skills to produce traditional crafts. Terpsichore project targets at integrating the latest innovative results of photogrammetry, semantic technologies, computer vision and time evolved modelling, along with traditional choreography and narrative. The study, design, research, education, analysis, implementation and validation of an innovative …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:uWiczbcajpAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "International Journal of Knowledge and Learning (IJKL)",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/47795162/ELeGI_as_enabling_architecture_for_e-lea20160804-32424-lnxac8.pdf",
            "Abstract": "The Web 2.0 is supposed to be a second-generation of Internet-based services–such as social networking sites, wikis, communication tools, and folksonomies–that let people collaborate and share information online in previously unavailable way. Currently, there is a strong interest of many leading enterprises in the Web 2.0 and on the impact that it can have on the traditional web-based application such as the e-Learning, namely e-Learning 2.0.This paper analyses what ELeGI could provide to e-Learning 2.0, in terms of its vision of learning, processes, methodologies and technologies. Our preliminary investigations have raised up which results obtained in the ELeGI project can give support to the e-Learning 2.0 and improve some its typical aspects and processes.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Game‐based assessment: Investigating the impact on test anxiety and exam performance",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jcal.12170",
            "Abstract": "The aim of this study is to assess the impact of a 3D educational computer game on students' test anxiety and exam performance when used in evaluative situations as compared to the traditional method of examination. The participants of the study were students in tertiary education who were examined using game‐based assessment and traditional assessment in a 2 × 2 cross‐over design. The game was flexible, providing the instructor with the opportunity to import and edit exam questions and modify several aspects via an administration panel. Following the collection and analysis of both quantitative and interview data, it was revealed that the students' test anxiety was reduced during the game‐based assessment. Furthermore, the exam performance of the students was significantly better when the game method was used. The results showed that there is a linear negative relationship between the students' test …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and implementation of a remote laboratory for heat transfer experiments",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-76935-6_14",
            "Abstract": "The current chapter describes the design and the implementation of a remote laboratory for heat transfer learning purposes. It summarizes the main steps of the work carried out to adapt and redesign the heat exchanger bench to be remotely accessed and controlled. This new device introduced many fundamental aspects of heat transfer, both theoretically and practically. An evaluation procedure was also carried out on this remote lab. This evaluation was focused on some technical and pedagogical aspects. The evaluation results demonstrated that the expected learning outcomes of remote labs seem to be very interesting compared to a conventional lab.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:5awf1xo2G04C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Designing virtual spaces to support learning communities and e-collaboration",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1508691/",
            "Abstract": "In this paper, we present the design principles for virtual spaces and two different tools as solutions for supporting e-collaboration and multi-user communication in Web-based learning communities. The first solution, called Virtual Conference, is designed and implemented in the framework of the VirRAD European project. It is a two-dimensional space where participants represented by their photos can use various e-collaboration tools. The second solution, called EVE Training Area, is a three-dimensional space where participants, represented by 3D humanoid avatars, can use a variety of e-collaboration tools. This paper describes the functionality provided by both tools, compares them, and proposes cases for exploiting each solution.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Collaborative educational virtual environments evaluation: The case of Croquet",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30973816/10.1.1.181.59.pdf#page=40",
            "Abstract": "E-learning systems have gone through a radical change from the initial text-based environments to more stimulating multimedia systems. In this paper we present and compare 3D multi-user virtual environments for supporting collaborative learning. After a pre-selection phase the most promising solution seems to be the Croquet platform. An educational environment has been implemented on top of this platform. Furthermore, this paper presents a case study carried out in a tertiary education department, to assess the educational environment. This environment has been evaluated based on a hybrid evaluation methodology for uncovering usability problems, collecting further requirements for additional functionality to support collaborative learning environments, and determining the appropriateness of different kinds of learning scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Internet protocols for synchronous distance learning",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/875003/",
            "Abstract": "The use of multimedia in telematics and new services has been greatly improved by the introduction of new systems and techniques. These new systems and techniques have made possible the implementation of many telematic applications such as tele-teaching, and collaborative or tele-medicine applications. We present design, protocol and implementation issues of an Internet based synchronous distant learning application. We describe in detail the design and implementation of each application's module and propose protocols which control communication among the application's components. The application is network-based, following the client-server model. The application runs over the Internet and more specifically over the Web. Users of the application access its services through Web pages.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design, Development and Evaluation of a MOOC Platform to Support Dual Career of Athletes (GOAL Project)",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qfCKDwAAQBAJ&oi=fnd&pg=PA257&dq=info:dqnWLZE61-kJ:scholar.google.com&ots=P9ErOly6-R&sig=UN1JiN5lRvGwSLKKFCBd41S5PZg",
            "Abstract": "This paper presents the expert evaluation results of the alpha version of an e-learning platform for supporting dual career of athletes. The platform has been designed and implemented in the context of GOAL (Gamified and Online Activities for Learning to support dual career of athletes) Erasmus+ project. More specifically, the paper presents briefly the structure and content of the platform along with the technological solution, which is based on the wellknown Moodle platform. According to the evaluation results, GOAL platform is easy to use, consistent, with a simple user interface and the overall attitude of the evaluators is positive.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Springer"
        },
        {
            "Title": "Detecting emotions in Greek sentences: towards an open-source affect-awareness framework",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=4141147589912047808&hl=en&oi=scholarr",
            "Abstract": "Considering the highly important role of automated emotion recognition in the development of affective intelligent systems, this study investigates a real-time sentence-level emotion recognition method. More specifically, this paper describes the construction process of an open-source library that can be used for the detection of emotions from sentences comprising Greek or English words. The proposed library was developed, based on the Synesketch software library, utilizing Ekman’s basic emotion theory. Greek sentences are classified to six emotional types defined by Ekman (happiness, sadness, anger, fear, disgust and surprise).",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electronic Cognitive Exercises",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/electronic-cognitive-exercises/112495",
            "Abstract": "BackgroundResearch has shown that brain exercise can slow the progression of Alzheimer’s disease and can also improve the cognitive functioning of people with attention deficit disorder, head injuries, autism, schizophrenia and other cognitive problems. Today, there is a worldwide effort under way to find better ways to treat the disease, delay its onset, and prevent it from developing. Additionally to pharmaceutical treatment, a form of cognitive exercise can be very useful, by improving mental abilities and brain functionality. The rehabilitation of cognitive impairments in patients with Alzheimer’s disease is a form of treatment that is used in order to limit and offset the damaged mental abilities. Also, CT is used to develop the thinking skills that help children in school and adults in the workplace improve their memory, attention, listening skills, self-control, processing speed, and more (1).",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "OpenGames: A framework for implementing 3D collaborative educational games in OpenSim",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=L5B9MJjHXQYC&oi=fnd&pg=PA82&dq=info:J6kI9Ofcw40J:scholar.google.com&ots=mJxibou7ky&sig=5xpsXC8NEXvXbDpbX9t7-FoGsnQ",
            "Abstract": "The main goal of this paper is the presentation of the design and implementation of a game framework, for building 3D collaborative educational games. The final framework, which is called OpenGames, supports the creation of such games, in the virtual worlds of the open source platform, OpenSim. This paper presents the steps followed for the implementation of this framework, its technical aspects, as well as the first impressions and evaluation results after the conducting of a game based educational activity.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting distant PSYCHO-eDucational activities with a bio–feedback device",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=9264828297810617528&hl=en&oi=scholarr",
            "Abstract": "Caregivers of patients with dementia mainly face the problems such as psychological pressure in a daily basis, lack of knowledge and/or training about caring the patients and lack of knowledge about the consequences of dementia in patients’ behavior. These issues reveal the demand both for the support and the training for caregivers. Following this direction, we developed a web based platform to provide distant support for caregivers who are not able to participate in face to face sessions. This platform integrates services (ie teleconferencing, content management, learning management) and tools, such as a bio-feedback device for stress awareness to support distance learning and psychological support of the caregivers. This paper presents this platform, along with preliminary encouraging results concerning its usability and its usefulness not only for the caregivers but also for the psychologists who are training …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distribution and Partitioning Techniques for NVEs: the case of EVE",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1652058/",
            "Abstract": "The majority of the systems and platforms developed for supporting distributed virtual environments are based on the concept of distribution from the early beginning of their development. In this paper we present the migration to a distributed virtual environment from a traditional client-server architecture. In particular, this paper describes the case of EVE, a networked virtual environment originally aimed to support small-scale applications. EVE started as a standard client-multi server architecture, which could support multiple concurrent virtual worlds with a maximum number of seventeen simultaneous participants in each of these worlds. However, the need to support larger-scale applications revealed that the traditional architecture, upon which EVE was based, is insufficient to meet the needs of these applications, which are large both in the sense of virtual space and graphics and in regard to the number of …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "International Student 3D Competition in Microeconomics",
            "Publication year": 0,
            "Publication url": "http://users.auth.gr/tsiatsos/CD-Papers/5_Papers/C62.pdf",
            "Abstract": "This paper describes the international electronic collaboration between professors of four universities and their students in order to organize and implement a serious game activity. The paper also presents the concept of the serious game, the game play scenario as well as the assessment of the whole activity from the pedagogical and technological viewpoint.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the potential of programming tasks to benefit patients with mild cognitive impairment",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2910674.2935850",
            "Abstract": "In the context of the ASPAD project we explored the potential of robot programming tasks to benefit patients with MCI (mild cognitive impairment), when implemented as a form of cognitive training with the use of a user-friendly tangible interface. In this paper, we present relevant research evidence indicating that:(a) there is a significant negative correlation between patients' MMSE index and\" Programming Task Completion Time\"(PTCT) index, suggesting that PTCT can be used as a precursor of patients' general mental state;(b) MCI patients (treatment group) displayed significantly improved post-test performance in the\" Test of Everyday Attention\" when compared to a non-hospitalized non-otherwise treated control group. We conclude that available evidence encourage further investigation of the impact of programming tasks on MCI patients, as a cognitive training and assessment tool, in relation to important mental …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Educational virtual environments: design rationale and architecture",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-006-0005-7",
            "Abstract": "The use of collaborative virtual environments in e-learning is one of the most promising uses of virtual reality technology. While much research has been done in the area of networked virtual environments corresponding to the sharing of events, very little research has been done on specific services and functionality. However both the requirements and the kind of the offered services affect significantly the design of a system. In this paper we present the design and implementation of a platform suitable for educational virtual environments, which are collaborative virtual environments aiming at offering collaborative e-learning services to the users. Apart from the platform itself, we present the technological choices, and a new method for sharing virtual environments. Furthermore, we present an e-learning environment to support e-learning services using collaborative virtual environments from both the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The 3D Motion Capturing Process of Greek Traditional Dance “Syrtos in Three” and a Proposed Method for the Sex Identification of Performing Dancers (Terpsichore Project)",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=N374DwAAQBAJ&oi=fnd&pg=PA366&dq=info:D6RI0th9S0MJ:scholar.google.com&ots=yhWAEFt5Lj&sig=EERP37j-SkuvODIqRyK-bxhxmAc",
            "Abstract": "The UNESCO considers as part of the cultural heritage of a place, the intangible cultural heritage (ICH) which is a practice, an expression or representation and knowledge or skill, as well as instruments, objects and cultural places. The cultural heritage includes the traditions or living expressions inherited from the ancestors and passed on to the descendants, not only the monuments or collections of objects. Such features are oral traditions, social practices, arts, festive events and generally, knowledge and practices concerning nature and the universe or the knowledge and skills to produce traditional crafts. Terpsichore project targets at integrating the latest innovative results of photogrammetry, semantic technologies, computer vision and time evolved modelling, along with traditional choreography and narrative. The study, design, research, education, analysis, implementation and validation of an innovative framework for accessible digitization, modelling, archiving, online preservation and presentation of ICH content related folk dances is reflected in the project. The Department of Physical Education and Sport Sciences of the Aristotle University was involved in the project in the performance of six traditional Greek dances and the three-dimensional capturing. Specifically, in the present work with the process of 3D recording of the movement of the Greek traditional dance “Syrtos in three”, the method for identifying the dancers’ gender will be proposed. The results showed that using 3D motion capturing we may recognize the sex of the dancer through the trajectories of toes markers and the kinematic data of joints angles. Regarding kinematic …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Using sensors to detect student’s emotion in adaptive learning environment",
            "Publication year": 2011,
            "Publication url": "https://www.scitepress.org/Papers/2011/44717/44717.pdf",
            "Abstract": "The purpose of this paper is a case study of the development of a device that could collect and evaluate biosignals by people engaged in learning activities. The physiological reactions of the body, affects the conductivity of the skin producing bio-signals that provides the opportunity to estimate some basic human emotional states. In particular stressful situations have resulted in increased moisture in human skin, reducing the resistance and increasing the conductivity of the skin to electrical current. In this case study there is a reference to adaptive collaborative learning support. This work suggests that emotional state regulation may be an important factor in implementing the adaptivity of learning activities.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Second Life and croquet: a comparative study for investigating the support of CSCL scenarios",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5194303/",
            "Abstract": "Computer technology seems to be very useful to support collaborative learning scenarios and thus computer supported collaborative learning. The main goal of this paper is to compare two of the most promising collaborative virtual environment platforms, namely Croquet and Second Life, in terms of their potential to support collaborative e-learning scenarios among geographically separated users. Both platforms are examined by validating the platformspsila features, philosophy and policies against some basic design principles for collaborative virtual learning environments in order to better assess their design adequacy for online learning. Finally, this paper presents the user evaluation results, which was conducted by undergraduate students in order to assess the potential of both platforms for supporting collaborative e-learning scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet of Things, Infrastructures and Mobile Applications: Proceedings of the 13th IMCL Conference",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=cD_8DwAAQBAJ&oi=fnd&pg=PR5&dq=info:csD4rG6NcwIJ:scholar.google.com&ots=u5IGFZOaW7&sig=5J2TM_ZjZjZEOK2wV3TFgr2_9yU",
            "Abstract": "This book gathers papers on interactive and collaborative mobile learning environments, assessment, evaluation and research methods in mobile learning, mobile learning models, theory and pedagogy, open and distance mobile learning, life-long and informal learning using mobile devices, wearables and the Internet of Things, game-based learning, dynamic learning experiences, mobile systems and services for opening up education, mobile healthcare and training, case studies on mobile learning, and 5G network infrastructure. Today, interactive mobile technologies have become the core of many--if not all--fields of society. Not only do the younger generation of students expect a mobile working and learning environment, but also the new ideas, technologies and solutions introduced on a nearly daily basis also boost this trend. Discussing and assessing key trends in the mobile field were the primary aims of the 13th International Conference on Interactive Mobile Communication Technologies and Learning (IMCL2019), which was held in Thessaloniki, Greece, from 31 October to 01 November 2019. Since being founded in 2006, the conference has been devoted to new approaches in interactive mobile technologies, with a focus on learning. The IMCL conferences have since become a central forum of the exchange of new research results and relevant trends, as well as best practices. The books intended readership includes policymakers, academics, educators, researchers in pedagogy and learning theory, schoolteachers, further education lecturers, practitioners in the learning industry, etc.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "A comparison of 3D collaborative virtual learning environments: OpenSim vs. Second Life",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/article/content/73657",
            "Abstract": "This paper focuses on 3D Collaborative Virtual Learning Environments, examining the state of the art in both open source and proprietary software. Issues pertaining to the use of open source Collaborative Virtual Learning Environments are discussed, rationalizing the choice of executing a collaborative learning scenario in Second Life. The scenario is then presented and evaluation results assess the appropriateness of the chosen platform with regards to its technical and pedagogical affordances. Finally, students’ suggestions and reactions towards such a novel didactical approach are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:blknAaTinKkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Designing 3D Collaborative Virtual Environments to Utilize the Pedagogical Benefits of CSCL.",
            "Publication year": 2008,
            "Publication url": "https://www.scitepress.org/Papers/2008/15282/15282.pdf",
            "Abstract": "In this paper, we aim to aid designers of 3D collaborative virtual environments in their work by presenting the pedagogical benefits of computer supported collaborative learning (CSCL) and discussing how these can be utilized in the definition of certain design guidelines for CVEs. We also present the challenges faced by CVE designers due to both the inherent characteristics of CVEs and the purpose these applications are designed to fulfil. Finally, based on bibliographical studies we suggest how these challenges can be overcome through thoughtful consideration of certain design principles.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using VR technology to support e-learning: the 3D virtual radiopharmacy laboratory",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1284042/",
            "Abstract": "We present a virtual laboratory, which is designed and implemented in the framework of the VirRAD European project. This laboratory represents a 3D simulation of a radio-pharmacy laboratory, where learners, represented by 3D avatars, can experiment on radio-pharmacy equipment by carrying out specific learning scenarios. We describe the functionality provided by this laboratory, the motivation factors which led to its formation, the technological decisions that were made for the optimization of the system as well as the envisioned steps to be carried out.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of a blog-based learning analytics tool: A case study focusing on teachers",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_50",
            "Abstract": "The current paper presents a case study for evaluating an Interaction Analysis (IA) toolkit for blogs, called GIANT (Graphical Interaction Analysis Tool). The paper focuses on the perspective of the teachers and investigates the hypothesis that IA techniques could be implemented in educational group-blogging systems, as a tool for supporting teachers. The main objective of the study is to provide an indication that teachers could be facilitated, in the process of evaluating and assessing students’ interaction and participation, through the real-time generated graphs from the GIANT toolkit. This paper also provides further evaluation evidence for the GIANT toolkit, from a teachers’ point of view, in terms of overall teacher satisfaction, perceived usefulness and perceived ease of learning. Particularly, 32 secondary education teachers’ used and evaluated GIANT during a collaborative blog-based activity with …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:PELIpwtuRlgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluation Plan of a network of remote labs in the Maghrebian countries",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6784255/",
            "Abstract": "The need for adopting virtual and remote labs in engineering education is high in Algeria, Morocco and Tunisia. This paper proposes the evaluation plan of a network of remote labs in the Maghrebian countries. This plan is based on the significant research that has been done until now concerning the evaluation of remote labs. More specifically the proposed evaluation strategy of the project will focus on five different but interrelated directions (a) usability of remote labs; (b) learners' attitude towards remote labs; (c) technical evaluation of remote labs operation; (d) evaluation of the e-learning content namely the teaching units previously described; and (e) learning outcome.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "VLSS--virtual learning and social stories for children with autism",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901553/",
            "Abstract": "This paper presents the design, implementation and educational use of a virtual learning environment which supports children with Autism Spectrum Disorders (ASD) to learn to solve social problems presented in the format of Social Stories. The pilot evaluation revealed that the environment has the potential to be a beneficial and easy-to-use educational tool for teaching social problem solving to children with ASD.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ODL services and PTTs: The Greek PTT case",
            "Publication year": 1999,
            "Publication url": "http://ru6.cti.gr/ru6/system/files/publications/9352279.pdf",
            "Abstract": "During the last years Open and Distance Learning (ODL) methods that utilise network resources and services are gaining wide acceptance. An increasingly number of enterprises uses ODL for training their employees. Interestingly enough not all the enterprises that want to and can use ODL are doing so. The role of PTTs is important in here. PTTs can provide not only the connections necessary for the implementation of ODL services but the ODL services themselves, thus making the process of adopting ODL easier for the enterprises. In Greece the main PTT organisation, as part of its strategy to offer integrated telematics services in various areas, designed and currently operates a pilot network offering ODL services. The services offered include among others Synchronous Distance Education, Asynchronous Distance Education, Co-operative Learning etc. The network utilises ISDN links to connect the users of the ODL services (either trainers or trainees) to a central site. This site is used to interconnect the users among themselves, and to host the services and any educational material needed. The ODL services can be offered either over ISDN services or over the Internet (using TCP/IP services and applications). In the first case the central site utilises a Multipoint Control Unit (MCU). In the second case the ISDN lines are used to the implement the connections to the Internet, and the central site utilises a powerful server. Each user may access the ODL service using an ISDN enabled personal computer. Small groups of users that wish to participate from the same location can be accommodated using larger displays. The ODL services (and the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "International Journal of Distance Education Technologies",
            "Publication year": 0,
            "Publication url": "https://www.igi-global.com/pdf.aspx?tid%3D133239%26ptid%3D118398%26ctid%3D15%26t%3Dtable+of+contents%26isxn%3D",
            "Abstract": "International Journal of Distance Education Technologies Page 1 The International Journal of \nDistance Education Technologies is indexed or listed in the following: ABI/Inform; ACM Digital \nLibrary; Aluminium Industry Abstracts; Australian Education Index; Bacon’s Media Directory; \nBurrelle’s Media Directory; Cabell’s Directories; Ceramic Abstracts; Compendex (Elsevier \nEngineering Index); Computer & Information Systems Abstracts; Corrosion Abstracts; CSA Civil \nEngineering Abstracts; CSA Illumina; CSA Mechanical & Transportation Engineering Abstracts; \nDBLP; DEST Register of Refereed Journals; EBSCOhost’s Academic Search; EBSCOhost’s \nAcademic Source; EBSCOhost’s Business Source; EBSCOhost’s Computer & Applied \nSciences Complete; EBSCOhost’s Computer Science Index; EBSCOhost’s Computer Source; \nEBSCOhost’s Current Abstracts; EBSCOhost’s Science & Technology Collection; & ; ; – ; ; ; .…",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework model for DVEs using SIMUL8",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.144.3996&rep=rep1&type=pdf",
            "Abstract": "Distributed Virtual Environment systems simulate the behaviour and activities of a great number of users interacting in a virtual world over a wide area network. The sizes of the virtual worlds and the tremendous number of users that DVEs are called to support require additional bandwidth and computational resources. For handling these growing requirements a lot of work has been done both to the direction of alternative architectural solutions as well as to techniques and algorithms for handling the limitations of these environments. For supporting large-scale DVEs, extended infrastructure is needed in terms of both hardware and software. However, both researchers and application designers do not always have access to such extended infrastructure and the assessment and evaluation of developed techniques becomes extremely difficult. To this direction, this paper presents a simulation modelling tool for networked servers DVEs that could be used by designers for simulating the performance of their approaches under different scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Remote Warehouse Management System",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-52575-0_28",
            "Abstract": "This paper describes the software architecture and the required hardware components of a Remote Warehouse Management System using Augmented Reality, designed in the context of the project called WMS & AR project. The system architecture will augment the capabilities of an existing WMS system [1]. The main services that the extended system will provide are (a) automatic recording of the layout of the warehouse; (b) automatic measurement of goods; (c) exception handling. Moreover, the paper discusses the architectural requirements of the system, presents the proposed software architecture and refers to the future steps.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "HistoryLand: A Serious Game for History Learning in Primary Education",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Dimitris_Gkoumas2/publication/287027690_HistoryLand_A_serious_game_for_history_learning_in_primary_education/links/57b43c3608ae19a365faddd2/HistoryLand-A-serious-game-for-history-learning-in-primary-education",
            "Abstract": "Research has indicated that games can positively impact learning by providing a potentially motivating and engaging learning environment that can complement traditional education. This is especially important for such domains as History, which students often consider to be one of the least appealing learning subjects. In this paper, we present the design of the prototype online game HistoryLand, along with an evaluation study conducted in the context of a Greek primary school course on Modern History. The aim of this study was to explore the impact of the game on students’ immersion, collaboration, knowledge improvement and enjoyment. The findings of the study revealed a positive students’ opinion about the HistoryLand game, which was perceived as useful for comprehension of the historical events discussed in class.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:SP6oXDckpogC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Affect Awareness Support and Communication Technologies in Education",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/affect-awareness-support-and-communication-technologies-in-education/112658",
            "Abstract": "The purpose of this article is the support of learning activities through the student affective awareness and more specifically through his/her anxiety level recognition. In learning activities besides the cognitive procedure, there is a mixture of student academic emotions revealed, which might be considered as important factors to student performance. Student anxiety recognition through bio-feedback, might be approved a significant support providing critical and on-time affective information which may improve self-regulation and teaching and coaching quality. The physiological reactions of the body, affects the conductivity of the skin, the skin temperature and the heart rate producing bio-signals that provide the opportunity to estimate some basic human emotional states. More specifically, high anxiety is usually resulting in increased human skin moisture, reducing the resistance and increasing the skin conductivity to …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A SERIOUS GAME APPROACH IN ANTI-DOPING EDUCATION: THE GAME PROJECT",
            "Publication year": 2019,
            "Publication url": "http://bibliotecadigitala.unap.ro/handle/123456789/4716",
            "Abstract": "Anti-doping education has largely relied on traditional educational approaches such as face-to-face interaction and e-learning material. Current challenges in anti-doping education involve a) the development of modern educational tools suitable for the new generation of athletes, b) the use of state-of- art learning pedagogies that will enable effective engagement, learning and retention of the learned material, c) a systematic evaluation of the outcomes of anti-doping educational interventions on behavior and related cognition, and d) a positive approach to doping prevention. Project GAME aims to address these needs through the development of a serious game that will incorporate current empirical evidence on the psychological mechanisms underpinning the decision making process towards doping use in competitive and recreational sports. The aim of the present study is to highlight the importance of anti …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "\" CAROL I\" National Defence University Publishing House"
        },
        {
            "Title": "Integration of 3D Mesh Streaming and Compression Techniques for Adaptive, Progressive Virtual World Transmission in NVEs",
            "Publication year": 0,
            "Publication url": "http://users.auth.gr/tsiatsos/CD-Papers/5_Papers/C23.pdf",
            "Abstract": "In this paper, we present a framework for exploiting three-dimensional (3D) mesh streaming and compression techniques and algorithms in order to improve the performance of our EVE-II Networked Virtual Environments platform. These improvements are related to the progressive transmission of 3D worlds or separate meshes. We also present a 3D mesh compression method focused on network communication, which is designed to support progressive mesh transmission, offering a fast and effective means of reducing the storage and transmission needs for geometrical data.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-user layer in the EVE distributed virtual reality platform",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1203619/",
            "Abstract": "In this paper, we present the design and implementation of a VRML97 multi-user layer, which is introduced in the EVE distributed virtual reality platform. Main consideration of our multi-user extension is the ease of transforming single-user virtual worlds to multi-user virtual worlds, as well as the conformity with any standard VRML97 browser. Furthermore, we present the EVE's communication platform, which can be used in order to support Collaborative Virtual Environments (CVEs). Main issues regarding the effective network communication as well as the initialization of the 3D scene are discussed in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Group formation based on learning styles: can it improve students’ teamwork?",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007%252Fs11423-011-9215-4",
            "Abstract": "This work explores the impact of teacher-led heterogeneous group formation on students’ teamwork, based on students’ learning styles. Fifty senior university students participated in a project-based course with two key organizational features: first, a web system (PEGASUS) was developed to help students identify their learning styles and distribute them to heterogeneous groups. Second, group facilitation meetings were introduced as a technique to help students reflect on their weak/strong traits and employ appropriate roles in their group. The study research questions focused mainly on students’ attitudes regarding the learning style-based group formation approach. By applying qualitative research method students’ views were recorded about the impact of styles awareness and group heterogeneity on group collaboration and possible benefits and drawbacks related to the style-based grouping approach …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Exploiting annotated video to support dance education",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5489872/",
            "Abstract": "This article deals with the employment of annotated video in order to support dance education. More specifically, it is investigated the usage of multimedia technology in learning and teaching of Greek traditional dances. One of the issues faced by the teachers is that they do not have the opportunity of practicing Greek traditional dances before they teach them in a class of students. Therefore, there is a specific need for the teachers of physical education to recall the Greek traditional dances that they should teach in Primary Education schools. Furthermore, the pupils want to attend many times the performance of a dance in order to learn how to dance Greek traditional dances. The only means to support the teachers are (a) books which describe the Greek traditional dances in, a rather abstruse, symbolic language and (b) face-to-face seminars, which are not suitable for wide scale training due to time and cost …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Assessing the Attitudes of Greek Nurses Toward Computerized Dementia Screening",
            "Publication year": 2020,
            "Publication url": "https://content.iospress.com/articles/journal-of-alzheimers-disease/jad200666",
            "Abstract": "Background:Despite the abundance of research on computerized dementia screening tests, the attitudes of hospital personnel toward this screening method have not been investigated.Objective:1) To conduct a confirmatory factor analysis of the first part of a two-part questionnaire about computerized dementia screening. 2) To assess the attitudes of Greek nurses toward computerized dementia screening. 3) To assess barriers to future implementation of computerized dementia screening in the Greek healthcare system, as reported by nurses.Methods:161 Greek nurses from two urban public general hospitals who participated in a dementia training program were recruited. They were asked to complete a two-part questionnaire about computerized dementia screening. The first part of the questionnaire assesses attitudes toward dementia screening while the second part of the questionnaire assesses barriers to its …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:g3aElNc5_aQC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Motivating computer science students by facilitating inderdisciplinary educational activities [exploitation of a 3D educational game for marketing]",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7130483/",
            "Abstract": "This study investigates the integration of a 3D Collaborative Game into the learning process of a Marketing lesson. The research conducted in the context of a collaboration between two universities. Students from one university facilitated the game activity whereas the others played the game. The evaluation methodology was focused on users’ satisfaction, intension - purpose and attitude towards the game activity as well as on the motivational impact of the activity to the students who supported it. The preliminary results of the evaluation were promising and revealed that there is a great interest from the side of the learners towards the use of games in the learning process.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Basic Aspects of VLEs and Guidelines for Supporting Learning Communities and E-Collaboration",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/basic-aspects-vles-guidelines-supporting/9114",
            "Abstract": "This chapter aims to present the basic design principles for virtual spaces for facilitating educational designers and developers by providing a point of reference for making decisions about whether or not to incorporate 3D environments into the resources they develop as well as for extending their capabilities by integrating more functionality.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "An Object Driven Partitioning Approach for Distributed Virtual Environments",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4420156/",
            "Abstract": "Distributed virtual environments tend to become a de facto solution for large-scale networked virtual environments. One of the key issues and problems that need to be handled in the design of a scalable and effective distributed virtual environment system is the partitioning problem, which refers to the efficient assignment of the system's workload to the available resources of the system. This paper presents an object driven partitioning approach based on the partitioning algorithm of Lui & Chan, who proposed a three step technique for balancing the workload among the servers of the Distributed Virtual Environment.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A SCORM-Conformant LMS",
            "Publication year": 2003,
            "Publication url": "https://www.learntechlib.org/p/11116/",
            "Abstract": "In this paper we propose a sample Learning Management System (LMS) that will be conformant with the SCORM v1. 3 Specification. In particular, the sample LMS we propose will make use of both, the SCORM Run Time Environment, in order to communicate with the learning content, and a sequencing engine so as to sequence discrete learning activities in a consistent way, based on the learners' interactions with the content. Even if the SCORM v1. 3 Specification is not yet finalized, the proposed LMS intends to be an attempt to test and evaluate the specification in its present form.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Selecting and evaluating a learning management system: A Moodle evaluation based on instructors and students",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/article/selecting-evaluating-learning-management-system/55796",
            "Abstract": "This paper presents the rationale behind the utilization of a Moodle Learning Management System for the facilitation of a blended learning approach in the Informatics department. The authors present and analyze the steps followed in order to replace the prior decentralized organizational structure of the courses, which consisted of a multitude of different and incompatible systems. The main goal was to implement a single system, which would be easy to operate, maintain, and update, and would cater to the variety of instructor and student needs. Furthermore, evaluation data of the new system is presented in detail. The analysis of the results serves to confirm the success of this department-wide migration.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:Mojj43d5GZwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "FGAWeb: a web platform for administrating flexible games in education",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7943104/",
            "Abstract": "This paper introduces a contemporary platform, called FGAWeb, that can be utilized in order to administrate flexible games. FGAWeb platform is focused on differentiating the content of puzzle and quiz games in order to make them more suitable for use in educational settings. Instructors can utilize this platform in order to create and edit game activities as well as, to have access to game and learning analytics. FGAWeb platform offers an API that makes the whole system accessible from any game engine that supports the HTTP protocol for data transfers.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A web-based virtual community",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWBC.2005.006058",
            "Abstract": "This paper describes functionality and architectural issues in the design of a web-based virtual community. This virtual community aims to meet the requirements of a virtual collaboration system with both autonomous and collaborative e-learning services, by supporting communities whose members interact and form groups based on their common interests.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "The virtual radiopharmacy laboratory: A 3-D simulation for distance learning",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/11430/",
            "Abstract": "This article presents Virtual Radiopharmacy Laboratory (VR LAB), a virtual laboratory accessible through the Internet. VR LAB is designed and implemented in the framework of the VirRAD European project. This laboratory represents a 3D simulation of a radio-pharmacy laboratory, where learners, represented by 3D avatars, can experiment on radio-pharmacy equipment by carrying out specific learning scenarios. This article describes the functionality provided by this laboratory, the motivation factors which led to its formation, the technological decisions that were made for the optimization of the system, as well as the envisioned steps to be carried out.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:u9iWguZQMMsC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Towards a Flipped Optical Laboratory",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-52575-0_29",
            "Abstract": " This paper presents the main steps for creating an innovative educational Optical Laboratory, based on the flipped classroom educational model. This laboratory called FlipOL: Flipped Optical Laboratory. FlipOL intends to support hands-on training and skill enhancement on photonics by offering hands-on educational activities, broadening the audience and extending existing facilities expediting access to photonic components, measurement equipment of Photonic Integrated Circuits (PICs) and support services. Doing so, FlipOL aims to introduce, adapt and exploit the rich capabilities of current ICT distance learning toolkit towards negating the barriers associated with geographical location, localization and cost in outreach and learning activities. It will establish a single one-stop-shop Virtual Space for educational material, bringing the community of photonics in contact with well-established principles from the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:URolC5Kub84C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Selecting a networked virtual environment platform and the design of a collaborative e-learning environment",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4482888/",
            "Abstract": "Our goal was to create a 3D virtual environment which could be used to carry out online lectures and which would offer the most popular features of current CVEs. This paper initially discusses the potential of 3D networked virtual environments for supporting collaborative learning and presents the assets of such systems. Furthermore, the paper reviews the features of five such software applications, through the comparison of the tools and services they offer. These include tools for supporting communication, sharing applications, organizing and coordinating the teaching process and for interacting with the virtual environment through an avatar. Based on that comparison, we justify our choice of platform and discuss design and implementation issues. Finally, future work regarding the assessment of the virtual environment is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using Multi-user Distributed Virtual Environments in Education",
            "Publication year": 2000,
            "Publication url": "https://www.learntechlib.org/p/6338/",
            "Abstract": "On-line learning is one of the emerging needs of the information age. Access to education is going to become crucial for the success of our information society. Therefore a lot of potential is seen in distance learning and distributed virtual environments. The communicative character of the distributed virtual environments would allow for students and stuff to meet in social shared spaces and engage in on-line real-time seminars and tutorials. Such technologies may mitigate some of the problems of isolation that distance learning brings. This paper presents multi-user distributed virtual environments, which are designed and implemented for educational uses.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:isC4tDSrTZIC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Users’ and experts’ evaluation of TARGET: a serious game for mitigating performance enhancement culture in youth",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_15",
            "Abstract": "This paper presents both the experts and users evaluation results of the alpha version of TARGET (anTi-doping AwaReness Game for hEalthy lifestyle), a Serious Game for supporting the Anti-Doping Awareness for a Healthy Lifestyle. The game has been designed and implemented in the context of GAME (A serious Game Approach in Mitigating performance Enhancement culture in youth) which is an Erasmus + project. Particularly, the paper briefly presents the design and content of the serious game, along with the technological solution, which is based on the well-known Unity 3D platform in combination with Fungus plugin, and then presents the findings of the Alpha Version Users’ and Experts’ Evaluation of the game.According to the evaluation results, Lund’s results are very satisfying indicating a simple and easy to use and learn user interface and users believe that the game is useful for them, and on the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An Object Driven Partitioning Approach for Distributed Virtual Environments",
            "Publication year": 0,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.892.6867&rep=rep1&type=pdf",
            "Abstract": "Distributed virtual environments tend to become a de facto solution for large-scale networked virtual environments. One of the key issues and problems that need to be handled in the design of a scalable and effective distributed virtual environment system is the partitioning problem, which refers to the efficient assignment of the system’s workload to the available resources of the system. This paper presents an object driven partitioning approach based on the partitioning algorithm of Lui & Chan, who proposed a three step technique for balancing the workload among the servers of the Distributed Virtual Environment.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "• Vyacheslav Shitikov• Jin Gon Shon• Melody Siadaty• Rory Sie• Jose Luis Sierra",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6268261/",
            "Abstract": "Reviewers Page 1 Reviewers • Marie-Helene Abel • Olusola Adesope • Reem Al-Mahmood • \nEfthymios Alepis • Colin Allison • Mohamed Ally • Arif Altun • Ainhoa Alvarez • Rachid Anane • \nGalia Angelova • Luis Anido • Baharuddin Aris • Ana Arruarte • Juan Ignacio Asensio-Perez • \nPetek Askar • Alev Ates • Mirjam Augstein • Nahed Amin Azab • Sebastiano Bagnara • \nMarie-Therese Barbaux • Vincent Barre • Brian Belland • Adriana Berlanga • Markus Bick • \nMarlies Bitter • Lars Bollen • Miguel Luis Bote-Lorenzo • Denis Bouhineau • Christos Bouras • \nTharrenos Bratitsis • Crescencio Bravo • Francis Brouns • Juan Carlos Burguillo-Rial • Maria \nLuz Cacheiro • Rosa M. Carro • Chien-Lung Chan • Tak-Wai Chan • Ben Chang • Maiga Chang \n• Ni Chang •Yam-San Chee • Irene Ya-Ling Chen • Sherry Chen • Tzy-Ling Chen • Weiqin Chen \n• Zhi-Hong Chen • Vadim Chepegin • Nan-Hsing Chiu • Christophe Choquet • Ruth Cobos …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open Source vs. Proprietary Collaborative Virtual Learning Environments",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/chapter/open-source-vs-proprietary-collaborative-virtual-learning-environments/104837",
            "Abstract": "This chapter is an evaluation of the efficiency of 3D Collaborative Virtual Learning Environments to facilitate the implementation of collaborative learning activities. Firstly, there is a presentation of the state of the art regarding open source as well as proprietary platforms. Afterwards, the use of a case study reveals issues concerning the suitability of open source Collaborative Virtual Learning Environments, rationalizing the choice of executing a collaborative learning scenario in Second Life. The specific scenario is then presented culminating in evaluation results related to the appropriateness of Second Life with regards to its technical and pedagogical affordances. Finally, students' suggestions and reactions towards such a novel didactical approach are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Work-in-Progress: SenseExpress, It Sounds Greek to Me but I Can Imagine How You Feel",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11932-4_42",
            "Abstract": "This study presents and evaluates an application exploring real-time sentence-based emotion recognition. This application is called SenseExpres and is used for the detection of emotions from sentences comprising Greek words. SenseExpress development was based on the Synesketch software library, which is built upon Ekman’s basic emotion theory. Greek sentences are classified into six emotional types defined by Ekman (happiness, sadness, anger, fear, disgust and surprise). The evaluation of this application was based on users’ self-report and Technology Acceptance Model (TAM). More specifically, 108 users participated in the evaluation activity. Every user was asked to provide 15 simple Greek sentences as input to the application. The self-report evaluation showed that 50.9% of the participants were satisfied with the resulted emotions. Moreover, TAM evaluation resulted in a significant …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Collaborative learning in OpenSim by utilizing sloodle",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5489686/",
            "Abstract": "The paper introduces and proposes a hybrid approach to computer supported collaborative learning. The approach suggests a combined use of the open source systems Moodle and OpenSim through the Sloodle module, in order to facilitate the fruitful execution of the collaborative learning techniques Jigsaw and Fishbowl, and examines their online transferability. In the concluding section, it is surmised that the successful combination of specific approaches and systems can surpass particular shortcomings inherent in their isolated use.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A SERIOUS GAME AGAINST DOPING: EVALUATION OF GAME USABILITY, EASE AND USERS’ENJOYMENT",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Thrasyvoulos-Tsiatsos/amp",
            "Abstract": "Doping is a threat to sport worldwide. Doping not only exists in professional sport, but also affects recreational athletes who increasingly use performance-enhancing drugs. As anti-doping authorities largely rely on detection, deterrence, and prevention to tackle doping use, the main tool for prevention is education. So far, educational interventions have largely used traditional teaching approaches such as face-to-face courses and online courses. The present study examines the usability of a serious game against doping (the GAME) as an alternative approach to traditional anti-doping education. In addition, this study will investigate its ease and users’ enjoyment while playing the serious game. Participants in the evaluation were 21 undergraduate students who played the GAME and then were asked to respond to a questionnaire evaluating GAME’s usability, ease and users’ enjoyment. Concerning the usability and ease of GAME, the results demonstrated the high usability and ease of GAME. The findings related to the evaluation of users’ enjoyment were also positive. Overall, players were largely satisfied with their gaming experience, rating the GAME as easy to understand and learn and very satisfying. The next step is to deploy the GAME in greater audiences and evaluate its effectiveness in changing beliefs and knowledge about doping.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:gsN89kCJA0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Motivating Computer Science Students by Facilitating Inderdisciplinary Educational Activities",
            "Publication year": 2014,
            "Publication url": "http://users.auth.gr/tsiatsos/CD-Papers/5_Papers/C71.pdf",
            "Abstract": "Collaborative Game into the learning process of a Marketing lesson. The research conducted in the context of a collaboration between two universities. Students from one university facilitated the game activity whereas the others played the game. The evaluation methodology was focused on users’ satisfaction, intension-purpose and attitude towards the game activity as well as on the motivational impact of the activity to the students who supported it. The preliminary results of the evaluation were promising and revealed that there is a great interest from the side of the learners towards the use of games in the learning process.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting virtual environments and Web 2.0 immersive worlds to support collaborative e-learning communities",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/novel-developments-web-based-learning/40529",
            "Abstract": "The main goal of this chapter is to facilitate educational designers and developers by providing a point of reference for making decisions on how to incorporate 3D environments into the applications they develop as well as for extending their capabilities by integrating more functionality. Therefore, this chapter presents the design principles for virtual spaces, which aim at supporting multi-user communication in web-based learning communities. In addition the implementation of these principles is presented using as point of reference EVE Training Area. This environment constitutes a three-dimensional space where participants, represented by 3D humanoid avatars, have the ability to use a variety of 3D e-collaboration tools for learning together. Furthermore, this chapter presents how these principles could be used as criteria for validating and extending ready Web2. 0 Immersive worlds for supporting collaborative e …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:-f6ydRqryjwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Improving collaboration between students exploiting a 3D game",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901573/",
            "Abstract": "This study investigates whether 3D collaborative games can promote the collaboration between students. The participants of the study were 27 undergraduate students in tertiary education, aged 19-22 years old. The intervention lasted 12 weeks and it was based on the One Group Pretest, Post test experimental design. The game used for the intervention was configurable, providing the ability for changes to its content, and it was developed in the OpenSim platform. The data collection was made with the use of a paper-based questionnaire and the statistical analysis was conducted using paired-samples t-test. The results of the analysis were promising and showed that educational games can promote collaborative interactions between students and improve their social skills.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and architecture of an online system for Vocational Education and Training",
            "Publication year": 2007,
            "Publication url": "http://ru6.cti.gr/ru6/system/files/publications/1227ICL2007_MENTOR_Bouras.pdf",
            "Abstract": "E-learning and tele-training have been evolved over time from a newborn trend for complementing the learning process to a major form of education and training for supporting mainly geographically scattered users. Learning and training, can be applied to a wide variety of fields and areas, each of which is accompanied by some special characteristics related to the field of learning/training, to the tools needed for the realization of the training process as well as to the familiarization of the target audience to the selected technologies. Basic aim of this paper is the description of a platform for open and distance training, which is mainly focused at supporting the needs of Vocational Training Centres as well as of institutions providing life-long adult training and learning. In particular, the issues that this paper focuses on are vocational education and training characteristics and requirements while it also proposes basic vocational training services and the system architecture of the integrated platform.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Kassel University Press"
        },
        {
            "Title": "Exploiting virtual environments to support collaborative e-learning communities",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/article/international-journal-web-based-learning/3005",
            "Abstract": "The main goal of this article is to facilitate educational designers and developers by providing a point of reference for making decisions on how to incorporate 3D environments into the applications they develop as well as for extending their capabilities by integrating more functionality. Therefore, this article presents the design principles for virtual spaces, which aim at supporting multi-user communication in Web-based learning communities. In addition the implementation of these principles is presented, using as point of reference EVE Training Area. This environment constitutes a three-dimensional space where participants, represented by 3D humanoid avatars, have the ability to use a variety of 3D e-collaboration tools for learning together. Furthermore, this article presents collaborative e-learning usage scenarios that could be realized by exploiting collaborative virtual environments.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:WbkHhVStYXYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Designing and deploying 3D collaborative games in education",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/article/designing-and-deploying-3d-collaborative-games-in-education/144216",
            "Abstract": "This paper focuses on methodologies of serious games deployment and evaluation. Particularly, this study will present a specific category of serious games that are based on Collaborative Virtual Environments and they aim to support Collaborative Learning. We call these serious games Collaborative Virtual Educational Games (CVEG). The paper aims to analyze the deployment and evaluation process, through the study of relevant bibliography, and by doing so to reveal the existing research gap, which fails to evaluate the threefold nature–game, collaboration, and software-of CVEG. The proposed framework aims to support the design, deployment, and evaluation of a CVEG, by incorporating two consecutive and recurrent cycles, each consisting of distinct phases. Furthermore, each phase is designed to address specific goals. Finally, the paper presents four case studies, applying the proposed theoretical …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:geHnlv5EZngC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Business models for broadband municipal optical networks: a proposed model for the Greek case",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4381495/",
            "Abstract": "This paper proposes a business model for the successful operation of the currently developing broadband metropolitan area networks in Greece. Having recorded and examined relevant international practices, we describe in detail the way that these networks should be managed, operated, maintained and expanded. Taking into consideration that these infrastructures will alter the broadband map of Greece widely, that Greece currently has one of the lowest broadband penetration percentages in Europe and that the proper exploitation of the networks to be deployed could boost the demand for broadband connections and applications, the proposition of the business model appears to be of vital importance. We present the proposed business model in detail including information regarding network management and network expansion of the broadband metropolitan networks and viability issues regarding the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Designing a 3D collaborative game to support game based learning",
            "Publication year": 2011,
            "Publication url": "http://users.auth.gr/users/4/7/043774/public_html/CD-Papers/5_Papers/C55.pdf",
            "Abstract": "The main goal of this paper is to provide educational game designers with a design model for the development of 3D virtual collaborative games aiming to utilize the advantages of 3D immersive environments. The proposed design model is presented through a detailed 3D collaborative game scenario, appropriate and suitable for implementing educational games in virtual immersive environments. Thereby this paper presents a proposal to support collaborative learning based on 3D serious games.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agent supported serious game environment",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7390265/",
            "Abstract": "This study proposes and applies a novel concept for an AI enhanced serious game collaborative environment as a supplementary learning tool in tertiary education. It is based on previous research that investigated pedagogical agents for a serious game in the OpenSim environment. The proposed AI features to support the serious game are the following: a) a pedagogical game agent, b) non-playing characters, c) chat bots, and d) a game interface called “Progress Map”. This study aims to explore whether the utilization of AI features in game based collaborative learning in a tertiary education course can positively affect students' attitudes towards the course and educational games, students' game performance, as well as the students' perception of their learning environment. Summarizing, even though the intelligent game environment does not affect students' attitudes, neither towards the course nor towards the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A comparative single-blind randomized controlled trial with language training in people with mild cognitive impairment",
            "Publication year": 2019,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1533317518813554",
            "Abstract": "Although cognitive training is effective for people with mild cognitive impairment (MCI), it is not clear which format is more effective.To compare the effectiveness of the same language programs when carried out via computer, paper/pencil and orally in people with MCI.Seventy-one participants with MCI were randomly classified in 3 experimental and 2 control groups. The experimental groups attended 48 sessions of language training for 6 months. The control groups attended either unstructured sessions or they were on waiting list.Mixed measures analysis of variance, at the follow-up, showed a significant cognitive abilities improvement among the experimental versus control groups. At the end of the language training, the 3 groups presented improvement in cognitive abilities and daily function, while the control groups remained at the same performance level.All …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:N5tVd3kTz84C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "A Configurable Agent to Advance Peers’ Productive Dialogue in MOOCs",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=H_zKDwAAQBAJ&oi=fnd&pg=PA245&dq=info:D2HRqe3H8Z8J:scholar.google.com&ots=U34hSXh22W&sig=_YgixlTa5lAjY9hfFcfc0u--xOs",
            "Abstract": "Chatbot technology can greatly contribute towards the creation of personalized and engaging learning activities. Still, more experimentation is needed on how to integrate and use such agents in real world educational settings and, especially, in large-scale learning environments such as MOOCs. This paper presents the prototype design of a teacher-configurable conversational agent service, aiming to scaffold synchronous collaborative activities in MOOCs. The architecture of the conversational agent system is followed by a pilot evaluation study, which was conducted in the context of postgraduate computer science course on Learning Analytics. The preliminary study findings reveal an overall favorable student opinion as regards the ease of use and user acceptance of the system.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Creating Magic-Matt, An Interface to Transform Video Games to a Sports Experience",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_59",
            "Abstract": "The aim of this study is to create an interface which, through the simulation of human movements, transforms a typical sedentary activity as video games in physical activity and as a result make some improvement on their motor skills, which are necessary for people’s everyday life. Initially, a detailed description of the necessary theoretical concepts, namely natural user interfaces, serious games and exergames, is displayed. Then, after comparing the available technologies to create NUIs, researchers created a prototype of the interface Finally after the implementation of the interface an evaluation activity was conducted. The results were encouraging concerning the ease of use, the enjoyment and the usefulness of the game. This article ends with suggestions for future research.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Promoting learner-centeredness with the use of a group-activity",
            "Publication year": 0,
            "Publication url": "http://users.auth.gr/users/4/7/043774/public_html/CD-Papers/5_Papers/C48.pdf",
            "Abstract": "Technology can facilitate a iearner-centered mode of education by supporting both learners and teachers to reflect on their preferred ways of learning and teaching, thus triggering a fruitful negotiation as part of the ecology of the iearning environment. This paper presents a case study of promoting learnercenteredness in a post graduate University course by integrating a group-activity support system (PEGASUS) that helps students and teachers to identify their learning and teaching styles. Additionally, the system can suggest optimal group formation in order to foster improved conditions for student collaboration. Integrating PEGASUS in the context of a University course is expected to increase students and teacher self-awareness and initiate productive discussions on the impact of learning styles both on individual and collaborative learning. The paper provides evidence about the acceptance of the system by the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design, creation and evaluation of TEAM, a serious game for teamwork development",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11932-4_69",
            "Abstract": "The aim of this study is to create an educational game which, through the simulation of realistic situations, enhances the development, practice and improvement of skills, which are necessary for the people’s professional progress. In particular, this game will aim at developing people’s teamwork skills, as they need to work closely with others in order to achieve their common goals.Initially, a detailed description of the necessary theoretical concepts, namely game-based learning and serious games, is displayed. In addition, the term soft skills, is presented, while the chapter concludes with presentation of teamwork skills. This analysis of the theoretical concepts explains the importance of soft skills and in particular of teamwork skills, while at the same time it explains why the creation of an educational game has been chosen in order to strengthen them. Then, after comparing the available technologies …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Conversational agents in MOOCs: reflections on first outcomes of the colMOOC project",
            "Publication year": 2021,
            "Publication url": "https://research.utwente.nl/en/publications/conversational-agents-in-moocs-reflections-on-first-outcomes-of-t",
            "Abstract": "Massive Open Online Courses (MOOCs) provide a powerful means for informal online learning that is already popular, engaging great numbers of students all over the world. However, studies on MOOCs’ efficiency frequently report on the high dropout rates of enrolled students, and the lack of productive social interaction to promote the quality of MOOC-based learning. Conversational agents (CAs), on the other hand, appear to be a promising artificial intelligence (AI) technology with the potential of acting as catalysts of students’ social interaction, a factor known to beneficially affect learning at many levels. Within this context the “colMOOC” project has proposed and developed an agent-based tool and methodology for integrating flexible and teacher-configurable CAs along with relevant learning analytics services in MOOCs platforms, aiming to promote peer learning interactions. This chapter concisely presents the overall rationale of the project, the agent-based tools developed, and provides reflections on the first project outcomes emerging from four different pilot MOOCs offered so far. Early conclusions analyze the challenges for integrating a teacher-configured agent-chat service in MOOCs, provide helpful guidelines for efficient task design, and highlight promising evidence on the learning impact of participating in agent-chat activities.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Networked Virtual Environments",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/networked-virtual-environments/13983",
            "Abstract": "The inherent need of humans to communicate acted as the moving force for the formation, expansion and wide adoption of the Internet. The need for communication and collaboration from distance resulted in the evolution of the primitive services originally offered (ie, e-mail) to advanced applications, which offer a high sense of realism to the user, forming a reality, the so-called virtual reality. Even though virtual environments were first introduced as stand alone applications, which could run on a single computer, the promising functionalities of this new form of representation and interaction as well as the familiarity of the users with it drew increased research interest. This fact resulted in virtual reality to be viewed as the solution for achieving communication and collaboration between scattered users, in various areas of interest, such as entertainment, learning, training, etc. This led to the creation of Networked Virtual …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:4DMP91E08xMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Formal discussion summaries",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=18134786455190071765&hl=en&oi=scholarr",
            "Abstract": "Copyright by the International Forum of Educational Technology & Society (IFETS). The authors and the forum jointly retain the copyright of the articles. Permission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear the full citation on the first page. Copyrights for components of this work owned by others than IFETS must be honoured. Abstracting with credit is permitted. To copy otherwise, to republish, to post on servers, or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from the authors of the articles you wish to copy or kinshuk@ massey. ac. nz.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The broadband status in the region of Western Greece: overview and recommendations",
            "Publication year": 2005,
            "Publication url": "http://telematics.upatras.gr/telematics/system/files/publications/2253bbeurope05_bouras.pdf",
            "Abstract": "This paper presents a study conducted in the Region of Western Greece, in order to propose an overall planning for the development of broadband infrastructure in the Region of Western Greece. The current broadband status in the region is being described, while the results of a survey on broadband usage and demand are being presented. The paper proposes some Recommendations that should be adopted in the region of Western Greece in order for the appropriate broadband infrastructures to be developed and adopted so as to contribute to economic growth and to tackle any possible cases of “digital gap” between the citizens of our country.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and evaluation of a 3D collaborative game to support game based learning",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=L5B9MJjHXQYC&oi=fnd&pg=PA269&dq=info:le5ZVrsEJIIJ:scholar.google.com&ots=mJxibou7oy&sig=KyL-DmKxQtKBwjhvEt0-zi3Wmiw",
            "Abstract": "The purpose of this paper is to present a detailed and comprehensive design and evaluation of a 3D collaborative game using the OpenSim virtual world platform. The aim ofthe game is to developthe collaboration skills of the students, give them a new perspective of knowledge acquisition, combine fun with learning and give teachers a new and innovating educational tool for the learning process. The evaluation results are very promising, as far as the students are concern for two reasons: a) because they believe that the virtual game activity improves the effectiveness of the knowledge acquisition and b) they recommend the addition of such activities in educational programs.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating Technology into Traditional Dance for the Elderly",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11935-5_28",
            "Abstract": "The increased life expectancy is associated with an increase in multiple chronic conditions, such as functional disability, need for help, reduced mobility, depression, isolation and loneliness. It is considered necessary to give particular attention in order to observe changes to services and facilities aimed at the elderly, to design and to implement appropriate health programs initially on prevention and continuously on treatment to achieve a satisfactory level of quality of life and a significant improvement and facilitation in their daily life. The traditional dance which is a health program that is very close to the interests of the elderly, could promote their health and contribute to the maximum delay of aging. The aim of this work was to investigate whether the elderly can participate in traditional dance programs using new technologies, effectively promoting active aging and pursuing an autonomous and independent …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:_Ybze24A_UAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Exploiting 3D virtual environments for supporting role playing games",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6402170/",
            "Abstract": "This paper describes the international electronic collaboration among students of two universities in order to create a digital educational space for supporting a role playing educational activity. The paper also presents the virtual place that has been implemented in order to transfer the role playing game activity students from the traditional classroom as well as the assessment of the whole activity from the pedagogical and technological viewpoint.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Metadata Correction: Design and Evaluation of a Simulation for Pediatric Dentistry in Virtual Worlds",
            "Publication year": 2013,
            "Publication url": "https://www.jmir.org/2013/11/e268/pdf",
            "Abstract": "“Design and Evaluation of a Simulation for Pediatric Dentistry in Virtual Worlds”(J Med Internet Res 2013; 15 (10): e240) was published on Oct 29th in issue 10 (with correct citation information in the table of contents) but the article itself originally displayed incorrect “please cite as” citation information, displaying issue 11 instead of issue 10. This error was corrected in the online version of the paper on the JMIR website on November 26, 2013, together with publishing this correction notice. As a result, the URL for this paper has changed from http://www. jmir. org/2013/11/e240/to http://www. jmir. org/2013/10/e240/. No content changes were made.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:epqYDVWIO7EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "E-collaboration concepts, systems, and applications",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/collaboration-concepts-systems-applications/16849",
            "Abstract": "E-Collaboration is an important research topic, with a great number of researchers contributing on many aspects. The main reason for this major research activity is the broad topic’s scope, which involves not only technological but also social and psychological issues. As a result there are multiple interpretations about what e-collaboration is. More specifically we definitely can say that e-collaboration has been defined in many ways in the past, and the number of definitions has grown recently. The next section present the main terms in this area.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Design and evaluation of a simulation for pediatric dentistry in virtual worlds",
            "Publication year": 2013,
            "Publication url": "https://www.jmir.org/article/view/2651/1",
            "Abstract": "Background: Three-dimensional virtual worlds are becoming very popular among educators in the medical field. Virtual clinics and patients are already used for case study and role play in both undergraduate and continuing education levels. Dental education can also take advantage of the virtual world’s pedagogical features in order to give students the opportunity to interact with virtual patients (VPs) and practice in treatment planning.Objective: The objective of this study was to design and evaluate a virtual patient as a supplemental teaching tool for pediatric dentistry.Methods: A child VP, called Erietta, was created by utilizing the programming and building tools that online virtual worlds offer. The case is about an eight-year old girl visiting the dentist with her mother for the first time. Communication techniques such as Tell-Show-Do and parents’ interference management were the basic elements of the educational scenario on which the VP was based. An evaluation of the simulation was made by 103 dental students in their fourth year of study. Two groups were formed: an experimental group which was exposed to the simulation (n= 52) and a control group which did not receive the simulation (n= 51). At the end, both groups were asked to complete a knowledge questionnaire and the results were compared.Results: A statistically significant difference between the two groups was found by applying a t test for independent samples (P<. 001), showing a positive learning effect from the VP. The majority of the participants evaluated the aspects of the simulation very positively while 69%(36/52) of the simulation group expressed their preference for …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:HoB7MX3m0LUC",
            "Publisher": "JMIR Publications Inc., Toronto, Canada"
        },
        {
            "Title": "An Integrated",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=7792471341485944203&hl=en&oi=scholarr",
            "Abstract": "In this chapter, we present the design and implementation of an integrated platform for Educational Virtual Environments. This platform aims to support an educational community, synchronous online courses in multi-user three-dimensional (3D) environments, and the creation and access of asynchronous courses through a learning content management system. In order to offer synchronous courses, we have implemented",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Information Science Publishing"
        },
        {
            "Title": "Implementing advanced characteristics of X3D collaborative virtual environments for supporting e-learning: The case of EVE platform",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/chapter/implementing-advanced-characteristics-of-x3d-collaborative-virtual-environments-for-supporting-e-learning/137395",
            "Abstract": "Three dimensional Collaborative Virtual Environments are a powerful form of collaborative telecommunication applications, enabling the users to share a common three-dimensional space and interact with each other as well as with the environment surrounding them, in order to collaboratively solve problems or aid learning processes. Such an environment is “EVE Training Area tool” which is supported by “EVE platform”. This tool is a three-dimensional space where participants, represented by three-dimensional humanoid avatars, can use a variety of e-collaboration tools. This paper presents advanced functionality that has been integrated on “EVE Training Area tool” in order to support:(a) multiple collaborative learning techniques (b) Spatial audio conferencing, which is targeted to support principle 3 (augmenting user's representation and awareness). Furthermore the paper presents technological and …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A Unified Framework For Political Parties to Support E-Democracy Practices",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.420.1030&rep=rep1&type=pdf",
            "Abstract": "The wide adoption of the Internet and the familiarization by enterprises and citizens with it was sought for many public authorities as an important step forward in availability and accessibility, as it could provide access to information along with a certain degree of interaction among the citizens and the authorities",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Web Based Virtual Community: Functionality and Architecture Issues",
            "Publication year": 2004,
            "Publication url": "http://ru6.cti.gr/ru6/system/files/publications/6309989.pdf",
            "Abstract": "A Web Based Virtual Community is an example of a Collaborative Virtual Environment, which focalizes in providing collaborative functionalities and both synchronous and asynchronous interaction services. This paper describes a virtual community, which aims to meet the requirements of a virtual collaboration space and support autonomous and collaborative e-learning services. In particular, a web-based platform is described, which is able to support communities whose members are able to interact and form groups based on their common interests. The community provides its members with the ability to communicate through enhanced forums and chats, but also, to interact in the social interaction spaces. The users can arrange events, which occur in virtual meeting centers, where 3D avatars represent the users. In these multi-user spaces, extended functionalities are offered, while system agents assist and consult the users.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An educational community using collaborative virtual environments",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45689-9_15",
            "Abstract": "The use of Collaborative Virtual Environments in e-learning is one of the most promising uses of the virtual reality technology. While a lot of research has been done in the area of collaborative virtual environments corresponding to the sharing of events, very little research has been done on specific services and functionality. However both the requirements and the kind of the offered services affect significantly the design of a system. In this paper we present an Educational Community to support e-learning services using Collaborative Virtual Environments from both the technical and functional point of view.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Mobile Technologies and Applications for the Internet of Things: Proceedings of the 12th IMCL Conference",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ghCTDwAAQBAJ&oi=fnd&pg=PR5&dq=info:tyaX0ck7qWkJ:scholar.google.com&ots=He3srVzimp&sig=ygxnrNhwmvRwIA-p6uf5NiUt0fw",
            "Abstract": "This book discusses and assesses the latest trends in the interactive mobile field, and presents the outcomes of the 12th International Conference on Interactive Mobile Communication Technologies and Learning (IMCL2018), which was held in Hamilton, Canada on October 11 and 12, 2018. Today, interactive mobile technologies are at the core of many–if not all–fields of society. Not only does the younger generation of students expect a mobile working and learning environment, but also the new ideas, technologies and solutions coming out practically every day are further strengthening this trend. Since its inception in 2006, the conference has been devoted to highlighting new approaches in interactive mobile technologies with a focus on learning. The IMCL conferences have since established themselves as a valuable forum for exchanging and discussing new research results and relevant trends, as well as practical experience and best-practice examples. This book contains papers in the fields of: Interactive Collaborative Mobile Learning Environments Mobile Health Care Training Game-based Learning Design of Internet of Things (IoT) Devices and Applications Assessment and Quality in Mobile Learning. Its potential readership includes policymakers, educators and researchers in pedagogy and learning theory, schoolteachers, the learning industry, further education lecturers, etc.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:M7yex6snE4oC",
            "Publisher": "Springer"
        },
        {
            "Title": "The impact of pedagogical agents in 3D collaborative serious games",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7096838/",
            "Abstract": "This paper examines the impact of an pedagogical agent (PA), in a 3D collaborative educational game in the virtual environment of OpenSim platform. The main goal of this paper is to evaluate the impact of a pedagogical agent to 3D collaborative game based learning by developing an agent that interacts with the students both at team and personal level. In order to enhance the already implemented 3D game functions, a pedagogical agent that supports students during the game learning process was implemented. The evaluation approach attempts to investigate the impact of PAs in 3D collaborative educational games focusing on two dimensions: a) on PAs usefulness in collaborative 3D games and b) on students' teams performance in the game learning process. This research concludes that the intervention of pedagogical agent's assistance in the game has a strong positive impact on teams performance and …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Student Support in Web 2.0 CSCL: an exploratory proposal using Interaction Analysis",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=4310559101512126100&hl=en&oi=scholarr",
            "Abstract": "The development and availability of Web 2.0 applications, like blogs, set new challenges and opportunities for the Computer-Supported Collaborative Learning community. This paper aims to investigate the possibility of implementing Interaction Analysis techniques in educational groupblogging systems, as a tool for supporting students. To this end, the paper presents a case study evaluating an Interaction Analysis toolkit for blogs, called GIANT, in terms of general usability, usefulness and user interface satisfaction. Overall, research results indicate that students were to a large extent satisfied with their blogging experience, rating the automatically generated Interaction Analysis graphs as useful, easy to understand and decode, thus supporting our initial hypothesis that Interaction Analysis is an important module of any blog-based CSCL setting.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gamified and online activities for learning to support dual career of athletes (GOAL)",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_61",
            "Abstract": "Dual careers defined as enabling education or work, promote the attainment of a new career after the sporting career, and protect and safeguard the position of athletes. The success of dual career arrangements is largely dependent on individual, personalised pathways enabled through the use of rich-mediated technologies that will facilitate athlete’s effort to adapt to the changing employment needs. GOAL (Gamified and Online Activities for Learning to support dual career of athletes,                    http://goal.csd.auth.gr/                                    ) will effectively start dual careers for athletes embracing their awareness to balance sport training and education and, at a later stage, sport training and employment.The aim of this study is to present the project, highlight the importance of dual careers, describe the results of the project’s needs analysis, conduct a state of the art about e-learning platforms and …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Exploring Students’ Perceived Attitude on Utilizing a Biofeedback System for Anxiety Awareness during Academic Examination Activities",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1286512",
            "Abstract": "The presented paper examines the students’ adoption of the use of a cost-effective biofeedback system for anxiety awareness in parallel to examination activities. Human anxiety is classified by evaluating bio-signals related to skin conductance, skin temperature and heart rate. The participants of the research were 44 students who were taking examinations in the form of synchronous online tests in the classroom for one of their courses. At first, the usability of the biofeedback system was examined using the system usability scale (SUS). The statistical analysis indicated that the examined system usability is quite satisfactory. Then, the study attempted to investigate the relationships between the students’ technology readiness personality dimensions, perceptions of usability, and the usefulness of the presented system by exploiting the technology readiness and acceptance model (TRAM). The results showed that the students’ optimism and attitude towards using the system are significant factors that affect the model’s relationships. The examined relationships are presented via a path model.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Implementation and Evaluation of a Serious Game for Working Memory Enhancement",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/931438",
            "Abstract": "The amount of information which can be stored in the human brain is limited and dependent on memory capacity. Over the last few years there has been a trend in training cognitive skills, not only to prevent cognitive decline, which is inevitable as a person grows older, but also to increase or at least preserve mental abilities that will allow a person to function at a higher cognitive level. Memory is one of those key aspects among cognitive skills that has a significant role in a person’s mental performance. Specifically, focus is given to Working Memory (WM), as evidence has shown that it can be increased by applying targeted interventions. An intervention program like this is the main object of this current paper. Using a Serious Game (SG), we designed and created a video game which targets WM training. Its effectiveness was tested and evaluated through an evaluation process where forty people participated in a seven-week training program. Post-results showed that participants had an increase in their WM performance, especially those who had lower scores at the pre-test, while those with high pre-test scores just preserved their initial status. Additionally, all participants agreed that the game is fun and enjoyable to play and that it helps them to increase WM performance. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:KUbvn5osdkgC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Building e-learning communities: The case of VirRAD",
            "Publication year": 2003,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/icalt/2003/19670452/12OmNyPQ4CW",
            "Abstract": "This paper discusses the development of virtual communities and especially e-learning communities. In particular, this paper is inspired by VirRAD European project, and presents the intermediate results that have raised from the definition of this virtual radiopharmacy community.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Migrating to Moodle: A case study regarding a department-wide implementation",
            "Publication year": 2008,
            "Publication url": "https://research.utwente.nl/en/publications/migrating-to-moodle-a-case-study-regarding-a-department-wide-impl",
            "Abstract": "This paper presents the rationale behind the utilization of the Moodle Learning Management System (LMS) for blended learning in our Informatics Department and examines the steps followed, to replace the prior decentralized course organizational structure which consisted of a multitude of different systems. Our main goal was to implement a single, easy-to-operate, easy-to-maintain system, able to support students' and instructors' needs in all the courses. Furthermore, we present data which describe the pilot study of the Moodle implementation for the first semester and make evident the success of the department-wide migration.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting virtual objects' attributes and avatar's behavior in DVEs partitioning",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4414629/",
            "Abstract": "Partitioning constitutes one of the most critical challenges a distributed virtual environment needs to handle and is related to the efficient assignment of the existing entities of the virtual world to the available resources of the system. The efficient partitioning arises from the need of high consistency maintenance among participating users' view, as virtual reality applications are characterized by the high degree of realism they aim to achieve. To the direction of partitioning algorithms, a lot of work has been done, which has been more intense due to the evolution of network technologies and the familiarization of users with virtual reality systems. This paper presents a partitioning approach, which is based on the degree of interaction of each virtual object and the behavior of the participating users, in terms of moving trends, which is usually directed by the actions they can perform on the surrounding objects. In particular …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance improvement of Distributed Virtual Environments by exploiting objects’ attributes",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10055-011-0198-6.pdf",
            "Abstract": "Distributed virtual environments need to address issues related to the control of network traffic, resource management, and scalability. Given the distributed nature of these environments, the main problems they need to overcome are the efficient distribution of workload among the servers and the minimization of the communication cost. In this direction, a lot of work has been done and numerous relevant techniques and algorithms have been proposed. The majority of these approaches mainly focus on user entities and their interactions. However, most of actual DVE systems include additional and non-dynamic elements, denoted as objects, whose presence can affect users’ behavior. This paper introduces virtual objects’ attributes and proposes two approaches that exploit these attributes in order to handle workload assignment and communication cost in DVE systems. Both approaches take into account …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Brain plasticity in older adults",
            "Publication year": 2018,
            "Publication url": "http://ikee.lib.auth.gr/record/296881",
            "Abstract": "The aim of the study was to examine the effectiveness of Virtual Reality (VR) and Video Games (VG) as cognitive training tools in community dwelling older adults. A total of 19 older adults aged from 65 to 79 years comprised the sample of the study. According to the intervention program they were submitted to, participants were separated into two groups. The first one was trained using an adaptation of virtual reality platform (FitForAll), developed to train specific cognitive functions (n= 10). Contrary to the above the second group was trained in a go-kart-style video game (Super Mario Kart) on the Wii console (n= 9). There wasn’t significant difference between the two groups in terms of age, gender and educational level. In both groups the intervention consisted of 18 sessions of about 40’each, over a six-week period (3 times per week). Specific cognitive functions and state affect were measured before and …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:VLnqNzywnoUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Workshop on Machine Intelligence for Geographic Information Systems (MIGIS)",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5368887/",
            "Abstract": "Workshop Committee Members Page 1 Workshops Workshop on Machine Intelligence for \nGeographic Information Systems (MIGIS) Chair Václav Snášel, VSB-Technical University of \nOstrava, Czech Republic Workshop Program Committee Vít Voženílek, Palacky Univerity of \nOlomouc, Czech Republic Dušan Húsek, UI Academy of Science, Prague, Czech Republic Jiri \nDvorsky, VSB-Technical University Ostrava, Czech Republic Ales Cepek, Czech Technical \nUnivesity Prague, Czech Republic Jaromir Kolejka, Masaryk University Brno, Czech Republic \nJaroslav Hofierka, Presov University, Slovakia Branislav Bajat, Belgrade University, Serbia \nStelian Dimitrov, Sofia University St.Kliment Ohridski, Bulgaria Jonathan Raper, City University \nLondon, United Kingdom Workshop on Adaptive Systems for Collaborative Learning (IWASCL) \nChairs Stavros Demetriadis, Aristotle University of Thessaloniki, Greece Thanasis , Open , …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Architectures And Protocols For Educational Virtual Environments.",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.28.7463&rep=rep1&type=pdf",
            "Abstract": "Shared or networked virtual environments are one of the most promising uses of the virtual reality technology. While a lot of research has been done in the area of multi-user virtual environments corresponding to the sharing of events very few research has been done on specific services and functionality. However both the requirements and the kind of the offered services affect significantly the design of a system. In this paper we present the main issues in the design of a platform to support the distant education process using networked virtual environments. We also introduce the term Educational Virtual Environments and their basic requirements. According to these requirements of the educational virtual environments we propose both a suitable architecture and a protocol for the interaction between the components of this architecture.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Panic in the gallery: An online educational game for art history: Design and evaluation of a matching game",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388084/",
            "Abstract": "With the evolution of technology, social media and mobile devices, digital games have become a frequent form of entertainment for many people. As games can provide a fun environment, where students can actively learn content through actions and decisions, there are high hopes that game-based learning can be used both in and outside the classroom and yield positive learning outcomes. The aim of this study is to evaluate the effectiveness and enjoyment of a game created for art history learning, on adults of various ages, with a different art history background and game experience and to hopefully help educational game creators get closer to a balance between fun and learning.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "CSCL Techniques in Collaborative Virtual Environments",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=sekY2Iy5LdcC&oi=fnd&pg=PA139&dq=info:xQ0ha1gEiOQJ:scholar.google.com&ots=3EHhvnoDmo&sig=EXht37XpnO3QxuLTL-VKZ7-zKkg",
            "Abstract": "This chapter reviews and compares the most promising collaborative virtual environment platforms, which have been used or proposed for supporting educational activities in terms of their potential to support collaborative e-learning. The most promising environment according to the results of this review is Second Life. Second Life is further examined by validating the platform’s features, philosophy and policies against some basic design principles for collaborative virtual learning environments in order to better assess its design adequacy for online learning. Furthermore, the chapter will present the features that the authors have implemented within the Second Life platform, in order to facilitate both the jigsaw and fishbowl collaborative e-learning techniques. Finally, the authors will present a case study concerning the evaluation of Second Life by undergraduate students in order to assess its potential to support these collaborative e-learning techniques.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative virtual learning environments: design and evaluation",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-009-0289-5",
            "Abstract": "E-learning systems have gone through a radical change from the initial text-based environments to more stimulating multimedia systems. Such systems are Collaborative Virtual Environments, which could be used in order to support collaborative e-learning scenarios. The main aim of this paper is to aid educational designers in selecting, designing and evaluating three dimensional collaborative virtual environments in order to gain the pedagogical benefits of Computer Supported Collaborative Learning. Therefore, this paper initially discusses the potential of three dimensional networked virtual environments for supporting collaborative learning. Furthermore, based on a two-step platform selection process this paper (a) presents and compares three dimensional multi-user virtual environments for supporting collaborative learning and (b) validates the most promising solution against a set of design …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Einstellungen des Pflegepersonals zum computergestützten Demenz-Screening: Eine Validierung und Pilotstudie in einem Allgemeinkrankenhaus.",
            "Publication year": 2019,
            "Publication url": "https://pesquisa.bvsalud.org/portal/resource/fr/mdl-31641839",
            "Abstract": "BACKGROUND:Cognitive disorders such as dementia are common among older adults admitted to general hospitals. They can complicate treatment leading to longer hospitalization and worse outcomes. They often remain underdiagnosed as the busy routine of the hospital does not enable efficient screening and available screening instruments are not suitable for the hospital environment. Computerized cognitive testing (CCT) has been proposed as an efficient screening method as it can be employed by nonspecialists, such as nurses while featuring automatic scoring and interpretation of results.OBJECTIVE:This study validated a newly developed questionnaire for measuring the attitudes of Greek nurses towards computerized dementia screening. MATERIAL ANDMETHODS:The questionnaire was validated in a sample of 212 undergraduate psychology students and subsequently administered to a sample of 19 nurses working in a general hospital. Reliability of the questionnaire was calculated using Cronbach's alpha (= 0.762). Factor analysis revealed the existence of a single factor (acceptability-feasibility) that accounted for 33.73% of variance with an eigenvalue of 3.036.RESULTS:The total score of all the items loading on the single factor (acceptability-feasibility) was calculated. Scores ranged between 10 and 40 with the average score for the validation group being 29.33 (SDâ= 4.89) and the average score for the nurses' group being 29.50 (SDâ= 3.20).DISCUSSION:The questionnaire has acceptable reliability. Results indicate that acceptability-feasibility is high in both groups and there were no statistically significant differences …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Impact of online flexible games on students’ attitude towards mathematics",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s11423-017-9522-5",
            "Abstract": "This study examined the effects of using an online flexible educational game on students’ attitude towards mathematics as compared to the traditional method of solving mathematical problems. Moreover, the study assessed the learning effectiveness of the game and investigated potential gender differences in the game’s effectiveness on changing students’ attitude. The participants of the study were 79 students who were randomly assigned to a control and treatment group, as well as four coordinator teachers. The game was configurable and it was used as a supplementary teaching method. The intervention lasted 14 weeks and the data collection was based on quantitative measures and interviews. The results of the analysis indicated that the game approach was effective on improving students’ attitude towards mathematics and that it also resulted in better learning outcomes in the treatment group as …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Virtual Learning Communities-Theory and Practice: the Case of VirRAD []",
            "Publication year": 2003,
            "Publication url": "https://www.learntechlib.org/p/14986/",
            "Abstract": "In this paper we discuss the development of virtual communities and especially virtual learning communities, taking into account basic community requirements as well as social factors of e-learning. This paper has been inspired by the VirRAD European project and presents the intermediate results that have raised form the definition of a virtual community for the vocational training of radiopharmacists. We therefore present the user requirements that form the functional specification of such an environment along with the role model that provides a mindful but solid distribution of the access level in the system",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:738O_yMBCRsC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Steering Committee Chair",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753755/",
            "Abstract": "Conference organization Page 1 Steering Committee Chair Michael E. Auer, CTI, Villach, Austria \nGeneral Chair Thrasyvoulos Tsiatsos, Aristotle University of Thessaloniki, Greece Conference \nChair Mudasser F. Wyne, National University, San Diego, California, USA International Chairs \nSamir A. El-Seoud, The British University in Egypt (Africa) Kumiko Aoki, Open University, \nJapan (Asia) Alexander Kist, University of Southern Queensland, Australia (Astralia/Oceania) \nDoru Ursutiu, University Transylvania Brasov, Romania (Europe) Arthur Edwards, Universidad \nde Colima, Mexico (Latin America) David Guralnick, Kaleidoscope Learning New York, USA \n(North America) Technical Program Chairs Lu Zhang, National University, San Diego, \nCalifornia, USA Sebastian Schreiter, IAOE, France IEEE Liaison Russ Meier, IEEE Education \nSociety Meetings Chair Workshop, Doctoral Consortium, Tutorial and Special Sessions , , -…",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large-scale deployment of distance education in computer science at the Hellenic Open University",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKL.2008.020669",
            "Abstract": "This paper presents experiences related to the introduction of educational technologies in a situation involving a large number of students. We argue that significant differences exist between pilot use and large-scale deployment of educational technologies. To support our case, we present the experiences from the gradual introduction of educational technologies in a module of a computer science course involving 1242 students and 40 tutors, all relying on these technologies.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:r0BpntZqJG4C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "New Era of the Nano-Electronic Devices–One of the Most Adaptive Learning Areas for the Next Period",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=cD_8DwAAQBAJ&oi=fnd&pg=PA25&dq=info:Guz-3p0y658J:scholar.google.com&ots=u5IGFZOa15&sig=8NQxXx-TA0KYT2tCXsPniUJ3iN8",
            "Abstract": "The Moore’s law rigorously fulfilled and in 2021 the CMOS technology seems to reach its ultimate limit. What’s next? All specialists anticipate that a circuit from 2031 will not keep the same performances offered by the last 2.5 nm CMOS from 2021. Proposals are multiple, alternative nano-devices are well-known, nanoscale technologies open amazing future facilities. Confluence of nano-electronics with organic semiconductors and biomaterials seems to be inherent. The paper intends to reply to this extraordinary challenging.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Research on E-learning and ICT in Education: Technological, Pedagogical and Instructional Perspectives",
            "Publication year": 2021,
            "Publication url": "https://scholar.google.com/scholar?cluster=14153333766894984420&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:e_rmSamDkqQC",
            "Publisher": "Springer"
        },
        {
            "Title": "CSCL Techniques in Collaborative Virtual Environments: The Case of Second Life",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/63145",
            "Abstract": "This chapter reviews and compares the most promising collaborative virtual environment platforms, which have been used or proposed for supporting educational activities in terms of their potential to support collaborative e-learning. The most promising environment according to the results of this review is Second Life. Second Life is further examined by validating the platform’s features, philosophy and policies against some basic design principles for collaborative virtual learning environments in order to better assess its design adequacy for online learning. Furthermore, the chapter will present the features that the authors have implemented within the Second Life platform, in order to facilitate both the jigsaw and fishbowl collaborative e-learning techniques. Finally, the authors will present a case study concerning the evaluation of Second Life by undergraduate students in order to assess its potential to support …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Exploiting web conferencing to support collaborative learning",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065068/",
            "Abstract": "This paper examines whether it is possible for web conferencing platforms to support collaborative learning scenarios. Two web conferencing platforms, an open source and a commercial one, are compared and evaluated in two case studies in tertiary education. The final conclusion of this study is that both platforms are capable of supporting collaborative learning activities with great success.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Integrated Platform for Educational Virtual Environments",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/chapter/web-based-intelligent-learning-systems/31372",
            "Abstract": "In this chapter, we present the design and implementation of an integrated platform for Educational Virtual Environments. This platform aims to support an educational community, synchronous online courses in multi-user three-dimensional (3D) environments, and the creation and access of asynchronous courses through a learning content management system. In order to offer synchronous courses, we have implementeda system called EVE-II, which supports stable event sharing for multi-user 3D places, easy creation of multi-user 3D places, H. 323-based voice-over IP services fully integrated in a 3D space, as well as many concurrent 3D multi-user spaces.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:BqipwSGYUEgC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Building reusable and interactive e-learning content using Web",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45200-3_46",
            "Abstract": "This paper presents the design of a web-based learning content authoring tool as well as the way learners can access courseware material, within the scope of a personalized, yet social, learning environment for vocational training. The authoring tool is intended to be part of the instructional component of the VirRAD European project, where the learning process is inspired by the principles of the Mindful Learning theory and supported by an intelligent learner modelling system. It will enable the creation of Radiopharmacy-related learning content that can be easily accessed and reused. In addition, it will facilitate the monitorship of the users’ learning activities.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Implementation and evaluation of a game using natural user interfaces in order to improve response time",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359557/",
            "Abstract": "This paper presents the development and evaluation of an active video game in order to enhance reaction time of tennis athletes. The paper focuses on the perspective of the athletes and investigates the hypothesis whether or not they can get an improvement by practicing with that. Another goal of this paper was to investigate the difference between expert and inexperienced athletes in terms of general usability, usefulness, and user interface satisfaction. Overall, athletes were to a large extent satisfied with their gaming experience, rating the game as, easy to understand and learn and very satisfying. Moreover, it was concluded that the game doesn't affect the reaction time of inexperienced athletes only, but both groups had the same improvement.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Greek traditional dances 3D motion capturing and a proposed method for identification through rhythm pattern analyses (Terpsichore Project)",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Mounir-Elatrachi/publication/339812910_Determinants_of_ICT_Integration_by_Teachers_in_Higher_Education_in_Morocco/links/5ec31c49299bf1c09ac8f187/Determinants-of-ICT-Integration-by-Teachers-in-Higher-Education-in-Morocco.pdf#page=650",
            "Abstract": "Intangible cultural heritage (ICH) includes the practice, representation, expression, knowledge, or skill, as well as the instruments, objects, artifacts, and cultural spaces that are considered by UNESCO to be part of a place’s cultural heritage. Intangible cultural heritage is considered by the Member States of UNESCO in relation to the tangible World Heritage focusing on intangible aspects of culture. Terpsichore project aims to, analyse, design, research, train, implement and validate an innovative framework for low cost digitisation, modelling, archiving, e-preservation and presentation of ICH content related to traditional dances, in a wide range of users. The Department of Physical Education and Sport Sciences of the Aristotle University of Thessaloniki was involved in the performance of Greek traditional dances and the three-dimensional capturing. We performed three-dimensional recordings at the Laboratory of “Motor Behaviour and Adapted Physical Activity”. For data capturing, we used the Vicon 3D recording system. Six traditional Greek dances from different regions of Greece were performed and captured. The results of the three-dimensional capturing of movement showed that the assessment of foots’ movement through markers gives us the ability to identify Greek traditional dances. Finally, we distributed data from the recordings to the project partners in order to further analyse them for the fulfilment of the project objectives. With the completion of Terpsichore project, a bundle of services will have been created, including virtual and augmented reality applications, interactive maps, presentation and learning of traditional European dances …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:ipzZ9siozwsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Exploitation of Croquet CVE Platform for supporting Collaborative e-Learning Environments",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.372.7722&rep=rep1&type=pdf",
            "Abstract": "This paper reviews the features of five 3 dimensional networked virtual environments which support collaborative learning applications, through the comparison of the tools and services they offer. Following that, we justify our choice of platform, which is the Croquet platform, and discuss design and implementation issues. Finally we present the results of the evaluation process of the virtual environment we developed, which consisted of the participation of twelve postgraduate students who completed questionnaires regarding its applicability in education.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting Broadband Growth in an Interregional Level: The Case of Greece-Italy Partnership",
            "Publication year": 0,
            "Publication url": "http://broadband.cti.gr/en/download/3150Teleaccess2008_Bouras.pdf",
            "Abstract": "Broadband is a key element of the developments that are taking place in the electronic communications markets and the European Commission has been particularly active in promoting broadband developments. This paper presents the objectives and the methodology of a project for supporting the broadband growth in an Interregional Level between regions of Italy and Greece. Main target of the project is the technology and knowhow transfer (relative to broadband) to SMEs (Small and Medium Enterprises) and the demonstration of broadband advantages and benefits.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pedagogical agents in 3D learning environments",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/pedagogical-agents-in-3d-learning-environments/112673",
            "Abstract": "BackgroundPAs inherit the main attributes of the intelligent agents. Figure 2, graphically presents the hierarchical analysis of 3D intelligent PAs' structure. As mentioned above, PAs in 3D learning environments, have to fulfil a more sophisticated role that aims to combine issues arising from different research areas, such as: pedagogy and educational psychology, artificial intelligence, virtual reality, human computer interaction.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "10. The Virtues of Taiwanese Internet-Using Adolescents: The Development and Validation of the Cyber Virtues Scale",
            "Publication year": 2018,
            "Publication url": "https://www.learntechlib.org/j/JOETS/v/21/n/1/",
            "Abstract": "This paper reports the findings of a field experiment that gamified the classroom experience of elementary school ESL students by implementing digital badges-and-points which students could earn by... More",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Creative thinking experimentations for entrepreneurship with a disruptive, personalised and mobile game-based learning ecosystem",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359617/",
            "Abstract": "Based on an unprecedented need of stimulating creative capacities towards entrepreneurship to university students and young researchers, this paper introduces and analyses a smart learning ecosystem for encouraging teaching and learning on creative thinking as a distinct feature to be taught and learnt in universities. The paper introduces a mashed-up authoring architecture for designing lesson-plans and games with visual learning mechanics for creativity learning. The design process is facilitated by creativity pathways discerned across components. Participatory learning, networking and capacity building is a key aspect of the architecture, extending the learning experience and context from the classroom to outdoor (co-authoring of creative pathways by students, teachers and real-world entrepreneurs) and personal spaces. We anticipate that the smart learning ecosystem will be empirically evaluated and …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AICT 2010",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5489722/",
            "Abstract": "[Front cover] - IEEE Conference Publication IEEE.org IEEE Xplore IEEE-SA IEEE Spectrum More \nSites Create Account Personal Sign In Personal Sign In For IEEE to continue sending you helpful \ninformation on our products and services, please consent to our updated Privacy Policy. I have read \nand accepted the IEEE Privacy Policy. Accept & Sign In Email Address Password Sign In Forgot \nPassword? [Front cover] Abstract: Presents the front cover or splash screen of the proceedings. \nPublished in: 2010 Sixth Advanced International Conference on Telecommunications Article #: Date \nof Conference: 9-15 May 2010 Date Added to IEEE Xplore: 21 June 2010 ISBN Information: \nElectronic ISBN: 978-1-4244-6749-5 Print ISBN: 978-1-4244-6748-8 CD: 978-0-7695-4021-4 \nINSPEC Accession Number: Persistent Link: \nhttps://xplorestaging.ieee.org/servlet/opac?punumber=5488876 More » Publisher: IEEE IEEE …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual collaboration spaces: the EVE community",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1183032/",
            "Abstract": "An Educational Virtual Environment (EVE) is an instance of a Collaborative Virtual Environment (CVE), which focalises in providing collaborative, as well as educational, functionalities, such as synchronous and asynchronous e-learning services. This paper describes such an educational virtual community, which aims to meet the requirements of a virtual collaboration space and furthermore to support e-learning services. In particular, we are developing a Web-based system, which allows users to communicate with the other members of the community through forums, chat, e-mail, to schedule events which take place in the learning environment and to join, and even create, courses, which are held in 3D multi-user worlds where users are represented by avatars. These characteristics offer extended functionalities such as support of application sharing and voice chat, transmission of the educational material as well …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Broadband municipal optical networks in Greece: A suitable business model",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0736585309000161",
            "Abstract": "This paper proposes a business model for the optimal exploitation of the currently developing broadband metropolitan area networks in Greece. Having recorded and examined relevant international practices, we describe in detail the way that these networks should be managed, operated, maintained and expanded. Taking into consideration that these infrastructures will widely alter the broadband map of Greece, that Greece has currently one of the lowest broadband penetration percentages in Europe and that the proper exploitation strategy of the networks to be deployed could boost the demand for broadband connections and applications, the application of the optimal business model appears to be of vital importance. We describe the proposed business model in detail, including ways for expanding the broadband infrastructures, as well as tackling of viability issues regarding the authority responsible for …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:qjMakFHDy7sC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A Serious Game Approach in Mitigating Performance Enhancement Culture in Youth (GAME Project)",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11932-4_68",
            "Abstract": "Anti-doping education is currently at an early stage and there are several needs that must be addressed with respect to the design, implementation, and evaluation of anti-doping education programmes. Firstly, anti-doping education should be based on state-of-art learning pedagogies that will enable effective engagement, learning and retention of the learned material. Secondly, currently there is a lack of such a systematic approach for evaluating the behavior change outcomes of anti-doping educational interventions. Thirdly, there is a lack of other known anti-doping educational interventions that promote a positive approach to doping prevention. Finally, anti-doping educational interventions should incorporate the learning process in the context of new learning technologies that can also facilitate behavior change outcomes.The aim of this study is to present highlight the importance of anti-doping …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Developing Communities of Practice to Maximize the Usability and Impact of Clean Sport Education in Europe: IMPACT Project",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_99",
            "Abstract": "Over the last decade, the European Commission, the World Anti-Doping Agency and the International Olympics Committee have made significant investments for the development of evidence-based anti-doping education. Although this is an important step towards eliminating doping in amateur and professional, elite sport, still most of the existing projects operate in a fragmented manner and there is a considerable lack of synergies. Consequently, there has been little consideration of effective ways to manage and sustain the knowledge created in this area in ways that will further maximize and sustain the usability and impact of existing anti-doping education initiatives. For this purpose, project IMPACT was developed in order to deliver, for the first time, multi-stakeholder Communities of Practice for Clean Sport Education across Europe. Through the implementation of face-to-face and web-based communities of …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "VEAI 2015 Organizing and Program Committees",
            "Publication year": 0,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/cit-iucc-dasc-picom/2015/07363023/12OmNqJZgyn",
            "Abstract": "VEAI 2015 Organizing and Program Committees IEEE.org Help Cart Jobs Board Create Account \nToggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center \nPress Room Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer \nSociety Digital Library My Subscriptions Magazines Journals Conference Proceedings \nInstitutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center \nPress Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover \nImage Download 1.Home 2.Proceedings 3.cit-iucc-dasc-picom 2015 VEAI 2015 Organizing \nand Program Committees 2015, pp. cii-cii, DOI Bookmark: 10.1109/CIT/IUCC/DASC/PICOM.\nKeywords Authors Abstract Provides a listing of current committee members and society \nofficers. ,VEAI 2015 Organizing ,and Program Committees , , ,Workshop Chairs ,, of , ,, …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative E-learning techniques: Learning management systems vs. multi-user virtual environments",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/collaborative-learning-techniques/53494",
            "Abstract": "This chapter compares the potential of Learning Management Systems (LMSs) and Multi-User Virtual Environments (MUVEs) to facilitate the implementation of traditional face to face collaborative learning techniques in an online environment and discusses the benefits and challenges of an integrated approach. Initially, the chapter focuses on the application of collaborative learning techniques in traditional and computer supported didactical settings. Following this, the practice of utilizing LMSs in the contemporary educational process is analyzed, and the use of MUVEs in order to facilitate collaborative learning at a distance is subsequently presented. Ultimately, the chapter aims to clarify how the fruitful combination of these two technological approaches to the collaborative learning pedagogy can both diminish their weaknesses and amplify their strengths. For this reason, the final section of the chapter focuses on …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:aqlVkmm33-oC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Impact Assessment and Retention Rate of MOOCs for Supporting Dual Career of Athletes",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qYkiEAAAQBAJ&oi=fnd&pg=PA257&dq=info:4LL-_S9EiGgJ:scholar.google.com&ots=CeTdm70jBn&sig=aLdLYzukf7xMFHm_19CMZNNRZkI",
            "Abstract": "In the last 30 years, there has been an increase of professionalism in sports and with this, the interest in the scientific approach to training and recovery of elite athletes has increased (Kellmann et al. 2018). The elite sports organizations such as championship teams and sports federation teams mainly aim at high performance in the competition (Mayer and Thiel 2018). The situations for high performance have changed spectacularly. Athletes need to give more time to training and competition and continue to respond to some limitations such as studying, spending time with their family or friends and having a quality of life (Burlot et al. 2018). Athletes’ workload has increased reaching full-time occupation including training hours, competition, travel time and study requirements. Depending on the type of sport, elite sports career may last 5 to 10 years (Alfermann and Stambulova 2007). In this vein, athletes aiming to better prepare for future employment have to keep a balance between their studies and their sports career (Aquilina 2013). Most studies about athletic career, examined career development, professional transitions, and especially the retirement after sports career (Stambulova et al. 2009, 2020). Current research reveals the need for a holistic approach, highlighting that athletes have to deal with several transitions in sport, their studies and their psycho-social development (Debois et al. 2014; Wylleman and Lavallee 2004) and to reach this holistic approach the research in dual career for athletes is essential and represents a growing area of study (Condello et al. 2019; Aquilina and Henry 2010; Burnett 2010).",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:LI9QrySNdTsC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "The Challenges of the Digital Transformation in Education: Proceedings of the 21st International Conference on Interactive Collaborative Learning (ICL2018)-Volume 1",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=6jeNDwAAQBAJ&oi=fnd&pg=PR5&dq=info:x9rRF5mVY3oJ:scholar.google.com&ots=Y7Ka9ZcQWN&sig=jRsPV8vfJ6Cf1gWKFBBkdtOs67Y",
            "Abstract": "This book offers the latest research and new perspectives on Interactive Collaborative Learning and Engineering Pedagogy. We are currently witnessing a significant transformation in education, and in order to face today’s real-world challenges, higher education has to find innovative ways to quickly respond to these new needs. Addressing these aspects was the chief aim of the 21st International Conference on Interactive Collaborative Learning (ICL2018), which was held on Kos Island, Greece from September 25 to 28, 2018. Since being founded in 1998, the conference has been devoted to new approaches in learning, with a special focus on collaborative learning. Today the ICL conferences offer a forum for exchanging information on relevant trends and research results, as well as sharing practical experiences in learning and engineering pedagogy. This book includes papers in the fields of:* Collaborative Learning* Computer Aided Language Learning (CALL)* Educational Virtual Environments* Engineering Pedagogy Education* Game based Learning* K-12 and Pre-College Programs* Mobile Learning Environments: Applications It will benefit a broad readership, including policymakers, educators, researchers in pedagogy and learning theory, school teachers, the learning industry, further education lecturers, etc.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:2KloaMYe4IUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Detection of mild cognitive impairment in an at-risk group of older adults: Can a novel self-administered serious game-based screening test improve diagnostic accuracy?",
            "Publication year": 2020,
            "Publication url": "https://content.iospress.com/articles/journal-of-alzheimers-disease/jad200880",
            "Abstract": "Background:Literature supports the use of serious games and virtual environments to assess cognitive functions and detect cognitive decline. This promising assessment method, however, has not yet been translated into self-administered screening instruments for pre-clinical dementia.Objective:The aim of this study is to assess the performance of a novel self-administered serious game-based test, namely the Virtual Supermarket Test (VST), in detecting mild cognitive impairment (MCI) in a sample of older adults with subjective memory complaints (SMC), in comparison with two well-established screening instruments, the Montreal Cognitive Assessment (MoCA) and the Mini-Mental State Examination (MMSE).Methods:Two groups, one of healthy older adults with SMC (N= 48) and one of MCI patients (N= 47) were recruited from day centers for cognitive disorders and administered the VST, the MoCA, the MMSE …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:hMsQuOkrut0C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Designing Conversational Agent Interventions that Support Collaborative Chat Activities in MOOCs.",
            "Publication year": 2019,
            "Publication url": "http://ceur-ws.org/Vol-2356/research_short11.pdf",
            "Abstract": "Although conversational agent technology has matured over time, there is still a need for research on how agents can appropriately add value to real-world technological learning environments. This paper presents an ongoing research effort towards the design of low-cost, reusable conversational agents that deliver unsolicited interventions during online chat-based activities. These interventions aim at helping learners sustain a productive peer dialogue in the context of online courses. We expect this work to enlighten researchers, conversational interface designers and bot developers on the potential of conversational agents in serving as automated facilitators of synchronous collaborative learning in MOOCs.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing an adaptive serious game based on students' bio-feedback",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7387975/",
            "Abstract": "This paper describes the design and development of an educational game that is adapted based on the psychophysiological measures of the player. The particular measurements are collected using a bio-feedback device and they consist of skin conductance, skin temperature, and heart rate. The adaptation of the game aims to increase the engagement of the players by making the game more challenging when they are feeling bored or nervous. The proposed system will be evaluated in a series of activities in tertiary education.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Frontiers in education 2011",
            "Publication year": 0,
            "Publication url": "http://archive.fie-conference.org/fie2011/Pages/reviewers.pdf",
            "Abstract": "This year FIE2011 had over 720 papers/presentations submitted for consideration. The final conference program contains 424 paper/presentations. The FIE2011 Program Committee wishes to thank the following 623 individuals for acting as abstract/paper reviewers. The program committee asked these individuals to help control the quality of the presentations at this year's conference by reviewing the submissions for FIE2011. Their outstanding effort has helped maintain the high standard that has become the reputation of each FIE conference.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gamification of Midterm Examinations Using a Dynamic 3D Multiuser Game: What's the Impact?",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=IedEBQAAQBAJ&oi=fnd&pg=PA372&dq=info:qxUolyhXczAJ:scholar.google.com&ots=bGXlZY0l43&sig=x4Bh1RJeoHx6jndH-yGtiUDgPuA",
            "Abstract": "This study investigates the efficiency of using a dynamic 3D multiuser game as a midterm evaluation tool that replaces the traditional paper‐based examination procedure. The participants of the study were 89 students in tertiary education consisting of 73 male students and 16 female students and their ages ranged from 18 to 20. The intervention lasted 5 weeks and took place in the context of a computer science course in collaboration with a professor. The research design that was implemented in this study was based on the “One‐Shot” model. The game that was used as a treatment belonged to the category of the treasure hunt quiz games. The game was dynamic and therefore the educator was able to customize parameters and content using an administration panel. The goal of the game for students was to find hidden objects that contain multiple choice questions and then answer them correctly. The results from the data analysis showed that there was a statistically significant correlation between the performance of the students on the game and their performance on the final paper‐based examination.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:f2IySw72cVMC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Case Study: Integrating Computational Thinking into the Introductory Course of Computer Science via the Use of the Programming Language Python",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_52",
            "Abstract": "The purpose of this study is the integration of computational thinking in the introductory course “Introduction to Computer Science” of Aristotle University of Thessaloniki. After the publication of Jeanette Wing’s innovative article, computational thinking became of interest for the educational community and nowadays is considered as important as writing, reading and arithmetic. This research attempts to integrate the computational thinking skill in the introductory course of the Computer Science department. In order for this goal to be achieved and its results to be as good as possible, the related literature was looked into, for the lesson to meet, specifically the part of which is dealing with the computational thinking concepts, the formal and informal criteria that have been set. For the purposes of the research some presentations were developed based on four fundamental concepts of computational thinking …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards integrating conversational agents and learning analytics in MOOCs",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75928-9_98",
            "Abstract": " Higher Education Massive Open Online Courses (MOOCs) introduce a way of transcending formal higher education by realizing technology-enhanced formats of learning and instruction and by granting access to an audience way beyond students enrolled in any one Higher Education Institution. However, although MOOCs have been reported as an efficient and important educational tool, there is a number of issues and problems related to their educational impact. More specifically, there is an important number of drop outs during a course, little participation, and lack of students’ motivation and engagement overall. This may be due to one-size-fits-all instructional approaches and very limited commitment to student-student and teacher-student collaboration. This paper introduces the development agenda of a newly started European project called “colMOOC” that aims to enhance the MOOCs experience by …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An Educational Community Using Collaborative Virtual Environments",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=13841409070255579240&hl=en&oi=scholarr",
            "Abstract": "The use of Collaborative Virtual Environments in e-learning is one of the most promising uses of the virtual reality technology. While a lot of research has been done in the area of collaborative virtual environments corresponding to the sharing of events, very little research has been done on specific services and functionality. However both the requirements and the kind of the offered services affect significantly the design of a system. In this paper we present an Educational Community to support e-learning services using Collaborative Virtual Environments from both the technical and functional point ofview.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Best Practices Worldwide for Broadband Growth",
            "Publication year": 2006,
            "Publication url": "http://broadband.cti.gr/en/download/Broadband_Europe_Bouras_2006.pdf",
            "Abstract": "This paper investigates and analyses the best practices followed by various countries worldwide for supporting the broadband growth. The methodology used to locate the best practices is based on three main steps:(a) the presentation of the main factors that have a major impact on broadband growth;(b) the definition of what is a “best practice” based on quantitative criteria;(c) the calculation of a best practice index and a good practice index, which indicates that a country followed these best or good practices to support its broadband growth respectively. This methodology indicated that Denmark, United States, Japan, Canada and Rep. of Korea followed best practices for their broadband growth, while United Kingdom and the Netherlands followed good practices.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Architectures supporting e-learning through collaborative virtual environments: the case of INVITE",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/943842/",
            "Abstract": "The growing need for communication, visualization and organization technologies in the field of e-learning environments has led to the application of virtual reality and the use of collaborative virtual environments. The paper presents a system architecture to support such environments, defined by user needs and using state of the art technologies.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Full length articles",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=13921339025866370026&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Instructional mirroring applied in basketball shooting technique",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_59",
            "Abstract": "Human posture recognition is a very promising field of computer vision and it is applied in the areas of personal health care, human-computer-interaction, sports etc. In this paper a non-contact view-based approach of human body movement analysis is introduced using Microsoft Kinect V2 sensor. Moreover, there is a developing interdisciplinary scientific field which is trying to integrate modern technology into sports. Computer technology may prove a valuable supportive tool for (a) athletes of all ages to improve their technical skills, and (b) advanced coaching.The aim of this study is to integrate educational technology and sports in order to support the training of young athletes and boost their performance. This research utilizes Kinect V2 as a 3D depth camera in order to apply body tracking of a young athlete during a shooting attempt. The shooting movement is mirrored to the computer screen …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Views of nursing staff on computerized dementia screening",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s00391-019-01633-0",
            "Abstract": "Cognitive disorders such as dementia are common among older adults admitted to general hospitals. They can complicate treatment leading to longer hospitalization and worse outcomes. They often remain underdiagnosed as the busy routine of the hospital does not enable efficient screening and available screening instruments are not suitable for the hospital environment. Computerized cognitive testing (CCT) has been proposed as an efficient screening method as it can be employed by nonspecialists, such as nurses while featuring automatic scoring and interpretation of results.This study validated a newly developed questionnaire for measuring the attitudes of Greek nurses towards computerized dementia screening.The questionnaire was validated in a sample of 212 undergraduate psychology students and subsequently administered to a sample of 19 …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Springer Medizin"
        },
        {
            "Title": "A dynamic management scheme for DVEs",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S108480451000161X",
            "Abstract": "Advances in computer technology and networking infrastructures in combination with advanced applications and services, have expanded the adoption of distributed virtual environments and promoted their use in a wide range of areas, such as learning and training, collaborative work, military applications and multiplayer online games. The characteristics and requirements of such DVEs differ significantly given the diverse objectives, scope and context that each virtual world aims at supporting. However, one common characteristic of DVEs is their dynamic state with users entering and leaving the system randomly, resulting in changes of the requirements for the DVE system. These changes require effective load distribution and management of the communication cost so that consistency is always maintained. This paper presents a dynamic management approach for DVEs driven by the diversity of different …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Work in Progress. SportSWARES, Towards an Intelligent Way of Physical Training",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_48",
            "Abstract": " There is a developing interdisciplinary research field trying to provide advanced technological support to various sports activities. This support is focused mainly to professional elite athletes but is considering also about training in sports academies, gyms even about amateur athletes practicing at home. Advanced training can now be carried out using low-cost technology that can produce useful data for researchers and coaches. Sports data collected from athlete’s skeletal tracking, movement analysis and physiological measurements may prove a valuable tool for motor and technical skills development. In addition, there is an increasing interest from coaches and sports academies to enrich sport activities by utilizing the use of serious exer-games and applications of augmented reality in order to provide a more intelligent, personalized and immersive training environment. In this paper a smart platform is proposed …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Performance evaluation of a dynamic approach for networked servers distributed virtual environments",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.144.5265&rep=rep1&type=pdf",
            "Abstract": "Christos Bouras1, 2, Eri Giannaka1, 2, Thrasyvoulos Tsiatsos3 1Research Academic Computer Technology Institute, Greece 2Computer Engineering and Informatics Department, University of Patras, Greece 3Department of Informatics, Aristotle University of Thessaloniki, Greece bouras@ cti. gr, giannaka@ cti. gr, tsiatsos@ csd. auth. gr",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying best practices for supporting broadband growth: Methodology and analysis",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S108480450900040X",
            "Abstract": "This paper presents a methodology for identifying best practices followed by various countries worldwide for supporting broadband growth. It also investigates and analyzes these practices using data concerning broadband penetration, access technologies, market, prices and services for OECD countries during the period 2004–2006. The methodology used to locate the best practices is based on three main steps: (a) the presentation of the main factors that have a major impact on broadband growth; (b) the definition of what is a “best practice” based on quantitative criteria and (c) the calculation of a best practice index and a good practice index, which indicates that a country followed these best or good practices to support its broadband growth, respectively. This methodology indicated that Denmark, United States, Japan, Canada and Republic of Korea followed best practices for their broadband growth, while …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Designing cognitive exercises to support patients with AD: The case of ASPAD",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=IedEBQAAQBAJ&oi=fnd&pg=PA248&dq=info:4HKV4MF_iZoJ:scholar.google.com&ots=bGXlZY0mX5&sig=7lYUM0-cbAkoJ7DcYn9cJizACtY",
            "Abstract": "ASPAD (Augmentation of the Support of Patients suffering from Alzheimer’s Disease and their caregivers) is a national project which provides a holistic support of patients suffering from Alzheimer’s Disease (AD) by augmenting the care of the patients, services for the people affected and their families. One of the main objectives of the ASPAD project is to transform traditional paper‐based cognitive exercises in an electronic form by developing advanced software exercises. Following this objective, we have designed and developed a series of computer‐based cognitive exercises. Computer assisted cognitive rehabilitation has been a rather promising method to improve cognitive performances in AD patients. It has been reported that cognitive exercises can improve cognition or at least slow down the progression of cognitive decline in patients. The computer‐based cognitive exercises have been proved more effective than the classic exercises of mental stimulation especially because they can bee adaptive and flexible according the patient’s difficulties or to the patient’s performance. In order to evaluate the effectiveness of the proposed exercises in the ASPAD project, 61 patients (from Day Care Centers for patients with AD) have participated in 48 solving exercises sessions. Preliminary results concerning the difficulties that the patients have faced during the sessions could provide the basis to improve the user interface and user experience elements of the exercises. In this paper, we present briefly (a) the main types of the cognitive exercises based on their user interface and user experience elements,(b) statistics relating the average exercise …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Panagiotis Zervas",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359540/",
            "Abstract": "Reviewers Page 1 Salam Abdallah Samir Akhrouf Panagiotis Antoniou Carmelo Ardito \nHasan Aydogan Marianne Amir Azer Isabel Azevedo Panagiotis Bamidis Morad Benyoucef \nAzeddine Bilami Billis Billis Abdelhak Boubetra Christos Bouras Santi Caballe Youssef \nChahir Chin-Ling Chen Chi-Hua Chen Fran Cornelius Geoffrey Crisp Helen Crompton \nThanasis Daradoumis Rhena Delport Monica Divitini Roza Dumbraveanu Ian Dunwell \nMartin Ebner Anastasios A. Economides Daphne Economou Arthur Edwards Luis \nFernandez-Luque Golberi de Salvador Ferreira Bouchra Frikh Danilo G. Zutin Katerina \nGeorgouli Gheorghita Ghinea Michail Giannakos Carlo Giovannella Agueda Gras \nVelazquez Mariluz Guenaga Christian Guetl David Guralnick Saad Harous Thanos \nHatziapostolou Ligang He Davinia Hernández-Leo Jenq-Muh Hsu Ahmed Imran George S. \nIoannidis Pedro Isaias Charalampos Karagiannidis Kerr I …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conversational agents as group-teacher interaction mediators in MOOCs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8534686/",
            "Abstract": "This paper presents the colMOOC project perspective for integrating a conversational agent service in Massive Open Online Courses (MOOCs) to facilitate peer dialogue during chat-based activities. Furthermore, it provides high level system architecture to highlight key aspects of the technology infrastructure and the functionality of the software system. The rationale of the approach follows the tenets of several converging theoretical perspectives emphasizing the value of learners' dialogue and constructive argumentation as knowledge building processes during collaborative activities. The MOOC teacher (domain expert) is expected to play a key role by entering in the system conceptual links that guide the agent to make relevant questioning interventions. Thus, the agent tool is mediating group-teacher interactions in a MOOC environment aiming to increase the transactive quality of peer dialogue. The paper …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Welcome Message 2 nd International Workshop on Adaptive Systems for Collaborative Learning (IWASCL-2010)",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5702163/",
            "Abstract": "elcome to the IWASCL-2010 workshop! This workshop is the second in a series that began on 2009 with the successful organization of the 1st IWASCL in the context of INCoS-2009 conference in Barcelona, Spain. This year the 2nd edition of the workshop is organized again in conjunction with the INCoS conference in Thessaloniki, Greece. The focus of the workshop is on adaptive systems for collaborative learning. Lately, a significant research interest has emerged on how to integrate adaptive and intelligent methods in computer-supported collaborative learning (CSCL) systems to successfully support groups of learners. Adaptive and intelligent support emerges as an important aspect in CSCL since research has consistently emphasized that free collaboration conditions fail to engage all team members in productive learning interactions and, conversely, excessively imposed non-adaptive (“fixed”) guidance may …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teleconference in support of distance learning: Views of educators",
            "Publication year": 2013,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/openjournal/article/view/9806",
            "Abstract": "In this study we recorded the views of the educators that use teleconference as an educational medium to support distance learning. The data were collected using the semi-structured interview and the results showed that teleconferencing could be a strong complementary tool to support flexible learning as well as distance education, by enhancing the interaction among learners. All the interviewees consider teleconference as a\" helpful assistant\" in the educational process and suggested that the educators should be well prepared before the tele-lecture, as well as prepare and guide the learners in order to conduct a smooth teleconferencing session. From the interviews, several advantages and disadvantages of the teleconference’s use as an educational tool emerged. The main advantages consist of the independence of space",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MOOCs in Higher Education: A Study on the Learning Effectiveness, Quality and Usability of a SPOC on Introduction to Programming",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3437120.3437272",
            "Abstract": "In most Universities today, the sheer size of students in a single class and the limited time for on-campus lessons or activities limit the learning experience for both students and professors. Small Private Online Courses (SPOCs), which are Massive Open Online Courses (MOOCs) used locally to support certain groups of learners, can be a practical solution to this problem. Previous studies included only self-reported data to measure students' satisfaction and learning experience on SPOCs. There is also little longitudinal research on how SPOC-supported blended learning affects students' academic performance. This paper presents a SPOC on Introduction to Programming and explores its learning effectiveness, perceived course quality, perceived educational experience, and platform usability for on-campus Computer Science students. A total of 454 students were involved in a between-subjects study comparing a …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting students by using interaction analysis tools in educational group blogging: A Case study of the GIANT tool",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advanced bio-feedback and collaborative techniques to support caregivers of Alzheimer patients",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7057170/",
            "Abstract": "This paper describes a web-based framework to support caregivers of patients with dementia. Dementia is not a specific disease. It's an overall term that describes a wide range of symptoms associated with a decline in memory or other thinking skills severe enough to reduce a person's ability to perform everyday activities. Caregivers mainly face the problems such as (a) psychological pressure in a daily basis, (b) lack of knowledge and/or training about caring the patients and (c) lack of knowledge about the consequences of dementia in patients' behavior. These issues reveal the demand both for the support and the training for caregivers. Following this direction, we developed a web based framework to provide distant support for caregivers who are not able to participate in face to face sessions. This framework integrates services (i.e. teleconferencing, content management, learning management) and tools (such …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "International Journal of Game-Based Learning",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/pdf.aspx?tid%3D157300%26ptid%3D132066%26ctid%3D15%26t%3Dtable+of+contents",
            "Abstract": "Table of Contents Page 1 The International Journal of Game-Based Learning is indexed or \nlisted in the following: ACM Digital Library; Bacon’s Media Directory; Cabell’s Directories; \nDBLP; Google Scholar; INSPEC; JournalTOCs; MediaFinder; ProQuest Advanced \nTechnologies & Aerospace Journals; ProQuest Computer Science Journals; ProQuest \nIllustrata: Technology; ProQuest SciTech Journals; ProQuest Technology Journals; \nPsycINFO®; SCOPUS; The Standard Periodical Directory; Ulrich’s Periodicals Directory \nResearch Articles 1 Learning in Discussion Forums: An Analysis of Knowledge \nConstruction in a Gaming Affinity Space; Don Davis, University of Texas at San Antonio, \nSan Antonio, TX, USA Vittorio Marone, University of Texas at San Antonio, San Antonio, TX, \nUSA 18 The Impact of a Racing Feature on Middle School Science Students’ Performance \nin an Educational Game: The Effect of Content-Free --…",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual University and Gamification to Support Engineering Education.",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=11211854589900280296&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing Exergames for Working Memory Training Using MaKey MaKey",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_62",
            "Abstract": "Functioning at a higher cognitive level is becoming an increasing necessity over the years, as our society and especially the professional market demand individuals to perform as highly as they can for longer time periods. Starting from school and moving to a professional career, each person has to develop high cognitive skills in order to complete others. Enhancing and improving cognitive skills through cognitive training, is a promising field that becomes considerably important. A core cognitive function is memory and specifically working memory as its condition affects other cognitive functions. Training working memory through cognitive training programmes appears to be beneficial for people and affect their overall cognitive performance. In this work we describe the design process of a cognitive training computer game for increasing the working memory capacity combining the MaKey MaKey (MM …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluating a Coaching MOOC Course to Support Dual Career of Athletes",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_39",
            "Abstract": "This paper presents a case study evaluation results of a Coaching course on a MOOC to support dual career of athletes. The MOOC has been one of the most highly anticipated trends in higher education in recent years. Delivering web-based learning to potentially thousands of users at a time, it has dramatically expanded universities’ reach and provided an indirect income boost through greater global brand awareness. Sport coaching is as difficult and as demanding as any other aspect of sport. Good coaching and poor coaching often have impacts on the individual athlete or a team. According to the evaluation results this course is complete, well-structured and segmented, covering the most important parts of coaching.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:p__nRnzSRKYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Comparison of on Site versus Online Psycho Education Groups and Reducing Caregiver Burden",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/07317115.2021.1940409",
            "Abstract": "Objectives: The purpose of this project was to comparatively assess the benefit from the effects of the online versus onsite psychoeducative interventions on caregivers’ emotional burden, including their sense of burden, anxiety, and depression.Methods: Seventy-one caregivers of Patients with Dementia (PwD) were divided in two groups, the online versus the onsite, and participated in the 4-month psychoeducational group intervention. Psychosocial assessment was performed using Beck Anxiety Inventory, Beck Depression Inventory and Zarit Burden Interview before and after the intervention.Results: No significant differences were found between the online and onsite groups in anxiety (p = .531), depression (p = .577) and sense of burden (p = .623) after the interventions. Both interventions showed significant reductions across emotional variables measured over the course of the treatment study and treatment …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Evaluation framework for collaborative educational virtual environments",
            "Publication year": 2010,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.13.2.65.pdf",
            "Abstract": "In this paper we will focus on a specific category of Collaborative Virtual Environments that aims to support Collaborative Learning. We call these environments Collaborative Educational Virtual Environments. Our aim is to analyze the evaluation process through the study of relevant bibliography and by doing so reveal the existing research gap which fails to evaluate the twin nature of CEVEs. Our proposed framework aims to evaluate both the pedagogical and educational nature of a CEVE by incorporating two consecutive and recurrent cycles, each consisting of distinct evaluation phases. Furthermore, each phase is designed to address specific evaluation goals. Finally, the paper presents two case studies, applying the proposed theoretical methodology in a pragmatic 3D educational environment.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:UeHWp8X0CEIC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Business models for municipal broadband networks",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/business-models-municipal-broadband-networks/13614",
            "Abstract": "This article examines the most effective business model for the optimal exploitation of the currently developing broadband metropolitan area networks in various municipals around the globe. The proper exploitation strategy of the municipal broadband networks to be deployed could boost the demand for broadband connections and applications. The article describes the relevant, available business models in detail, including ways for broadband infrastructures’ expansion, and deals with viability issues, regarding the managing authority which is responsible for the broadband metropolitan networks. A business model, specifically in the current article, determines the way in which the exploitation of a metropolitan, community-owned, optical network will be effectuated. Municipalities may play a critical role in enabling the deployment of broadband infrastructures by the private sector (Government of Sweden, 2007):• …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A SIP Spatial Audio Server for the EVE Platform.",
            "Publication year": 2008,
            "Publication url": "http://users.auth.gr/tsiatsos/CD-Papers/6_Short_Papers/CS8.pdf",
            "Abstract": "When it comes to 3D Virtual Environments it is well known that 3D sound is of great importance to the whole interactive experience. The percept of sound is a major counterpart for the eyesight, since it describes the location, the momentum and the attitude towards the listener, of each surrounding entity. The sound can offer precision of spatial perception that cannot be achieved by the eye itself. Thus the support of 3D surround sound of high fidelity is mandatory for a 3D Virtual platform. The evolution of Internet telephony led to the introduction of new session establishment and management protocols. The most important of them, the Session Initiation Protocol (SIP), is a robust, lightweight reliable and fast application-layer control (signaling) protocol that is highly adopted for creating, modifying and terminating sessions. This protocol can be of extreme importance in establishing audio sessions for multi-user platforms. This paper presents the work done for developing a SIP 3D spatial audio server for a multi-user virtual environments platform, called EVE, in order to support 3D spatial audio.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Framework for H-Anim Support in NVEs.",
            "Publication year": 2009,
            "Publication url": "https://www.scitepress.org/Papers/2009/17787/17787.pdf",
            "Abstract": "Many applications of Networked Virtual Environment presuppose the users’ representation by humanoid avatars that are able to perform animations such as gestures and mimics. Example applications are computer supported collaborative work or e-learning applications. Furthermore, there is a need for a flexible and easy way to integrate humanoid standardized avatars in many different NVE platforms. Thus, the main aim of this paper is to introduce a procedure of adding animations to an avatar that is complying with H-Anim standard and to present a standardized way to integrate avatars among various NVEs. More specifically this paper presents a framework for adding/loading custom avatars to an NVE and applying to them a set of predefined animations, using H-Anim standard.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network-Based Distributed Learning Environment",
            "Publication year": 2000,
            "Publication url": "https://www.learntechlib.org/p/8001/",
            "Abstract": "Multimedia and hypermedia had and still have a tremendous impact on the evolution of educational software. Web-based systems have been shown to be useful tools for supporting educational communication for teachers and students. In this paper we present such a system, which is an Integrated Distributed Learning Environment (IDLE) for the implementation of the services of an educational network over TCP/IP networks such as the Internet. We present the technical description of this IDLE and we discuss its main characteristics such as the transmission of multimedia data over the network, the manipulation of the educational procedure, and the management of the users. In addition we list the functionalities of the IDLE and also discuss some implementation issues. Our proposal aims at providing an integrated communicational environment, which supplies the communicative needs of an educational community …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "X3D multi-user virtual environment platform for collaborative spatial design",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4279038/",
            "Abstract": "It is well known that both space and the spatial organization play an important role in our work and learning environments as well as in everyday life. There is a definite need for many persons to design their space along with an expert and to preview it in order to test its functionality. Many times there is a need for the inhabitants and workers to collaborate in order to co-design their space from distance. Multi-user 3D virtual environments are a powerful form of collaborative telecommunication applications, enabling the users to share a common three dimensional space and interact with each other as well as with the environment surrounding them, in order to collaboratively solve problems or aid learning processes. This paper presents the work done for extending a multi-user virtual environments platform, to support collaborative spatial design applications. Furthermore, a usage scenario is presented concerning the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Game based learning in mathematics: Teachers' support by a flexible tool",
            "Publication year": 2013,
            "Publication url": "http://users.auth.gr/users/4/7/043774/public_html/CD-Papers/5_Papers/C69.pdf",
            "Abstract": "The inherent difficulty of the core subject of Mathematics makes it hard for students of all ages to fully and sufficiently grasp its concepts and engage with it. With such an important matter still being unresolved, in this context, we propose a Game-Based Learning approach in order to assist the educational process. The main purpose of this paper is the presentation of the design and development of the configurable online two-dimensional (2D) game “Volcanic Riddles”. This particular game was designed in cooperation with educators, in order to support the teaching of Mathematics in primary school and the first grades of secondary school. The game is configurable in the sense that the (non-programmer) educator can easily alter several of its parameters, such as the content and total number of the game’s questions or images, via an administration website. Furthermore, the educator can choose which of the game's specific challenges wants to adapt according to the students' needs and level, and thus reuse the game in various educational contexts throughout the school year. Special attention was given so that the administration website is user-friendly and does not require any programming or scripting knowledge from the user. Regarding the game, basic features of educational games were incorporated in order to enhance its educational value and effectiveness. More specifically, this paper presents the steps followed for the implementation of the game, its technical aspects, as well as the first impressions and evaluation results after it was piloted in the field using real pupils and teachers. The assessment was focused on its usability …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:abG-DnoFyZgC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Student anxiety awareness through a bio-feedback device as a significant support to educational activities",
            "Publication year": 0,
            "Publication url": "http://universitypress.org.uk/library/2015/zakynthos/bypaper/COMPUTERS/COMPUTERS-14.pdf",
            "Abstract": "This paper describes an initiative in embedding students’ affective feedback (ie, frustration, boredom, anxiety and others) into learning tools and into emotional-appraisal learning models. The physiological reactions of the body such as conductivity of the skin, skin temperature, heart rate and respiration rate, produce bio-signals that can be classified into basic human emotional states. This work is the first approach in the direction of combining the cognitive models with the adaptive pedagogical patterns into a supportive reappraisal model. Anxiety state recognition and regulation may be approved an important factor in achieving better performance. This article describes our broad approach towards creating a modern and supportive learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating a Serious Game for Anti-doping on Adolescents",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-67209-6_59",
            "Abstract": "This paper presents the users’ evaluation results of TARGET (anTi-doping AwaReness Game for hEalthy lifesTyle), a Serious Game for supporting the Anti-Doping Awareness for a Healthy Lifestyle designed and implemented as part of GAME (A serious Game Approach in Mitigating performance Enhancement culture in youth). Particularly, the paper presents anti-doping in education via serious games, the game itself and the findings of use and enjoyment evaluation of the game in a group of 36 adolescents.According to the evaluation results TARGET performed high scores on all dimensions of enjoyment except immersion and social interaction. Also, Lund’s “USE” questionnaire results showed that users think that the game is simple, easy and useful for them, as all dimension are above average. Since this was a small-scale evaluation, we should note that there is an on-going large-scale …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:MLfJN-KU85MC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Interaction analysis for supporting students’ self-regulation during blog-based CSCL activities",
            "Publication year": 2018,
            "Publication url": "https://www.jstor.org/stable/26273866",
            "Abstract": "Self-regulated learning is an important means of supporting students’ self-awareness and self-regulation level so as to enhance their motivation and engagement. Interaction Analysis (IA) contributes to this end, and its use in studying learning dynamics involved in asynchronous Computer-Supported Collaborative Learning (CSCL) activities has rightfully increased in recent years. This paper presents a case study regarding the impact IA graphs have on students’ self-regulation, during a blog-based learning activity. More specifically, 52 secondary education students – a control group (25 students without IA toolkit support) and an experimental group (27 students with IA toolkit support) - used a blog, as a communication and information management medium for creating Scratch games. The statistical analysis of their responses to the Self-Regulation Questionnaire, before and after the activity, indicates that IA graphs …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:t6usbXjVLHcC",
            "Publisher": "National Taiwan Normal University"
        },
        {
            "Title": "Augmenting the Educational Process Using a Prototype Bio-Feedback Device for Anxiety Awareness",
            "Publication year": 2014,
            "Publication url": "http://users.auth.gr/tsiatsos/CD-Papers/3_Chapters_in_Books/K12.doc",
            "Abstract": "Students’ anxiety recognition might be approved a significant support providing self-regulation and teaching and coaching quality. From physiology it is known that high anxiety is usually resulting in increasing skin conductivity to electrical current. Furthermore, people under stressful conditions usually show increased heart-rate values. The purpose of this paper is the presentation of a prototype device that measures the anxiety level of a person by collecting bio-signals. This device has been the evaluated by persons engaged in learning activities in order to investigate whether and how it could augment the educational process. This work concludes that student’s anxiety recognition and regulation seems to be an important factor in implementing personalized learning activities.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing data from a computer based intervention program for patients with Alzheimer’s disease",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07464-1_24",
            "Abstract": "Nowadays, dealing with Alzheimer’s disease (AD) includes a combination of pharmaceutical and non-pharmaceutical treatment. But, current drugs do not, and potential future drugs might not, improve quality of life. Evidence suggests psychosocial interventions, like educational and arts programs, do in fact have such a benefit. Supportive and enriching information technology may be more important than biotechnology (Whitehouse, 2013). So non-pharmaceutical treatment including physical and mental exercising as well seem to perform better. There are many forms of mental exercising from simple crosswords puzzles to sophisticated video games that exercise different cognitive skills. Main object of this report is to present the results of a computer-based intervention program for people with AD that take place in two Day Care Centers of Greek Association of Alzheimer’s Disease and Related Disorders in …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Serious Game Approach in Anti-Doping Education: the Game Project",
            "Publication year": 2019,
            "Publication url": "http://shura.shu.ac.uk/25312/",
            "Abstract": "Anti-doping education has largely relied on traditional educational approaches such as face-to-face interaction and e-learning material. Current challenges in anti-doping education involve a) the development of modern educational tools suitable for the new generation of athletes, b) the use of state-of- art learning pedagogies that will enable effective engagement, learning and retention of the learned material, c) a systematic evaluation of the outcomes of anti-doping educational interventions on behavior and related cognition, and d) a positive approach to doping prevention. Project GAME aims to address these needs through the development of a serious game that will incorporate current empirical evidence on the psychological mechanisms underpinning the decision making process towards doping use in competitive and recreational sports. The aim of the present study is to highlight the importance of anti-doping education, conduct a state of the art literature review on serious games' design, present the prototype of a scenario that will be included in a serious game for anti-doping education, and discuss the project's activities related to the use of technologies in anti-doping education. +++++++++++++ Anti-doping education has largely relied on traditional educational aproaches such as face-to-face interaction and e-learning material. Current chalenges in anti-doping education involve a) the development of modern educational tools suitable for the new generation of athletes, b) the use of state-of- art learning pedagogies that will enable effective engagement, learning and retention of the learned material, c) a systematic evaluation of the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "eLSE"
        },
        {
            "Title": "Towards a Learning Analytics Dashboard for Collaborative Conversational Agent Activities in MOOCs",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_65",
            "Abstract": "This paper presents the design of a learning analytics dashboard, utilizing learning traces that emerge from conversational MOOC activities. These chat-based activities encourage students to collaborate in dyads, with the support of a conversational agent, in order to answer open-ended questions, set by the course instructor. Taking into account the dynamic and context-sensitive nature of the agent-based support provided during this kind of online activities, we aspire to share a series of variables, metrics and use cases, which can be valuable for practitioners and researchers looking forward to initiate the development of a learning analytics dashboard that encompasses aspects of both peer-to-peer and human-to-bot conversational interactions.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:EYYDruWGBe4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Implementing collaborative e-learning functionality in Second Life",
            "Publication year": 0,
            "Publication url": "http://users.auth.gr/users/4/7/043774/public_html/CD-Papers/5_Papers/C42.pdf",
            "Abstract": "This paper initially discusses the potential of Second Life for supporting collaborative learning by evaluating its functionality against some basic design principles. Furthermore, the paper presents the features that we have implemented within the Second Life platform, in order to facilitate collaborative e-learning scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effect of a 12 week reaction time training using active video game tennis attack on reaction time and tennis performance",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_63",
            "Abstract": "Reaction time is one of human abilities that involves in physical activity almost in all sports and it is important factor to winning when an athlete dominate others. Tennis Attack is an interactive 3D video game, which promises to improve response time of, including but not limited to, athletes using entertainment as its vehicle. The aim of the present study was to identify if Tennis Attack can improve the reaction time of the video game player and to explore if a possible improvement on reaction time affects the performance in tennis. The sample is consisted of 42 male undergraduate students. The sample divided into two groups. The first group (N = 20) was the experimental group and the other (N = 22) was the control group. Both groups attended two-hour tennis lessons once a week. All participants, at baseline and at end line, played Tennis Attack in order to examine their reaction time. The experimental group …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:_B80troHkn4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Scripted collaboration to guide the pedagogy and architecture of digital learning games",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=L5B9MJjHXQYC&oi=fnd&pg=PA148&dq=info:qSMN7XSIadIJ:scholar.google.com&ots=mJxibou8nG&sig=7XZSGV5qI9rS5fh1yyB3ZLJ2D98",
            "Abstract": "With the advancement of digital technology game playing emerged as an important learning generating experience and attracted significantly the interest of the educational community. However, current research strongly emphasizes the need for game-relevant pedagogical approaches that foster learners’ essential knowledge construction and development of transferable skills. From another perspective, during the last twenty, or so, years technology-enhanced learning has witnessed the advent of the computer-supported collaborative learning (CSCL) domain. Collaborative learning refers to a variety of educational practices in which peer interactions are considered as the key factor in learning, while the term “computer-supported” refers to using technology tools to facilitate, support and guide interactions among both remotely located students (online interactions) and/or co-located students (face-to-face interactions). Relevant research stresses the fact that freely collaborating students usually fail to engage in productive learning interactions when left without teachers’ consistent support and scaffolding. As a remedy it has been proposed that teachers support learners by implementing specific didactic scenarios (collaboration scripts) which trigger and guide peer interaction. Collaboration scripts aim to engage students by providing explicit collective workflow description and guidance (for example, by assigning student roles) during the collaborative activity. This work suggests that scripted collaboration offers a promising pedagogical framework for efficient game design and game-based learning. To substantiate this claim the paper first reviews …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative Virtual Environments",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/collaborative-virtual-environments/13633",
            "Abstract": "Computer supported collaboration is one of the most promising innovations to improve teaching, learning, and collaborating with the help of modern information and communication technology (Lehtinen & Hakkarainen, 2001). Continuous enhancements in computer technology and the current widespread computer literacy among the public have resulted in a new generation of users (less so in developing countries) that expect increasingly more from their e-learning experiences. To keep up with such expectations, e-learning systems have gone through a radical change from the initial text-based environments to more stimulating multimedia systems (Monahan, McArdle & Bertolotto, in press). Generally a collaborative virtual environment (CVE) can be defined as a computer-based, distributed, virtual space or set of places. In such places, people can meet and interact with others, with agents (artificial intelligence …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A configurable agent to advance peers’ productive dialogue in MOOCs",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-39540-7_17",
            "Abstract": "Chatbot technology can greatly contribute towards the creation of personalized and engaging learning activities. Still, more experimentation is needed on how to integrate and use such agents in real world educational settings and, especially, in large-scale learning environments such as MOOCs. This paper presents the prototype design of a teacher-configurable conversational agent service, aiming to scaffold synchronous collaborative activities in MOOCs. The architecture of the conversational agent system is followed by a pilot evaluation study, which was conducted in the context of postgraduate computer science course on Learning Analytics. The preliminary study findings reveal an overall favorable student opinion as regards the ease of use and user acceptance of the system.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Internet of Things, Infrastructures and Mobile Applications",
            "Publication year": 0,
            "Publication url": "http://e-university.tu-sofia.bg/e-publ/files/6598_Paper_Mobile_Learning.pdf",
            "Abstract": "IMCL2019 was the 13th edition of the International Conference on Interactive Mobile Communication, Technologies and Learning. This interdisciplinary conference is part of an international initiative to promote technology-enhanced learning and online engineering worldwide. The IMCL2019 covered all aspects of mobile learning as well as the emergence of mobile communication technologies, infrastructures and services and their implications for education, business, governments and society. The IMCL conference series actually aims to promote the development of mobile learning to provide a forum for education and knowledge transfer, to expose students to latest ICT technologies and encourage the study and implementation of mobile applications in teaching and learning. The conference was also the platform for critical debates on theories, approaches, principles and applications of mobile learning among educators, developers, researchers, practitioners and policy-makers. IMCL2019 has been organized by Aristotle University of Thessaloniki, Greece, from 31 October to 01 November 2019.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed Learning Environment Using Advanced Services over the Internet.",
            "Publication year": 1999,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.28.5220&rep=rep1&type=pdf",
            "Abstract": "Multimedia and hypermedia had and still have a tremendous impact on the evolution of educational software. In this paper we propose an Integrated Distributed Learning Environment (IDLE) for the implementation of the services of an educational network over TCP/IP networks such as the Internet. Our proposal aims at providing an integrated communicational environment, which supplies the communicative needs of an educational community, using the latest telecommunication and multimedia information processing technology. The environment that we implemented can be used for virtual lectures, virtual conferences, collaborative work on projects, which are shared among institutions, exchange of useful material and experiences among teachers, and creation of educational material.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A configurable conversational agent to trigger students’ productive dialogue: a pilot study in the CALL domain",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s40593-013-0007-3",
            "Abstract": "Conversational agents constitute a specific type of ITSs that has been reportedly proven successful in helping students in one-to-one settings, while recently their impact has also been explored in computer-supported collaborative learning (CSCL). In this work, we present MentorChat, a dialogue-based system that employs a configurable and domain-independent conversational agent for triggering students’ productive dialogue. After a system overview with an emphasis on design rationale and system architecture, we present a pilot study, where the agent is evaluated in the context of the computer-assisted language learning (CALL) domain. Thirty students collaborated in small groups trying to accomplish three different tasks. MentorChat conversational agent supported each group discussion differently in each task providing (a) ‘weak’-directed interventions and/or (b) undirected interventions. The study …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Deployment and Dynamics of a Biofeedback System for Anxiety Awareness during Online Examination Activities",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/960712",
            "Abstract": "The presented paper examines the deployment of a cost-effective biofeedback system that provides anxiety awareness during online examination activities. Human anxiety is classified by evaluating biosignals related to skin conductance, skin temperature, and heart rate. The first aim of this study is to check the presented system performance. Thus, we test the convergent validity of the system regarding self-report measures of anxiety. Moreover, the system is validated against a commercial tool of anxiety detection. Fifteen (15) postgraduate students took part in the relevant psychometric test. The convergent validity of the system is found to be satisfactory. The second aim of this study is to identify the participant’s personality dimensions according to Technology Readiness Index (TRI) which affects their academic performance and their real-time anxiety, as provided by the biofeedback device, during academic examinations. Thirty-five (35) postgraduate students, who were taking examinations in the form of synchronous online tests in the classroom for one of their lessons, took part in this stage of the research. The examined relationships are presented via a path model showing mainly that insecurity causes academic performance to decline, which in turn has a significant negative effect with increasing anxiety. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A Framework for Intelligent Virtual Training Environment: The steps from specification to design",
            "Publication year": 2002,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.5.4.11.pdf",
            "Abstract": "The growing need for communication, visualization and organization technologies in the field of e-learning environments has led to the application of virtual reality and the use of collaborative virtual environments. This paper presents a system architecture to support such environments, defined by user needs and using state of the art technologies.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Using a conversational agent for promoting collaborative language learning",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6337914/",
            "Abstract": "Research in the field of Second Language Acquisition has repeatedly highlighted the importance of conversational interactions between students working together in small groups. Particularly, peer dialogue can play a vital role in intellectual development and language acquisition. Thus, we argue that the use of a conversational agent, designed to advance peer interaction and cognitive activity, would enhance learning outcomes related to language learning. In this work, we describe the design of a web-based collaborative system that utilizes a configurable conversational agent, which facilitates and triggers the learners' discussion. We also present an exploratory case study that was conducted in an English language school. Our analysis indicates a positive effect regarding the usability and user acceptance of the system.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design, Development and Evaluation of a MOOC Platform to Support Dual Career of Athletes (GOAL Project)",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11935-5_25",
            "Abstract": "This paper presents the expert evaluation results of the alpha version of an e-learning platform for supporting dual career of athletes. The platform has been designed and implemented in the context of GOAL (Gamified and Online Activities for Learning to support dual career of athletes) Erasmus+ project. More specifically, the paper presents briefly the structure and content of the platform along with the technological solution, which is based on the well-known Moodle platform. According to the evaluation results, GOAL platform is easy to use, consistent, with a simple user interface and the overall attitude of the evaluators is positive.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:W5xh706n7nkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Protocols for sharing educational virtual environments",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=6593083478614222436&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Panic in the gallery",
            "Publication year": 2016,
            "Publication url": "http://ikee.lib.auth.gr/record/300847",
            "Abstract": "With the evolution of technology, social media and mobile devices, digital games have become a frequent form of entertainment for many people. As games can provide a fun environment, where students can actively learn content through actions and decisions, there are high hopes that game-based learning can be used both in and outside the classroom and yield positive learning outcomes. The aim of this study is to evaluate the effectiveness and enjoyment of a game created for art history learning, on adults of various ages, with a different art history background and game experience and to hopefully help educational game creators get closer to a balance between fun and learning.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Gamified Educational Mobile Application to Support Healthy Lifestyle",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-67209-6_57",
            "Abstract": " This paper aims to present a tool for (a) supporting the change of people’s behavior about physical activity, and (b) raising awareness about their body and nutrition. Taking into account studies that show reduced physical activity in the majority of European adolescents [1–3], an incredible number of people being obese or overweight [4], a sedentary lifestyle being prevalent [5], an insufficient amount of nutrients or unbalanced diet [6], and a lack of ongoing nutrition counselling [7, 8], the need to change is of crucial importance. It is important to address all the above at the same time due to the strong relationship between physical activity, healthy nutrition and healthy lifestyle [9]. The main goal of this paper is to present a first version of a gamified educational application aiming to promote awareness on the importance of health-enhancing physical activity by contributing on the changes of lifestyle and physical …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:tuHXwOkdijsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Gamified Assessment supported by a dynamic 3D collaborative game",
            "Publication year": 2019,
            "Publication url": "https://www.igi-global.com/chapter/gamified-assessment-supported-by-a-dynamic-3d-collaborative-game/224710",
            "Abstract": "This study examined whether a 3D collaborative gave can be used as a midterm examination method and investigated the impact of this game on students' attitude towards collaboration. A total of 89 students and one coordinating professor participated in this study. The intervention lasted five weeks and took place in a computer science department. The game that was used as a treatment was dynamic and therefore the educator was able to customize its content for the examinations using an administration panel. A mixed method of quantitative and qualitative data collection was used. The results indicated that there was a statistically significant correlation between the performance of the students on the game and their performance on the final paper-based examination. However, there was no statistically significant difference between the attitude of the students towards collaboration before and after the use of the …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "INCOS-2010 COMMITTEES",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5702160/",
            "Abstract": "INCOS 2010 Committees Page 1 INCOS-2010 COMMITTEES General Chairs Fatos Xhafa, \nTechnical University of Catalonia, Spain Andreas Pombortsis, Aristotle University of Thessaloniki, \nGreece Vassilios Dagdilelis, University of Macedonia, Greece Programme Committee Chairs \nStavros Demetriadis, Aristotle University, Thessaloniki, Greece Nik Bessis, Bedfordshire \nUniversity, UK International Co-Chairs Rafael Calvo, University of Sydney, Australia Angelique \nDimitrakopoulou, University of Aegean, Greece Yannis Dimitriadis, University of Valladolid, \nSpain Frank Fischer, University of Munich, Germany Maria Grigoriadou, University of Athens, \nGreece Stefanos Gritzalis, University of Aegean, Greece Lakhmi C. Jain, University of South \nAustralia Janusz Kacprzyk, Polish Academy of Sciences, Poland Charalampos Karagiannides, \nUniversity of Thessaly, Greece Kinshuk, Athabasca University, Canada Mario Koeppenl…",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Research on E-Learning and ICT in Education",
            "Publication year": 0,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-64363-8.pdf",
            "Abstract": "Research on E-Learning and ICT in Education Thrasyvoulos Tsiatsos· Stavros Demetriadis \nAnastasios Mikropoulos Vasileios Dagdilelis Editors Research on E-Learning and ICT in \nEducation Technological, Pedagogical and Instructional Perspectives Page 2 Research on \nE-Learning and ICT in Education Page 3 Thrasyvoulos Tsiatsos• Stavros Demetriadis Anastasios \nMikropoulos• Vasileios Dagdilelis Editors Research on E-Learning and ICT in Education \nTechnological, Pedagogical and Instructional Perspectives Page 4 Editors Thrasyvoulos Tsiatsos \nDepartment of Informatics Aristotle University of Thessaloniki Thessaloniki, Greece Stavros \nDemetriadis Informatics Aristotle University of Thessaloniki Thessaloniki, Greece Anastasios \nMikropoulos Department of Primary Education University of Ioannina Ioannina, Greece Vasileios \nDagdilelis Educational and Social Policy University of Macedonia Thessaloniki, Greece …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:SpbeaW3--B0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Examining the effect of interaction analysis on supporting students’ motivation and learning strategies in online blog-based secondary education programming courses",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10494820.2019.1678487",
            "Abstract": "Students’ skilful use of self-regulatory learning strategies is becoming fundamental to the advent of blog-based learning. Moreover, the use of Interaction Analysis (IA) in studying the learning dynamics in Computer-Supported Collaborative Learning (CSCL) activities is on the increase, particularly aiming to support participants by means of IA self-monitoring tools. Within this framework, the main objective of this study is to investigate the effect IA indicators have on students’ motivational orientations and learning strategies. Utilizing a pre-/post-test design to examine the main research questions, the authors of this paper collected data from 91 secondary education students, including the Motivation Strategies for Learning Questionnaire (MLSQ), administered before and after the completion of online programming activity. Overall research results indicate that the presence of IA indicators enhance students’ motivation …",
            "Abstract entirety": 0,
            "Author pub id": "KLqgXzwAAAAJ:35r97b3x0nAC",
            "Publisher": "Routledge"
        },
        {
            "Title": "VLEs, social stories and children with autism: A prototype implementation and evaluation",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-015-9409-1",
            "Abstract": "Virtual Learning Environments (VLEs) have been successfully used in educational interventions for children with Autism Spectrum Conditions (ASC) for overcoming their persistent differences related to social communication and imagination. This paper investigates the potential of VLEs presenting Social Stories, as an advantageous pathway for the development of social problem skills in children with ASC. To this end, it presents the design and development of VLSS (Virtual Learning Environment with Social Stories), a prototype three-dimensional VLE for children with ASC. Overall, the evaluation of VLSS by 40 experts (special education teachers) was very positive, indicating that VLSS has the potential to be a beneficial and easy-to-use educational tool for enhancing social problem solving in children with ASC.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "основной публикации",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=8853760220511958511&hl=en&oi=scholarr",
            "Abstract": "The article discloses a study on the identification of multidisciplinary master degree majors, which interest potential employers and students in Russia. Results of the initial phase of the research project conducted at Tomsk Polytechnic University are presented. The study focuses on collecting raw data from two categories of respondents: potential employers (industry representatives) and potential master students (4th year bachelor students of engineering majors, TPU). The respondents underline the demand for double major master programs and rate reasons for studying two majors. The study proposes particular pairs of master programs that should be harmonized on the latter stages of the project. The importance of the research lies at the root of communicating modern issues and requirements of industry and society with the responses provided by universities, ie the quality and relevance of students’ professional training.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:WZBGuue-350C",
            "Publisher": "Springer Verlag"
        },
        {
            "Title": "Evaluation of OpenDelos online video editing and publishing platform for Greek Open Courses and MOOCs",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359632/",
            "Abstract": "This paper presents briefly the project “Central Repository of Greek Open Courses” as well as the innovative OpenDelos platform. OpenDelos is an online video editing and publishing platform for MOOCs implemented in the context of this project. The main goal of this paper is to investigate users' acceptance of OpenDelos platform as an online video editing and publishing platform for MOOCs. The evaluation methodology is based on Technology Acceptance Model (TAM). The five dimensions of the studied model are based on external variables (sex, age, web experience, educational level), perceived ease of use (PEOU), perceived usefulness (PU), attitude towards using (ATU) and behavior intension (BI). According to the confirmed derived model, presented in this paper, all the initially mentioned hypotheses were verified.",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An investigation of conversational agent interventions supporting historical reasoning in primary education",
            "Publication year": 2016,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KLqgXzwAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer, Cham"
        }
    ]
}]