[{
    "name": "Νικόλαος Λάσκαρης",
    "romanize name": "Nikolaos Laskaris",
    "School-Department": "Πληροφορικής",
    "University": "ΑΠΘ",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 5220,
    "Scholar name": "Nikos Laskaris",
    "Scholar id": "uG8cgA4AAAAJ",
    "Affiliation": "Associate Professor, Department of Informatics, AUTH",
    "Citedby": 2379,
    "Interests": [
        "NeuroInformatics",
        "Cognitive Neuroscience",
        "Brain Connectomics",
        "Biosignals"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=uG8cgA4AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Surface and Interface investigation using TOF-SIMS of archaeological obsidian artefacts",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=13066192208509308944&hl=en&oi=scholarr",
            "Abstract": "In the present work the obsidian surface and interface of 8 artifacts from different obsidian sources will be studied systematically in the TOF-SIMS Laboratory of Jagiellonian University. The Greek partner will calculate the dating of each sample, using SIMS profiles and a theoretical model.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:YXeC4bxG7-IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Serious gaming enhances cognitive function in MCI due to Alzheimer’s disease",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/45121570/Poster_Alzheimer_Conference20160426-26676-zoiwer.pdf",
            "Abstract": "ConclusionIn conclusion, the present study provides evidence of DMN improvements in term of both power and connectivity that correlate with enhanced cognitive function after a novel ICT-based intervention.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:Ltc9rfRcsxEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A genetic algorithm for the multidimensional filtering process of visual evoked potential signals",
            "Publication year": 1996,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/647548/",
            "Abstract": "A new filtering approach for the recovering of visual evoked potential signal is introduced. The single trials are treated as observation vectors from a multidimensional distribution, in order to exploit the obvious correlation between the time instants. The technique of potential functions is utilized to approximate the vector distribution. A genetic algorithm is employed for the location of the mode of this distribution which is proposed as an estimate of the underlying EP signal. The experimental results indicate that the mode of the vector distribution deviates a lot from the corresponding ensemble average, justifying our approach. The proposed filtering method offers significant increases in SNR compared to conventional averaging, showing that the status of the visual pathway can be better portrayed.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "University of Patras, Physics Dept., Electronics Lab.",
            "Publication year": 1997,
            "Publication url": "https://www2.spsc.tugraz.at/people/franklyn/ICASSP97/pdf/scan/ic972581.pdf",
            "Abstract": "In this paper, a new filter that is performing color image enhancement is presented. The filter is achieving this through the minimization of a weighted cost function. The weights are determined using potential functions which are calculated in such a way as to convey spatial information. Application of the proposed filter on a real blurred and noisy color image is performed to verify its enhancement capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:ZppSRAJs3i8C",
            "Publisher": "IEEE, Computer Society Press"
        },
        {
            "Title": "A similarity measure for color image retrieval and indexing based on the multivariate two sample problem",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079774/",
            "Abstract": "In this work, a similarity measure in the feature space is proposed for color retrieval and indexing based on the “Multivariate Two-Sample Problem”. Color information is extracted via random selection of image pixels from high-density regions. The proposed scheme has a global nature due to its randomness and is easy to implement. It makes uses of the minimal spanning tree (MST) structure and properties, providing the retrieval results with a statistical measure of their significance level. The main advantages of our proposal are its computational efficiency and the fact that it is generally applicable to natural image collections.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "journal homepage: www. elsevier. com/locate/jneumeth",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=1481501702055962521&hl=en&oi=scholarr",
            "Abstract": "Kaemmer, D., Bozkurt, A., Otto, J., Junge, K., Klink, C., Weis, J., Sellhaus, B., O’Dey, DM, Pallua, N., Jansen, M., Schumpelick, V. and Klinge, U. Evaluation of tissue components in the peripheral nervous system using Sirius red staining and immunohistochemistry: A comparative study (human, pig, rat),(190) 112",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conflicting cerebrospinal fluid biomarkers and progression to dementia due to Alzheimer’s disease",
            "Publication year": 2016,
            "Publication url": "https://alzres.biomedcentral.com/articles/10.1186/s13195-016-0220-z",
            "Abstract": "According to new diagnostic guidelines for Alzheimer’s disease (AD), biomarkers enable estimation of the individual likelihood of underlying AD pathophysiology and the associated risk of progression to AD dementia for patients with mild cognitive impairment (MCI). Nonetheless, how conflicting biomarker constellations affect the progression risk is still elusive. The present study explored the impact of different cerebrospinal fluid (CSF) biomarker constellations on the progression risk of MCI patients. A multicentre cohort of 469 patients with MCI and available CSF biomarker results and clinical follow-up data was considered. Biomarker values were categorized as positive for AD, negative or borderline. Progression risk differences between patients with different constellations of total Tau (t-Tau), phosphorylated Tau at threonine 181 (p-Tau) and amyloid-beta 1–42 (Aβ42) were studied. Group comparison analyses and Cox regression models were employed. Patients with all biomarkers positive for AD (N = 145) had the highest hazard for progression to dementia due to AD, whilst patients with no positive biomarkers (N = 111) had the lowest. The risk of patients with only abnormal p-Tau and/or t-Tau (N = 49) or with positive Aβ42 in combination with positive t-Tau or p-Tau (N = 119) is significantly lower than that of patients with all biomarkers positive. The risk of progression to dementia due to AD differs between patients with different CSF biomarker constellations.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:Ef4XXjhdXvQC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Key frame extraction in video sequences: a vantage points approach",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4412909/",
            "Abstract": "In this work, the idea of key frames extraction from single shots in video sequences is presented. The method is implemented by an efficient two-step algorithm, which is classified neither to clustering nor to temporal variations based techniques. In the first step, an MST (minimal spanning tree) graph is constructed, where each node is associated to a single frame of the shot. In the second step, extracts key frames based on the principle of their maximum spread, are extracted. The number of the selected key frames is controlled by an adaptively defined threshold, while the validity of the results is evaluated by the fidelity measure.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MEG tomography of human cortex and brainstem activity in waking and REM sleep saccades",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/cercor/article-abstract/14/1/56/433493",
            "Abstract": "We recorded the magnetoencephalographic (MEG) signal from three subjects before, during and after eye movements cued to a tone, self-paced, awake and during rapid eye movement (REM) sleep. During sleep we recorded the MEG signal throughout the night together with electroencephalographic (EEG) and electromyographic (EMG) channels to construct a hypnogram. While awake, just prior to and during eye movements, the expected well time-locked physiological activations were imaged in pontine regions, with early 3 s priming. Activity in the frontal eye fields (FEF) was identified in the 300 ms before the saccade onset. Visual cortex activation occurred 200 ms after saccades. During REM, compared to the eyes closed awake condition, activity was higher in supplementary motor area (SMA) and lower in inferior parietal and precuneus cortex. Electro-occulographic (EOG) activity just prior to REM …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "On the estimate of music appraisal from surface EEG: a dynamic-network approach based on cross-sensor PAC measurements",
            "Publication year": 2021,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1741-2552/abffe6/meta",
            "Abstract": "Objective. The aesthetic evaluation of music is strongly dependent on the listener and reflects manifold brain processes that go well beyond the perception of incident sound. Being a high-level cognitive reaction, it is difficult to predict merely from the acoustic features of the audio signal and this poses serious challenges to contemporary music recommendation systems. We attempted to decode music appraisal from brain activity, recorded via wearable EEG, during music listening. Approach. To comply with the dynamic nature of music stimuli, cross-frequency coupling measurements were employed in a time-evolving manner to capture the evolving interactions between distinct brain-rhythms during music listening. Brain response to music was first represented as a continuous flow of functional couplings referring to both regional and inter-regional brain dynamics and then modelled as an ensemble of time-varying …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:ThYxFsVAhEkC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Go with the Winner: Optimizing Detection of Modular Organization Differences in Dynamic Functional Brain Networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6395161/",
            "Abstract": "The modular structure of human brain network(s) is well established. Despite numerous and increasing studies that examine brain's modular organization based on various measures of neural synchrony, it is not known yet how to qualify the employed descriptors in terms of the resulting functional community structure. A methodology is introduced here that facilitates the selection of best synchronization measure based on the comparison between two experimental conditions. Our method is presented using data from a multi-trial ERP paradigm (where the same task is performed in an attentive/passive mode) and in a time-varying exploration set up. The functional interactions are quantified at the level of EEG sensors through descriptors that differ regarding the nature of functional dependencies sought (linear vs. nonlinear) and regarding the specific form of the measures employed (amplitude/phase covariation). The …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Discriminative codewaves: a symbolic dynamics approach to SSVEP recognition for asynchronous BCI",
            "Publication year": 2018,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1741-2552/aa904c/meta",
            "Abstract": "Objective. Steady-state visual evoked potential (SSVEP) is a very popular approach to establishing a communication pathway in brain–computer interfaces (BCIs), without any training requirements for the user. Brain activity recorded over occipital regions, in association with stimuli flickering at distinct frequencies, is used to predict the gaze direction. High performance is achieved when the analysis of multichannel signal is guided by the driving signals. This study introduces an efficient way of identifying the attended stimulus without the need to register the driving signals. Approach. Regional brain response is described as a dynamical trajectory towards one of the'attractors' associated with the brainwave entrainment induced by the attended stimulus. A condensed description for each single-trial response is provided by means of discriminative vector quantization, and different trajectories are disentangled based on …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:MUocvVTjX6cC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A Wavelet based assessment of abnormal intra-QRS potentials in patients with ventricular tachycardia",
            "Publication year": 1996,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/647471/",
            "Abstract": "The concept of late potentials may be expanded if early abnormal activation of the myocardium can be linked to arrhythmogenesis. The detection of abnormal intra-QRS potentials in patients with ventricular tachycardia has been achieved from the raw ECG data based upon a two step wavelet transformation/feature extraction process. The beat-to-beat variance of the QRS-corresponding wavelet coefficients and the modulus maxima evolution across scales have been tested as distinguishing features of arrhythmogenicity. Their comparison with convential late potentials revealed improvements in ventricular tachycardia risk assessment.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A SIMILARITY MEASURE FOR COLOR IMAGE RETRIEVAL AND INDEXING BASED ON THE MULTIVARIATE TWO SAMPLE PROBLEM (FriPmOR4)",
            "Publication year": 0,
            "Publication url": "https://www.eurasip.org/Proceedings/Eusipco/Eusipco2004/defevent/abstract/a1247.pdf",
            "Abstract": "In this work, a similarity measure in the feature space is proposed for color retrieval and indexing based on the ‘‘Multivariate Two− Sample Problem’’. Color information is extracted via random selection of image pixels from high− density regions. The proposed scheme has a global nature due to its randomness and is easy to implement. It makes uses of the minimal spanning tree (MST) structure and properties, providing the retrieval results with a statistical measure of their significance level. The main advantages of our proposal are its computational efficiency and the fact that it is generally applicable to natural image collections.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:W8gSVh4kTHQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Greater repertoire and temporal variability of cross-frequency coupling (CFC) modes in resting-state neuromagnetic recordings among children with reading difficulties",
            "Publication year": 2016,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnhum.2016.00163/full",
            "Abstract": "Cross-frequency, phase-to-amplitude coupling (PAC) between neuronal oscillations at rest may serve as the substrate that supports information exchange between functionally specialized neuronal populations both within and between cortical regions. The study utilizes novel algorithms to identify prominent instantaneous modes of cross-frequency coupling and their temporal stability in resting state magnetoencephalography (MEG) data from 23 students experiencing severe reading difficulties (RD) and 27 age-matched non-impaired readers (NI). Phase coherence estimates were computed in order to identify the prominent mode of PAC interaction for each sensor, sensor pair, and pair of frequency bands (from δ to γ) at successive temporal segments of the continuous MEG record. The degree of variability in the characteristic frequency-pair PACf1-f2 modes over time was also estimated. Results revealed a wider repertoire of prominent PAC interactions in RD as compared to NI students, suggesting an altered functional substrate for information exchange between neuronal assemblies in the former group. Moreover, RD students showed significant variability in PAC modes over time. This temporal instability of PAC values was particularly prominent: (a) within and between right hemisphere temporal and occipitotemporal sensors and, (b) between left hemisphere frontal, temporal, and occipitotemporal sensors and corresponding right hemisphere sites. Altered modes of neuronal population coupling may help account for extant data revealing reduced, task-related neurophysiological and hemodynamic activation in left hemisphere regions …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:m03se8k-GH0C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "On the perceptual organization of image databases using cognitive discriminative biplots",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2007/68165.pdf",
            "Abstract": "A human-centered approach to image database organization is presented in this study. The management of a generic image database is pursued using a standard psychophysical experimental procedure followed by a well-suited data analysis methodology that is based on simple geometrical concepts. The end result is a cognitive discriminative biplot, which is a visualization of the intrinsic organization of the image database best reflecting the user's perception. The discriminating power of the introduced cognitive biplot constitutes an appealing tool for image retrieval and a flexible interface for visual data mining tasks. These ideas were evaluated in two ways. First, the separability of semantically distinct image classes was measured according to their reduced representations on the biplot. Then, a nearest-neighbor retrieval scheme was run on the emerged low-dimensional terrain to measure the suitability …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Advanced leaf image retrieval via Multidimensional Embedding Sequence Similarity (MESS) method",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-011-0254-6",
            "Abstract": "A novel method for shape analysis and similarity measurement is introduced based on a time series matching approach. It applies to shapes represented through one-dimensional signals and has as objectives to utilize efficiently the provided information and to optimize the shape matching process. The new technique is tested on boundaries from leaf images, after their conversion into 1D sequences using either the Centroid Contour Distance (CCD) or the Angle code (AC) measurements. In the core of the new method lies the ‘time delay’-based transformation of a given 1D sequence to an ensemble of vectors embedded in a multivariate phase space. The resulting point set is considered as representative of the leaf identity. Inter-leaf comparisons are carried out in a pairwise fashion by employing the multidimensional, Wald–Wolfowitz, statistical test for the ‘two-sample problem’, which implicitly performs …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:H0nRGT7Dr7IC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Cognitive workload assessment based on the tensorial treatment of EEG estimates of cross-frequency phase interactions",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10439-014-1143-0.pdf",
            "Abstract": "The decoding of conscious experience, based on non-invasive measurements, has become feasible by tailoring machine learning techniques to analyse neuroimaging data. Recently, functional connectivity graphs (FCGs) have entered into the picture. In the related decoding scheme, FCGs are treated as unstructured data and, hence, their inherent format is overlooked. To alleviate this, tensor subspace analysis (TSA) is incorporated for the parsimonious representation of connectivity data. In addition to the particular methodological innovation, this work also makes a contribution at a conceptual level by encoding in FCGs cross-frequency coupling apart from the conventional frequency-specific interactions. Working memory related tasks, supported by networks oscillating at different frequencies, are good candidates for assessing the novel approach. We employed surface EEG recordings when the subjects …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:hZ5_QnqxF7AC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Connectivity steered graph Fourier transform for motor imagery BCI decoding",
            "Publication year": 2019,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1741-2552/ab21fd/meta",
            "Abstract": "Objective. Graph signal processing (GSP) concepts are exploited for brain activity decoding and particularly the detection and recognition of a motor imagery (MI) movement. A novel signal analytic technique that combines graph Fourier transform (GFT) with estimates of cross-frequency coupling (CFC) and discriminative learning is introduced as a means to recover the subject's intention from the multichannel signal. Approach. Adopting a multi-view perspective, based on the popular concept of co-existing and interacting brain rhythms, a multilayer network model is first built from empirical data and its connectivity graph is used to derive the GFT-basis. A personalized decoding scheme supporting a binary decision, either'left versus right'or'rest versus MI', is crafted from a small set of training trials. Electroencephalographic (EEG) activity from 12 volunteers recorded during two randomly alternating, externally cued, MI …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:esGtpfCv0y8C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Fluid biomarker agreement and interrelation in dementia due to Alzheimer’s disease",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:52neCvzbxIwC",
            "Publisher": "Journal of Neural Transmission Springer"
        },
        {
            "Title": "Pigments identification in paintings by from JF Mücke, using Raman spectroscopy: an arts/science project",
            "Publication year": 0,
            "Publication url": "https://bsa7.uniwa.gr/wp-content/uploads/sites/246/2020/09/Poster-No-12.pdf",
            "Abstract": "“Vukovar landscapes” is a series of oil on canvas paintings made in mid-19th century by an unknown author [1]. Only one of the landscapes is signed, by Joseph Franz Mücke, a royal painter of Habsburg dinasty, presumably ordered by count Emmerich Josef Eltz as a decoration for his Manor in Vukovar, Croatia. Of all candidate authors, Mücke is the only one who was known to live in Vukovar in the period the landscapes were made. One of the clues toward the discovery or confirmation of the true author could be given by comparing the painting pigments used in signed and unsigned landscapes.Raman spectroscopy with 785 nm laser is used to identify the pigments used for the signed painting “The Gardens”. Raman analysis reveals the author’s palette [2]. For blue colours indigo pigment was found with addition of calcite for lighter hues. Green colours contain malachite with possible mixture of other earth pigments, like terre-verte. Orange-brown colours are obtained using either a mixture of red lead, red earth and yellow earth pigments or terra umbra. All earth pigments contain traces of quartz. Elemental analysis, like XRF, is proposed for complete characterization of Mücke’s palette [3].",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:9UF2BbDYXHIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards the bio-personalization of music recommendation systems: A single-sensor EEG biomarker of subjective music preference",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020025516000074",
            "Abstract": "Recent advances in biosensors technology and mobile electroencephalographic (EEG) interfaces have opened new application fields for cognitive monitoring. A computable biomarker for the assessment of spontaneous aesthetic brain responses during music listening is introduced here. It derives from well-established measures of cross-frequency coupling (CFC) and quantifies the music-induced alterations in the dynamic relationships between brain rhythms. During a stage of exploratory analysis, and using the signals from a suitably designed experiment, we established the biomarker, which acts on brain activations recorded over the left prefrontal cortex and focuses on the functional coupling between high-β and low-γ oscillations. Based on data from an additional experimental paradigm, we validated the introduced biomarker and showed its relevance for expressing the subjective aesthetic appreciation of a …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:0uG9q0SNyf4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An efficient Video-Synopsis technique for optical recordings with application to the analysis of rat barrel-cortex responses",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_84",
            "Abstract": "Optical imaging techniques are nowadays highly popular in neuroscience research, due to their high spatial and temporal resolution. Optical recordings data are coming in the form of sequential snapshots (i.e. videos) reflecting changes in neural activity. By adopting carefully designed stimulation paradigms, these signals constitute an invaluable source of information regarding the emerging spatiotemporal dynamics of brain’s response. However, the volume of collected data can obscure the understanding of underlying mechanisms. In particular, the comparison between different recording conditions is a challenging task that is usually solved empirically.We introduce an algorithmic technique that identifies spatial domains of coherent evoked activity, produces a meaningful summary of the involved videos and facilitates the comparison of response dynamics. A self-organizing network (SON) lies in …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A graph-theoretic sensor-selection scheme for covariance-based Motor Imagery (MI) decoding",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9287865/",
            "Abstract": "Optimal sensor selection is an issue of paramount importance in brain decoding. When associated with estimates of covariance, its implications concern not only classification accuracy, but also computational efficiency. However, very few attempts have been made so far, since it constitutes a challenging mathematical problem. Herein, we propose an efficient heuristic scheme that combines discriminative learning (from a small training dataset of labelled trials) with unsupervised learning (the automated detection of sensors that collectively maximize the trial discriminability of the induced Covariance structure). The approach is motivated from a complex network modelling perspective. Its efficacy and efficiency are demonstrated experimentally, based on BCI-competition datasets concerning MI-tasks, and compared against popular techniques in the field.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:ipSP0SfFaZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the discovery of group-consistent graph substructure patterns from brain networks",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027012004852",
            "Abstract": "Complex networks constitute a recurring issue in the analysis of neuroimaging data. Recently, network motifs have been identified as patterns of interconnections since they appear in a significantly higher number than in randomized networks, in a given ensemble of anatomical or functional connectivity graphs. The current approach for detecting and enumerating motifs in brain networks requires a predetermined motif repertoire and can operate only with motifs of small size (consisting of few nodes).There is a growing interest in methodologies for frequent graph-based pattern mining in large graph datasets that can facilitate adaptive design of motifs. The results presented in this paper are based on the graph-based Substructure pattern mining (gSpan) algorithm and introduce a manifold of ways to exploit it for data-driven motif extraction in connectomics research.Functional connectivity graphs from …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:isC4tDSrTZIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "GEVI cell‐type specific labelling and a manifold learning approach provide evidence for lateral inhibition at the population level in the mouse hippocampal CA1 area",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/ejn.15177",
            "Abstract": "The CA1 area in the mammalian hippocampus is essential for spatial learning. Pyramidal cells are the hippocampus output neurons and their activities are regulated by inhibition exerted by a diversified population of interneurons. Lateral inhibition has been suggested as the mechanism enabling the reconfiguration of pyramidal cell assembly activity observed during spatial learning tasks in rodents. However, lateral inhibition in the CA1 lacks the overwhelming evidence reported in other hippocampal areas such as the CA3 and the dentate gyrus. The use of genetically encoded voltage indicators and fast optical recordings permits the construction of cell‐type specific response maps of neuronal activity. Here, we labelled mouse CA1 pyramidal neurons with the genetically encoded voltage indicator ArcLight and optically recorded their response to Schaffer Collaterals stimulation in vitro. By undertaking a manifold …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:fHS53ZCY-AEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cortical activity preceding vertical saccades: a MEG study",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0006899310000053",
            "Abstract": "Previous studies have shown that upward saccade latencies are faster than downward saccade latencies in certain tasks. This asymmetry does not appear to represent a general main effect of the visual, or the vertical oculomotor system. In this study we examined the cortical activity underlying this latency asymmetry. We used MEG to assess cortical activity related to horizontal and vertical saccade preparation, and eye movement recordings to assess saccade latencies in a modified delay task. The reconstructed cortical activity was examined with respect to the onset of the target stimulus and the onset of the saccade. Upward saccades were faster than downward saccades, in agreement with previous studies. Although to a large extent, horizontal and vertical targets activated similar areas, there were also some differences. The earlier difference was found 100–150 ms after target onset over the right supramarginal …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Tracking brain dynamics via time-dependent network analysis",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027010004875",
            "Abstract": "Complex network analysis is currently employed in neuroscience research to describe the neuron pathways in the brain with a small number of computable measures that have neurobiological meaning. Connections in biological neural networks might fluctuate over time; therefore, surveillance can provide a more useful picture of brain dynamics than the standard approach that relies on a static graph to represent functional connectivity.Using the application of well-known measures of neural synchrony over short segments of brain activity in a time series, we attempted a time-dependent characterization of brain connectivity by investigating functional segregation and integration. In our implementation, a frequency-dependent time window was employed and regularly spaced (defined as overlapping segments), and a novel, parameter-free method was introduced to derive the required adjacency matrices. The …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:W7OEmFMy1HYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multidimensional fuzzy filtering using statistical parameters",
            "Publication year": 1999,
            "Publication url": "https://link.springer.com/article/10.1023/A:1008479832000",
            "Abstract": "A multidimensional filtering technique is proposed using fuzzy logic ideas and based on two locally estimated statistical parameters. This technique is applied to the 3D space of color images. Two fuzzy sets for each fuzzy variable are considered. These fuzzy variables assign the corresponding part of the image to a specific class. The parameters of the fuzzy sets are derived in respect to the corresponding “crisp” sets attributed to the ideal noiseless image. An additional fuzzy selection process is also introduced by applying a distance dependent weighted average as the filtering action of each rule. Both signal and noise characteristics are taken into account in the filtering process. Experimental results show that these fuzzy non-linear filters work very well.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "In quest of the missing neuron",
            "Publication year": 2012,
            "Publication url": "http://ikee.lib.auth.gr/record/203665",
            "Abstract": "Spike sorting algorithms aim at decomposing complex extracellular signals to independent events from single neurons in the electrode's vicinity. The decision about the actual number of active neurons is still an open issue, with sparsely firing neurons and background activity the most influencing factors. We introduce a graph-theoretical algorithmic procedure that successfully resolves this issue. Dimensionality reduction coupled with a modern, efficient and progressively executable clustering routine proved to achieve higher performance standards than popular spike sorting methods. Our method is validated extensively using simulated data for different levels of SNR.(C) 2011 Elsevier Ireland Ltd",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:vPKCt-r_nWsC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "An Intelligent System for the tracking-localization of changes & exploratory analysis-of Long-Term ECG",
            "Publication year": 1997,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/18740",
            "Abstract": "An interactive methodology for the analysis of long-term ECG is introduced. It is an anthropomimetic technique and consinsts of three parts. At the first stage, the clinicians' scan of the ECG traces is imitated and changes in the shape of QRS are quantified. In the sequel, a clinician involves in the interpretation of the most prominent changes providing the patient-dependent prototypes for the subsequent machine learning procedure. Finally, a classification scheme incorporates the portion of medical knowledge needed to explore the whole patient's ECG. This scheme, being very robust to noise, presents excellent generalization properties and can serve as a reliable automation in a future examination of the certain subject.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:blknAaTinKkC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Multivariate image segmentation using Laplacian eigenmaps",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079989/",
            "Abstract": "We are exploring the novel technique of Laplacian Eigenmaps (LE) [1] as a means of improving the clustering-based segmentation of multivariate images. A computationally efficient scheme, taking advantage of the ability of LE-algorithm to learn the actual manifold of the multivariate data, is introduced. After embedding the local image characteristics in a high-dimensional feature space, the skeleton of the intrinsically low dimensional manifold is reconstructed. A low-dimensional map, in which the variations in the local image characteristics are presented in the context of global image variation, is then computed. The non-linear projections on this map serve as inputs to the fuzzy c-means algorithm boosting its clustering performance significantly. The final segmentation is produced by a simple labelling scheme that works pixelwise. The experimental results using RGB-images were very promising and showed that …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel training scheme for neural-network-based vector quantizers and its application in image compression",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S092523120400222X",
            "Abstract": "A “roulette-wheel” routine (Genetic Algorithms in Search, Optimization and Machine Learning, Addison-Wesley, Reading, MA, 1989) for random sampling is adopted as a means of adjusting the resolution of vector quantizers. With the proposed procedure, the sequential presentation of training vectors is controlled according to an external, user-defined criterion. The new training scheme is applied to the problem of codebook design, using the neural gas network (IEEE Trans. Neural Networks (1993) 558), for image coding and shown to improve the visual quality of the reconstructed images.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Data dependent weighted averages for recording of evoked potential signals",
            "Publication year": 1995,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/0168559795000709",
            "Abstract": "Two new filters are proposed to replace conventional on-line artifact rejection routines. They are based on an algorithm that computes a weight for each trial according to its similarity to the rest. The robustness of the two filters and their capacity to reduce recording time significantly were verified experimentally.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:Se3iqnhoufwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Effective connectivity patterns associated with p300 unmask differences in the level of attention/cognition between normal and disabled subjects",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_422",
            "Abstract": "Recent findings indicated that both P300 and α-event-related desynchronization (a-ERD) were associated, and similarly involved in cognitive brain functioning, like attention, allocation and memory updating. In a very recent study, the causality between P300 and α-ERD (Event Related Desynchronization) generators was investigated in four sensory modalities, i.e., audition, vision, somatosensory, and pain. In the present study, we investigated the effective connectivity patterns related with P300 during a visual modality protocol with six different flashing images in a normal and a disabled subject (Cerebral Palsy). We constructed effective connectivity graphs (ECGs) with Partial Directed Coherence (PDC) focusing on target trials in the frequency range of 8 – 13 Hz. Adopting a tensorial classification scheme, we succeeded to differentiate the trials related with six different images with classification performance …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Development of a Wireless Embedded System to Reduce the Influence of Gaussian Noise and 50 Hz Power Line Noise in Electromyography(EMG)",
            "Publication year": 2009,
            "Publication url": "http://www.wseas.us/e-library/conferences/2009/rodos/CIRCUITS/CIRCUITS13.pdf",
            "Abstract": "Electromyography (EMG) is a technique for evaluating and recording the activation signal of muscles. In EMG, the electrical source is the muscle membrane potential of about-70mV. Measured EMG potentials vary depending on the muscle under observation. The typical repetition rate of the muscle unit firing is about 7-20 Hz, depending on the size of the muscle, previous axon damage and other factors. EMG signals are influenced by electrical environmental noise. The main sources of these noise signals are the noise from the differential amplifier circuit that is normally included in data logger devices and 50 Hz power line noise. In this paper a development of a Wireless data acquisition system is presented. The system uses an embedded system and the commercial ZigBEE protocol to reduce the influence of white Gaussian noise and 50Hz Power line noise from EMG measurements signals.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:LYDvBi7O6RsC",
            "Publisher": "World Scientific and Engineering Academy and Society"
        },
        {
            "Title": "Exploiting the heightened phase synchronyin patients with neuromuscular disease forthe establishment of efficient motorimagery BCIs",
            "Publication year": 0,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:wyCGhLAOp5UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards an affordable brain computer interface for the assessment of programmers’ mental workload",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1071581918300934",
            "Abstract": "This paper provides a proof of concept for the use of wearable technology, and specifically wearable Electroencephalography (EEG), in the field of Empirical Software Engineering. Particularly, we investigated the brain activity of Software Engineers (SEngs) while performing two distinct but related mental tasks: understanding and inspecting code for syntax errors. By comparing the emerging EEG patterns of activity and neural synchrony, we identified brain signatures that are specific to code comprehension. Moreover, using the programmer's rating about the difficulty of each code snippet shown, we identified neural correlates of subjective difficulty during code comprehension. Finally, we attempted to build a model of subjective difficulty based on the recorded brainwave patterns. The reported results show promise towards novel alternatives to programmers’ training and education. Findings of this kind may …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:1DAnfT_YoJgC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A Tutorial on Graph Theory for Brain Signal Analysis",
            "Publication year": 0,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:5uu-MYFt2EcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generic scheme for color image retrieval based on the multivariate Wald-Wolfowitz test",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1423981/",
            "Abstract": "In this study, a conceptually simple, yet flexible and extendable strategy to contrast two different color images is introduced. The proposed approach is based on the multivariate Wald-Wolfowitz test, a nonparametric test that assesses the commonality between two different sets of multivariate observations. It provides an aggregate gauge of the match between color images, taking into consideration all the (selected) low-level characteristics, while alleviating correspondence issues. We show that a powerful measure of similarity between two color images can emerge from the statistical comparison of their representations in a properly formed feature space. For the sake of simplicity, the RGB-space is selected as the feature space, while we are experimenting with different ways to represent the images within this space. By altering the feature-extraction implementation, complementary ways to portray the image content …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An error-aware gaze-based keyboard by means of a hybrid BCI system",
            "Publication year": 2018,
            "Publication url": "https://www.nature.com/articles/s41598-018-31425-2",
            "Abstract": "Gaze-based keyboards offer a flexible way for human-computer interaction in both disabled and able-bodied people. Besides their convenience, they still lead to error-prone human-computer interaction. Eye tracking devices may misinterpret user’s gaze resulting in typesetting errors, especially when operated in fast mode. As a potential remedy, we present a novel error detection system that aggregates the decision from two distinct subsystems, each one dealing with disparate data streams. The first subsystem operates on gaze-related measurements and exploits the eye-transition pattern to flag a typo. The second, is a brain-computer interface that utilizes a neural response, known as Error-Related Potentials (ErrPs), which is inherently generated whenever the subject observes an erroneous action. Based on the experimental data gathered from 10 participants under a spontaneous typesetting scenario, we first …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:QndmRo8phpgC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Understanding and characterizing olfactory responses.",
            "Publication year": 2008,
            "Publication url": "https://europepmc.org/article/med/18463022",
            "Abstract": "Understanding and characterizing olfactory responses. - Abstract - Europe PMC Sign in or create \nan account https://orcid.org Europe PMC Menu About About Europe PMC Funders Joining \nEurope PMC Governance Roadmap Outreach Tools Tools overview ORCID article claiming \nJournal list Grant finder External links service RSS feeds Annotations Annotations submission \nservice Developers Developer resources Articles RESTful API Grants RESTful API API use \ncases SOAP web service Annotations API OAI service Bulk downloads Developers Forum Help \nHelp using Europe PMC Search syntax reference Contact us Contact us Helpdesk Feedback \nTwitter Blog Tech blog Developer Forum Europe PMC plus Search worldwide, life-sciences \nliterature Search Advanced Search Recent history Saved searches Abstract Full text \nReferences Citations & impact Funding Understanding and characterizing olfactory responses…",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:pk6FPx6l9xIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms for Vectorial Pattern-Analysis",
            "Publication year": 0,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.525.4781&rep=rep1&type=pdf",
            "Abstract": "The term ‘‘pattern’’, currently, encompasses the notion of a variety of data-forms the machines have to tackle with. Despite the fact that in early days it was used mostly for pictorial information, ie 2D-signals, now the same term stands almost for any output from a data-source. For instance, any digital-signal can be considered as an 1D-pattern, a grey-scale image as a 2D-patterm, a video-sequence as a (temporal) multi-dimensional pattern etc.Here we will present a general purpose framework for dealing with patterns and discuss simple algorithms with a wide-range of applications (from novelty-detection and prototyping in databases to the full organization of a library of patterns). The main characteristic of the framework and simultaneously its great benefit is its Geometrical character. This enables the direct conceptualization of the employed ideas and promotes the easy understanding of the described algorithmic steps.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:5o6HiIVP414C",
            "Publisher": "Unknown"
        },
        {
            "Title": "NASS: an empirical approach to spike sorting with overlap resolution based on a hybrid noise-assisted methodology",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027010002049",
            "Abstract": "Background noise and spike overlap pose problems in contemporary spike-sorting strategies. We attempted to resolve both issues by introducing a hybrid scheme that combines the robust representation of spike waveforms to facilitate the reliable identification of contributing neurons with efficient data learning to enable the precise decomposition of coactivations.The isometric feature mapping (ISOMAP) technique reveals the intrinsic data structure, helps with recognising the involved neurons and, simultaneously, identifies the overlaps. Exemplar activation patterns are first estimated for all detected neurons and consecutively used to build a synthetic database in which spike overlaps are systematically varied and realistic noise is added. An Extreme Learning Machine (ELM) is then trained with the ISOMAP representation of this database and learns to associate the synthesised waveforms with the corresponding …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Classifying children with reading difficulties from non-impaired readers via symbolic dynamics and complexity analysis of MEG resting-state data",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7886059/",
            "Abstract": "Magnetoencephalography (MEG) is a brain imaging method affording real-time temporal, and adequate spatial resolution to reveal aberrant neurophysiological function associated with dyslexia. In this study we analyzed sensor-level resting-state neuromagnetic recordings from 25 reading-disabled children and 27 non-impaired readers under the notion of symbolic dynamics and complexity analysis. We compared two techniques for estimating the complexity of MEG time-series in each of 8 frequency bands based on symbolic dynamics: (a) Lempel-Ziv complexity (LZC) entailing binarization of each MEG time series using the mean amplitude as a threshold, and (b) An approach based on the neural-gas algorithm (NG) which has been used by our group in the context of various symbolization schemes. The NG approach transforms each MEG time series to more than two symbols by learning the reconstructed …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:00hq1xGbIBsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BCIs using motor imagery and sensorimotor rhythms",
            "Publication year": 2020,
            "Publication url": "https://opac.atmaluhur.ac.id/uploaded_files/temporary/DigitalCollection/Nzk0OWNhZmY3MzY2OTI5NjhkNzBmNWM5OGU2ZjBlZDM1MDc0NWFkZA==.pdf#page=189",
            "Abstract": "Motor imagery (MI) Brain Computer Interfaces (BCI) are considered the most prominent paradigms of endogenous BCIs, as they comply with the requirements of asynchronous implementations. As MI BCIs can be operated via the movement imagination of one limb (eg, left hand), after a training period, the user can harness such an interface without the aid of external cue (s) that are considered ideal for selfpaced implementations. MI BCIs have been employed in several cases as a means of both communication restoration and neurorehabilitation. Neuromuscular disease (NMD), although rarely studied within the context of MI BCIs, presents significant interest mainly due to the disease’s progressive nature and the impact it has on each patient’s brain reorganization.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:AdGrMoNItN4C",
            "Publisher": "Healthcare Technologies"
        },
        {
            "Title": "On the improvement of support vector techniques for clustering by means of whitening transform",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4439734/",
            "Abstract": "In this letter, we suggest a novel method for clustering, based on finding the smallest enclosing hyperellipse in arbitrary Hilbert spaces. In particular, we show that the one class support vector method that finds the minimum bounding hypersphere, under the whitening transform, becomes a method for finding the minimum bounding hyperellipse. Afterwards, we generalize the method in order to find the minimum bounding hyperellipse in arbitrary Hilbert spaces. We illustrate the power of the proposed methods in clustering applications.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image enhancement using color and spatial information",
            "Publication year": 1997,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/595316/",
            "Abstract": "In this paper, a new filter that performs color image enhancement is presented. The filter achieves this through the minimization of a weighted cost function. The weights are determined using potential functions which are calculated in such a way as to convey spatial information. Application of the proposed filter on a real blurred and noisy color image is performed to verify its enhancement capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Characterizing dynamic functional connectivity across sleep stages from EEG",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s10548-008-0071-4",
            "Abstract": "Following a nonlinear dynamics approach, we investigated the emergence of functional clusters which are related with spontaneous brain activity during sleep. Based on multichannel EEG traces from 10 healthy subjects, we compared the functional connectivity across different sleep stages. Our exploration commences with the conjecture of a small-world patterning, present in the scalp topography of the measured electrical activity. The existence of such a communication pattern is first confirmed for our data and then precisely determined by means of two distinct measures of non-linear interdependence between time-series. A graph encapsulating the small-world network structure along with the relative interdependence strength is formed for each sleep stage and subsequently fed to a suitable clustering procedure. Finally the delineated graph components are comparatively presented for all stages …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Analyzing Functional Brain Connectivity by Means of Commute Times",
            "Publication year": 2012,
            "Publication url": "http://ikee.lib.auth.gr/record/129410",
            "Abstract": "There is growing interest in studying the association of functional connectivity patterns with particular cognitive tasks. The ability of graphs to encapsulate relational data has been exploited in many related studies, where functional networks (sketched by different neural synchrony estimators) are characterized by a rich repertoire of graph-related metrics. We introduce commute times (CTs) as an alternative way to capture the true interplay between the nodes of a functional connectivity graph (FCG). CT is a measure of the time taken for a random walk to setout and return between a pair of nodes on a graph. Its computation is considered here as a robust and accurate integration, over the FCG, of the individual pairwise measurements of functional coupling. To demonstrate the benefits from our approach, we attempted the characterization of time evolving connectivity patterns derived from EEG signals recorded while …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:SC9kKMAi-DoC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Unsupervised Artifact Rejection in Evoked Potential Recordings by Means of a Novel Nonlinear Technique",
            "Publication year": 1995,
            "Publication url": "https://scholar.google.com/scholar?cluster=14538407104536430340&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:pxLfhFzThFYC",
            "Publisher": "Springer Science and Media"
        },
        {
            "Title": "Improved detection of amnestic MCI by means of discriminative vector quantization of single-trial cognitive ERP responses",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027012004396",
            "Abstract": "Cognitive event-related potentials (ERPs) are widely employed in the study of dementive disorders. The morphology of averaged response is known to be under the influence of neurodegenerative processes and exploited for diagnostic purposes. This work is built over the idea that there is additional information in the dynamics of single-trial responses.We introduce a novel way to detect mild cognitive impairment (MCI) from the recordings of auditory ERP responses. Using single trial responses from a cohort of 25 amnestic MCI patients and a group of age-matched controls, we suggest a descriptor capable of encapsulating single-trial (ST) response dynamics for the benefit of early diagnosis.A customized vector quantization (VQ) scheme is first employed to summarize the overall set of ST-responses by means of a small-sized codebook of brain waves that is semantically organized. Each ST-response is then …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:maZDTaKrznsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Cardiac Electrical Instability of the Arrhythmogenic Tissue Substrate Assessed by Means of Wavelet Transform",
            "Publication year": 1997,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/18741",
            "Abstract": "The unstable activation wavefront from the tissue responsible for the production of ventricular tachycardia (VT) gives rise to beat-variable signals components that are eluded during the averaging step of high resolution ECG (HRECG). We used a mathematical model of small variations in a largely repetitive waveform to evaluate the beat-to-beat variance of the HRECG signal. The ability of the Morlet Wavelet Transform to discriminate the different factors responsible for the beat-variability (the alignment error and the beat-variable signal component) has been assessed on simulated signals. The performance evaluation on real ECG signals from normal subjects and patients with a documented history of ventricular tachycardia showed that the dynamics of the arrhythmogenic substrate as revealed by wavelet transform offers a significant improvement in ventricular tachycardia risk assessment.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:R3hNpaxXUhUC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "On the comparison of VR-responses, as performance measures in prospective memory, with auditory P300 responses in MCI detection.",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=0x3vAgAAQBAJ&oi=fnd&pg=PA156&dq=info:tTpd2-nCcY8J:scholar.google.com&ots=n7KqECorT5&sig=UIITcbOFFpvYJ9KDIxSBwPfEYh8",
            "Abstract": "Patients with amnestic mild cognitive impairment are at high risk for developing Alzheimer's disease. Besides episodic memory dysfunction they show deficits in accessing contextual knowledge that further specifies a general spatial navigation task or an executive function (EF) virtual action planning. There has been only one previous work with virtual reality and the use of a virtual action planning supermarket for the diagnosis of mild cognitive impairment. The authors of that study examined the feasibility and the validity of the virtual action planning supermarket (VAP-S) for the diagnosis of patients with mild cognitive impairment (MCI) and found that the VAP-S is a viable tool to assess EF deficits. In our study we employed the in-house platform of virtual action planning museum (VAP-M) and a sample of 25 MCI and 25 controls, in order to investigate deficits in spatial navigation, prospective memory and executive function. In addition, we used the morphology of late components in event-related potential (ERP) responses, as a marker for cognitive dysfunction. The related measurements were fed to a common classification scheme facilitating the direct comparison of both approaches. Our results indicate that both the VAP-M and ERP averages were able to differentiate between healthy elders and patients with amnestic mild cognitive impairment and agree with the findings of the virtual action planning supermarket (VAP-S). The sensitivity (specificity) was 100%(98%) for the VAP-M data and 87%(90%) for the ERP responses. Considering that ERPs have proven to advance the early detection and diagnosis of\" presymptomatic AD\", the suggested …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:ipvhVhH6zQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Magnetic field tomography of both cortical and pontine activity during eye movements",
            "Publication year": 2007,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-cdca6cbd-ca70-3cb5-b1d5-216478011d85",
            "Abstract": "Magnetic field tomography of both cortical and pontine activity during eye movements × Close \nThe Infona portal uses cookies, ie strings of text saved by a browser on the user's device. The \nportal can access those files and use them to remember the user's data, such as their chosen \nsettings (screen view, interface language, etc.), or their login data. By using the Infona portal \nthe user accepts automatic saving and using this information for portal operation purposes. \nMore information on the subject can be found in the Privacy Policy and Terms of Service. By \nclosing this window the user confirms that they have read the information on cookie usage, and \nthey accept the privacy policy and the way cookies are used by the portal. You can change the \ncookie settings in your browser. I accept Polski English Login or register account remember \nme Password recovery INFONA - science communication portal INFONA Search × of -…",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "P4-364 EFFECTS ON COGNITION OF A SELECTIVE P38MAPK ALPHA INHIBITOR IN AGED RATS",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=4865527168621651937&hl=en&oi=scholarr",
            "Abstract": "Background: Recent human genetic data indicate major drivers of Alzheimer’s are dysregulated microglia and neuroinflammation. As in vitro data indicate IL-1 b-p38 MAPK system is a key regulator of microglia/inflammation, p38 MAPK is recognized as a significant therapeutic target (Correa, 2012). However, the effects of inhibiting p38 MAPK in a chronic model of Alzheimer’s are unknown due to previous unavailability of blood-brain-barrier (BBB)-penetrant p38 MAPK antagonists (Munoz, 2010). VX745 (BBB penetrant selective p38 MAPK a antagonist) inhibits IL-1 b production and signaling, with potency against signaling two-fold higher. VX-745 has demonstrated anti-inflammatory activity in non-CNS clinical studies. To re-position for Alzheimer’s, VX-745 was tested in aged rat model. Methods: This study was conducted at Charles River Finland. It used 60 Fischer rats aged 20-24 months with cognitive deficit in Morris-Water-Maze (MWM), as well as 15 young (2-3 months) adult Fischer rats. The vehicle (1% Pluronic F108) or VX745 (0.5, 1.5 or 4.5 mg/kg) was administered twice daily by oral gavage for 23 days. Learning/memory deficits were analyzed by MWM on eight occasions. Hippocampal PSD95 and IL-1b were determined by ELISA; and plasma VX745 drug levels by LC/MS were determined at sacrifice, one hour after the last dose. Results: Vehicle-treated young rats demonstrated effective learning with rapid reduction in MWM latency/distance with sequential testing. Aged vehicle-treated rats appeared cognitively impaired, exhibiting longer times/distances than young rats, and little improvement during the study. VX745-treated aged rats …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:0dtNEdnCFDAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unlocking the Subconscious Consumer Bias: A Survey on the Past, Present, and Future of Hybrid EEG Schemes in Neuromarketing",
            "Publication year": 2021,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnrgo.2021.672982/full?utm_source=S-TWT&utm_medium=SNET&utm_campaign=ECO_FNINS_XXXXXXXX_auto-dlvrit",
            "Abstract": "Fueled by early success stories, the neuromarketing domain advanced rapidly during the last ten years. As exciting new techniques were being adapted from medical research to the commercial domain, many neuroscientists and marketing practitioners have taken the chance to exploit them so as to uncover the answers of the most important marketing questions. Among the available neuroimaging technologies, electroencephalography (EEG) stands out as the less invasive and most affordable method. While not equally precise as other neuroimaging technologies in terms of spatial resolution, it can capture brain activity almost at the speed of cognition. Hence, EEG constitutes a favorable candidate for recording and subsequently decoding the consumers’ brain activity. However, despite its wide use in neuromarketing, it cannot provide the complete picture alone. In order to overcome the limitations imposed by a single monitoring method, researchers focus on more holistic approaches. The exploitation of hybrid EEG schemes (e.g. combining EEG with eye-tracking, electrodermal activity, heart rate and/or other) is ever growing and will hopefully allow neuromarketing to uncover consumers' behaviour. Our survey revolves around last-decade hybrid neuromarketing schemes that involve EEG as the dominant modality. Beyond covering the relevant literature and the state-of-the-art findings, we also provide future directions on the field, present the limitations that accompany each of the commonly employed monitoring methods and briefly discuss the omni-present ethical scepticism related to neuromarketing.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:gNZucvRojEcC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Harnessing functional segregation across brain rhythms as a means to detect EEG oscillatory multiplexing during music listening",
            "Publication year": 2018,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1741-2552/aaac36/meta",
            "Abstract": "Objective. Music, being a multifaceted stimulus evolving at multiple timescales, modulates brain function in a manifold way that encompasses not only the distinct stages of auditory perception, but also higher cognitive processes like memory and appraisal. Network theory is apparently a promising approach to describe the functional reorganization of brain oscillatory dynamics during music listening. However, the music induced changes have so far been examined within the functional boundaries of isolated brain rhythms. Approach. Using naturalistic music, we detected the functional segregation patterns associated with different cortical rhythms, as these were reflected in the surface electroencephalography (EEG) measurements. The emerged structure was compared across frequency bands to quantify the interplay among rhythms. It was also contrasted against the structure from the rest and noise listening …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:e0CZ6poB34oC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Multivariate image similarity in the compressed domain using statistical graph matching",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320306001622",
            "Abstract": "We address the problem of image similarity in the compressed domain, using a multivariate statistical test for comparing color distributions. Our approach is based on the multivariate Wald–Wolfowitz test, a nonparametric test that assesses the commonality between two different sets of multivariate observations. Using some pre-selected feature attributes, the similarity measure provides a comprehensive estimate of the match between different images based on graph theory and the notion of minimal spanning tree (MST). Feature extraction is directly provided from the JPEG discrete cosine transform (DCT) domain, without involving full decompression or inverse DCT. Based on the zig-zag scheme, a novel selection technique is introduced that guarantees image's enhanced invariance to geometric transformations. To demonstrate the performance of the proposed method, the application on a diverse collection of …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:WF5omc3nYNoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Limited agreement between biomarkers of neuronal injury at different stages of Alzheimer's disease",
            "Publication year": 2014,
            "Publication url": "https://alz-journals.onlinelibrary.wiley.com/doi/abs/10.1016/j.jalz.2014.03.006",
            "Abstract": "New diagnostic criteria for Alzheimer's disease (AD) treat different biomarkers of neuronal injury as equivalent. Here, we quantified the degree of agreement between hippocampal volume on structural magnetic resonance imaging, regional glucose metabolism on positron emission tomography, and levels of phosphorylated tau in cerebrospinal fluid (CSF) in 585 subjects from all phases of the AD Neuroimaging Initiative. The overall chance‐corrected agreement was poor (Cohen κ, 0.24–0.34), in accord with a high rate of conflicting findings (26%–41%). Neither diagnosis nor APOE ε4 status significantly influenced the distribution of agreement between the biomarkers. The degree of agreement tended to be higher in individuals with abnormal versus normal CSF β‐amyloid (Aβ1‐42) levels. Prospective diagnostic criteria for AD should address the relative importance of markers of neuronal injury and elaborate a …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:d3xjRt2Mi1YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spike sorting based on dominant-sets clustering",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_2",
            "Abstract": "Spike sorting algorithms aim at decomposing complex extracellularly recorded electrical signals to independent events from single neurons in the vicinity of electrode. The decision about the actual number of active neurons in a neural recording is still an open issue, with sparsely firing neurons and background activity the most influencing factors. We introduce a graph-theoretical algorithmic procedure that successfully resolves this issue. Dimensionality reduction coupled with a modern, efficient and progressively-executable clustering routine proved to achieve higher performance standards than popular spike sorting methods. Our method is validated extensively using simulated data for different levels of SNR.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Mining information from event-related recordings",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1296544/",
            "Abstract": "In this article we describe a signal-processing framework for mining information from event-related recordings. Pattern-analytic tools are combined with graph-theoretic techniques and signal understanding methodologies in a user-friendly environment with the scope of learning, parameterization, and representation of the ST data manifold. Through the first part, we provide a general outline of our methodological approach while trying to demonstrate all the different stages, where DM tools can be applied. In the second part, we provide a more detailed demonstration, give a synopsis of the obtained results and take the opportunity to underline the merits of the adopted algorithmic procedures. To enable the full justification of our framework, instead of just including a technical demonstration of some of the incorporated DM and KDD tools, we address the problem of response variability: an issue of great neuroscientific …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An error-aware gaze-based keyboard by means of a hybrid BCI system",
            "Publication year": 0,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:LLUdpdcEW3AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Color-based image retrieval using vector quantization and multivariate graph matching",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1529806/",
            "Abstract": "A novel strategy for color-based image retrieval is introduced. Initially, a vector quantization technique is adopted, based on the application of self-organizing neural networks. The color content in each image is summarized by representative RGB-vectors extracted using the Neural-Gas network, an efficient way to extract faithful representations from multivariate distributions. The similarity between two images is then assessed as commonality between the corresponding representative color distributions and quantified using the multivariate Wald-Wolfowitz test, a nonparametric statistical test dealing with the \"multivariate two-sample problem\". Experimental results drawn from a diverse collection of color images show a significantly improved performance relative to the popular approach of color histogram.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Functional aspects of the EGF-induced MAP kinase cascade: a complex self-organizing system approach",
            "Publication year": 2014,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0111612",
            "Abstract": "The EGF-induced MAP kinase cascade is one of the most important and best characterized networks in intracellular signalling. It has a vital role in the development and maturation of living organisms. However, when deregulated, it is involved in the onset of a number of diseases. Based on a computational model describing a “surface” and an “internalized” parallel route, we use systems biology techniques to characterize aspects of the network’s functional organization. We examine the re-organization of protein groups from low to high external stimulation, define functional groups of proteins within the network, determine the parameter best encoding for input intensity and predict the effect of protein removal to the system’s output response. Extensive functional re-organization of proteins is observed in the lower end of stimulus concentrations. As we move to higher concentrations the variability is less pronounced. 6 functional groups have emerged from a consensus clustering approach, reflecting different dynamical aspects of the network. Mutual information investigation revealed that the maximum activation rate of the two output proteins best encodes for stimulus intensity. Removal of each protein of the network resulted in a range of graded effects, from complete silencing to intense activation. Our results provide a new “vista” of the EGF-induced MAP kinase cascade, from the perspective of complex self-organizing systems. Functional grouping of the proteins reveals an organizational scheme contrasting the current understanding of modular topology. The six identified groups may provide the means to experimentally follow the dynamics of this …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:irE4lMk4wWMC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "A tensorial approach to access cognitive workload related to mental arithmetic from EEG functional connectivity estimates",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6610156/",
            "Abstract": "The association of functional connectivity patterns with particular cognitive tasks has long been a topic of interest in neuroscience, e.g., studies of functional connectivity have demonstrated its potential use for decoding various brain states. However, the high-dimensionality of the pairwise functional connectivity limits its usefulness in some real-time applications. In the present study, the methodology of tensor subspace analysis (TSA) is used to reduce the initial high-dimensionality of the pairwise coupling in the original functional connectivity network to a space of condensed descriptive power, which would significantly decrease the computational cost and facilitate the differentiation of brain states. We assess the feasibility of the proposed method on EEG recordings when the subject was performing mental arithmetic task which differ only in the difficulty level (easy: 1-digit addition v.s. 3-digit additions). Two different …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spike sorting based on noise-assisted semi-supervised learning methodologies",
            "Publication year": 2011,
            "Publication url": "http://www.proslipsis.gr/cm_download.php?cm_attid=3668#page=93",
            "Abstract": "Background noise is considered the most influential factor regarding the success of any spike sorting algorithm. Its presence in the experimental data complicates the correct estimation of active neurons, while on the same time makes overlapping events (from co-activated neurons) difficult to resolve. So far, the assumption of a stationary Gaussian profile for the noise has dominated the developed spike-sorting methodologies. As a consequence, any deviation from stationarity and Gaussianity can lead to performance deterioration.We have recently introduced a novel paradigm in spike sorting (Adamos et al., 2010): noise-assisted methodologies that incorporate new trends in data-learning theory, so as the spike-sorting algorithm to be selfadaptive to the particular realization of the experimental data. In this work, we present an overview of our approach and extend its application towards the daunting scenario of …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "What does delta band tell us about cognitive processes: a mental calculation study",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304394010009353",
            "Abstract": "Multichannel EEG recordings from 18 healthy subjects were used to investigate brain activity in four delta subbands during two mental arithmetic tasks (number comparison and two-digit multiplication) and a control condition. The spatial redistribution of signal-power (SP) was explored based on four consecutives subbands of the delta rhythm. Additionally, network analysis was performed, independently for each subband, and the related graphs reflecting functional connectivity were characterized in terms of local structure (i.e. the clustering coefficient), overall integration (i.e. the path length) and the optimality of network organization (i.e. the “small-worldness”). EEG delta activity showed a widespread increase in all subbands during the performance of both arithmetic tasks. The inter-task comparison of the two arithmetic tasks revealed significant differences, in terms of signal-power, for the two subbands of higher …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Error-aware BCIs",
            "Publication year": 2020,
            "Publication url": "https://opac.atmaluhur.ac.id/uploaded_files/temporary/DigitalCollection/Nzk0OWNhZmY3MzY2OTI5NjhkNzBmNWM5OGU2ZjBlZDM1MDc0NWFkZA==.pdf#page=233",
            "Abstract": "The ability of recognizing and correcting the erroneous actions is an integral part of human nature. Plenty of neuroscientific studies have been investigating the ability of human brain to recognize errors. The distinct neuronal responses that are produced by the human brain during the perception of an erroneous action are referred to as errorrelated potentials (ErrPs). Although research in brain–computer interfaces (BCIs) has managed to achieve significant improvement in terms of detecting the users’ intentions over the last years, in a real-world setting, the interpretation of brain commands still remains an error-prone procedure leading to inaccurate interactions. Even for multimodal interaction schemes, the attained performance is far from optimal. As a means to overcome these debilities, and apart from developing more sophisticated machinelearning techniques or adding further modalities, scientists have also exploited the users’ ability to perceive errors. During the rapid growth of the BCI/Human-Machine Interaction (HMI) technology over the last years, ErrPs have been used widely in order to enhance several existing BCI applications serving as a passive correction mechanism towards a more user-friendly environment. The principal idea is that a BCI system may incorporate, as feedback, the user’s judgement about its function and use this feedback to correct its current output. In this chapter, we discuss the potentials and applications of ErrPs into developing hybrid BCI systems that emphasize in reliability and user experience by introducing the so-called error awareness.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:8EvVLpklxGMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel symbolization scheme for multichannel recordings with emphasis on phase information and its application to differentiate EEG activity from different mental tasks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11571-011-9186-5.pdf",
            "Abstract": "Symbolic dynamics is a powerful tool for studying complex dynamical systems. So far many techniques of this kind have been proposed as a means to analyze brain dynamics, but most of them are restricted to single-sensor measurements. Analyzing the dynamics in a channel-wise fashion is an invalid approach for multisite encephalographic recordings, since it ignores any pattern of coordinated activity that might emerge from the coherent activation of distinct brain areas. We suggest, here, the use of neural-gas algorithm (Martinez et al. in IEEE Trans Neural Netw 4:558–569, 1993) for encoding brain activity spatiotemporal dynamics in the form of a symbolic timeseries. A codebook of k prototypes, best representing the instantaneous multichannel data, is first designed. Each pattern of activity is then assigned to the most similar code vector. The symbolic timeseries derived in this way is mapped to a …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "NNMF connectivity microstates: a new approach to represent the dynamic brain coordination",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Stavros-Dimitriadis-3/publication/305424281_NNMF_connectivity_microstates_A_new_approach_to_represent_the_dynamic_brain_coordination/links/5837156608aed5c614863980/NNMF-connectivity-microstates-A-new-approach-to-represent-the-dynamic-brain-coordination.pdf",
            "Abstract": "Symbolic dynamics (Rajagopalan et al. 2007) in the context of EEG are highly interwoven with the notion of Lehmann's microstates (Lehmann et al. 1987, 2010). These are detectable in the multichannel signal, from both event-related and spontaneous activity recordings, as recurrent quasi-stable scalp potential maps lasting from tens to hundreds of milliseconds. Discrete symbols can be assigned to these microstates, and since they are characterized by great consistency across subjects, this offers a very efficient data reduction method and further facilitates the derivation of brain dynamics descriptors (Ville et al. 2010; Dimitriadis et al., 2012). However, the whole approach relies on signal amplitude characteristics and, hence, ignores aspects of neural coordination that involves genuine interactions beyond coincidence in timing. Inspired by the simplicity and effectiveness of microstates, we have recently introduced an alternative representation that aims at analyzing functional-connectivity patterns (Dimitriadis et al. 2013, 2015). The relevant microstates, functional connectivity microstates (FCμstates), proved to be convenient descriptors for tracking inter-areal synchronization during cognitive ERP responses and revealed dynamical trends in a parsimonious fashion.We increase the descriptive power of the FCμstates approach by integrating a nonnegative matrix factorization (NNMF)(Lee and Sung, 1999) algorithmic step. Here-for the first time-NNMF is applied to functional connectivity patterns, which are formed by inherently positively-valued measurements. The introduced approach starts by deriving time-indexed functional connectivity profiles …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:qzPvQt7yPGwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparison of Delta, Theta, Alpha, Beta and Gamma waves in Different Brain Regions of Patients with MCI and Alzheimer’s Disease with Normal Controls; A Preliminary Study",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=14428896743604792054&hl=en&oi=scholarr",
            "Abstract": "▶ Understanding the pathophysiology of EEG changes in Alzheimer's disease (AD) is very complex and just some general concepts have been commented.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:cUMtEw7vMgQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-linear methods for P300 latency measure-ment improvement",
            "Publication year": 1994,
            "Publication url": "https://www.academia.edu/download/51075901/0167-8760_2894_2990303-420161227-12286-1tiwviw.pdf",
            "Abstract": "Event-related potentials and in particular P300 are accepted research tools for the study of cognitive neuroscience. P300 has been related to task relevance, information delivery, decision making, expectancy, stimulus evaluation time, etc. Although its importance has been underlined, no systematic work on its enhancement via signal processing methods has yet been presented. The individual sweeps are affected by latency jitter and might contain an EEG component too high for accurate P300 detection. This way, the most useful information to be extracted (P300 latency) is diminished. It is our objective to restore the degraded peaks and provide accurate information about their exact location. The proposed processing method is based on non-linear filtering of the FIR-median hybrid (FMH) type. Elaborating research via discriminant analysis showed that a triangular-like modelling of a useful signal is not far from being realistic. The proposed filter, selected from the FMH filter family, has been designed for revealing triangular-shaped signals from additive gaussian noise (the on-going EEG in our case). The new method is recommended as a powerful tool incorporated in the peak-picking procedure, where the ensemble average will be processed. It is also recommended in place of the single-trial template-fitting procedures that suffer from the fact that the EP is embedded in the on-going EEG (especially in elderly people). III this case the filtering of each individual sweep will lead to the corresponding single-trial P3OO latency measurement. The variability quantification of these measurements constitutes a parameter of great significance for the 1Q …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Points of interest extraction using pairwise clustering and spatial features",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071604/",
            "Abstract": "In this work, the idea of local features extraction from image data based on points of interest, is revised. The method is based on a nonparametric pairwise clustering algorithm and the application of Hubert's test statistic. The clustering algorithm iteratively partitions the input image data until it finally converges to 2 classes. On the other hand the use of Hubert's test guarantees that the 2 classes in the feature space are associated with a well organized structure in the image plane. Both algorithms utilize the dissimilarity matrix of the input data. The validity of the approach is demonstrated by applying the method to an image retrieval system.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:3AIi9tQMIrsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the quantization of time-varying phase synchrony patterns into distinct functional connectivity microstates (FCμstates) in a multi-trial visual ERP paradigm",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10548-013-0276-z?error=cookies_not_supported&error=cookies_not_supported&code=35a4ac27-5562-4c28-aad7-e98305262698&code=1c109064-3ee2-4f62-bfab-c59dd438125c",
            "Abstract": "The analysis of functional brain connectivity has been supported by various techniques encompassing spatiotemporal interactions between distinct areas and enabling the description of network organization. Different brain states are known to be associated with specific connectivity patterns. We introduce here the concept of functional connectivity microstates (FCμstates) as short lasting connectivity patterns resulting from the discretization of temporal variations in connectivity and mediating a parsimonious representation of coordinated activity in the brain. Modifying a well-established framework for mining brain dynamics, we show that a small sized repertoire of FCμstates can be derived so as to encapsulate both the inter-subject and inter-trial response variability and further provide novel insights into cognition. The main practical advantage of our approach lies in the fact that time-varying connectivity …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Mapping CSF biomarker profiles onto NIA–AA guidelines for Alzheimer’s disease",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00406-015-0628-7",
            "Abstract": " The National Institute on Aging–Alzheimer’s Association (NIA–AA) guidelines for Alzheimer’s disease (AD) propose the categorization of individuals according to their biomarker constellation. Though the NIA–AA criteria for preclinical AD and AD dementia have already been applied in conjunction with imaging AD biomarkers, the application of the criteria using comprehensive cerebrospinal fluid (CSF) biomarker information has not been thoroughly studied yet. The study included a monocentric cohort with healthy (N = 41) and disease (N = 22) controls and patients with AD dementia (N = 119), and a multicentric sample with healthy controls (N = 116) and patients with AD dementia (N = 102). The CSF biomarkers β-amyloid 1–42, total tau, and phosphorylated tau at threonine 181 were measured with commercially available assays. Biomarker values were trichotomized into positive for AD, negative, or …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:GO2DTSf4MZMC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "In quest of the missing neuron: spike sorting based on dominant-sets clustering",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260711003038",
            "Abstract": "Spike sorting algorithms aim at decomposing complex extracellular signals to independent events from single neurons in the electrode's vicinity. The decision about the actual number of active neurons is still an open issue, with sparsely firing neurons and background activity the most influencing factors. We introduce a graph-theoretical algorithmic procedure that successfully resolves this issue. Dimensionality reduction coupled with a modern, efficient and progressively executable clustering routine proved to achieve higher performance standards than popular spike sorting methods. Our method is validated extensively using simulated data for different levels of SNR.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Covariation Informed Graph Slepians for Motor Imagery Decoding",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9316955/",
            "Abstract": "Graph signal processing (GSP) provides signal analytic tools for data defined in irregular domains, as is the case of non-invasive electroencephalography (EEG). In this work, the recently introduced technique of  Graph Slepian functions  is exploited for the robust decoding of motor imagery (MI) brain activity. The particular technique builds over the concept of graph Fourier transform (GFT) and provides additional flexibility in the subsequent data analysis by incorporating domain knowledge. Based on contrastive learning, we introduce an algorithmic pipeline that attains a data driven and subject specific design of Graph Slepian functions. These functions, by incorporating both the topology of the sensor array and the empirical evidence about the differential functional covariation, act as spatial filters that enhance the information conveyed by the multichannel signal and specifically relates to the participant’s intention …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:o4Qvs5Y5TLQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "pursue of attentional modulations based on multi-trial event-related responses",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Stavros-Dimitriadis-3/publication/262916293_Analyzing_Functional_Brain_Connectivity_by_means_of_Commute-Timesin_pursue_of_attentional_modulations_based_on_multi-trial_event-related_responses/links/5506c4b00cf2d60c0e6d8c55/Analyzing-Functional-Brain-Connectivity-by-means-of-Commute-Timesin-pursue-of-attentional-modulations-based-on-multi-trial-event-related-responses.pdf",
            "Abstract": "Text We introduce commute times (CTs) as an alternative way to capture the true interplay between the nodes of a functional connectivity graph (FCG). Commute time is a measure of the time taken for a random walk to set-out and return between a pair of nodes on a graph. Its computation is considered here as a robust and accurate integration, over the FCG, of the individual pairwise measurements of functional coupling.To demonstrate the benefits from our approach, we attempted the characterization of time evolving connectivity patterns derived from EEG signals recorded while the subject was engaged in an eye-movement task. A fixation cross appeared in the middle of the screen indicating the beginning of the trial (baseline period). Two seconds later, a checkerboard pattern appeared either on the left, or on the right, pseudo-randomly. After 4 sec the disappearance of the central fixation cross indicated the “go” signal and subjects had to make a saccade towards the opposite side of the checkerboard (antisaccade). Using the same stimuli, subjects were instructed not to perform the saccade and view passively the stimuli on the screen. We refer to the first as “attentive” condition, and to the second as “passive” condition.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:GUJN1xMjMHAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transition dynamics of EEG-based network microstates during mental arithmetic and resting wakefulness reflects task-related modulations and developmental changes",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11571-015-9330-8",
            "Abstract": "We studied how maturation influences the organization of functional brain networks engaged during mental calculations and in resting state. Surface EEG measurements from 20 children (8–12 years) and 25 students (21–26 years) were analyzed. Interregional synchronization of brain activity was quantified by means of Phase Lag Index and for various frequency bands. Based on these pairwise estimates of functional connectivity, we formed graphs which were then characterized in terms of local structure [local efficiency (LE)] and overall integration (global efficiency). The overall data analytic scheme was applied twice, in a static and time-varying mode. Our results showed a characteristic trend: functional segregation dominates the network organization of younger brains. Moreover, in childhood, the overall functional network possesses more prominent small-world network characteristics than in early …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:6fxomyk5x4cC",
            "Publisher": "Springer"
        },
        {
            "Title": "The human primary somatosensory cortex response contains components related to stimulus frequency and perception in a frequency discrimination task",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306452203003531",
            "Abstract": "Somatosensory stimulation of primary somatosensory cortex (SI) using frequency discrimination offers a direct, well-defined and accessible way of studying cortical decisions at the locus of early input processing. Animal studies have identified and classified the neuronal responses in SI but they have not yet resolved whether during prolonged stimulation the collective SI response just passively reflects the input or actively participates in the comparison and decision processes. This question was investigated using tomographic analysis of single trial magnetoencephalographic data. Four right-handed males participated in a frequency discrimination task to detect changes in the frequency of an electrical stimulus applied to the right-hand digits 2+3+4. The subjects received approximately 600 pairs of stimuli with Stim1 always at 21 Hz, while Stim2 was either 21 Hz (50%) or varied from 22 to 29 Hz in steps of 1 Hz …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Understanding and characterizing Olfactory responses [A manifold learning approach based on optical recordings]",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4469641/",
            "Abstract": "The olfactory bulb (OB) is the first stage of olfactory information processing in the brain. On its way to the cortex, odor information is encoded in spatiotemporal maps of activated loci in the bulb, and these are known as input maps. Using optical recording techniques, experimental neuro-scientists can reveal the input maps by applying response-dependent fluorescent dyes to the OB of rodents and imaging the odorant-evoked responses. A hard signal analysis task then emerges (i.e., to handle the resulting sequence of spatial patterns). We suggest that the intricate spatiotemporal patterning of event-related dynamics can be described fully by using a manifold learning approach that merges both the spatial and temporal aspects of the response into a single visualization scheme.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Incorporating resting state dynamics in the analysis of encephalographic responses by means of the Mahalanobis–Taguchi strategy",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417412012249",
            "Abstract": "The analysis of encephalographic responses has mostly been attempted via signal analytic techniques aiming at revealing the useful information from recordings which are considered as contaminated by the ubiquitous ongoing (or background) brain activity. There is continuously accumulating evidence for the existence of well-defined resting-state-networks (RSNs) in the brain, which play a crucial role in the generation of spontaneous activity and the associated neural responses. Hence, the signal plus noise is no longer a valid model and the ongoing fluctuations may influence the response.We introduce here the use of a multivariate statistical methodology, known as Mahalanobis–Taguchi (MT) strategy, which can be tailored to the spontaneous fluctuations so as to optimize the subsequent response detection. A subject-specific version of the MT strategy that combines the original methodology with a clustering …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:r0BpntZqJG4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Querying functional brain connectomics to discover consistent subgraph patterns",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701655/",
            "Abstract": "Dynamic recordings of functional activity maps can naturally and efficiently be represented in the form of functional/effective connectivity networks. New methods for mapping synaptic connections and recording neural signals generate rich and complex data about the structure and dynamics of brain networks. To study the most complex network in nature, the brain, there is need to integrate a huge amount of brain networks collected from laboratories over the world in large databases. Human Brain Project (Europe and USA) aims to explore brain functionality in various ways. Brain networks are central to achieving the goals of this ambitious plan. However, the immense amount of thousands of brain networks, prevent an easy way to utilizable knowledge. In this paper, we demonstrate a data-driven approach that discovers consistent patterns from a collection of brain networks via a querying approach: formulating a …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:2MdNiwGT7yoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Surface EEG shows that functional segregation via phase coupling contributes to the neural substrate of mental calculations",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S027826261200053X",
            "Abstract": "Multichannel EEG traces from healthy subjects are used to investigate the brain’s self-organisation tendencies during two different mental arithmetic tasks. By making a comparison with a control-state in the form of a classification problem, we can detect and quantify the changes in coordinated brain activity in terms of functional connectivity. The interactions are quantified at the level of EEG sensors through descriptors that differ over the nature of functional dependencies sought (linear vs. nonlinear) and over the specific form of the measures employed (amplitude/phase covariation). Functional connectivity graphs (FCGs) are analysed with a novel clustering algorithm, and the resulting segregations enter an appropriate discriminant function.The magnitude of the contrast function depends on the frequency-band (θ, α1, α2, β and γ) and the neural synchrony descriptor. We first show that the maximal-contrast …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:aqlVkmm33-oC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A symbolic dynamics approach to Epileptic Chronnectomics",
            "Publication year": 2016,
            "Publication url": "http://ikee.lib.auth.gr/record/301486",
            "Abstract": "Treating brain as a complex system is currently among the most popular approaches that are used to understand its function and explain encephalopathies. The networked epileptic brain has already been studied through various neuroimaging modalities based on estimates of functional connectivity. Here, we suggest that additional insights to epileptogenesis can be gained with an appropriate description on the network (re) organization dynamics as these are reflected in surface EEG measurements. Our approach commences with a pattern analytic step that turns a time series of connectivity patterns into a symbolic time series. The condensed dynamics are then analyzed by means of Markov chain modeling and a motif detection algorithm. Both descriptions yield novel dynamic characteristics that can capture the progression towards an epileptic crisis. Conceptually, our work adds to the emerging field of …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:Jxw8hHINxX0C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "On the extension of ordinal time series analysis for multisite recordings: A new method and its use in discriminating EEG activity during different mental tasks",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Stavros-Dimitriadis-3/publication/262916378_On_the_extension_of_ordinal_time_series_analysis_for_multisite_recordings_A_new_method_and_its_use_in_discriminating_EEG_activity_during_different_mental_tasks/links/5e9205d4a6fdcca7890ca0d3/On-the-extension-of-ordinal-time-series-analysis-for-multisite-recordings-A-new-method-and-its-use-in-discriminating-EEG-activity-during-different-mental-tasks.pdf",
            "Abstract": "OBJECTIVE: Analyzing ordinal patterns has recently gained high popularity among practitioners of nonlinear dynamics and currently appears as a powerful tool of Symbolic Time Series Analysis capable of revealing changes in the dynamics of EEG data [1]. In its original format, the particular approach is tailored to unidimensional timeseries, hence its straightforward application to brain signals is restricted to singlesensor measurements. The treatment of multisite recordings by analyzing the dynamics in a channelwise fashion is obviously a problematic approach, as it is equivalent to ignoring any coordinated activity patterns emerging from the coherent activation of distinct brain areas. We introduce here a vectorial version of ordinal time series analysis that can fully encompass the multidimensional character of brain’s activations and covariations. By applying it to EEG-data from subjects while performing mental calculations, we show that our approach can differentiate between, otherwise, indistinguishable brain states.METHODS: A sliding window is moving along the N-dimensional time series (each recording site treated as an individual variate). At every step, the window encloses M successive vectors on which we apply a vector-ranking operator and the resulting ranks provides the ordinal pattern associated with the particular signal-segment. This is, always, just one of the permutations of {1, 2,…, M}. By simply counting the number of different ordinal patterns, which appear while traversing the whole timeseries, we end up with a histogram reflecting the variations in global brain dynamics. Having established this representation, the contrast …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel biomarker of amnestic MCI based on dynamic cross-frequency coupling patterns during cognitive brain responses",
            "Publication year": 2015,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnins.2015.00350/full",
            "Abstract": "The detection of mild cognitive impairment (MCI), the transitional stage between normal cognitive changes of aging and the cognitive decline caused by AD, is of paramount clinical importance, since MCI patients are at increased risk of progressing into AD. Electroencephalographic (EEG) alterations in the spectral content of brainwaves and connectivity at resting state have been associated with early-stage AD. Recently, cognitive event-related potentials (ERPs) have entered into the picture as an easy to perform screening test. Motivated by the recent findings about the role of cross-frequency coupling (CFC) in cognition, we introduce a relevant methodological approach for detecting MCI based on cognitive responses from a standard auditory oddball paradigm. By using the single trial signals recorded at Pz sensor and comparing the responses to target and non-target stimuli, we first demonstrate that increased CFC is associated with the cognitive task. Then, considering the dynamic character of CFC, we identify instances during which the coupling between particular pairs of brainwave frequencies carries sufficient information for discriminating between normal subjects and patients with MCI. In this way, we form a multiparametric signature of impaired cognition. The new composite biomarker was tested using data from a cohort that consists of 25 amnestic MCI patients and 15 age-matched controls. Standard machine-learning algorithms were employed so as to implement the binary classification task. Based on leave-one-out cross-validation, the measured classification rate was found reaching very high levels (95%). Our approach compares …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:vbti4gW_9XwC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "A Data Augmentation Scheme for Geometric Deep Learning in Personalized Brain–Computer Interfaces",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9186097/",
            "Abstract": "Electroencephalography signals inherently deviate from the notion of regular spatial sampling, as they reflect the coordinated action from multiple distributed overlapping cortical networks. Hence, the observed brain dynamics are influenced both by the topology of the sensor array and the underlying functional connectivity. Neural engineers are currently exploiting the advances in the domain of graph signal processing in an attempt to create robust and reliable brain decoding systems. In this direction, Geometric Deep Learning is a highly promising concept for combining the benefits of graph signal processing and deep learning towards revolutionising Brain-Computer Interfaces (BCIs). However, its exploitation has been hindered by its data-demanding character. As a remedy, we propose here a novel data augmentation approach that combines the multiplex network modelling of multichannel signal with a graph …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:5McdzzY_mmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Beyond FCM: graph-theoretic post-processing algorithms for learning and representing the data structure",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320308000769",
            "Abstract": "We show that when fuzzy C-means (FCM) algorithm is used in an over-partitioning mode, the resulting membership values can be further utilized for building a connectivity graph that represents the relative distribution of the computed centroids. Standard graph-theoretic procedures and recent algorithms from manifold learning theory are subsequently applied to this graph. This facilitates the accomplishment of a great variety of data-analysis tasks. The definition of optimal cluster number C o, the detection of intrinsic geometrical constraints within the data, and the faithful low-dimensional representation of the original structure are all performed efficiently, by working with just a down-sampled version (comprised of the centroids) of the data. Our approach is extensively demonstrated using synthetic data and actual brain signals.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:roLk4NBRz8UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Musical NeuroPicks: a consumer-grade BCI for on-demand music streaming services",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S092523121731768X",
            "Abstract": "We investigated the possibility of using a machine-learning scheme in conjunction with commercial wearable EEG-devices for translating listener's subjective experience of music into scores that can be used in popular on-demand music streaming services.Our study resulted into two variants, differing in terms of performance and execution time, and hence, subserving distinct applications in online streaming music platforms. The first method, NeuroPicks, is extremely accurate but slower. It is based on the well-established neuroscientific concepts of brainwave frequency bands, activation asymmetry index and cross frequency coupling (CFC). The second method, NeuroPicksVQ, offers prompt predictions of lower credibility and relies on a custom-built version of vector quantization procedure that facilitates a novel parameterization of the music-modulated brainwaves.Beyond the feature engineering step, both …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:MbTKqoTs-1EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "AI based Music Recommendation system using Deep Learning Algorithms",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Anand-Raju/publication/352593691_AI_based_Music_Recommendation_system_using_Deep_Learning_Algorithms/links/61682b138ad119749b196262/AI-based-Music-Recommendation-system-using-Deep-Learning-Algorithms.pdf",
            "Abstract": "The customized recommendation framework for music should accurately represent private tastes. To obtain tailored feedback for the needs of various viewers, it takes adjustments. To find the better deep learning model for the recommendation may pave a way for a better recommender. Compared to the previous era, with commercial music streaming sites that can be downloaded from mobile devices, digital music availability is currently plentiful. It takes a very long time to figure out all this digital music and induces data exhaustion. It may be helpful to create a music recommendation system that can automatically scan the music libraries and suggest appropriate songs to users. The music provider will anticipate and then give their customers the appropriate songs based on the characteristics of the music previously heard by using the music recommendation system. Our study would like to build a framework for music recommendations that can provide recommendations based on the similarity of audio signal features. This research uses the Convolutional Neural Network (CNN) and the Recurrent Neural Network (RNN). Customized recommendation system for music should effectively represent private preferences. To attain tailored recommendations for the demands of different listeners, it needs changes and therefore, attempting to find a better deep learning model for the recommendation will pave a way for a better recommender.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:3ssty3PwuTgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A complex-valued functional brain connectivity descriptor amenable to Riemannian geometry",
            "Publication year": 0,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:gPamCmV4epEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Visual Information Retrieval using Orthogonal MSTs",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4127497/",
            "Abstract": "The notion of interpoint-distance-based graphs has in the past, guided the extension of distributional order-measures to multivariate observations. The concept of minimal spanning tree (MST) was introduced as the key pattern for generalizing the univariate two-sample problem to multivariate observations. Here, the multivariate Wald-Wolfowitz test is further quantified using the enhanced representations of orthogonal MSTs. Their advantages are investigated by comparing the similarity between color distributions in the feature space, using a standard feature extraction technique borrowed computer vision. To demonstrate the performance of the proposed scheme, the application on a diverse collection of images has been systematically studied in a query-by-example visual information retrieval task. Experimental results show that a powerful measure of similarity can emerge from the statistical comparison of their …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy description of skin lesions",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Lucia-Ballerini/publication/228590031_Fuzzy_Description_of_Skin_Lesions/links/0912f50812ed197375000000/Fuzzy-Description-of-Skin-Lesions.pdf",
            "Abstract": "We propose a system for describing skin lesions images based on a human perception model. Pigmented skin lesions including melanoma and other types of skin cancer as well as non-malignant lesions are used. Works on classification of skin lesions already exist but they mainly concentrate on melanoma. The novelty of our work is that our system gives to skin lesion images a semantic label in a manner similar to humans. This work consists of two parts: first we capture they way users perceive each lesion, second we train a machine learning system that simulates how people describe images. For the first part, we choose 5 attributes: colour (light to dark), colour uniformity (uniform to non-uniform), symmetry (symmetric to non-symmetric), border (regular to irregular), texture (smooth to rough). Using a web based form we asked people to pick a value of each attribute for each lesion. In the second part, we extract 93 features from each lesions and we trained a machine learning algorithm using such features as input and the values of the human attributes as output. Results are quite promising, especially for the colour related attributes, where our system classifies over 80% of the lesions into the same semantic classes as humans.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Color image segmentation using Laplacian eigenmaps",
            "Publication year": 2009,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Journal-of-Electronic-Imaging/volume-18/issue-2/023004/Color-image-segmentation-using-Laplacian-eigenmaps/10.1117/1.3122369.short",
            "Abstract": "The novel technique of Laplacian eigenmaps (LE) is studied as a means of improving the clustering-based segmentation of color images. Taking advantage of the ability of the LE algorithm to learn the actual manifold of the multivariate data, a computationally efficient scheme is introduced. After embedding the local image characteristics, extracted from overlapping regions, in a high-dimensional feature space, the skeleton of the intrinsically low-dimensional manifold is constructed using spectral graph theory. Using the LE-based dimensionality reduction technique, a low-dimensional map is computed in which the variations of the local image characteristics are presented in the context of global image variation. The nonlinear projections on this map serve as inputs to the Fuzzy C-Means (FCM) algorithm, boosting its clustering performance significantly. The final segmentation is produced by a simple labeling …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:kNdYIx-mwKoC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "‘’MINeD Graphs’’: graphs mined from time-resolved functional brain connectomics",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=10876292588617892912&hl=en&oi=scholarr",
            "Abstract": "The concept of functional connectivity is central for understanding the synergistic behavior of brain regions which form distributed networks. With the fast advancement of neuroimaging techniques and the subsequent development of sophisticated signal-analytic methodologies, connectivity can nowadays be assessed in various ways. Often, the descriptive power of graphs is exploited by turning connectivity measurements into graph topologies.Studies of cognition aim at elucidating the inherent mechanisms for information processing and rely on observation of signals emitted from distinct brain areas. Cognition is thought to emerge through integrated activities of neuronal populations throughout the brain, following the principles of segregation and integration. Distinctive patterns of brain activation were extensively sought as neural correlates of cognitive (sub) processes, by associating them with stimuli and behavioral responses. However, it is only recently that the ongoing reconfiguration of brain networks has been brought under examination.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:oMtqKo3K3HAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TMS combined with EEG in genetic generalized epilepsy: a phase II diagnostic accuracy study",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1388245716306691",
            "Abstract": "(A) To develop a TMS–EEG stimulation and data analysis protocol in genetic generalized epilepsy (GGE). (B) To investigate the diagnostic accuracy of TMS–EEG in GGE.Pilot experiments resulted in the development and optimization of a paired-pulse TMS–EEG protocol at rest, during hyperventilation (HV), and post-HV combined with multi-level data analysis. This protocol was applied in 11 controls (C) and 25 GGE patients (P), further dichotomized into responders to antiepileptic drugs (R, n = 13) and non-responders (n-R, n = 12).Features (n = 57) extracted from TMS–EEG responses after multi-level analysis were given to a feature selection scheme and a Bayesian classifier, and the accuracy of assigning participants into the classes P-C and R-nR was computed.On the basis of the optimal feature subset, the cross-validated accuracy of TMS–EEG for the classification P-C was 0.86 at …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:uqZYSrDi9MMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Analyzing functional brain connectivity by means of commute times: a new approach and its application to track event-related dynamics",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6145618/",
            "Abstract": "There is growing interest in studying the association of functional connectivity patterns with particular cognitive tasks. The ability of graphs to encapsulate relational data has been exploited in many related studies, where functional networks (sketched by different neural synchrony estimators) are characterized by a rich repertoire of graph-related metrics. We introduce commute times (CTs) as an alternative way to capture the true interplay between the nodes of a functional connectivity graph (FCG). CT is a measure of the time taken for a random walk to setout and return between a pair of nodes on a graph. Its computation is considered here as a robust and accurate integration, over the FCG, of the individual pairwise measurements of functional coupling. To demonstrate the benefits from our approach, we attempted the characterization of time evolving connectivity patterns derived from EEG signals recorded while …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Revealing cross-frequency causal interactions during a mental arithmetic task through symbolic transfer entropy: a novel vector-quantization approach",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7384514/",
            "Abstract": "Working memory (WM) is a distributed cognitive process that employs communication between prefrontal cortex and posterior brain regions in the form of cross-frequency coupling between theta (θ) and high-alpha (α2) brain waves. A novel method for deriving causal interactions between brain waves of different frequencies is essential for a better understanding of the neural dynamics of such complex cognitive process. Here, we proposed a novel method to estimate transfer entropy (TE) through a symbolization scheme, which is based on neural-gas algorithm (NG) and encodes a bivariate time series in the form of two symbolic sequences. Given the symbolic sequences, the delay symbolic transfer entropy (dSTE NG ) is defined. Our approach is akin to standard symbolic transfer entropy (STE) that incorporates the ordinal pattern (OP) symbolization technique. We assessed the proposed method in a WM-invoked …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:hXkWDDAEazwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Tutorial on Graph Theory for Brain Signal Analysis",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2007.05800",
            "Abstract": "This tutorial paper refers to the use of graph-theoretic concepts for analyzing brain signals. For didactic purposes it splits into two parts: theory and application. In the first part, we commence by introducing some basic elements from graph theory and stemming algorithmic tools, which can be employed for data-analytic purposes. Next, we describe how these concepts are adapted for handling evolving connectivity and gaining insights into network reorganization. Finally, the notion of signals residing on a given graph is introduced and elements from the emerging field of graph signal processing (GSP) are provided. The second part serves as a pragmatic demonstration of the tools and techniques described earlier. It is based on analyzing a multi-trial dataset containing single-trial responses from a visual ERP paradigm. The paper ends with a brief outline of the most recent trends in graph theory that are about to shape brain signal processing in the near future and a more general discussion on the relevance of graph-theoretic methodologies for analyzing continuous-mode neural recordings.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:H8haQKU-3ZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Beat-to-beat wavelet variance of the QRS complex as a marker of arrhythmogenic substrate in ventricular tachycardia patients",
            "Publication year": 1998,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0967-3334/19/1/007/meta",
            "Abstract": "This study proposes a wavelet transform based technique to assess the beat-to-beat variation of the QRS signal in post-myocardial infarction patients with sustained monomorphic ventricular tachycardia. Recent electrophysiological investigations suggested that the diminished synchrony between the normal myocardium and the scarred arrhythmogenic tissue bordering a myocardial infarction area gives rise to beat-variable ECG signal components. Using a mathematical model of small variations in a largely repetitive waveform, we show that the inherent alignment errors (trigger jitter) of the high-resolution ECG (HRECG) can artificially increase the value of the time-domain beat-to-beat variance, making it less valuable as a marker of beat-variable signal components. To overcome this drawback, we propose the wavelet based approach which discriminates between the different factors responsible for the beat …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:ufrVoPGSRksC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Image similarity based on a distributional\" metric\" for multivariate data",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.460.2713&rep=rep1&type=pdf",
            "Abstract": "The problem of image similarity has become a challenging task in the field of computer vision through the last two decades. The assessment of (dis) similarity between color (or multichannel, in general) images or parts of images has been studied on several image processing application domains such as image indexing and retrieval, classification and unsupervised segmentation (Rubner et al., 2001). The basic operations that need to be carried out in order to estimate the similarity between two color images are three-fold (Stricker & Orengo, 1995): first, choose an appropriate color space for image representation; then, extract a signature for each image (using, commonly, low-level features) to construct a theoretically valid distribution; finally, establish pairwise comparisons based on these signatures. Each signature constitutes the content description of a corresponding image. It is summarized based on pixel attributes and provides a representation of the image in a multidimensional feature space. There, a proper (dis) similarity measure is defined in order to act as a general rule for comparing any given pair of images. In these directions, several (dis) similarity measures have been developed and used as empirical estimates of the distribution of image features, confirming that distribution-based measures exhibit excellent performance in all areas (Rubner et al., 2001). In the context of visual image similarity, we make use of a nonparametric test from the field of multivariate statistics that deals with the “Multivariate Two-Sample Problem”, originally presented by Friedman and Rafsky (1979). The specific test is a multivariate extension of the classical …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:IWHjjKOFINEC",
            "Publisher": "INTECH Open Access Publisher"
        },
        {
            "Title": "A symbolic dynamics approach to Epileptic Chronnectomics: Employing strings to predict crisis onset",
            "Publication year": 2016,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/43650",
            "Abstract": "A symbolic dynamics approach to Epileptic Chronnectomics: Employing strings to predict crisis \nonset Toggle navigation English Ελληνικά English English Ελληνικά Login Toggle navigation \nView Item Home Δημοσιεύσεις ΠΚ / UCY Publications 007 Πολυτεχνική Σχολή / Faculty of \nEngineering Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών / Department of \nElectrical and Computer Engineering View Item Home Δημοσιεύσεις ΠΚ / UCY Publications 007 \nΠολυτεχνική Σχολή / Faculty of Engineering Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών \nΥπολογιστών / Department of Electrical and Computer Engineering View Item Article A \nsymbolic dynamics approach to Epileptic Chronnectomics: Employing strings to predict crisis \nonset Thumbnail Date 2016 Author Tsichlas, C. Iakovidou, ND Laskaris, NA Manolopoulos, Y. \nChristodoulakis, M. Papathanasiou, ES Papacostas, SS ORCID logo Mitsis, Georgios D. full …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:HkunuPqSaCsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mani-Web: large-scale web graph embedding via laplacian eigenmap approximation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5976478/",
            "Abstract": "The Web as a graph can be embedded in a low-dimensional space where its geometry can be visualized and studied in order to mine interesting patterns such as web communities. The existing algorithms operate on small-to-medium-scale graphs; thus, we propose a close to linear time algorithm called Mani-Web suitable for large-scale graphs. The result is similar to the one produced by the manifold-learning technique Laplacian eigenmap that is tested on artificial manifolds and real web-graphs. Mani-Web can also be used as a general-purpose manifold-learning/dimensionality-reduction technique as long as the data can be represented as a graph.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel single-trial analysis scheme for characterizing the presaccadic brain activity based on a SON representation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15822-3_44",
            "Abstract": "We introduce a tactic for single-trial (ST) analysis that incorporates, in the study of saccades, the experimental control of a behavioural variable within the standard paradigm of a repeated execution of a single task. The ubiquitous ST-variability in brain imaging recordings is turned, here, to an additional informative dimension that can be exploited to gain further understanding of brain’s function mechanisms.Our approach builds over a self-organizing neural network (SON) that can efficiently learn and parameterise the variability in the patterning of electro-oculographic (EOG) signals. In a second stage, the STs of encephalographic activity are organized accordingly and the observed variations in the EOG signals are associated with specific brain activations. Finally, complex network analysis is employed as a means to characterize the ST-variability based on modes of functional connectivity …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Latency measurement improvement of P100 complex in visual evoked potentials by FMH filters",
            "Publication year": 1995,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/376138/",
            "Abstract": "The ensemble average of pattern shift visual evoked potentials (PSVEPs) signals is seriously affected by random latency variations encountered in each individual sweep which is modeled as a continuous signal with linear segments and well-shaped triangular peaks. This effect is causing the smoothed peaks of the averaged PSVEP waveforms. It is the authors objective to restore the degraded peaks and provide accurate information about their exact location. The method used is based on nonlinear filtering of the FIR-median hybrid (FMH) type and is recommended as a postfiltering process to the well-known averaging methods of recovering PSVEP signals from noise by time-locking to stimuli. The new technique, tested in signals from clinical observations, has proven very promising.< >",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Altered temporal correlations in resting-state connectivity fluctuations in children with reading difficulties detected via MEG",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1053811913006733",
            "Abstract": "In this study we investigate systematic patterns of rapidly changing sensor-level interdependencies in resting MEG data obtained from 23 children experiencing reading difficulties (RD) and 27 non-impaired readers (NI). Three-minute MEG time series were band-passed and subjected to blind source separation (BSS) prior to estimating sensor interdependencies using the weighted phase synchronization measure (wPLI). Dynamic sensor-level network properties were then derived for two network metrics (global and local efficiency). The temporal decay of long-range temporal correlations in network metrics (LRTC) was quantified using the scaling exponent (SE) in detrended fluctuation analysis (DFA) plots. Having established the reliability of SE estimates as robust descriptors of network dynamics, we found that RD students displayed significantly reduced (a) overall sensor-level network organization across all …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:O3NaXMp0MMsC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Use of random time-intervals (RTIs) generation for biometric verification",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320309000041",
            "Abstract": "We explore the possibility of using human-generated time-series as biometric signature. Adopting a simple psychometric procedure, in which a button is pressed in entirely random manner, successive elapsed times are registered and gathered in a signal reflecting user's internal cognitive processes. By reconstructing and comparing the dynamics across repetitions from the same subject a noticeable consistency was observed. Moreover, the dynamics showed a prominent idiosyncratic character when realizations from different subjects were contrasted. We established an appropriate similarity measure to systematize such comparisons and experimentally verified that it is feasible to restore someone's identity from RTI (random time-interval) signals. By incorporating it in an SVM-based verification system, which was trained and tested using a medium sized dataset (from 40 persons), a considerably low equal error …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:0EnyYjriUFMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A symbolic dynamics approach to Epileptic Chronnectomics: Employing strings to predict crisis onset",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397517301561",
            "Abstract": "Treating brain as a complex system is currently among the most popular approaches that are used to understand its function and explain encephalopathies. The networked epileptic brain has already been studied through various neuroimaging modalities based on estimates of functional connectivity. Here, we suggest that additional insights to epileptogenesis can be gained with an appropriate description on the network (re)organization dynamics as these are reflected in surface EEG measurements. Our approach commences with a pattern analytic step that turns a time series of connectivity patterns into a symbolic time series. The condensed dynamics are then analyzed by means of Markov chain modeling and a motif detection algorithm. Both descriptions yield novel dynamic characteristics that can capture the progression towards an epileptic crisis. Conceptually, our work adds to the emerging field of …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:polMJLZb0X8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An error aware SSVEP-based BCI",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104300/",
            "Abstract": "Error-Related Potentials (ErrPs) have been used lately in order to improve several existing Brain-Computer Interface (BCI) applications. In our study we investigate the contribution of ErrPs in a Steady State Visual Evoked Potential (SSVEP) based BCI. An extensive study is presented in order to discover the limitations of the proposed scheme. Using Common Spatial Patterns and Random Forests we manage to show encouraging results regarding the incorporation of ErrPs in a SSVEP system. Finally, we provide a novel methodology (Inverse Correct Response Time) that can measure the gain of a BCI system by incorporating ErrPs in terms of time efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:C2yK8tfAHAgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Riemannian Geometry Approach to Reduced and Discriminative Covariance Estimation in Brain Computer Interfaces",
            "Publication year": 0,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:N5XbD978G_MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transition dynamics of EEG-based network microstates during mental arithmetic and resting wakefulness reflects task-related modulations and developmental changes",
            "Publication year": 0,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:0d9pApVQ-n0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Felisberto, Marcelo Kleber, 238 Foroosh, Hassan, 227",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=13213068763102005428&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the comparison of a novel serious game and electroencephalography biomarkers for early dementia screening",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-08939-3_11",
            "Abstract": "Patients with amnestic mild cognitive impairment are at high risk for developing Alzheimer’s disease. Besides episodic memory dysfunction they show deficits in accessing contextual knowledge that further specifies a general spatial navigation task or an executive function (EF) virtual action planning. Virtual reality (VR) environments have already been successfully used in cognitive rehabilitation and show increased potential for use in neuropsychological evaluation allowing for greater ecological validity while being more engaging and user friendly. In our study we employed the in-house platform of virtual action planning museum (VAP-M) and a sample of 25 MCI and 25 controls, in order to investigate deficits in spatial navigation, prospective memory, and executive function. In addition, we used the morphology of late components in event-related potential (ERP) responses, as a marker for cognitive …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:zTJoPluU4X4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Kostas Georgiadis",
            "Publication year": 0,
            "Publication url": "http://ikee.lib.auth.gr/record/332166/files/GRI-2021-30932.pdf",
            "Abstract": "Brain computer interfaces (BCIs) provide alternative communication (or control) pathways between the human brain and an external device by decoding brain activity and “translating” it into machine commands without requiring any physical interaction. The idea of “mind reading” was first conceived by Berger, but only in the past few years BCI implementations were made plausible. Due to their design, BCIs are considered ideal assistive tools for people suffering from motor disabilities and as such they receive continuous attention. BCIs can be implemented with various approaches, but electroencephalography (EEG) has been proven to be the most popular choice due to its noninvasiveness, low cost and the advantage of being employed with minimal effort even in home environments. In this Ph. D. thesis, we deal with two different BCI paradigms, namely the Steady State Visual Evoked Potential (SSVEP) and the Motor Imagery (MI) paradigm. It is the scope of this thesis to design signal analytic pipelines for EEG data that will decode the users’ intention/choice. The implementations must be characterized by swift and robust responses, characteristics of paramount importance for all BCI implementations. To this end, the SSVEP paradigm was first examined and a novel decoding scheme based on discriminative vector quantization (DVQ) followed by a subsequent nearest-template classification rule was designed. Additionally, the proposed decoder was designed with the scope of avoiding premature activations (ie false positives) by associating each prediction with a confidence-level that should exceed a threshold (estimated upon training data …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:2hrGa7H818QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using conditional FCM to mine event-related brain dynamics",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482509000171",
            "Abstract": "We introduce a framework for mining event related dynamics based on conditional FCM (CFCM). For a given set of responses, the variation in the data is summarized by means of a small set of meaningful prototypes accompanied with a low-dimensional graph capturing their relative relationships. CFCM enables prototyping in a principled manner. User-defined constraints, which are imposed by the nature of experimental data and/or dictated by the neuroscientist's intuition, direct the process of knowledge extraction and can robustify single-trial analysis. The method is introduced using simulated data and demonstrated using actual encephalographic data.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An EEG study of brain connectivity dynamics at the resting state",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Stavros-Dimitriadis-3/publication/51921984_An_EEG_Study_of_Brain_Connectivity_Dynamics_at_the_Resting_State/links/0deec5309e4e5e60ef000000/An-EEG-Study-of-Brain-Connectivity-Dynamics-at-the-Resting-State.pdf",
            "Abstract": "We investigated the dynamical behavior of resting state functional connectivity using EEG signals. Employing a recently introduced methodology that considers the time variations of phase coupling among signals from different channels, a sequence of functional connectivity graphs (FCGs) was constructed for different frequency bands and analyzed based on graph theoretic tools. In the first stage of analysis, hubs were detected in the FCGs based on local and global efficiency. The probability of each node to be identified as a hub was estimated. This defined a topographic function that showed widespread distribution with prominence over the frontal brain regions for both local and global efficiency. Hubs consistent across time were identified via a summarization technique and found to locate over forehead. In the second stage of analysis, the modular structure of each single FCG was delineated. The derived time-dependent signatures of functional structure were compared in a systematic way revealing fluctuations modulated by frequency. Interestingly, the evolution of functional connectivity can be described via abrupt transitions between states, best described as short-lasting bimodal functional segregations. Based on a distance function that compares clusterings, we discovered that these segregations are recurrent. Entropic measures further revealed that the apparent fluctuations are subject to intrinsic constraints and that order emerges from spatially extended interactions.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy colour filtering using relative entropy",
            "Publication year": 1998,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7090069/",
            "Abstract": "Relative entropy (E rel ) has long been used as a distance measure between two sets of sampled data. In this work E rel  is used for filtering of colour images. Local statistical characteristics of the image are estimated by means of Parzen estimators. Two indices for the noise are derived. These indices are associated with membership functions. Filtering of the image is achieved by using a small number of fuzzy rules.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A complex-valued functional brain connectivity descriptor amenable to Riemannian geometry",
            "Publication year": 2020,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1741-2552/ab8130/meta",
            "Abstract": "Objective. We introduce a novel, phase-based, functional connectivity descriptor that encapsulates not only the synchronization strength between distinct brain regions, but also the time-lag between the involved neural oscillations. The new estimator employs complex-valued measurements and results in a brain network sketch that lives on the smooth manifold of Hermitian Positive Definite (HPD) matrices. Approach: Leveraging the HPD property of the proposed descriptor, we adapt a recently introduced dimensionality reduction methodology that is based on Riemannian Geometry and discriminatively detects the recording sites which best reflect the differences in network organization between contrasting recording conditions in order to overcome the problem of high-dimensionality, usually encountered in the connectivity patterns derived from multisite encephalographic recordings. Main results. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:Iq19BMNozs4C",
            "Publisher": "IOP Science"
        },
        {
            "Title": "A novel efficient protein similarity measure based on n-gram modeling",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.220.2287",
            "Abstract": "A new general strategy for measuring similarity between proteins is introduced. Our approach has its roots in computational linguistics and the related techniques for quantifying and comparing content in strings of characters. The pairwise comparison of proteins relies on the content regularities expected to uniquely characterize each sequence. These regularities are captured by n-gram based modelling techniques and in the sequel are contrasted by cross-entropy related measures. In this very first attempt to fuse theoretical ideas from computational linguistic within the field of bioinformatics, we experimented with different implementations having always as ultimate goal the development of practical, computational efficient algorithms. The experimental analysis provides evidence for the usefulness of the new approach and motivates the further development of linguistics-related tools as a means to decipher the biological sequences.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:QxlgOPrhsAcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Single-trial variability in early visual neuromagnetic responses: an explorative study based on the regional activation contributing to the N70m peak",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1053811903003677",
            "Abstract": "Cortical activity evoked by repeated identical sensory stimulation is extremely variable. The source of this variability is often assigned to “random ongoing background activity” which is considered to be irrelevant to the processing of the stimuli and can therefore be eliminated by ensemble averaging. In this work, we studied the single-trial variability in neuromagnetic responses elicited by circular checkerboard pattern stimuli with radii of 1.8°, 3.7°, and 4.5°. For most of the MEG sensors over the occipital areas, the averaged signal showed a clear early (N70m) response following the stimulus onset and this response was modulated by the checkerboard size. A data-driven spatial filter was used to extract one of the many possible composite time courses of single-trial activity corresponding to the complex of N70m generators. Pattern analysis principles were then employed to analyze, classify, and handle the extracted …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:u-x6o8ySG0sC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "The human SI response contains components related to stimulus frequency and perception in a frequency discrimination task",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=4074159596617019012&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:38eRAUXPO10C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel single-trial methodology for studying brain response variability based on archetypal analysis",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417415004613",
            "Abstract": "The objective of this paper is to present a methodology for deriving an intelligible synopsis of single-trial (ST) variability in brain responses. An algorithmic procedure, relying on temporal patterning and built over archetypal analysis, is introduced. Archetypical brain waves are first derived from the ensemble of brain responses and then used to unfold the observed variability. Using these archetypes as anchor points, homogeneous groups of ST-responses are detected and contrasted with each other. The new methodology incorporates steps for organizing the variability and presenting it by means of low-dimensional maps. Magnetoencephalographic responses from a visual stimulation paradigm are used for demonstrating and validating the approach. The results show that a small number of archetypes is sufficient for describing reliably the response variability. The groups of ST-responses, delineated around these …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:dgXhHFWAKKUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "NASS",
            "Publication year": 2010,
            "Publication url": "http://ikee.lib.auth.gr/record/129793",
            "Abstract": "Background noise and spike overlap pose problems in contemporary spike-sorting strategies. We attempted to resolve both issues by introducing a hybrid scheme that combines the robust representation of spike waveforms to facilitate the reliable identification of contributing neurons with efficient data learning to enable the precise decomposition of coactivations. The isometric feature mapping (ISOMAP) technique reveals the intrinsic data structure, helps with recognising the involved neurons and, simultaneously, identifies the overlaps. Exemplar activation patterns are first estimated for all detected neurons and consecutively used to build a synthetic database in which spike overlaps are systematically varied and realistic noise is added. An Extreme Learning Machine (ELM) is then trained with the ISOMAP representation of this database and learns to associate the synthesised waveforms with the corresponding …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:b8wqy9DyMDUC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Exploratory data analysis of evoked response single trials based on minimal spanning tree",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1388245700005605",
            "Abstract": "Objective: An exploratory data analysis framework, based on minimal spanning tree, is proposed as a means to support the analysis of single trial (ST) electrophysiological signals. The core of this framework is the compact description of the input ST sample in a form of content-dependent ordered lists. Based on the established hierarchies, efficient ways to increase the SNR, extract prototypical responses, visualize possible self-organization trends in the sample and track the course of evoked response along the trial-to-trial dimension, are proposed.Method: Magnetoencephalographic auditory evoked responses were used for demonstrating and validating the introduced framework.Results and conclusion: The results demonstrate the benefits, from this intelligent manipulation of STs, in understanding and enhancing the actual evoked signal. Specifically we find support for stimulus-induced phase-resetting …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:qjMakFHDy7sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fuzzy Color Filtering using potential functions",
            "Publication year": 1997,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/628529/",
            "Abstract": "In this paper a color filtering technique is proposed using fuzzy logic ideas and based on local dispersion and potential function. Two fuzzy sets for each fuzzy variable are considered. These fuzzy variables control the partition of the image to appropriate classes. The parameters of the fuzzy sets are tuned experimentally. Application in color images ('pepper') show that these nonlinear filters suppress gaussian as well as impulsive noise very well.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "P2‐095: THE NEUROCHEMICAL SIGNATURE OF ALZHEIMER'S DISEASE IN COGNITIVELY HEALTHY CONTROLS AND PATIENTS WITH DEMENTIA DUE TO ALZHEIMER'S DISEASE",
            "Publication year": 2014,
            "Publication url": "https://alz-journals.onlinelibrary.wiley.com/doi/abs/10.1016/j.jalz.2014.05.769",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:Qy-rCirNo-8C",
            "Publisher": "The Alzheimer's Association"
        },
        {
            "Title": "Using discriminative lasso to detect a graph Fourier transform (GFT) subspace for robust decoding in motor imagery BCI",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8856973/",
            "Abstract": "A novel decoding scheme for motor imagery (MI) brain computer interfaces (BCI's) is introduced based on the GFT concept. It considers the recorded EEG activity as a signal defined over (the graph of) the sensor array. A graph encapsulating the functional covariations emerging during the execution of a specific imagined movement is first defined, from a small training set of relevant trials. The ensemble of graphs signals corresponding to a multi-trial training dataset is then analyzed using a graph-guided decomposition and, based on discriminative Lasso (dLasso), an information-rich GFT subspace is defined. After training, only simple matrix operations are required for transforming the multichannel signal into features to be fed into a classifier that decides whether brain activity conforms with the graph structure associated with the targeted movement. The proposed decoding scheme is evaluated based on two …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:cocyvO7vrcwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nonnegative embeddings and projections for dimensionality reduction and information visualization",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5596031/",
            "Abstract": "In this paper, we propose novel algorithms for low dimensionality nonnegative embedding of vectorial and/or relational data, as well as nonnegative projections for dimensionality reduction. We start by introducing a novel algorithm for Metric Multidimensional Scaling (MMS). We propose algorithms for Nonnegative Locally Linear Embedding (NLLE) and Nonnegative Laplacian Eigenmaps (NLE). By reformulating the problem of MMS, NLLE and NLE for finding projections we propose algorithms for Nonnegative Principal Component Analysis (NPCA), for Nonnegative Orthogonal Neighbourhood Preserving Projections (NONPP) and Nonnegative Orthogonal Locality Preserving Projections (NOLPP). We demonstrate some first preliminary results of the proposed methods in data visualization.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting the heightened phase synchrony in patients with neuromuscular disease for the establishment of efficient motor imagery BCIs",
            "Publication year": 2018,
            "Publication url": "https://jneuroengrehab.biomedcentral.com/articles/10.1186/s12984-018-0431-6",
            "Abstract": "Phase synchrony has extensively been studied for understanding neural coordination in health and disease. There are a few studies concerning the implications in the context of BCIs, but its potential for establishing a communication channel in patients suffering from neuromuscular disorders remains totally unexplored. We investigate, here, this possibility by estimating the time-resolved phase connectivity patterns induced during a motor imagery (MI) task and adopting a supervised learning scheme to recover the subject’s intention from the streaming data. Electroencephalographic activity from six patients suffering from neuromuscular disease (NMD) and six healthy individuals was recorded during two randomly alternating, externally cued, MI tasks (clenching either left or right fist) and a rest condition. The metric of Phase locking value (PLV) was used to describe the functional coupling between all recording sites. The functional connectivity patterns and the associate network organization was first compared between the two cohorts. Next, working at the level of individual patients, we trained support vector machines (SVMs) to discriminate between “left” and “right” based on different instantiations of connectivity patterns (depending on the encountered brain rhythm and the temporal interval). Finally, we designed and realized a novel brain decoding scheme that could interpret the intention from streaming connectivity patterns, based on an ensemble of SVMs. The group-level analysis revealed increased phase synchrony and richer network organization in patients. This trend was also seen in the performance of the employed classifiers. Time …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:5kvG9DmRKWYC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Tomographic and spatio-temporal correlates of short-term plasticity in human primary somatosensory cortex from magnetoencephagraphic (MEG) data",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1202808/",
            "Abstract": "We trained humans to detect changes in the frequency of 21 Hz electrical stimulation applied to the right-hand digits 2+3+4 and recorded the MEG signal before, during and after the training. We evaluated changes for each digit and observed: (1) activations in the left primary somatosensory (L-SI) and medial parietal precuneus (PCu) areas; (2) after the training in L-SI, the 21 Hz spectral power increased for digits 3 and 4 over the stimulation period, while the 10 Hz spectral power increased for digit 3 only around the stimulus onset and offset; (3) only digit 3 showed significant change in the correlation between the two areas around the stimulus onset and offset, at the same latency ranges of increased 10 Hz spectral power. During the training, we found that the L-SI activation reflects the input frequencies of stimuli at early latencies but correlates with the subject's perception between low and high frequencies at later …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Source space analysis of event-related dynamic reorganization of brain networks",
            "Publication year": 2012,
            "Publication url": "https://www.hindawi.com/journals/cmmm/2012/452503/",
            "Abstract": "How the brain works is nowadays synonymous with how different parts of the brain work together and the derivation of mathematical descriptions for the functional connectivity patterns that can be objectively derived from data of different neuroimaging techniques. In most cases static networks are studied, often relying on resting state recordings. Here, we present a quantitative study of dynamic reconfiguration of connectivity for event-related experiments. Our motivation is the development of a methodology that can be used for personalized monitoring of brain activity. In line with this motivation, we use data with visual stimuli from a typical subject that participated in different experiments that were previously analyzed with traditional methods. The earlier studies identified well-defined changes in specific brain areas at specific latencies related to attention, properties of stimuli, and tasks demands. Using a recently introduced methodology, we track the event-related changes in network organization, at source space level, thus providing a more global and complete view of the stages of processing associated with the regional changes in activity. The results suggest the time evolving modularity as an additional brain code that is accessible with noninvasive means and hence available for personalized monitoring and clinical applications.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Effective Connectivity Patterns Associated with P300 Unmask Differences in the Level of Attention/Cognition...",
            "Publication year": 0,
            "Publication url": "https://www.academia.edu/download/51075898/Effective_Connectivity_Patterns_Associat20161227-11859-1cie4xq.pdf",
            "Abstract": "Recent findings indicated that both P300 and αevent-related desynchronization (a-ERD) were associated, and similarly involved in cognitive brain functioning, like attention, allocation and memory updating. In a very recent study, the causality between P300 and α-ΕRD (Event Related Desynchronization) generators was investigated in four sensory modalities, ie, audition, vision, somatosensory, and pain. Ιn the present study, we investigated the effective connectivity patterns related with P300 during a visual modality protocol with six different flashing images in a normal and a disabled subject (Cerebral Palsy). We constructed effective connectivity graphs (ECGs) with Partial Directed Coherence (PDC) focusing on target trials in the frequency range of 8–13 Hz. Adopting a tensorial classification scheme, we succeeded to differentiate the trials related with six different images with classification performance of 100% in both subjects. In addition, we estimated small-worldness as an indicator to quantify the difference in the level of attention/cognition between normal and disabled subject. Finally, small-world index can be used to measure how demanding a task is in terms of attention/cognition especially for disabled subjects.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:UFuRdyijzaAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Surface and Interface investigation with SIMS of archaeological obsidian artefacts",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=17645487848795650626&hl=en&oi=scholarr",
            "Abstract": "Obsidian is a dense volcanic glass, formed when lava is rapidly cooled, often at the margins of flow. Obsidian is one of the most usable stones during prehistoric times for tool and weapon manufacture. Obsidian is an amorphous natural glass with its major chemical composition to be 70–75% SiO2, 10–15% Al2O3, 3-5% Na2O, 2-5% K2O and 1-5% total Fe2O3+ FeO. Also it has several trace elements (Rb, Sr, Zr, Ti, Mg) and crystalline inclusions of several types such as mica, feldspar and biotite and of several sizes from 100μm2 up to 1000μm2.In the present work the obsidian surface and interface of 8 artifacts from different obsidian sources will be studied systematically in the TOF-SIMS Laboratory of Jagiellonian University. The Greek partner (Dr. Theodore Ganetsos and Nikolaos Laskaris) will calculate the dating of each sample, using SIMS profiles and a theoretical model.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:AOwgc6nnr1EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamics of brain connectivity at resting state: An EEG study",
            "Publication year": 0,
            "Publication url": "http://ikee.lib.auth.gr/record/127658/files/Resting_State_Dynamics_17_11_2010.doc",
            "Abstract": "We investigated the dynamical behavior of resting state functional connectivity using EEG signals. Employing a recently introduced methodology that considers the time variations of phase coupling among signals from different channels, a sequence of functional connectivity graphs (FCGs) was constructed for different frequency bands and analyzed based on graph theoretic tools.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms for color image edge enhancement using potential functions",
            "Publication year": 1997,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/623046/",
            "Abstract": "This letter deals with the color image edge enhancement issue using clustering ideas and based on the use of potential functions (Parzen windows). Two algorithms are proposed. The first uses potential functions (PF's) and selects the output as the vector maximizing the PF. The second one elaborates further by employing the mountain clustering method and modifying it appropriately. Both algorithms are robust in the presence of noise, Gaussian and impulsive.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spontaneous Up states in vitro: a single-metric index of the functional maturation and regional differentiation of the cerebral cortex",
            "Publication year": 2015,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncir.2015.00059/full",
            "Abstract": "Understanding the development and differentiation of the neocortex remains a central focus of neuroscience. While previous studies have examined isolated aspects of cellular and synaptic organization, an integrated functional index of the cortical microcircuit is still lacking. Here we aimed to provide such an index, in the form of spontaneously recurring periods of persistent network activity -or Up states- recorded in mouse cortical slices. These coordinated network dynamics emerge through the orchestrated regulation of multiple cellular and synaptic elements and represent the default activity of the cortical microcircuit. To explore whether spontaneous Up states can capture developmental changes in intracortical networks we obtained local field potential recordings throughout the mouse lifespan. Two independent and complementary methodologies revealed that Up state activity is systematically modified by age, with the largest changes occurring during early development and adolescence. To explore possible regional heterogeneities we also compared the development of Up states in two distinct cortical areas and show that primary somatosensory cortex develops at a faster pace than primary motor cortex. Our findings suggest that in vitro Up states can serve as a functional index of cortical development and differentiation and can provide a baseline for comparing experimental and/or genetic mouse models.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:kOdZbmsmKqcC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Semantic geodesic maps: a unifying geometrical approach for studying the structure and dynamics of single trial evoked responses",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1388245702001244",
            "Abstract": "Objectives: A general framework for identifying and describing structure in a given sample of evoked response single-trial signals (STs) is introduced. The approach is based on conceptually simple geometrical ideas and enables the convergence of pattern analysis and non-linear time series analysis.Methods: Classical steps for analyzing the STs by waveform are first employed and the ST-analysis is transferred to a multidimensional space, the feature space, the geometry of which is systematically studied via multidimensional scaling (MDS) techniques giving rise to semantic maps. The structure in the feature space characterizes the trial-to-trial variability and this is utilized to probe functional connectivity between two brain areas. The underlying dynamic process responsible for the emerged structure can be described by a multidimensional trajectory in the feature space. This in turn enables the detection of …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An efficient data mining technique with applications in multivariate image analysis",
            "Publication year": 1997,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/628558/",
            "Abstract": "The \"curse of dimensionality\" complicates the analysis of multiparameter images. The application of a data mining technique, as a tool to resolve the image puzzle, is the subject of this study. This well developed technique is a sequential planing procedure, based on the minimal spanning tree of the data. It is armed with a Hopfield neural network implementation and, being computationally efficient, appears to be very attractive for image understanding tasks. Integrated in a GUI environment, it can be a useful prelude to the subsequent image analysis.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting the temporal patterning of transient VEP signals: A statistical single-trial methodology with implications to brain–computer interfaces (BCIs)",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027014001484",
            "Abstract": "When visual evoked potentials (VEPs) are deployed in brain–computer interfaces (BCIs), the emphasis is put on stimulus design. In the case of transient VEPs (TVEPs) brain responses are never treated individually, i.e. on a single-trial (ST) basis, due to their poor signal quality. Therefore their main characteristic, which is the emergence during early latencies, remains unexplored.Following a pattern-analytic methodology, we investigated the possibility of using single-trial TVEP responses to differentiate between the different spatial locations where a particular visual stimulus appeared and decide whether it was attended or unattended by the subject.Covert spatial attention modulates the temporal patterning of TVEPs in such a way that a brief ST-segment, from a single synthesized sensor, is sufficient for a Mahalanobis-Taguchi (MT) system to decode subject's intention …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:cG0OFEevkNgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Vector nonlinear data dependent filters",
            "Publication year": 1994,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/408949/",
            "Abstract": "Vector filtering processes are of special importance when correlated multichannel data are of interest. In this case the data sequence is taken as a whole. The idea of using vectors instead of scalers has been used extensively. This work presents a method where data dependent coefficients are derived at each time instant, upon which the filter output is computed. This nonlinear filter has properties in between the vector median and other nonlinear vector filters and similar to linear ones.< >",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy—weighted averaging for high-resolution ECG based on exploratory data analysis",
            "Publication year": 1996,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7083078/",
            "Abstract": "In this work we introduce a method for the enhancement of Late Potentials in the Signal Averaged electrocardiography. The method involves computation of weights prior averaging. Two fuzzy control techniques are proposed for the derivation of weights. The experimental results indicate the contribution of the method to a more reliable prognosis.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Volume Contents Volume 193 (2010)",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=4164774335703053516&hl=en&oi=scholarr",
            "Abstract": "Journal of Neuroscience Methods 193 (2010) 385â€“386 Issue 1 30 October 2010 Invited review Facial affect processing in social anxiety: Tasks and stimuli JP Machado-de-Sousa, KC Arrais, NT Alves, MHN Chagas, C. de Meneses-Gaya, JA de S. Crippa and JEC Hallak (Brazil) 1 Basic Neuroscience Voltage-and temperature-dependent gating of heterologously expressed channelrhodopsin-2 TE Chater, JM Henley, JT Brown and AD Randall (UK) 7 Genetically encoded Cl-Sensor as a tool for monitoring of Cl-dependent processes in small neuronal compartments T. Waseem, M. Mukhtarov, S. Buldakova, I. Medina and P. Bregestovski (France) 14 An experimental paradigm to compare motor performance under laboratory and under everyday-like conditions O. Bock and A. Hagemann (Germany) 24 Rotating disk electrode voltammetric measurements of serotonin transporter kinetics in synaptosomes CE Hagan …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A non-parametric prototyping scheme for LFP dynamics and its application to detect changes in spontaneous Up states due to cortical maturation and aging",
            "Publication year": 2014,
            "Publication url": "http://ikee.lib.auth.gr/record/297495",
            "Abstract": "Spontaneous network activity in the form of Up and Down states plays an important role in the function of neural circuits and reflects intrinsic connectivity. Such cortical dynamics are shaped by genes, experience and intrinsic cellular properties and form the substrate upon which external stimuli and neuromodulation will impinge to determine cortical responses. The scope of this work was to build a methodological framework for assessing developmental changes in intrinsic cortical activity patterns obtained from LFP recordings of spontaneously active mouse brain slices. To overcome the complexity seen in the recorded signals, which are characterized by a high variability in Up-state waveforms, we resorted to a representation that preserves the dynamic invariants of the underlying network and built a pattern-analytic scheme that includes three pipelined stages. In the first stage, upstate waveforms are represented …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:m8MyhXdlT-4C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "A Consumer BCI for Automated Music Evaluation Within a Popular On-Demand Music Streaming Service “Taking Listener’s Brainwaves to Extremes”",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-44944-9_37",
            "Abstract": "We investigated the possibility of a using a machine-learning scheme in conjunction with commercial wearable EEG-devices for translating listener’s subjective experience of music into scores that can be used for the automated annotation of music in popular on-demand streaming services.Based on the established -neuroscientifically sound- concepts of brainwave frequency bands, activation asymmetry index and cross-frequency-coupling (CFC), we introduce a Brain Computer Interface (BCI) system that automatically assigns a rating score to the listened song. Our research operated in two distinct stages: (i) a generic feature engineering stage, in which features from signal-analytics were ranked and selected based on their ability to associate music induced perturbations in brainwaves with listener’s appraisal of music. (ii) a personalization stage, during which the efficiency of extreme …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:XAEgxC7iu0MC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A collaborative representation approach to detecting error-related potentials in SSVEP-BCIs",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3126686.3129334",
            "Abstract": "This study takes advantage of Error Related Potentials, a certain type of neurophysiological event associated with humans' ability to observe and recognize erroneous actions, in order to improve SSVEP-based Brain Computer Interfaces (BCIs). The Error Related Potentials serve as a passive correction mechanism that originates directly from the user's brain. In this paper we propose a novel approach to spatial filtering, based on a supervised variant of Collaborative Representation Projections (CRP) offering a more discriminant representation of electroencephalography signals for detecting Error Related Potentials. This new approach enhances the detectability of Error Related Potentials by projecting the spatial information of signals into a new space where samples of the same class tend to form local neighborhoods. Moreover, the limitations under which the Error Related Potentials positively contribute to the …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:tFyepMjQr3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Charting of geoelectric potential signal dynamics via geometrical techniques and its possible relation to significant earthquakes in Western Greece",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S009830040700221X",
            "Abstract": "An exploratory data analysis (EDA) framework was developed in order to investigate the presence of possible correlations in the long-term geoelectric potential (LTGP) signal, prior to significant seismic events in Western Greece. Experimental data, which had been collected continuously within a 6-year period (1998–2003) at the earthquake signal-acquisition center of the University of Patras Seismological Laboratory (UPSL), were studied. The multidimensional scaling (MDS) technique was used to detect putative clustering tendencies in the ensemble of time-series (TS) segments that could indicate the existence of a possible correlation between the geoelectric signal structure and the impending seismic activity. The end result is a 2-dimensional point diagram with the geometry reflecting important signal characteristics, directly related with the underlying seismic events. In addition, the “appending technique”, a …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:dhFuZR0502QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Transition dynamics of EEG-based Network Microstates unmask developmental and task differences during mental arithmetic and resting wakefulness",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=7885484469382870750&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:xyzrkeHX5M4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical properties of ZnO: Cu nanowires for optoelectronic applications",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Gennaro-Grasso/project/ASSET-A-holistic-and-Scalable-Solution-for-Research-Innovation-and-Education-targeting-Energy-Transition/attachment/5f871d467600090001ee5fa7/AS:946562704351233@1602689543707/download/ASSET_Paper_1.pdf?context=ProjectUpdatesLog",
            "Abstract": "ZnO nanowires attract much attention for their applications in different kind of nano-devices. The control of size, shape and density of ZnO nanowires is of fundamental significance in modern science and engineering because the properties of ZnO highly depend on its morphology and structure. Doping is an important way to tailor the properties of semiconductor materials and among all Cu doped ZnO is very important recently because of its interesting properties, such as p-type, room temperature ferromagnetism and high efficient solar cells (SCs). We have prepared 0.1, 0.3, 0.5 and 0.8% of Cu doped ZnO nanowires using sol-gel spin coating techniques on the glass substrate. The coating solution was prepared using Zinc acetate as the dissolved precursor material, with the molarity of 0.2 M and 2-methoxyethanol as the solvent, and the Copper acetate as the doping material. The stabilizer was mono-ethanolamine, and the molarity ratio of the stabilizer and zinc acetate was 1. In this research work we investigate the structure using micro Raman Spectroscopy and Micro-PL techniques of these nanowires transferred to a Si/SiO2 substrate.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:-XtG2q47PdUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analyzing Functional Brain Connectivity by means of Commute-Times: in pursue of attentional modulations based on multi-trial event-related responses",
            "Publication year": 0,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.700.8126&rep=rep1&type=pdf",
            "Abstract": "We introduce commute times (CTs) as an alternative way to capture the true interplay between the nodes of a functional connectivity graph (FCG). Commute time is a measure of the time taken for a random walk to set-out and return between a pair of nodes on a graph. Its computation is considered here as a robust and accurate integration, over the FCG, of the individual pairwise measurements of functional coupling.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust moving averages, with Hopfield neural network implementation, for monitoring evoked potential signals",
            "Publication year": 1997,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168559797966818",
            "Abstract": "This technical note describes a robust version of moving averages, that enables reliable monitoring of the evoked potential (EP) signals. A cluster analysis (CA) procedure is introduced to robustify the signal averaging (SA). It is implemented via a Hopfield neural network (HNN), which performs selection of the trials forming a cluster around the current state of the EP signal. The core of this cluster serves as an estimate of the instantaneous EP. The effectiveness of the method, indicated by application to real data, and its computation efficiency, due to the use of simple matrix operations, makes it very promising for clinical observations.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:ZbXHRDTBJTgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Selective noise filtering of high resolution ECG through wavelet transform",
            "Publication year": 1996,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/542617/",
            "Abstract": "A wavelet transform (WT) based filtering of the high resolution electrocardiogram is proposed in this study. The overcomplete time-scale decomposition of the row signal is achieved in the first step by convolution with the quadratic spline wavelet. The small scale data are passed by the filtering algorithm at locations where the wavelet coefficients correlation at adjacent scales is high and suppressed if the correlation is small. The filtered signal is reconstructed from the set of filtered scales through the inverse WT. A comparison with the Wiener filter proved that the wavelet filtering performed better in passing the useful high-frequency data from the QRS terminal part. The denoising results obtained on real signals were similar with 0.6 /spl mu/V root-mean-square noise endpoint signal averaged ECG.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timing and connectivity in the human somatosensory cortex from single trial mass electrical activity",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/hbm.10023",
            "Abstract": "Parallel‐distributed processing is ubiquitous in the brain but often ignored by experimental designs and methods of analysis, which presuppose sequential and stereotypical brain activations. We introduce here a methodology that can effectively deal with sequential and distributed activity. Regional brain activations elicited by electrical median nerve stimulation are identified in tomographic estimates extracted from single trial magnetoencephalographic signals. Habituation is identified in both primary somatosensory cortex (SI) and secondary somatosensory cortex (SII), often interrupted by resurgence of strong activations. Pattern analysis is used to identify single trials with homogeneous regional brain activations. Common activity patterns with well‐defined connectivity are identified within each homogeneous group of single trials across the subjects studied. On the contralateral side one encounters distinct sets of …",
            "Abstract entirety": 0,
            "Author pub id": "uG8cgA4AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "EEGminer: Discovering Interpretable Features of Brain Activity with Learnable Filters",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.10009",
            "Abstract": "Patterns of brain activity are associated with different brain processes and can be used to identify different brain states and make behavioral predictions. However, the relevant features are not readily apparent and accessible. To mine informative latent representations from multichannel EEG recordings, we propose a novel differentiable EEG decoding pipeline consisting of learnable filters and a pre-determined feature extraction module. Specifically, we introduce filters parameterized by generalized Gaussian functions that offer a smooth derivative for stable end-to-end model training and allow for learning interpretable features. For the feature module, we use signal magnitude and functional connectivity. We demonstrate the utility of our model towards emotion recognition from EEG signals on the SEED dataset, as well as on a new EEG dataset of unprecedented size (i.e., 763 subjects), where we identify consistent trends of music perception and related individual differences. The discovered features align with previous neuroscience studies and offer new insights, such as marked differences in the functional connectivity profile between left and right temporal areas during music listening. This agrees with the respective specialisation of the temporal lobes regarding music perception proposed in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:0kYikfLtzSYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Combining self-organizing neural nets with multivariate statistics for efficient color image retrieval",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314206000245",
            "Abstract": "An efficient novel strategy for color-based image retrieval is introduced. It is a hybrid approach combining a data compression scheme based on self-organizing neural networks with a nonparametric statistical test for comparing vectorial distributions. First, the color content in each image is summarized by representative RGB-vectors extracted using the Neural-Gas network. The similarity between two images is then assessed as commonality between the corresponding representative color distributions and quantified using the multivariate Wald–Wolfowitz test. Experimental results drawn from the application to a diverse collection of color images show a significantly improved performance (approximately 10–15% higher) relative to both the popular, simplistic approach of color histogram and the sophisticated, computationally demanding technique of Earth Mover’s Distance.",
            "Abstract entirety": 1,
            "Author pub id": "uG8cgA4AAAAJ:Zph67rFs4hoC",
            "Publisher": "Academic Press"
        }
    ]
}]