[{
    "name": "Νικόλαος Τσίτσας",
    "romanize name": "Nikolaos Tsitsas",
    "School-Department": "Πληροφορικής",
    "University": "ΑΠΘ",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 2482,
    "Scholar name": "Nikolaos L. Tsitsas",
    "Scholar id": "E2Jk3JQAAAAJ",
    "Affiliation": "Aristotle University of Thessaloniki",
    "Citedby": 810,
    "Interests": [
        "Applied Mathematics",
        "Wave Propagation Theory",
        "Mathematical Modeling",
        "Computational Electromagnetics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=E2Jk3JQAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On some convergence/divergence issues in Generalized Multipole Methods",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of Interaction Scattering Cross Sections and Their Physical Bounds for Multiple-Dipole Stimulation of a Three-Dimensional Layered Medium",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9392002/",
            "Abstract": "A three-dimensional layered and isotropic medium is excited by primary spherical waves due to     magnetic dipoles radiating inside or outside the medium. Interaction scattering cross sections (ISCS) are defined as the differences between the overall scattering cross section and the sum of the individual cross sections generated by all dipoles within a layer or by all     dipoles. Optical theorems and physical bounds for the ISCS are established. Extensive numerical investigations are performed for the variations of the ISCS and their physical bounds with respect to the geometrical and physical characteristics of the layered medium. Conditions for which ISCS contribute significantly in the overall cross section are analyzed. It is also demonstrated that the number of excitation layers and the total number     of dipoles can be determined by means of the individual scattering cross sections.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scattering by a grating slab waveguide with regular plane regions grooves: integral equation modeling",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4787407/",
            "Abstract": "A rigorous integral equation formulation in conjunction with Green's function theory is used to analyze the scattering phenomena by a periodic dielectric grating slab waveguide. Such a structure is mainly utilized to obtain a frequency selective surface, finding applications both in the microwave and the optical region. The grating is modeled as a periodic layer with grooves regular plane regions. The advantages of the developed method with respect to already established ones are discussed. The dependence of the waveguide's reflectance and transmission from the grooves characteristics is investigated.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The method of auxiliary sources applied to three-dimensional acoustic scattering: Convergence issues and inherent oscillations",
            "Publication year": 2016,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2016/00000102/00000002/art00014",
            "Abstract": "The method of auxiliary sources (MAS) is a computational method widely used for the modeling of wave scattering and radiation problems. In this paper, fundamental issues related to the MAS solution of three-dimensional (3-D) scattering problems are analytically and numerically investigated. Two 3-D scattering problems are considered. In both, the respective singularities of the analytic continuation of the scattered field in the scatterer's interior can be explicitly determined; the location of these singularities plays a crucial role to the application of the MAS. The first problem concerns the acoustic scattering by a soft sphere when excited by an exterior point source. The analytic solution of this problem is directly compared with the numerical solution obtained by the MAS for varying locations of the auxiliary sources (AS's). The second problem concerns the plane wave acoustic scattering by a soft ellipsoid. This may …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:vV6vV6tmYwMC",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "Dyadic Green’s Function Studies for the Three-shell Head Model",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9232296/",
            "Abstract": "In this work, we employ analytical expressions for the calculation of the dyadic Green’s function (DGF) of the isotropic three-shell head model, due to an infinitesimal electric dipole located in the internal core that corresponds to the brain. We compute the electric field obtained from this DGF and compare and validate our analytical results with HFSS commercial software when the dipole is inside a single sphere. Then, we numerically examine the behavior of the electric field due to the placement of the dipole inside a three-shell spherical head model. Finally, we discuss how the isotropic model can be extended to the more complicated anisotropic one by considering a volume integral equation approach.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radiation relations for electromagnetic excitation of layered media",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4619054/",
            "Abstract": "In this paper, radiation principles for the interior dipole excitation of a layered medium by a time-harmonic spherical electromagnetic wave is established. The study of such excitation problems is motivated by several scientific and technological applications, including: (i) localization of buried objects in layered media, (ii) medical implantations inside the human body for hyperthermia or biotelemetry purposes, (iii) resonant layered microstrip antennas, (iv) investigation of the human brain's activity, and (v) scattering by waveguides inhomogeneities.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low-frequency electromagnetic near-field inverse problem for a spherical scatterer",
            "Publication year": 2013,
            "Publication url": "https://www.jstor.org/stable/43693776",
            "Abstract": "The interior low-frequency electromagnetic dipole excitation of a dielectric sphere is utilized as a simplified but realistic model in various biomedicai applications. Motivated by these considerations, in this paper, we investigate analytically a near-field inverse scattering problem for the electromagnetic interior dipole excitation of a dielectric sphere. First, we obtain, under the low-frequency assumption, a closed-form approximation of the series of the secondary electric field at the dipole's location. Then, we utilize this derived approximation in the development of a simple inverse medium scattering algorithm determining the sphere's dielectric permittivity. Finally, we present numerical results for a human head model, which demonstrate the accurate determination of the complex permittivity by the developed algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:maZDTaKrznsC",
            "Publisher": "Chinese Academy of Mathematices and System Sciences (AMSS) Chinese Academy of Sciences"
        },
        {
            "Title": "Cloaking a microstrip antenna: Integral equation modeling",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6328654/",
            "Abstract": "We analyze a two-dimensional planar microstrip antenna, excited by a plane wave, and propose its operation as a low-profile receiving antenna, by adjusting the parameters of its cloaking superstrate. A semi-analytic integral equation method is developed to determine the antenna's scattering characteristics. It is shown that for specific cloaking parameters the far-field by the antenna is considerably reduced, while the received signal from the antenna is maintained at sensible levels. The material values achieving the reduction correspond to an ε-near-zero or a low-index metamaterial superstrate.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Amplifying the response of a buried scatterer by depositing a passive layer on the ground",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=13619557127181162641&hl=en&oi=scholarr",
            "Abstract": "Locating a buried scatterer inside the earth is an interesting problem with very long history. Various methods have been established for the localization and reconstruction of such a scatterer. Characteristic representatives are groundpenetrating radar (GPR) methods which use pulses from a radar, lying in close proximity to the ground, to image the subsurface. The effectiveness of most of the utilized methods usually depends on the electric dimensions and the shape of the scatterer, it’s depth inside the earth, the operating frequency as well as the adopted model for the earth.In this work, we use a different approach from the conventional ones which aims to reveal the localization of an inclusion inside the earth. Consider the geometrical configuration of Fig. 1. A circular cylindrical perfectly electric conducting (PEC) inclusion is located at a certain distance from the surface of the ground. Our main objective is to determine the proper parameters of a thin passive superstrate layer (namely its thickness h and complex relative dielectric permittivity ϵr2) which is deposited on the ground in order to increase (make more feasible) the detectability of the circular PEC inclusion. A moving line source is utilized as a primitive subsurface scanner; this source is expected to model practical implementations related to GPR’s.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Vector solitons in nonlinear isotropic chiral metamaterials",
            "Publication year": 2011,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/44/43/435203/meta",
            "Abstract": "Starting from the Maxwell equations, we used the reductive perturbation method to derive a system of two coupled nonlinear Schrödinger (NLS) equations for the two Beltrami components of the electromagnetic field propagating along a fixed direction in an isotropic nonlinear chiral metamaterial. With single-resonance Lorentz models for the permittivity and permeability and a Condon model for the chirality parameter, in certain spectral regimes, one of the two Beltrami components exhibits a negative-real refractive index when nonlinearity is ignored and the chirality parameter is sufficiently large. We found that, inside such a spectral regime, there may exist a subregime wherein the system of the NLS equations can be approximated by the Manakov system. Bright–bright, dark–dark, and dark–bright vector solitons can be formed in that spectral subregime.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Direct and Inverse Acoustic Spherical Wave Scattering by a Small Layered Sphere with Soft Core",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4105779/",
            "Abstract": "A spherical acoustic wave is scattered by a three layered sphere with a soft core. Exact expressions of the fields in every layer and the exterior of the scatterer are established. Low frequency results are then obtained by approximating the exact expression of the scattering cross section. The inverse problem of determining the sphere's center and the layers radii is treated from the knowledge of the scattering cross section's low frequency expansion",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Higher-order effects and ultrashort solitons in left-handed metamaterials",
            "Publication year": 2009,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.79.037601",
            "Abstract": "Starting from Maxwell’s equations, we use the reductive perturbation method to derive a second-order and a third-order nonlinear Schrödinger equation, describing ultrashort solitons in nonlinear left-handed metamaterials. We find necessary conditions and derive exact bright and dark soliton solutions of these equations for the electric and magnetic field envelopes.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:u5HHmVD_uO8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Cloaking a bump inside a single isotropic lossless dielectric",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7228455/",
            "Abstract": "In this work, we determine the suitable parameters (permittivity and thickness) of a lossless dielectric superstrate slab layer, covering an infinite perfect electric conducting (PEC) plane on which lies a two-dimensional PEC bump, such that, simultaneously: (i) the plane wave reflection by the overall configuration in the absence of the bump resembles closely that by the infinite PEC plane, and (ii) the bump's contribution on the scattered far-field radiated over all directions becomes as small as possible. The scattered field is determined by a semi-analytic integral equation methodology. Optimal superstrate's parameters, achieving both objectives (i) and (ii) within significant numerical accuracy, are computed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Aspects of Discrete/Auxiliary Sources Methods in Two-Dimensional Acoustic Scattering",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/343450786_Aspects_of_DiscreteAuxiliary_Sources_Methods_in_Two-_Dimensional_Acoustic_Scattering/links/5f2ae44792851cd302df943e/Aspects-of-Discrete-Auxiliary-Sources-Methods-in-Two-Dimensional-Acoustic-Scattering.pdf",
            "Abstract": "Scattering of acoustic waves by a bounded two-dimensional penetrable obstacle is considered. The problem is analyzed by two methods employing auxiliary (fictitious) sources: the Discrete Sources Method (DSM) and the Method of Auxiliary Sources (MAS). Both belong to the Generalized Multipole Methods (GMM). Numerical results obtained from both methods are compared. The effect of shape elongation on the computed far-field is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the resonance and radiation characteristics of multi-layered spherical microstrip antennas",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/02726340802040096",
            "Abstract": "The resonance and radiation characteristics of a spherical microstrip with its circular metallic patch located inside a coating, possessing an arbitrary number of layers, are investigated. The developed methodology combines the Legendre transform with a T-matrix method. The appropriate basis functions for the surface current on the patch are chosen according to the cavity model. The complex resonant frequencies are the singular points of a homogeneous linear system, resulting by following a Galerkin's technique. The numerical results of this article propose novel multi-layered spherical microstrip configurations. More precisely, a new type of excitation that concerns an amplifying layer located between core and patch is proposed. The control mechanism of the amplifying capability via the layer's thickness and dielectric constant is reported. Moreover, the behavior of a microstrip with two airgaps that are …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "“unlocking” the ground: Increasing the detectability of buried objects by depositing passive superstrates",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7435296/",
            "Abstract": "One of the main problems when trying to detect the position and other characteristics of a small inclusion into lossy Earth via external measurements is the object's poor scattering response due to attenuation. Hence, increasing the scattered power generated by the inclusion when using not an active but a passive material is of great interest. To this direction, we examine a procedure of “unlocking” the ground by depositing a thin passive layer of conventional material atop of it. The first step is to significantly enhance the transmission into a lossy half-space, in the absence of the inclusion, by covering it with a passive slab. The redistribution of the fields into the slab and the infinite half-space, due to the interplay of waves between the interfaces, makes it possible to determine the thickness and permittivity of an optimal layer. The full boundary value problem (including the inclusion and the deposited superstrate) is …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nonlinear electromagnetic metamaterials: Aspects on mathematical modeling and physical phenomena",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931719301856",
            "Abstract": "Electromagnetic metamaterials with simultaneously negative effective dielectric permittivity ε and magnetic permeability μ (double-negative or left-handed or negative-index metamaterials) have a long history going back to the seminal paper of Veselago in 1968. Such metamaterials exhibit unusual and remarkable effects, like, e.g., the reversal of Snell's law, the support of backward-propagating waves, and the possibility of obtaining a perfect lens. Nonlinear left-handed metamaterials are also very useful in tunable structures with intensity-controlled transmission and in switching the material properties from left- to right-handed and back. In this paper, we present aspects on mathematical modeling and physical phenomena governing electromagnetic wave propagation in nonlinear metamaterials. The metamaterials under consideration are described by a Drude-Lorentz frequency model of the linear parts and a Kerr …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:738O_yMBCRsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Dipole-Scattering by Spherical Media and Related Optimization Problems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471317/",
            "Abstract": "A layered spherical medium is excited by an arbitrary internal or external dipole. Direct scattering problems are investigated analytically by employing a dyadic Green's function technique. Inverse scattering problems concerning the determination of the medium's parameters are subsequently considered in the low-frequency regime. Specific optimization problems are examined, referring to the determination of the medium's parameters so that the far-field exhibits desired variations. Certain initial numerical results on such problems are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "2017 22ND INTERNATIONAL SEMINAR/WORKSHOP ON DIRECT AND INVERSE PROBLEMS OF ELECTROMAGNETIC AND ACOUSTIC WAVE THEORY, DIPED 2017-PROCEEDINGS",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=8353380787495745329&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybridization of the Method of Auxiliary Sources (MAS) with the Fast Multipole Method (FMM) for Scattering from Large Arrays of Cylinders",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9017416/",
            "Abstract": "A hybridization of the Method of Auxiliary Sources (MAS) and the Fast Multipole Method (FMM) is developed and applied for the electromagnetic scattering problem by a large array of parallel circular cylinders. Such an array can serve as a model for the tree trunks of a forest or an orchard. As a starting point, a standard MAS formulation is used, where auxiliary sources are located on fictitious curves inside/outside the physical boundaries of the tree trunks. Next, by adopting an FMM setting, the far-field interactions are approximated as perturbations of a central interaction between the centroids of properly selected clusters encompassing neighboring sources and matching points. Numerical comparisons of efficiency and accuracy of the proposed hybridization are reported, together with discussions for the optimal selections of the involved parameters.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient integral equation modeling of scattering by a gradient dielectric metasurface",
            "Publication year": 2017,
            "Publication url": "https://epjam.epj.org/articles/epjam/abs/2017/01/epjam160019/epjam160019.html",
            "Abstract": "Plane-wave scattering by a gradient dielectric metasurface, composed of a dielectric slab on which has been etched an infinitely periodic grating, is analyzed by means of rigorous semi-analytical integral equation techniques based on the Method of Moments with entire domain basis functions. The electric field integral equation is considered with unknown function the electric field on the grating and is then solved by applying an entire domain Galerkin’s technique. The proposed methodology is characterized by high numerical stability and controllable accuracy; the obtained solution is analytic with the sole approximation of the final truncation of the expansion functions sets. The operation of the metasurface as a narrow-band reflection frequency filter is investigated. Moreover, it is also shown that under certain conditions anomalous reflection and transmission can be generated even for a metasurface composed of …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Theory of perturbation of electric potential by a 3D object made of an anisotropic dielectric material",
            "Publication year": 2021,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2399-6528/ac3461/meta",
            "Abstract": "The extended boundary condition method (EBCM) was formulated for the perturbation of a source electric potential by a 3D object composed of a homogeneous anisotropic dielectric medium whose relative permittivity dyadic is positive definite. The formulation required the application of Green’s second identity to the exterior region to deduce the electrostatic counterpart of the Ewald–Oseen extinction theorem. The electric potential inside the object was represented using a basis obtained by implementing an affine bijective transformation of space to the Gauss equation for the electric field. The EBCM yields a transition matrix that depends on the geometry and the composition of the 3D object, but not on the source potential.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:tkaPQYYpVKoC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Integral equation analysis of scattering by a grating slab waveguide",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4620023/",
            "Abstract": "In this paper the problem of plane wave scattering by a periodic grating slab waveguide is investigated by a rigorous integral equation method utilizing essentially the entire domain method of moments. The electric field integral equation is employed with unknown function the electric field on the grating's domain and is subsequently solved by applying entire domain Galerkin's techniques. The proposed analysis provides high numerical stability and controllable accuracy, while all the involved computations are analytically carried out. The computed results exhibit superior accuracy and efficiency compared with those derived by applying different methods. The grating structure's efficient operation as a narrow band filter is investigated.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Excitation of a grounded lossy dielectric slab by an external complex source point beam",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7228895/",
            "Abstract": "A lossy grounded dielectric slab is excited by an external E-polarized two-dimensional (2-D) beam generated by a complex-source-point (CSP) feed. The electromagnetic boundary value problem is solved analytically in the Fourier-transform domain. Associated wave scattering and absorption phenomena are investigated. Numerical results illustrate the fields variations versus the characteristics of the CSP beam.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electromagnetic Excitation of a Layered Medium by N Magnetic Dipoles",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9135385/",
            "Abstract": "Excitation of a layered medium by N magnetic dipoles is considered. Scattering relations and physical bounds concerning the scattering cross sections and the number of dipoles are derived. Potential applications of such problems are pointed out. Numerical implementations of the derived relations for specific scattering geometries are included.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radiation relations for electromagnetic excitation of a layered chiral medium by an interior dipole",
            "Publication year": 2008,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2834920",
            "Abstract": "In this paper we establish certain fundamental radiation integral relations, refereed also as radiation theorems or principles, which connect the fields and far-field patterns due to the spherical wave excitation of a layered chiral obstacle by a dipole in its interior. The investigation of problems involving such types of excitations is motivated by significant applications including, for example, radiation from thin wires embedded in layered chiral media as well as from chiral in chiral composites. Reciprocity and general radiation theorems are established, relating the total, primary, and secondary Beltrami fields with the respective far-field patterns. As a consequence of the general radiation theorem, we obtain the optical theorem expressing the extinction cross section by means of the secondary Beltrami field at the dipole’s location. For an obstacle excited by a plane and a spherical wave mixed radiation-scattering theorems …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:-f6ydRqryjwC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Inverse medium problems for spherical scatterers in the low-frequency region",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6046512/",
            "Abstract": "The interior low-frequency dipole excitation of a spherical scatterer is motivated by various applications, arising mainly in biomedical engineering. In this paper, we investigate the near-field direct and inverse scattering problem corresponding to the interior electromagnetic excitation of a dielectric sphere by a magnetic dipole. The near-field quantity of interest is the secondary electric field at the dipole's location, which is, under the low-frequency assumption, expressed in closed form. Then, this derived low-frequency near-field expansion is utilized in the development of a simple inverse medium scattering algorithm concerning the determination of the sphere's dielectric permittivity.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diffraction of plane waves incident on a grated dielectric slab: An entire domain integral equation analysis",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7771530/",
            "Abstract": "Diffraction of electromagnetic waves by periodic grating waveguides is investigated by using a rigorous integral equation method, which combines semianalytical techniques and the Method of Moments with entire domain basis functions. The electric field integral equation is employed with unknown function the electric field on the grooves. This equation is subsequently solved by applying an entire domain Galerkin's technique. The proposed analysis provides high numerical stability and controllable accuracy. All the involved computations are analytically carried out, leading to an analytic solution with the sole approximation of the final truncation of the expansion functions sets. The computed results exhibit superior accuracy and numerical efficiency compared with those already derived by applying different methods. The effect of the incident field's and grating's characteristics on the diffraction process as well as …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:IjCSPb-OGe4C",
            "Publisher": "AGU"
        },
        {
            "Title": "Integral equation analysis of coupling in symmetric grating-assisted optical waveguides",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-23-6-1488",
            "Abstract": "The propagation and coupling phenomena in grating-assisted optical couplers are analyzed by using an integral equation formulation and applying an entire-domain Galerkin technique. The proposed method constitutes a special type of the method of moments and provides high numerical stability and controllable accuracy. The electric field in the grating region is the unknown quantity and the resulting integral equation is subsequently solved by using Galerkin's method. The propagation constants of the guided waves are computed accurately by determining the singular points of the corresponding system's matrix. Numerical results regarding the propagation constants are presented for various coupler parameters, and the effect of the grating's physical and geometric characteristics on the coupling process is investigated.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:ufrVoPGSRksC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Inverse Electromagnetic Problems for Spherical Scatterers",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/347910414_Inverse_Electromagnetic_Problems_for_Spherical_Scatterers/links/5fe6ec6545851553a0ef6848/Inverse-Electromagnetic-Problems-for-Spherical-Scatterers.pdf",
            "Abstract": "In this Master’s Thesis, the inverse electromagnetic scattering problem of determining the geometrical and physical characteristics of a layered sphere is analytically investigated. Efficient algorithms in the lowfrequency region are analyzed. These algorithms utilize essentially the information encoded in the scattered far-field due to primary dipoles lying at different locations inside or outside the scatterer.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering and absorption of a complex source point beam by a grounded lossy dielectric slab with a superstrate",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2040-8978/16/10/105712/meta",
            "Abstract": "Considered is the scattering and absorption of an E-polarized two-dimensional (2D) beam generated by a complex-source-point (CSP) feed in the presence of a lossy grounded dielectric slab with a lossless superstrate. The solution is found analytically in the Fourier-transform domain. Numerical results demonstrate the ways of obtaining enhanced absorption in the slab by a proper selection of the slab electrical thickness and the parameters of the superstrate. The effects of internal resonances in the slab are analyzed and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "E-mails; ntsitsasocentral. ntua. gr\", cathanomath. uoagrº",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=y9VoDQAAQBAJ&oi=fnd&pg=PA63&dq=info:zOqZUH_AHNAJ:scholar.google.com&ots=xusyALdyTP&sig=3ryEF5ha29DvmykMzAbhAc7jm20",
            "Abstract": "A layered sphere is excited by a point-source, generating spherical electromagnetic waves. The point-source is located either in the interior or in the exterior of the layered sphere. The solution of the corresponding boundary value problem, which is obtained by applying a combination of Sommerfeld's and T-matrix methods, yields exact expressions of the fields in every layer and in the exterior of the layered sphere. A recursive algorithm with respect to the number of layers is extracted for the computation of the fields in every layer. The results corresponding to a pointsource located in the exterior of the sphere recover known results for spherical wave scattering by a layered sphere.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:2P1L_qKh6hAC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "On the scattering of spherical electromagnetic waves by a layered sphere",
            "Publication year": 2006,
            "Publication url": "https://academic.oup.com/qjmam/article-abstract/59/1/55/1920521",
            "Abstract": "A spherical electromagnetic wave is scattered by a layered sphere. The exact expressions of the scattered and interior fields are obtained by solving the corresponding boundary-value problem, by means of a combination of Sommerfeld's and T-matrix methods. A recursive algorithm with respect to the number of layers is extracted for the computation of the fields in every layer. The far-field pattern and the scattering cross-sections are determined in terms of the physical and geometrical characteristics of the scatterer. As the point-source tends to infinity, the known results for plane wave incidence are recovered. Numerical results are presented for several cases and various parameters of the layered spherical scatterer.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Aristotle University of Thessaloniki, Department of Informatics, GR-54124, Thessaloniki, Greece 2 Aalto University, School of Electrical Engineering, Department of Radio Science and Engineering, Otakaari SA Str., FIN-02150, Espoo, Finland ntsitsas@ csd. auth. gr",
            "Publication year": 0,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.707.1192&rep=rep1&type=pdf",
            "Abstract": "A grounded dielectric film-slab is externally excited by a normally-incident Gaussian beam. A single superstrate dielectric layer, with suitably selected parameters, is placed on top of the film-slab in order to increase the power concentration inside the slab. A basic quantity of interest, called\" enhancement factor\" is defined, which expresses how high is the power concentration in the slab when the superstrate is present, compared to when it is absent. We demonstrate that high enhancement factor values may be achieved by choosing appropriately the physical and geometrical superstrate's parameters.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Point source excitation of a layered sphere: direct and far-field inverse scattering problems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8207876/",
            "Abstract": "A layered sphere is excited by a time-harmonic spherical acoustic wave, generated by a point source located either in the interior or in the exterior of the sphere. The sphere's core may be acoustically soft, hard, resistive or penetrable. Significant applications such as radiation from the neuron currents lying inside the human brain and localization and shape reconstruction of buried objects in layered media motivate the investigation of direct and inverse scattering problems involving such types of scatterers and excitations. The exact Green's function is determined by solving the corresponding boundary-value problem, by applying a combination of Sommerfeld's and T-matrix methods. We then introduce the low-frequency assumption and extract from the determined exact Green's function the low-frequency far-field results for a small layered sphere. The spherical wave low-frequency far-fields obtained reduce to those …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:eQOLeE2rZwMC",
            "Publisher": "OUP"
        },
        {
            "Title": "Concealing a perfectly conducting object with edges inside a dielectric superstrate",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6632451/",
            "Abstract": "An infinite perfect electric conducting (PEC) plane on top of which lies a 2-D PEC thin object with edges (bump) is excited by a plane wave. The overall structure is covered by a slab dielectric superstrate. The purpose of this work is to determine the superstrate's thickness and permittivity such that the contribution due to the bump on the far-field is reduced, while simultaneously the plane wave reflection by the bump-free structure remains close to that by the infinite PEC plane. A semi-analytic integral equation method is developed to determine the structure's scattering characteristics. Numerical simulations are also presented verifying the effectiveness of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mathematical modeling of spherical microstrip antennas and applications",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=b1WRDwAAQBAJ&oi=fnd&pg=PA109&dq=info:oouPN5UMgXsJ:scholar.google.com&ots=SUwGvgEIbI&sig=6xlauy-WmGoRgZsVZ8qA0K5wY7U",
            "Abstract": "Microstrip antennas offer many attractive features and hence it is very challenging to model efficiently their resonance and radiation characteristics (Pozar & Schaubert, 1995). In particular, microstrip antennas composed of perfectly electric conducting (PEC) patches mounted on spherical surfaces possess two basic advantages against the planar ones. First, their curved shape makes them more applicable to real-world moving configurations such as missiles, satellites and aircrafts, where large plane boundaries are usually absent. Second, the frequency scanning problem encountered in case of planar microstrips at low elevations may be overcome due to the conformability of spherical antennas. Apart from these two advantages, spherical microstrip antennas offer (due to their relatively simple geometry) additional attractive features like low cost, light weight, easy fabrication as well as integrability with microwave and millimeter-wave circuits. As far as the metallic patch is concerned, circular or annular-ring ones are preferable for mounting on a spherical body. Interesting design characteristics of microstrip antennas are mainly the complex resonant frequencies, the radiation pattern and the input impedance. An extensive literature survey concerning the analysis of non-planar radiating microstrip structures, as well as the investigations of the aforementioned design characteristics is included in the classic book (Wong, 1999).The mathematical methods, developed for analyzing the behavior of a spherical microstrip, may be categorized as follows:(i) the full-wave approach implements the method of moments (MoM) to approximate the surface current …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:5nxA0vEk-isC",
            "Publisher": "BoD–Books on Demand"
        },
        {
            "Title": "Multiple Scattering by an Impenetrable Cluster: Energy Transfer Process of the Scattered Sound",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9552318/",
            "Abstract": "A cluster of impenetrable scatterers is excited by a point source located inside a penetrable scatterer. The conservation of energy and the energy transfer process for this problem are considered. Relations of the scattering cross section with the complex sound intensity in the exciting scatterer are derived. A connection between the energy densities in the cluster's exterior and the reactive acoustic intensity through the exciting scatterer is established.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient integral equation analysis of scattering by a metamaterial grating assisted slab",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7746403/",
            "Abstract": "Plane wave scattering by a dielectric slab on which has been etched an infinitely periodic metamaterial grating is analyzed by means of semi-analytical integral equation techniques. The grating slab's operation as a frequency filter as well as the effect of the grating's parameters on the diffracted fields are investigated for a grating composed of an epsilon-near-zero (ENZ) material.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Entire-Domain Galerkin Method for the Analysis of Wave Scattering by All-Dielectric Metasurfaces",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8460458/",
            "Abstract": "Plane-wave scattering by a planar all-dielectric metasurface is considered. The associated boundary-value problem is reformulated in an integral form involving the layered medium's Green's function. Then, a rigorous entire-domain integral-equation methodology is developed for the accurate determination of the reflected and transmitted fields. Certain numerical results are reported, exhibiting specific metasurfaces, which can operate efficiently as narrow-band reflection filters. Connections to applications of controlling the propagation direction of electromagnetic waves are pointed out.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Entire domain integral equation analysis of periodic dielectric waveguides",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4581037/",
            "Abstract": "The propagation and scattering phenomena by grating waveguides are investigated analytically by applying a rigorous entire domain integral equation method. The basic advantages of this method concern the high accuracy, the numerical efficiency and the analytic computation of the integrals involved. Numerical results reveal the optimal gratingpsilas characteristics for maximum coupling efficiency as well as very narrow reflection resonances.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Complex source point beam excitation of a lossless dielectric slab",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7544062/",
            "Abstract": "The excitation of the guided modes of a lossless slab by a complex source point (CSP) beam is semi-analytically investigated. The goal is to compute the guided-mode powers and efficiencies as a function of problem's parameters, namely the electrical thickness, the angle of incidence, the beam aperture, and the aperture location.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rigorous Integral-equation Modeling of Wave Scattering and Guiding by All-dielectric Grating-assisted Metasurfaces",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9017722/",
            "Abstract": "Scattering and guiding of electromagnetic waves by periodic grating-assisted all-dielectric metasurfaces are modeled by a rigorous entire-domain integral equation methodology. The standard electric-field integral equation is employed with unknown function the electric field on the grating region. Semi-analytical solutions are determined by applying an entire domain Galerkin's technique. The derived results possess high numerical stability and controllable accuracy. The effect of the grating's parameters on the computed scattered fields and complex propagation constants is examined. Applications related to generating enhanced reflection or transmission in specific diffraction orders are pointed out.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:tOudhMTPpwUC",
            "Publisher": "Electromagnetics Academy"
        },
        {
            "Title": "Point-source elastic scattering by a nested piecewise homogeneous obstacle in an elastic environment",
            "Publication year": 2010,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1081286508102048",
            "Abstract": "A nested piecewise homogeneous elastic scatterer is embedded in a homogeneous elastic environment. The scatterer’s core may be rigid, cavity, Robin, or lossy penetrable. A 2D or 3D incident elastic field, generated by a point-source located in the homogeneous environment, impinges on the scatterer. The scattering problem is formulated in a dyadic form. The main purpose of this paper is to establish scattering relations for the elastic point-source excitation of a nested piecewise homogeneous scatterer. To this direction, we establish reciprocity principles and general scattering theorems relating the scattered fields with the corresponding far-field patterns. Furthermore, for a scatterer excited by a point-source and a plane wave, mixed scattering relations are derived. The optical theorem, relating the scattering cross-section with the field at the point-source’s location a is recovered as a corollary of the general …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:4TOpqqG69KYC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Finding a source inside a sphere",
            "Publication year": 2011,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0266-5611/28/1/015003/meta",
            "Abstract": "A sphere excited by an interior point source or a point dipole gives a simplified yet realistic model for studying a variety of applications in medical imaging. We suppose that there is an exterior field (transmission problem) and that the total field on the sphere is known. We give analytical inversion algorithms for determining the interior physical characteristics of the sphere as well as the location, strength and orientation of the source/dipole. We start with static problems (Laplace's equation) and then proceed to acoustic problems (Helmholtz equation).",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:UebtZRa9Y70C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Modelling of computational electromagnetics problems by using discrete trigonometric transforms matrices",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5637376/",
            "Abstract": "Several problems in Computational Electromagnetics (CEM) including discretizations of scatterers and radiators with the Method of Moments, the Boundary Element Method, and the Method of Auxiliary Sources may be modelled efficiently by exploiting certain properties of block matrices associated with Discrete Trigonometric Transforms (DTT's). To this direction, in this paper we describe the implementation of certain efficient algorithms for the inversion of such block matrices, which are superior in terms of computational complexity compared to standard inversion techniques. Numerical results are presented demonstrating the CPU-time efficiency as well as the accuracy for ill-conditioned matrices, stemming from specific CEM problems.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Increasing the detectability of a buried object by depositing a passive superstrate on the ground",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/347904021_Forum_for_Electromagnetic_Research_Methods_and_Application_Technologies_FERMAT_Increasing_the_detectability_of_a_buried_object_by_depositing_a_passive_superstrate_on_the_ground/links/5fe65ef0299bf140884400fa/Forum-for-Electromagnetic-Research-Methods-and-Application-Technologies-FERMAT-Increasing-the-detectability-of-a-buried-object-by-depositing-a-passive-superstrate-on-the-ground.pdf",
            "Abstract": "A ground-penetrating radar (GPR) antenna excites a perfectly electric conducting (PEC) inclusion buried inside the ground. One of the main problems in the detection of the PEC inclusion via external measurements is its poor scattering response due to attenuation. Hence, increasing the scattered power generated by the inclusion is of great practical interest. To this direction, the main purpose of this work is to investigate a procedure of unlocking the ground by depositing a thin passive layer of conventional material atop of it. The first step of the developed methodology is to significantly enhance the transmission into a lossy half space, in the absence of the inclusion, by covering it with a passive slab, the thickness and permittivity of which are to be determined. Then, the full boundary value problem (including the inclusion) is solved semi-analytically via integral equations techniques. The scattered power of the buried inclusion is compared to the corresponding quantity when no additional layer is present. Results from numerical simulations are presented exhibiting the effectiveness of the approach. Substantial improvement in the detectability of the inclusion is reported for several types of ground and burying depths by using conventional realizable passive materials. The effects of the shape of the buried inclusion on the scattered field are also investigated. The developed technique may constitute an effective configuration (structural) preprocessing which may be used as an initial step in the analysis of related problems before the application of an inverse scattering algorithm concerning the efficient processing of the scattering data.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accuracy analysis of the method of auxiliary sources (MAS) for scattering from a two-layer dielectric circular cylinder",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1552515/",
            "Abstract": "The paper rigorously investigates the accuracy of MAS when the method is applied to normal incidence scattering by an infinite circular cylinder composed of two dielectric layers. For this particular scattering configuration, we prove that the MAS matrix is analytically invertible. Numerical and analytical results for the computational error, which results from numerical inversion, are presented. Finally, error minimization indicates the auxiliary sources' optimal location.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integral Equation Computation of Coupled Propagation Modes in Non-Symmetric Grating Waveguides",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4018185/",
            "Abstract": "A rigorous integral equation formulation in conjunction with Green's function theory is used for the analysis of the wave guiding and coupling phenomena in non-symmetric grating assisted optical couplers. The integral equation is solved by applying an entire domain Galerkin's technique. Numerical results, referring to the evolution of the propagation constants, as function of the grating's characteristics are presented",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Giant enhancement of the controllable in-plane anisotropy of biased isotropic noncentrosymmetric materials with epsilon-negative multilayers",
            "Publication year": 2017,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4975482",
            "Abstract": "Giant in-plane anisotropy can be exhibited by a finitely thick periodic multilayer comprising bilayers of an isotropic noncentrosymmetric material and a non-dissipative isotropic medium of negative permittivity, when a dc electric field is applied in the thickness direction. Compared to a homogeneous layer of the noncentrosymmetric material with the same thickness as the periodic multilayer, the latter exhibits an effective in-plane anisotropy that can be three orders larger in magnitude. This enhancement gets more substantial at higher frequencies and is electrically controllable. The incorporation of dissipation reduces the enhancement of the effective in-plane anisotropy, which nevertheless remains significant. We expect the finitely thick periodic multilayer to be useful as a polarization transformer or a modulator in the terahertz regime fully controllable via external dc bias.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:a0OBvERweLwC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Teaching Applied Mathematics for Electromagnetics by means of a Simple Scattering Problem",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9135559/",
            "Abstract": "In this paper, combined techniques from Complex Analysis, Fourier Transforms and Compact Operators are applied to investigate convergence properties of the solutions of a simple two-dimensional scattering problem. It is shown how basic tools of Applied Mathematics can aid the understanding and the gain of physical insight on the behavior of the scattered fields.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convergence of fictitious sources methods applied to three-dimensional scattering problems",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7571364/",
            "Abstract": "Computational methods, utilizing representations of the approximate solution of a boundary value problem as a finite superposition of fields of fictitious sources located outside the problem's domain, are widely used in the numerical modeling of wave scattering and radiation problems. In this work, we investigate certain convergence issues related to the field solutions derived by the application of fictitious sources methods to three-dimensional (3-D) scattering problems. The main result concerns the divergence and oscillations of the source strengths and the simultaneous convergence of the field generated by these divergent strengths. The origin of the oscillations is discussed and it is shown that they are not due to round-off errors or matrix ill-conditioning.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electromagnetic scattering theorems for interior dipole excitation of a layered obstacle",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.853",
            "Abstract": "A layered scatterer is excited by a time‐harmonic spherical electromagnetic wave, generated by a dipole located either in the interior or in the exterior of the scatterer. The scatterer's core may be perfect conducting, impedance or dielectric. This paper initiates the investigation of scattering theorems corresponding to the excitation of a layered scatterer by a dipole in its interior. We establish reciprocity and general scattering theorems relating the total electric fields with the corresponding far‐field patterns. The optical theorem, relating the scattering cross‐section with the electric field in the layer containing the dipole, is recovered as a corollary of the general scattering theorem. Furthermore, for a scatterer excited by a spherical and a plane wave, mixed scattering theorems are derived. Besides, all the derived theorems recover known results, concerning the excitation of a homogeneous scatterer by an exterior dipole …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:W7OEmFMy1HYC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Gap Solitons in Double-Lorentz Nonlinear Metamaterials",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8534146/",
            "Abstract": "A nonlinear metamaterial, characterized by a double-Lorentz model of its frequency-dependent linear effective permittivity and permeability, is considered. The formation of gap solitons in the two frequency band gaps of this metamaterial is investigated analytically.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A distributed intelligent agent platform for genetic optimization in CEM: Applications in a quasi-point matching method",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4120280/",
            "Abstract": "The use of genetic algorithms in computational electromagnetics (CEM) has proved a fruitful, but resource demanding optimization method with numerous practical applications. This paper introduces a parallel distributed computing framework based on the intelligent agent technology that is capable of handling the genetic optimization for diverse CEM problems. The platform core component is the genetic search agent (GSA), a collaborative computational entity that communicates with its peers in order to carry out a genetic optimization scheme. The platform can interface with foreign codes transparently due to its flexible code loading mechanisms, specially designed for CEM applications. The framework is applied to the optimization of a quasi-point matching method with fictitious sources (QPM-FS). The analysis comprises two case studies, involving electromagnetic scattering by: i) a two-layered cylinder; and ii) a …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wavefront engineering with optimally loaded absorbing metamirrors",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Costas-Valagiannopoulos/publication/351634003_Wavefront_engineering_with_optimally_loaded_absorbing_metamirrors/links/60a28fef92851c186a629bcb/Wavefront-engineering-with-optimally-loaded-absorbing-metamirrors.pdf",
            "Abstract": "Controlling the amplitude and phase of electromagnetic waves as they propagate in space is a generic and critical function behind a myriad of microwave and photonic devices. Such a process has become easier and more feasible with the advent of metasurfaces, where subwavelength nanoparticles modify locally the reflection and transmission coefficients from a flat boundary and “rewrite” at will the laws of diffraction [1]. The planarly distributed inclusions that create this effective boundary condition vary from elliptical dielectric nanoposts, offering complete control of refractive polarization [2], to resonant nanocubes accomplishing extreme light bending and focusing [3, 4] and printed patches on unit cells for arbitrary tailoring of transmissive wavefronts [5]. Similar wavefront engineering aims are greatly served by the development of general synthesis formulations that provide the correct susceptibility tensors for the desired transformation [6] and give rise to intelligent metasurfaces with continuously tunable surface features for multiple reconfigurable operations [7, 8]. Nonlinear elements have been, also, employed to* konstantinos. valagiannopoulos@ nu. edu. kz further enhance the local power concentration and refractive resolution [9] or achieve asymmetric light transport allowing for the implementation of one-way photonic devices such as unrivaled optical valves and diodes [10]. In most of the aforementioned approaches, the control of the wavefront concerns the transmissive signal; however, the fabrication of free-standing ultrathin structures is not always convenient. Indeed, the surface is commonly patterned on an impenetrable base helping …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:HE397vMXCloC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "On methods employing auxiliary sources for 2-D electromagnetic scattering by noncircular shapes",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8410885/",
            "Abstract": "Methods employing auxiliary sources are applied to electromagnetic scattering problems by 2-D noncircular scatterers. Specific cases are considered for which the singularities of the analytic continuation of the scattered field into the interior of the scatterer can be analytically determined. Then, it is shown that the amplitudes (currents) of the sources diverge and oscillate when the auxiliary curve does not enclose these singularities. Still, the electric fields computed by means of the divergent and oscillatory currents are convergent and correct. The correctness of the computed fields is validated by comparison with the exact solutions (where possible) as well as with the numerical solutions computed via commercial field simulation software.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On an electromagnetic inverse source problem for the excitation of a spherical medium",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6328729/",
            "Abstract": "Important applications in medical imaging, like for example electroencephalography (EEG), frequently utilize a homogeneous dielectric sphere excited by an interior electromagnetic point-dipole as an appropriate relevant simplified model. In this work, we investigate an electromagnetic inverse source problem, where a primary magnetic dipole source radiating inside a homogeneous sphere is determined from a certain set of field measurements on the sphere's surface. More precisely, the location and strength of the interior dipole are determined by a simple and analytic methodology which relies on the information from specific moments, obtained by integrating the product of the total tangential electric field on the spherical interface with the vector spherical harmonic functions.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Solitons in a homogenized two-phase, isotropic, nonlinear, particulate composite medium",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-29-9-2610",
            "Abstract": "The strong permittivity fluctuation theory was employed to determine the effective linear relative permittivity and the effective nonlinear susceptibility of a two-phase, isotropic, nonlinear, particulate composite medium. Propagation in the homogenized composite medium obeys the complex Ginzburg–Landau equation, and therefore the medium can support the propagation of chirped solitons that are either Pereira–Stenflo (PS) bright solitons or Nozaki–Bekki (NB) dark solitons, when linear loss is counterbalanced by nonlinear gain. Soliton propagation depends on the volume fraction of the component phases as well as on the correlation length of the spatial fluctuation of the dielectric properties in the composite medium.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:r0BpntZqJG4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optimization of the method of auxiliary sources (MAS) for scattering by an infinite cylinder under oblique incidence",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/02726340590522157",
            "Abstract": "This paper presents a rigorous accuracy analysis of the method of auxiliary sources (MAS) for the problem of oblique incidence plane wave scattering by a perfectly conducting, infinite circular cylinder. For this particular scattering geometry, it is shown that the MAS matrix is inverted analytically, via eigenvalue analysis, and an exact mathematical expression for the discretization error is derived. Furthermore, the computational error, resulting from numerical matrix inversion, is calculated and compared to the analytical one, showing perfect fit for a wide range of the auxiliary sources' locations. The irregular behavior of the computational error for small values of the auxiliary sources' radii is explained by the corresponding high values of the linear system's condition number. It is also demonstrated that specific source locations, associated with the characteristic eigenvalues of the scattering problem, should be avoided …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Achieving Anomalous Refraction with Metasurfaces Composed by Two Ordinary Dielectric Materials",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8534170/",
            "Abstract": "The optimal parameters of a dielectric metasurface, composed of two alternating rectangular rods, are investigated so that it exhibits significant enhancement in the -1-diffracted order in the transmission region. An efficient integral-equation methodology is used for the numerical computations. Representative results of initial optimizations are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Integral Equation Method for the Analysis of Propagation in Symmetric Grating Assisted Optical Couplers",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/346061286_An_Integral_Equation_Method_for_the_Analysis_of_Propagation_in_Symmetric_Grating_Assisted_Optical_Couplers/links/5fb98be2458515b7975fdc20/An-Integral-Equation-Method-for-the-Analysis-of-Propagation-in-Symmetric-Grating-Assisted-Optical-Couplers.pdf",
            "Abstract": "The propagation and coupling phenomena in a grating assisted optical coupler are analyzed by using integral equation techniques. The electric field in the grating region is the unknown quantity and the resulting integral equation is subsequently solved by using Galerkin’s method. The roots of the determinant of the pertinent linear system’s matrix determine the propagation constants. Numerical results regarding the propagation constants are presented for various coupler’s parameters and the effect of the grating’s physical and geometrical characteristics on the coupling process is investigated.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "4.19 Interactions of layered spheres with dipoles in direct and inverse scattering theory",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.930.4870&rep=rep1&type=pdf#page=70",
            "Abstract": "The scattering of a dipole generated spherical wave by a layered sphere provides interesting features, which are essentially different from those due to a plane wave. In direct scattering theory the far-field interaction of a dipole with a sphere is in general stronger than that of a plane wave. On the other hand, in inverse scattering problems the distance of the dipole from the sphere’s center constitutes an additional parameter, which is encoded in the far-field pattern and is significant for the sphere’s reconstruction. Dipole excitation of a layered sphere has significant applications. The interaction between the mobile phone antenna and the human head is modelled as an exterior dipole excitation problem [1]. Besides, the interior dipole excitation has significant medical applications, such as implantations inside the human head for hyperthermia or biotelemetry purposes [2], as well as excitation of the human brain by the neurons’ currents [3]. Further chemical, biological, and physical applications are discussed in [4]. In this paper we investigate the excitation of a layered sphere by a time-harmonic spherical electromagnetic wave, generated by a dipole located either in the interior or in the exterior of the sphere. The layered sphere consists of N concentric spherical layers with constant material parameters; N− 1 layers are dielectric and the N-th layer (core) is perfect conducting, impedance or dielectric. We compute the exact Green’s function by combining T-matrix [5] and Sommerfeld’s methods [6]. The T-matrix method uses Mie series expansions and handles the effect of the layers, while the Sommerfeld’s method handles the singularity of the dipole …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering analysis of discrete bodies of revolution via an efficient numerical algorithm",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5637295/",
            "Abstract": "Electromagnetic Scattering from Discrete Bodies of Revolution (DBOR's) is performed by invoking a recently developed, recursive linear system direct solver. The problem is initially formulated via a standard Moment Method (MoM) with point matching, however the DBOR symmetry is taken into account to simplify calculations. Specifically, the MoM matrix is cast in a form comprising circulant blocks, which is amenable to eigenvalue decomposition, and subsequent direct matrix inversion by an efficient recursive technique.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Anomalous refraction into free space with all-dielectric binary metagratings",
            "Publication year": 2020,
            "Publication url": "https://journals.aps.org/prresearch/abstract/10.1103/PhysRevResearch.2.033526",
            "Abstract": "Steering the incoming photonic power toward unusual directions, not predicted by Snell's laws of reflection and refraction, is a fundamental operation behind numerous wavefront engineering applications. In this study, strong anomalous transmission is reported to all-dielectric electrically thin structures comprising only two materials in alternating rectangular posts. These binary metagratings have been thoroughly optimized to support almost perfect negative refraction by suppressing all the rest of diffraction orders; such an effect is found to be very robust with respect to oscillation frequency, incident beam angle, and structural defects. In this way, easy-to-fabricate setups working at different colors of the visible spectrum are determined and may be directly incorporated in various optical integrated systems from lenses and beamformers to field enhancers and power splitters.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:q3oQSFYPqjQC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Characteristics of soliton propagation in an isotropic chiral metamaterial",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/347828452_Characteristics_of_soliton_propagation_in_an_isotropic_chiral_metamaterial/links/5fe448a992851c13feb49e89/Characteristics-of-soliton-propagation-in-an-isotropic-chiral-metamaterial.pdf",
            "Abstract": "By using the reductive perturbation method, we found that the two Beltrami components of the electromagnetic field propagating along a fixed direction in an isotropic nonlinear chiral metamaterial obey a system of two coupled nonlinear Schrödinger (NLS) equations. Certain spectral regimes exist wherein one of the two Beltrami components exhibits a negative-real refractive index and the NLS system can be approximated by the Manakov system. Bright-bright, dark-dark and dark-bright vector solitons can form in those spectral regimes.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Convergence analysis and oscillations in the method of fictitious sources applied to dielectric scattering problems",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-29-1-1",
            "Abstract": "Several wave scattering phenomena in optics are modeled by the method of fictitious sources (MFS). Despite its interesting features, the effectiveness of the MFS and its applicability are restricted by open issues, including the placement of the fictitious sources (FS) and the fields’ convergence. Concerning these issues, we investigate here the MFS convergence and study oscillations in its solutions for a representative scattering problem of a dielectric cylinder illuminated by a current filament. It is shown analytically that, when the FS radii lie in the interior and exterior of two disks with certain critical radii, the MFS currents’ series diverge while the respective fields converge, as the FS number N tends to infinity. Asymptotic formulas of the divergent currents are established, exhibiting that they increase exponentially with N and oscillate. Numerical simulations are included, demonstrating that (i) the divergent currents …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Point-source electromagnetic excitation of a layered sphere",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812773197_0007",
            "Abstract": "A layered sphere is excited by a point-source, generating spherical electromagnetic waves. The point-source is located either in the interior or in the exterior of the layered sphere. The solution of the corresponding boundary value problem, which is obtained by applying a combination of Sommerfeld's and T-matrix methods, yields exact expressions of the fields in every layer and in the exterior of the layered sphere. A recursive algorithm with respect to the number of layers is extracted for the computation of the fields in every layer. The results corresponding to a point-source located in the exterior of the sphere recover known results for spherical wave scattering by a layered sphere.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An optimized quasi-point matching Fictitious Sources method: Application to scattering by a buried cylinder",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1689788/",
            "Abstract": "A quasi-point matching method with fictitious sources (QPM-FS) is introduced and clarified by investigating the electromagnetic scattering problem by a cylinder, buried in a two-layered earth medium. This method reduces the effects of several numerical instabilities of the standard method of auxiliary sources (MAS) and thus is expected to treat more efficiently electrically large or complex problems",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the formation of gap solitons in nonlinear electromagnetic metamaterials",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.5844",
            "Abstract": "A nonlinear (Kerr‐type) electromagnetic metamaterial, characterized by a double‐Lorentz model of its frequency‐dependent linear effective dielectric permittivity and magnetic permeability, is considered. The formation of gap solitons in the low‐ and high‐frequency band gaps of this metamaterial is investigated analytically. Evolution equations governing the gap solitons, of the form of a nonlinear Klein‐Gordon and a nonlinear Schrödinger equation, are obtained, and the structure of their solutions is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mitigating Snell's-Law reflection and transmission with metasurfaces of ordinary dielectrics",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8065474/",
            "Abstract": "Obtaining anomalous reflection and transmission (namely propagation along directions different from those predicted by Snell's law) is investigated for plane waves impinging on a planar periodic metasurface composed of two dielectric layers. The associated boundary-value problem is treated by a rigorous entire-domain integral equation methodology. Optimizations with respect to the configuration's parameters are performed which reveal that it is possible to obtain significantly enhanced anomalous transmission and reflection depending on the color of the incident light. The optimal parameter values correspond to metasurfaces which can be easily realizable by low-loss dielectric materials.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pockels cover for switchable control of the reflection from a grounded, isotropic, lossy dielectric slab",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4913388",
            "Abstract": "Theoretical analysis indicates that the reflection of obliquely incident light with arbitrary polarization state in the mid-wavelength (3–8 μm) and long-wavelength (8–15 μm) infrared regimes by a lossy, isotropic, dielectric slab backed by a perfect electric conductor can be electrically controlled by covering the dielectric slab by an epitaxial layer of cubic noncentrosymmetric materials, which are normally isotropic dielectric but display the Pockels effect. The reflectances change on the application of a dc electric field parallel to thickness direction of the Pockels cover, without causing depolarization.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:BqipwSGYUEgC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Hiding a bump on a PEC plane by using an isotropic lossless dielectric layer",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6895287/",
            "Abstract": "An infinite perfect electric conducting (PEC) plane on top of which lies a 2-D PEC object (bump) is excited by a plane wave. The main purpose of this work concerns the determination of the appropriate permittivity εr and thickness H of a lossless dielectric superstrate slab layer, placed on top of the overall structure of the PEC bump and the PEC plane, such that two objectives are fulfilled: 1) the plane wave reflection by the grounded slab configuration in the absence of the bump resembles closely that by the infinite PEC plane, and simultaneously 2) the contribution due to the presence of the bump itself on the scattered far-field radiated over all directions becomes as small as possible. A semianalytic integral equation methodology is developed to determine the field scattered by the bump configuration. Numerical results are presented demonstrating that indeed for certain regions of values of the superstrate's …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analytical investigations of ground modifications assisting the detection of a buried object",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7571519/",
            "Abstract": "A ground-penetrating radar (GPR) antenna excites a perfectly electric conducting inclusion buried inside the ground. The scattering problem is solved semi-analytically via integral equation techniques. The permittivity and thickness of a superstrate deposited atop the ground are determined such that the detectability of the inclusion is significantly increased. Results from numerical simulations are presented exhibiting the effectiveness of the approach. Emphasis is given on the effects that the shape of the buried inclusion has on the scattered field.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Inverse Scattering in the Low-Frequency Region by Using Acoustic Point Sources",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1057.4248&rep=rep1&type=pdf",
            "Abstract": "The interaction of a point-source spherical acoustic wave with a bounded obstacle possesses various attractive and useful properties in direct and inverse scattering theory. More precisely, concerning the direct scattering problem, the far-field interaction of a point source with an obstacle is, under certain conditions, stronger compared to that of a plane wave. On the other hand, in inverse scattering problems the distance of the point-source from the obstacle constitutes a crucial parameter, which is encoded in the far-field pattern and is utilized appropriately for the localization and reconstruction of the obstacle’s physical and geometrical characteristics.The research of point-source scattering initiated in (1), dealing with analytical investigations of the scattering problem by a circular disc. The main results for point-source scattering by simple homogeneous canonical shapes are collected in the classic books (2) and (3). The techniques of the low-frequency theory (4) in the point-source acoustic scattering by soft, hard, impedance surface, and penetrable obstacles were introduced in (5),(6), and (7), where also explicit results for the corresponding particular spherical homogeneous scatterers were obtained. Moreover, in (5),(6), and (7) simple far-field inverse scattering algorithms were developed for the determination of the sphere’s center as well as of its radius. On the other hand, point-source near-field inverse scattering problems for a small soft or hard sphere were studied in (8). For other implementations of near-field inverse problems see (9), and p. 133 of (10); also we point out the point-source inverse scattering methods analyzed in (11). In all the …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "On block matrices associated with discrete trigonometric transforms and their use in the theory of wave propagation",
            "Publication year": 2010,
            "Publication url": "https://www.jstor.org/stable/43693621",
            "Abstract": "Block matrices associated with discrete Trigonometric transforms (DTT's) arise in the mathematical modelling of several applications of wave propagation theory including discretizations of scatterers and radiators with the Method of Moments, the Boundary Element Method, and the Method of Auxiliary Sources. The DTT's are represented by the Fourier, Hartley, Cosine, and Sine matrices, which are unitary and offer simultaneous diagonalizations of specific matrix algebras. The main tool for the investigation of the aforementioned wave applications is the efficient inversion of such types of block matrices. To this direction, in this paper we develop an efficient algorithm for the inversion of matrices with U-diagonalizable blocks (U a fixed unitary matrix) by utilizing the U-diagonalization of each block and subsequently a similarity transformation procedure. We determine the developed method's computational complexity …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:0EnyYjriUFMC",
            "Publisher": "Chinese Academy of Mathematices and System Sciences (AMSS) Chinese Academy of Sciences"
        },
        {
            "Title": "404 Contributed Sessions",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/337499154_Near-Field_Inverse_Dipole_Problems_in_Spherical_Media/links/5ddc3955a6fdccdb44655260/Near-Field-Inverse-Dipole-Problems-in-Spherical-Media.pdf",
            "Abstract": "A homogeneous dielectric spherical medium excited by an internal point-dipole is utilized as a simplified benchmark model in different application domains, like eg medical imaging. In this work, we investigate the electromagnetic inverse source problem of the determination of the internal dipole's characteristics by using near-field measurements on the boundary of the medium. We describe a simple analytic inverse algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Short pulse equations and localized structures in frequency band gaps of nonlinear metamaterials",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960110000150",
            "Abstract": "We consider short pulse propagation in nonlinear metamaterials characterized by a weak Kerr-type nonlinearity in their dielectric response. Two short-pulse equations (SPEs) are derived for the high-and low-frequency “band gaps”(where linear electromagnetic waves are evanescent) with linear effective permittivity ϵ< 0 and permeability μ> 0. The structure of the solutions of the SPEs is also briefly discussed, and connections with the soliton solutions of the nonlinear Schrödinger equation are made.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:2osOgNQ5qMEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Concentrating the electromagnetic power in a grounded dielectric slab excited by an external gaussian beam",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6331251/",
            "Abstract": "A grounded dielectric film-slab is externally excited by a normally-incident Gaussian beam. A single superstrate dielectric layer, with suitably selected parameters, is placed on top of the film-slab in order to increase the power concentration inside the slab. A basic quantity of interest, called “enhancement factor” is defined, which expresses how high is the power concentration in the slab when the superstrate is present, compared to when it is absent. We demonstrate that high enhancement factor values may be achieved by choosing appropriately the physical and geometrical superstrate's parameters.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direct and inverse low‐frequency acoustic excitation of a layered sphere by an arbitrarily positioned point source",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.4088",
            "Abstract": "A layered sphere is excited by an acoustic point source arbitrarily located inside or outside the sphere. First, the direct scattering problem is solved analytically by developing a transitions matrix methodology. Then, approximations of the acoustic far‐field in the low‐frequency regime are derived, by using asymptotic techniques, and are subsequently utilized in inverse scattering algorithms concerning either the determination of the sphere's characteristics or the parameters of an internal point source. Copyright © 2016 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new method of internal auxiliary source-sinks (MIASS) for two-dimensional interior Dirichlet acoustic problems",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377042720305227",
            "Abstract": "A new Method of Internal Auxiliary Source–Sinks (MIASS) is developed for the numerical solution of the two-dimensional interior Dirichlet acoustic problem for the Helmholtz equation. We give two versions of MIASS, one for a closed auxiliary curve (MIASS-C) and another for an open auxiliary curve (MIASS-O). The mathematical and numerical foundations of both versions are provided. In particular, we show that the integral operator that pertains to the associated integral equation has a dense range. We then demonstrate completeness and linear independence of the discrete system of source-sinks. Indicative numerical results are given and numerical implementation aspects are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:J-pR_7NvFogC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fourier-Transform-Domain Solution of the Directive Beam Scattering by a Dielectric Slab with Account of the Guided Waves",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471410/",
            "Abstract": "Considered is a lossless dielectric slab excited by a two-dimensional E-polarized complex source point (CSP) beam. This constitutes an accurate and experimentally realizable model for estimating the power transferred from a finite directive source into the slab's guided waves. The guided-waves fields as well as the space-wave (scattered) fields are analytically determined by employing a Fourier-transform-domain approach. The guided-modes powers and efficiencies and the space-wave powers are calculated as functions of problem's parameters. Some preliminary numerical results on the variations of these powers are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convergent fields generated by divergent currents in the method of auxiliary sources",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-74890-0_5",
            "Abstract": "A very simple scattering problem is considered, together with its solution obtained via the Method of Auxiliary Sources (MAS). We show that it is possible to concurrently have divergence of the auxiliary currents together with convergence of the scattered field generated by these divergent currents. The divergence manifests itself as rapid, unphysical oscillations in the auxiliary currents. It is stressed that the oscillations are not due to effects such as roundoff, matrix ill-conditioning, or to the well-studied phenomenon of internal resonances. We arrive at our conclusions using a number of means including asymptotic methods and a thorough discussion of the singularities of the analytic continuation          of the scattered field. We also make a detailed comparison to corresponding discretizations of the Extended Integral Equation (EIE), in which similar phenomena do not occur. Analogies to superdirectivity and …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "ON THE INTERIOR DIPOLE EXCITATION OF A LAYERED CHIRAL SCATTERER",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0002",
            "Abstract": "A layered chiral scatterer is excited by a time harmonic spherical electromagnetic wave, generated by a dipole located in the interior of the scatterer. The investigation of such excitation problems is motivated by significant applications including for example radiation from antennas embedded in chiral media and from chiral in chiral composites as well as medical implantations inside the human body. Reciprocity and general radiation theorems are established, relating the Beltrami fields with the corresponding far field patterns. The theorems recover as special cases the respective known results for chiral and achiral media.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new technique for efficient and accurate analysis of FSSs, EBGs and metamaterials",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.26730",
            "Abstract": "The article presents a numerically efficient and accurate technique for the analysis of doubly‐infinite periodic arrays, which find applications as frequency selective surfaces, electronic bandgap structures and metamaterials that often utilize periodic elements with fine features. The method derives its efficiency by projecting the solution to the infinite array problem from that of a corresponding truncated array of relatively small size, typically comprising of only four to six rings. Furthermore, it reduces the matrix size needed to solve for the induced current to only two or three. Another feature of the method is that it involves reciprocity principle to compute the reflection and transmission coefficients of the array, using a technique that avoids the need to integrate the currents induced on the unit cell via the periodic Green's function, as well as the evaluation of the latter integral in the far‐field. The results derived are compared …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Complex resonant frequencies of multi-layered spherical microstrip antennas",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4580943/",
            "Abstract": "A spherical microstrip antenna with its circular metallic patch located inside a multi-layered coating is analyzed. The developed methodology combines the Legendre transform with the T-matrix method. The resonant frequencies are computed by using Galerkinpsilas techniques. Novel multi-layered spherical microstrips are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EFFICIENT EMC/EMI ANALYSIS OF METAMATERIAL-CLOAKED PLANAR MICROSTRIPS",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Costas-Valagiannopoulos/publication/286084228_Efficient_EMCEMI_Analysis_of_Metamaterial-Cloaked_Planar_Microstrips/links/5665e76b08ae192bbf927522/Efficient-EMC-EMI-Analysis-of-Metamaterial-Cloaked-Planar-Microstrips.pdf",
            "Abstract": "The electromagnetic interactions of planar microstrips with their environment are examined in this paper, and a metamaterial-based cloaking process is proposed to diminish the induced current on the strip and the resulting scattered far-field. The featured mathematical analysis employs the Green’s function for the strip-free structure, the radiation integral method, the decomposition of the perfectly electric conductor strip into cylindrical wires, and Pocklington’s equations for the treatment of thin wires. Regarding the electromagnetic compatibility/electromagnetic interference (EMC/EMI) shielding and cloaking of the microstrip, a metamaterial slab is placed atop the microstrip. The selection of the slab parameters is conducted through a three-stage optimisation process, while its overall impact upon the cloaking of the microstrip is investigated over a wide range of noise-excitation frequencies and incidence angles. Finally, the proposed technique is verified through the numerical outcomes of a commercial computational package.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anomalous reflection of visible light by all-dielectric gradient metasurfaces",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-34-7-D1",
            "Abstract": "Plane wave scattering by a planar metasurface composed of two periodically alternating rectangular dielectric rods is considered. A rigorous integral equation methodology is employed for the analysis and the accurate determination of the reflected and transmitted fields. Systematic optimizations with respect to the configuration’s parameters are performed, which reveal that it is possible to obtain significantly enhanced anomalous reflection (with simultaneously suppressed ordinary reflection predicted by Snell’s law) with power varying from 92% to almost 100% of the input one, depending on the color of the incident light. It is shown that these reflection properties are supported by metasurfaces easily realizable with specific low-loss dielectric materials. In this way, several all-dielectric optimal designs are reported that can be used in numerous applications demanding anomalous reflection in the visible range.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:D03iK_w7-QYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A Double-Layer Metamaterial-Based Technique for Interference Mitigation and Shielding of Planar Microwave Structures",
            "Publication year": 2016,
            "Publication url": "https://nur.nu.edu.kz/handle/123456789/1682",
            "Abstract": "An efficient cloaking-shielding technique based on the use of a double superstrate-layer overlay is developed in this paper for planar microstrips. The metamaterial-inspired formulation reduces considerably the induced on the strip current and the reflected from the microstrip electric field, thus alleviating the electromagnetic susceptibility of microstrip transmission lines. For this purpose, the mathematical analysis and optimization procedure are founded on a semianalytic integral equation algorithm, while a set of numerical results certifies its promising merits",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Theory of perturbation of electrostatic field by an anisotropic dielectric sphere",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2108.06528",
            "Abstract": "The boundary-value problem for the perturbation of an electric potential by a homogeneous anisotropic dielectric sphere in vacuum was formulated. The total potential in the exterior region was expanded in series of radial polynomials and tesseral harmonics, as is standard for the Laplace equation. A bijective transformation of space was carried out to formulate a series representation of the potential in the interior region. Boundary conditions on the spherical surface were enforced to derive a transition matrix that relates the expansion coefficients of the perturbation potential in the exterior region to those of the source potential. Far from the sphere, the perturbation potential decays as the inverse of the distance squared from the center of the sphere, as confirmed numerically.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering by an all-dielectric metasurface including a periodic arrangement of arbitrary scatterers",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8958400/",
            "Abstract": "An all-dielectric metasurface containing a periodic arrangement of dielectric scatterers is considered. The problem of plane-wave scattering by this metasurface is analyzed by developing and employing a rigorous entire-domain integral-equation methodology. This methodology is fast and accurate and can aid relevant optimizations of the associated parameters. Numerical results are reported for the variations of the reflection and transmission coefficients.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ELECTROMAGNETIC ANALYSIS OF A TWO DIMENSIONAL DIFFRACTION GRATING REFLECTOR",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0044",
            "Abstract": "The diffraction phenomena taking place in a reflector with grooved grating are analyzed by using integral equation techniques. The grating geometry is assumed to be two dimensional, consisting of an external surface of circular shape. The electric current flowing on the surface of the diffraction grating reflector is the unknown quantity and the free space Green's function for the two dimensional electromagnetic fields is utilized to develop an integral equation formulation. This integral equation is solved by using a method of moments Galerkin technique. The current distributions on the facets of the diffraction grating are described, by using linear functions fulfilling the edge conditions involved. Numerical computations have been carried out to quantify the diffraction phenomena and the associated dispersion characteristics are investigated. All the integrations involved are carried out analytically, thus reducing the …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Field enhancement in a grounded dielectric slab by using a single superstrate layer",
            "Publication year": 2012,
            "Publication url": "https://www.hindawi.com/journals/aoe/2012/439147/",
            "Abstract": "The addition of a dielectric layer on a slab configuration is frequently utilized in various electromagnetic devices in order to give them certain desired operational characteristics. In this work, we consider a grounded dielectric film-slab, which is externally excited by a normally-incident Gaussian beam. On top of the film-slab, we use an additional suitably selected single isotropic superstrate layer in order to increase the field concentration inside the slab and hence achieve optimal power transfer from the external source to the internal region. We define a quantity of interest, called “enhancement factor,” expressing the increase of the field concentration in the film-slab when the superstrate is present compared to the case that it is absent. It is shown that large enhancement factor values may be achieved by choosing properly the permittivity, the permeability, and the thickness of the superstrate. In particular, it is demonstrated that the field in the film-slab is significantly enhanced when the slab is composed by an ϵ-near-zero (ENZ) or low-index metamaterial.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:isC4tDSrTZIC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Nonlinear wave propagation in negative index metamaterials",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6047334/",
            "Abstract": "Wave propagation in nonlinear negative index metamaterials is investigated by directly implementing the reductive perturbation method to Faraday's and Ampére's laws. In this way, we derive a second-order and a third-order nonlinear Schrödinger equation, describing solitons of moderate and ultra-short pulse widths, respectively. We find necessary conditions and derive exact bright and dark soliton solutions of these equations for the electric and magnetic field envelopes. Directions of future work towards the modelling of wave propagation in more complicated types of nonlinear negative index metamaterials (e.g., chiral metamaterials) are pointed out.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient analysis of scattering by strip gratings",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7588512/",
            "Abstract": "Plane wave scattering by a perfectly conducting strip grating is considered. A methodology for the computation of the induced currents is proposed, which utilizes the knowledge of the current induced in the center region of a truncated finite grating with only a moderate number of strips.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "424 Contributed Sessions",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/337499048_Acoustic_excitation_of_a_layered_scatterer_by_N_internal_point_sources/links/5ddc382ca6fdccdb4465523a/Acoustic-excitation-of-a-layered-scatterer-by-N-internal-point-sources.pdf",
            "Abstract": "Excitation of a layered obstacle by N acoustic internal point sources is considered. Scattering relations are derived. These involve the fields in a specific layer of the scatterer due to a source or a group of sources in any other layer. Potential applications of such problems are pointed out.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling of ultrashort pulse propagation in lossy nonlinear metamaterials",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.3987",
            "Abstract": "Wave propagation in lossy nonlinear metamaterials is analytically investigated by means of perturbation methods. In the left‐handed band of the nonlinear metamaterial, a higher‐order nonlinear Schrödinger equation is obtained, while in the frequency band gap, a dissipative short‐pulse equation is derived. In both cases, dissipation is described by linear terms, which lead to an exponential decay of the solutions. The decay rates, that is, the inverses of the linear loss coefficients in these two models, are found in terms of the dielectric and magnetic properties of the metamaterial. Copyright © 2016 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wide-angle absorption of visible light from simple bilayers",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ao-56-35-9779",
            "Abstract": "Color-selective absorption of light is a very significant operation used in numerous applications, from photonic sensing and switching to optical signal modulation and energy harnessing. We demonstrate angle-insensitive and polarization-independent absorption by thin bilayers comprising ordinary bulk media: dielectrics, semiconductors, and metals. Several highly efficient designs for each color of the visible spectrum are reported, and their internal fields’ distributions reveal the resonance mechanism of absorption. The proposed bilayer components are realizable, since various physical or chemical deposition methods can be used for their effective fabrication. The absorption process is found to exhibit endurance with respect to the longitudinal dimension of the planar structure, which means that the same designs could be successfully utilized in non-planar configurations composed of arbitrary shapes.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "The Generalized Multipole Technique for Light Scattering",
            "Publication year": 2018,
            "Publication url": "http://ikee.lib.auth.gr/record/305231",
            "Abstract": "A very simple scattering problem is considered, together with its solution obtained via the Method of Auxiliary Sources (MAS). We show that it is possible to concurrently have divergence of the auxiliary currents together with convergence of the scattered field generated by these divergent currents. The divergence manifests itself as rapid, unphysical oscillations in the auxiliary currents. It is stressed that the oscillations are not due to effects such as roundoff, matrix ill-conditioning, or to the well-studied phenomenon of internal resonances. We arrive at our conclusions using a number of means including asymptotic methods and a thorough discussion of the singularities of the analytic continuation of the scattered field. We also make a detailed comparison to corresponding discretizations of the Extended Integral Equation (EIE), in which similar phenomena do not occur. Analogies to superdirectivity and extensions to …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "INTEGRAL EQUATION MODELLING OF ELECTROMAGNETIC WAVE PROPAGATION AND SCATTERING BY PERIODIC GRATING WAVEGUIDES",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0010",
            "Abstract": "The propagation and scattering of electromagnetic waves by periodic grating waveguides are modelled by a rigorous integral equation method, which combines semianalytical techniques and the Method of Moments with entire domain expansion functions. The electric field integral equation is employed with unknown function the electric field on the grating region and is subsequently solved by applying an entire domain Galerkin's technique. The Green's function is analytically expressed and all the involved computations are analytically carried out. The proposed analysis provides high numerical stability and controllable accuracy. The computed results exhibit superior accuracy and numerical efficiency compared with those already derived by applying different methods. The effect of the grating's characteristics on the propagation and scattering phenomena is analyzed. The numerical results obtained provide …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integral equation analysis of a low-profile receiving planar microstrip antenna with a cloaking superstrate",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7776428/",
            "Abstract": "Eliminating the electromagnetic interaction of a device with its background is a topic which attracts considerable attention both from a theoretical as well as from an experimental point of view. In this work, we analyze an infinite two-dimensional planar microstrip antenna, excited by an incident plane wave, and propose its potential operation as a low-profile receiving antenna, by suitably adjusting the parameters of its cloaking superstrate. We impose a semi-analytic integral equation method to determine the scattering characteristics of the microstrip antenna. The method utilizes the explicit expressions of the Green's function of the strip-free microstrip and yields the surface strip's current as the solution of a suitable linear system. Subsequently, the antenna's far-field response is obtained. Numerical results are presented for the achieved low profile of the receiving antenna, by choosing suitably the cloaking superstrate …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:YsMSGLbcyi4C",
            "Publisher": "AGU"
        },
        {
            "Title": "New numerical techniques for efficient and accurate analysis of FSSs, EBGs and Metamaterials",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6206506/",
            "Abstract": "In this paper we present two numerically efficient and accurate techniques for the analysis of doubly-infinite periodic arrays, which find applications as Frequency Selective Surfaces (FSSs), Electronic Bandgap (EBGs) structures and Metamaterials (MTMs). The first method, suited for the analysis of periodic elements with fine features, processes the results of a truncated array, typically comprising of only four to six rings, to derive the response characteristics of its doubly-periodic infinite counterpart. The reduction of the matrix size to only two or three, combined with the use of Reciprocity Principle to compute the reflection and transmission coefficients of the array, leads to a considerable CPU time and memory saving. The second technique, which is formulated to address the analysis of arbitrary 3D periodic elements, utilizes a generalized version of the waveguide simulator (WGS) approach, which, in contrast to the …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convergence Analysis of the Currents and Fields Involved in the Method of Auxiliary Sources Applied to Scattering by PEC Cylinders",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9375497/",
            "Abstract": "The method of auxiliary sources (MAS) is an established technique for the numerical solution of electromagnetic shielding and scattering problems exhibiting an increasing interest for the simulation of various electromagnetic compatibility (EMC) applications. In previous works, it was shown that for the problem of transverse magnetic illumination of a perfect electric conducting cylinder by an electric current filament, it is possible for large numbers    of auxiliary sources that the MAS currents diverge and oscillate, while the generated MAS field converges to the exact solution. In this article, we further analyze the convergence issues and oscillations encountered in the MAS by considering the transverse electric case due to excitation by a magnetic current filament. We demonstrate analytically that the convergence/divergence phenomena of the currents and fields also occur in this problem and then study the nature of …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the nature of oscillations in discretizations of the extended integral equation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5704555/",
            "Abstract": "Using analytical methods, previous studies have shown that it is possible for oscillations to occur in the auxiliary surface current determined by applying the method of auxiliary sources (MAS) to problems of scattering by perfect conductors of a very simple shape. Such oscillations are inherent to MAS and would occur even in a hypothetical computer with ideal hardware and software. Because the integral equation relevant to MAS very much resembles the “extended integral equation” (in which the unknown is the actual surface current on the conductor), one might surmise that similar oscillations also occur in discretizations of the latter equation. In this communication, we use analytical means to show that this is not the case. Therefore, any oscillations that do occur in discretizations of the extended integral equation are-at least for “sufficiently simple” problems-likely to be due to matrix ill-conditioning, which magnifies …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Amplifying the response of a buried object by depositing a passive layer on the ground",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7237424/",
            "Abstract": "A circular cylindrical perfectly electric conducting inclusion is buried at a certain distance from the surface of the ground. We determine suitable parameters of a thin passive superstrate layer placed atop the ground such that the detectability of the circular inclusion is increased when the configuration is illuminated by a line source. Preliminary numerical results exhibiting the effectiveness of the approach are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of Truncated Gratings and a Novel Technique for Extrapolating their Characteristics to those of Infinite Gratings.",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/318947694_Analysis_of_truncated_gratings_and_a_novel_technique_for_extrapolating_their_characteristics_to_those_of_infinite_gratings/links/599b45950f7e9b892bad18ac/Analysis-of-truncated-gratings-and-a-novel-technique-for-extrapolating-their-characteristics-to-those-of-infinite-gratings.pdf",
            "Abstract": "Periodic gratings, such as Frequency Selective Surfaces (FSSs) and EBG (electromagnetic band gap) structures, are used in a wide variety of electromagnetic applications and are typically analyzed under the assumption that they are infinite periodic. Since the real-word structures are necessarily finite, and are derived by truncating the corresponding infinite structures, it is of interest to determine how large the finite structure needs to be so that it mimics its infinite counterpart. A related question is how to extrapolate the simulation results of a finite structure to predict the performance of the corresponding infinite structure in a computationally efficient manner. The objectives of this work are to address both of these questions and to present a novel computational technique which hybridizes analytical and numerical techniques to provide the answers. We illustrate the application of the proposed technique by considering the test case of plane wave scattering by a strip grating and investigate the asymptotic behavior of the solution for the current on a truncated periodic grating as we increase its size. The proportionality constant, relating the current distribution on the unit cell of the infinite grating to the corresponding distribution in the truncated grating, is computed, and its asymptotic value is accurately predicted by using an extrapolation algorithm presented in the paper. The required number of strips is estimated such that the current on the finite structure is sufficiently close to that on the infinite one. The results obtained for the current are found to be in excellent agreement with those derived from full-wave simulations.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Spherical Wavec Scattering by an Electrically Small Layered Sphere and a Related Inverse Problem",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1689727/",
            "Abstract": "A spherical electromagnetic wave is scattered by a layered sphere with a perfect electric conducting core. Low frequency results are obtained by approximating the known exact expressions of the scattering cross section. The inverse problem of determining the sphere's center and the layers radii and materials is treated from the knowledge of the leading order term of the scattering cross section's low-frequency expansion",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Linearization of the T-matrix solution for quasi-homogeneous scatterers",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-26-4-870",
            "Abstract": "Interesting applications arising in optical and chemical engineering, environmental science, and biology motivate the investigation of electromagnetic wave scattering problems by radially inhomogeneous obstacles. Our main purpose is the investigation of plane-wave scattering by quasi-homogeneous obstacles, that is, obstacles with wavenumbers not exhibiting large variations from a specific average value k¯. The analysis is presented separately for a slab (1D), a cylindrical (2D), and a spherical (3D) scatterer. First, we consider a step approximation of the wavenumber and express the field coefficients by applying a T-matrix method for the corresponding piecewise homogeneous scatterer. Then, by performing an appropriate Taylor expansion, we express the field coefficients as linear combinations of the distances of the wavenumber samples from k¯. The combinations' weights are called layer-factors, because …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Particle Swarm Optimization Algorithms with Applications to Wave Scattering Problems",
            "Publication year": 2021,
            "Publication url": "https://www.intechopen.com/online-first/particle-swarm-optimization-algorithms-with-applications-to-wave-scattering-problems",
            "Abstract": "Particle Swarm Optimization (PSO) algorithms are widely used in a plethora of optimization problems. In this chapter, we focus on applications of PSO algorithms to optimization problems arising in the theory of wave scattering by inhomogeneous media. More precisely, we consider scattering problems concerning the excitation of a layered spherical medium by an external dipole. The goal is to optimize the physical and geometrical parameters of the medium’s internal composition for varying numbers of layers (spherical shells) so that the core of the medium is substantially cloaked. For the solution of the associated optimization problem, PSO algorithms have been specifically applied to effectively search for optimal solutions corresponding to realizable parameters values. We performed rounds of simulations for the the basic version of the original PSO algorithm, as well as a newer variant of the Accelerated PSO (known as “Chaos Enhanced APSO”/“Chaotic APSO”). Feasible solutions were found leading to significantly reduced values of the employed objective function, which is the normalized total scattering cross section of the layered medium. Remarks regarding the differences and particularities among the different PSO algorithms as well as the fine-tuning of their parameters are also pointed out.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "Acoustic excitation of a layered scatterer by N internal point sources",
            "Publication year": 2019,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cloaking Analysis by Accelerated-Particle-Swarm-Optimization Techniques",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9560533/",
            "Abstract": "Cloaking behavior of spherically-layered media is analyzed by means of a chaotic accelerated particle-swarm-optimization (chaotic APSO) algorithm. The optimization problem concerns the determination of the radii, the permittivities, and the permeabilities of a small number of magneto-dielectric layers covering a PEC core. The results of some preliminary numerical experiments are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spurious oscillations in a combined Method-of-Auxiliary-Sources/Extended-Integral-Equation solution to a simple scattering problem",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022407313000125",
            "Abstract": "Recent studies of the Method of Auxiliary Sources (MAS) solutions to a simple scattering problem have shown that it is possible to have convergence of the field, which is the finally desired quantity, together with divergence of the MAS currents, which are intermediate quantities. Another recent study has demonstrated that no similar phenomenon occurs when the computational method is a certain discretization of the Extended Integral Equation (EIE); this integral equation is due to Peter C. Waterman. The purpose of the present paper is to extend these findings to a combined MAS/EIE method that can be viewed as one possible 2-D implementation of what is usually called the Null-Field Method with Discrete Sources (NFMDS). We find that, despite the convergence of the field, divergence of currents—manifesting itself as spurious oscillations—can occur within this combined method under certain conditions. We point …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Analytical Algorithms for the Inverse Source Problem in a Sphere",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/337499068_Analytical_Algorithms_for_the_Inverse_Source_Problem_in_a_Sphere/links/5ddc3cf092851c1fedb1cf77/Analytical-Algorithms-for-the-Inverse-Source-Problem-in-a-Sphere.pdf",
            "Abstract": "A homogeneous sphere is excited by a point source lying inside the sphere. Analytical inversion algorithms are established concerning the determination of the physical characteristics of the sphere as well as the location and strength of the source. The basic quantity utilized in these algorithms is the total field on the sphere which is assumed to be known. The investigation of the above described problem is motivated by various applications in medical imaging.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On convergence and inherent oscillations within computational methods employing fictitious sources",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0898122115000565",
            "Abstract": "Recent studies of the method of auxiliary sources (MAS) and the method of fundamental solutions (MFS) have shown that it is possible to have convergence of the field, which is the finally desired quantity, together with divergence of the fictitious sources, which are intermediate quantities. The aforementioned studies concern a simple scattering problem, where the scattered field satisfies the Helmholtz equation and the fictitious sources are placed symmetrically. In the present paper, we extend the previous results in two directions, one having to do with the geometry and the other with frequency. More precisely, we first show that the above convergence/divergence phenomena can also occur when the fictitious sources are placed asymmetrically and then study the nature of this divergence in detail. Second, we show that all findings carry over to the case of Laplace’s equation. We, additionally, point out certain …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:GnPB-g6toBAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Consistent Integral Equation Modeling of Cloaking Planar Microstrip Antennas",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7222441/",
            "Abstract": "In this paper, an efficient integral equation method is developed for the response and scattering characteristics of cloaked 2-D planar microstrip receiving antennas. The featured technique combines Green's function for the strip-free structure with the decomposition of the strip into cylindrical thin wires and a radiation integral evaluation for the scattered field. In essence, the desired low-profile operation of the antenna is achieved by overlaying a superstrate slab atop the antenna. Moreover, an optimization process determines the constitutive parameters and thickness of the slab, so that a significantly reduced scattering behavior is obtained. Finally, the performance of the receiving antenna is investigated for a specific range of frequencies around the operating one, while the accuracy of the proposed algorithm is successfully verified through several numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convergence and oscillations in method-of-auxiliary-sources analyses of dielectric scattering problems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5651472/",
            "Abstract": "It has been recently shown that in the case of scattering by a perfect electric conductor, it is possible to have a convergent Method of Auxiliary Sources (MAS) field due to divergent MAS currents. These conclusions are extended in the present paper for the case of the implementation of MAS to dielectric scattering problems. The main differences are pointed out, which regard the existence of two critical surfaces, each one related with the interior or the exterior auxiliary surface.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rigorous integral equation analysis of nonsymmetric coupled grating slab waveguides",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-23-11-2888",
            "Abstract": "A rigorous integral equation formulation in conjunction with Green's function theory is used to analyze the waveguiding and coupling phenomena in nonsymmetric (composed of dissimilar slabs) optical couplers with gratings etched on both slabs. The resulting integral equation is solved by applying an entire-domain Galerkin technique based on a Fourier series expansion of the unknown electric field on the grating regions. The proposed analysis actually constitutes a special type of the method of moments and provides high numerical stability and controllable accuracy. The singular points of the system's matrix accurately determine the complex propagation constants of the guided waves. The results obtained improve on those derived by coupled-mode methods in the cases of large grating perturbations and highly dissimilar slabs. Numerical results referring to the evolution of the propagation constants as a …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "EPJ Applied Metamaterials",
            "Publication year": 0,
            "Publication url": "https://epjam.epj.org/articles/epjam/abs/2017/01/contents/contents.html?mb=0",
            "Abstract": "EPJ Applied Metamaterials News Archives Scientific advisory committee About Open Access \nEPJ a b d e ap st h plus c ds pv ti qt am n woc rnc EPJ AM - Applied Metamaterials Applied \nMetamaterials 10 most recent Browse issues Reviews Free Access to the whole issue EPJ \nApplied Metamaterials Volume 4 (2017) Export the citation of the selected articles Export Select \nall Artificial materials for advanced applications in electromagnetics and mechanics Open \nAccess Editorial Editorial of the Special Issue: “Artificial materials for advanced applications in \nelectromagnetics and mechanics” E1 Christos Argyropoulos and Alessio Monti Published online: \n24 May 2017 DOI: 10.1051/epjam/2017005 Abstract PDF (274.8 KB) Open Access Research \nArticle Tunable plasmonic metasurface for perfect absorption 6 Paloma Arroyo Huidobro, \nStefan A. Maier and John B. Pendry Published online: 17 February 2017 DOI: 10.1051//() -…",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimization of the method of auxiliary sources (MAS) for oblique incidence scattering by an infinite dielectric cylinder",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s00202-006-0019-1",
            "Abstract": "The analytic inversion of the Method of Auxiliary Sources (MAS) matrix plays an important role in the rigorous investigation of the accuracy of the method. In this paper we investigate the accuracy of MAS when the method is applied to plane wave scattering under oblique incidence by an infinite, dielectric circular cylinder. For this scattering configuration, we prove that the MAS matrix is analytically invertible and hence obtain a concrete expression for the discretization error. A basic contribution of this paper lies in the analytic determination of the auxiliary sources’ locations, for which the corresponding system’s matrix becomes singular. Furthermore, we calculate the computational error resulting from numerical matrix inversion, and compare it to the analytical error. The dependence of both types of errors on the angle of incidence and on the dielectric permittivity is investigated. Finally, error minimization …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "On the interior acoustic and electromagnetic excitation of a layered scatterer with a resistive or conductive core",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=5585667092166487799&hl=en&oi=scholarr",
            "Abstract": "Concrete interesting scientific and technological applications suggest the investigation of the scattering problems, concerning the spherical wave excitation of a layered scatterer by a point-source located in its interior. In this paper we investigate scattering theorems for the acoustic and electromagnetic excitation of a layered scatterer by an interior point-source. On the scatterer’s core the resistive-or conductive-transmission boundary conditions are imposed. Such boundary conditions arise mainly in scattering problems by thin, shell like structures, modelling lightweight materials. Acoustic and electromagnetic general scattering, optical and mixed scattering theorems for the total, primary and secondary fields are derived.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ANALYTIC INVERSION OF MATRICES WITH 2k × 2k CIRCULANT BLOCKS",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812773197_0025",
            "Abstract": "In this paper, we develop a recursive method (-steps process) for the analytic inversion of matrices with 2k × 2k circulant blocks. Matrices of this type appear in several applications of Computational Electromagnetics, using Matrix Theory. The method is based on the diagonalization of each block by means of the known explicit expressions for the eigenvalues and corresponding eigenvectors of circulant matrices. Numerical results exhibit that this method is more efficient in terms of CPU time than the adjoint matrix method.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electromagnetic excitation of a spherical medium by an arbitrary dipole and related inverse problems",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/sapm.12206",
            "Abstract": "A piecewise homogeneous spherical medium is excited by an external or internal electric dipole with arbitrary location and polarization. The dyadic Green's function of the medium is determined analytically. Then, the vector electric fields and far‐field patterns are obtained. Low‐frequency approximations of the far‐field patterns are subsequently derived, which encode the dipole's locations coordinates and polarization components in the different orders of the associated expansions. This fact enables the establishment of far‐field inverse scattering algorithms referring to the electromagnetic interior or exterior excitation of a small sphere by an arbitrary dipole. Inverse medium and inverse source problems are considered concerning, respectively, the determination of the scatterer's material parameters and the dipole's characteristics. The developed inverse algorithms determine exactly the unknown parameters of …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feasible Optimal Solutions of Electromagnetic Cloaking Problems by Chaotic Accelerated Particle Swarm Optimization",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2227-7390/9/21/2725",
            "Abstract": "The optimization problem of cloaking a perfectly electric conducting or dielectric spherical core is investigated. The primary excitation is due to an external magnetic dipole. The chaotic accelerated particle swarm optimization (CAPSO) algorithm is adjusted and applied to this optimization problem. The optimization variables are the radii, the permittivities and the permeabilities of a small number of spherical shells covering the core. Several feasible optimal designs are obtained, which exhibit perfect or almost perfect cloaking performance for all angles of observation. These optimal designs correspond to two, three or four spherical coating layers composed of ordinary materials. Detailed parametric investigations of the cloaking mechanism with respect to the type and radius of the core and the location of the primary dipole are carried out. The presented optimization procedure and the reported results are expected to be useful in applications like scattering and characterization of optical particles as well as in designing low-profile receiving antennas.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Low-frequency inverse-source algorithms for spherical media",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8100548/",
            "Abstract": "A homogeneous ball is excited by an internal source. We investigate acoustic and electromagnetic inverse-source problems in the low-frequency region. In acoustics, we determine the strength and location of an internal point source, while in electromagnetics, the location and polarization of an internal point dipole. The developed algorithms are simple and analytic and are based on suitable far-field measurements in distinct observation directions.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Second‐kind Fredholm integral‐equation analysis of scattering by layered dielectric gratings",
            "Publication year": 2021,
            "Publication url": "http://ikee.lib.auth.gr/record/330831/files/17058498.pdf",
            "Abstract": "Scattering of the E‐polarised plane electromagnetic wave from two different but of the same‐period all‐dielectric rectangular bar gratings on substrates is analysed using a volume‐integral‐equation (VIE) method. Here, VIE is a Fredholm integral equation of the second kind with unknown function being the electric field in the gratings regions. Discretisation of the VIE is performed by applying an entire‐domain Galerkin technique. The developed algorithm possesses guaranteed convergence, provides accuracy, and is easily controlled by the order of discretisation. Numerical results for frequency‐selective reflection, manipulation of light to propagate in prescribed directions, and the ultrahigh‐Q lattice‐modes resonances are presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering Relations for Interior Acoustic Excitation of a Layered Obstacle with a Soft Or Hard Core",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4105780/",
            "Abstract": "A layered scatterer with a soft or hard core is excited by a time harmonic spherical acoustic wave, generated by a point source located in the interior of the scatterer. Reciprocity and general scattering relations are established, relating the total, primary and secondary fields with the corresponding far field patterns. Moreover, we formulate the optical theorem, relating the scattering cross section with the field in the layer of the source",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direct and inverse dipole electromagnetic scattering by a piecewise homogeneous sphere",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/zamm.200900272",
            "Abstract": "This paper deals with the investigation of the direct and the inverse electromagnetic scattering problem by a piecewise homogeneous sphere, excited by an interior or exterior dipole. The research is motivated by important physical, biomedical, and technological applications detailed in the introduction. First, we utilize Sommerfeld's and T‐matrix method to determine the exact electromagnetic Green's function, that is the solution of the direct scattering problem. Then, we use the low‐frequency assumption to derive asymptotic far‐field expansions of the Green's function of an electrically small piecewise homogeneous sphere. These low‐frequency expansions contribute essentially to the development of far‐field inverse scattering algorithms for the determination of the sphere's geometrical and physical characteristics. It is shown that for these algorithms interior dipoles offer additional information, which may be …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "ACCURACY ANALYSIS AND OPTIMIZATION OF THE METHOD OF AUXILIARY SOURCES (MAS) FOR OBLIQUE INCIDENCE SCATTERING BY A PERFECTLY CONDUCTING, INFINITE CIRCULAR CYLINDER",
            "Publication year": 0,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/346061429_ACCURACY_ANALYSIS_AND_OPTIMIZATION_OF_THE_METHOD_OF_AUXILIARY_SOURCES_MAS_FOR_OBLIQUE_INCIDENCE_SCATTERING_BY_A_PERFECTLY_CONDUCTING_INFINITE_CIRCULAR_CYLINDER/links/5fb98991a6fdcc6cc659ba8a/ACCURACY-ANALYSIS-AND-OPTIMIZATION-OF-THE-METHOD-OF-AUXILIARY-SOURCES-MAS-FOR-OBLIQUE-INCIDENCE-SCATTERING-BY-A-PERFECTLY-CONDUCTING-INFINITE-CIRCULAR-CYLINDER.pdf",
            "Abstract": "This paper is presenting a rigorous accuracy analysis of the Method of Auxiliary Sources (MAS) for the problem of oblique incidence, transverse magnetic (TMZ) plane wave scattering by a perfectly conducting, infinite circular cylinder. The MAS matrix is inverted analytically, via eigenvalue analysis, yielding exact expressions for the discretization error. It is demonstrated that the error increases very abruptly for source locations associated with the characteristic eigenvalues of the scattering problem. The optimal location of the auxiliary sources is determined on the grounds of error minimization.Introduction.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Particle Swarm Optimization of Layered Media Cloaking Performance",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/350277389_Particle_Swarm_Optimization_of_Layered_Media_Cloaking_Performance/links/60586548a6fdccbfeaf8aead/Particle-Swarm-Optimization-of-Layered-Media-Cloaking-Performance.pdf",
            "Abstract": "Scattering problems are considered for the excitation of a layered spherical medium by an external dipole. The purpose of this work is to determine suitable parameters of the dielectric layers covering a perfectly conducting core so that the scattered far field is significantly reduced for a wide range of observation angles. A particle swarm optimization algorithm is developed and applied to the associated optimization problem. Numerical results exhibiting reduced values of the scattering cross section for realizable coating parameters are presented. The effect of the dipole’s location on the cloaking performance is analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:t6usbXjVLHcC",
            "Publisher": "URSI"
        },
        {
            "Title": "Analytical Algorithms for Locating Line Sources",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9560364/",
            "Abstract": "Analytical algorithms are investigated for finding the characteristic parameters of a line source radiating inside a homogeneous cylindrical medium. Under certain conditions, the permittivity and permeability of the medium can also be determined. Preliminary results for the effect of boundary data with noise are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient modeling of radiation and scattering for a large array of loops",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5371944/",
            "Abstract": "A computationally efficient technique, based on the method of moments (MoM) formulation, is invoked in the characterization of radiation and scattering properties of an array of coaxial, circular, non-identical loops. A set of Pocklington-type integral equations for the loop currents is formulated and subsequently discretized by a standard procedure. Thanks to a suitable choice of the basis functions, the resulting matrix corresponding to the pertinent linear system is forced to consist of circulant blocks. This type of system is solvable by an innovative recursive algorithm, featuring several important advantages, such as lower memory and execution time consumption, over standard, purely numerical inversion. The overall procedure is simpler in implementation than already existing methods, based on Fourier analysis. The procedure invokes almost exclusively elementary functions, and is applicable to large arrays with …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Near-Field Inverse Dipole Problems in Spherical Media",
            "Publication year": 2019,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of electromagnetic wave propagation in frequency bands of nonlinear metamaterials",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Tsitsas/publication/286110393_Analysis_of_Electromagnetic_Wave_Propagation_in_Frequency_Bands_of_Nonlinear_Metamaterials/links/569d1d3b08ae03384dd0494a/Analysis-of-Electromagnetic-Wave-Propagation-in-Frequency-Bands-of-Nonlinear-Metamaterials.pdf",
            "Abstract": "Electromagnetic wave propagation phenomena in nonlinear metamaterials are investigated for waves propagating either in the left-handed frequency band or in the frequency band gaps. In the left-handed band, we implement directly the reductive perturbation method to Faraday’s and Ampére’s laws and derive a second-and a thirdorder nonlinear Schrödinger (NLS) equation, describing solitons of moderate and ultra-short pulse widths, respectively. Then, we find necessary conditions and derive exact bright and dark soliton solutions of these equations. On the other hand, in the frequency band gaps with negative linear effective permittivity and positive permeability (where linear electromagnetic waves are evanescent), we derive two short-pulse equations (SPEs) for the high-and low-frequency band gaps. The structure of the SPEs solutions is discussed, and connections with the NLS soliton solutions are presented. Numerical simulations of the SPEs solutions are included and compared with those of the reduced wave equations. Directions towards the modelling of wave propagation in nonlinear chiral metamaterials are pointed out.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Differences between extended-integral-equation and method-of-auxiliary-sources solutions of a simple scattering problem",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5637379/",
            "Abstract": "The auxiliary surface current, determined by applying the Method of Auxiliary Sources (MAS) to scattering problems by perfect conductors, may exhibit a certain form of oscillations, which are inherent to MAS and are independent of the word-length and the numerical-integration routines. The purpose of the present work is to demonstrate analytically that the “extended integral equation” (which is similar to the MAS one with the main difference that the unknown is the actual surface current on the scatterer) does not exhibit oscillations of the type described above. Hence, oscillations occurring in the extended integral equation are likely to be due to finite word-length or numerical integration errors.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A recursive algorithm for the inversion of matrices with circulant blocks",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0096300306014275",
            "Abstract": "We investigate the recursive inversion of matrices with circulant blocks. Matrices of this type appear in several applications of Computational Electromagnetics and in the numerical solution of integral equations with the boundary-element method. The inversion is based on the diagonalization of each circulant block by means of the discrete Fourier transform and the application of a recursive algorithm for the inversion of the matrix with diagonal blocks, determined by the eigenvalues of each block. The efficiency of the recursive inversion is exhibited by determining its computational complexity. An implementation of the algorithm in MATLAB is given and numerical results are presented to demonstrate the efficiency in terms of CPU time of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Gap solitons in nonlinear electromagnetic metamaterials",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=14850593974698136999&hl=en&oi=scholarr",
            "Abstract": "Controlling the frequency-dependent effective dielectric permittivity∈ and magnetic permeability μ of metamaterials offers the possibility for several interesting electromagnetic wave phenomena. For instance, in certain types of metamaterials, there exist frequency bands where the medium displays either a right-handed (∈> 0, μ> 0) or a left-handed behavior (∈< 0, μ< 0). Particularly, left-handed metamaterials exhibit negative refraction in the considered frequency band and, hence, feature unique properties, including reversal of Snell’s law, backward wave propagation, reversal of the Doppler shift and Cherenkov effect, perfect lens performance, and others. In addition, frequency band gaps, ie, frequency domains where linear electromagnetic waves are evanescent (for∈ μ< 0), also exist in metamaterials. In nonlinear metamaterials, ie, structures in which∈ and/or μ depend on the field intensities [1], nonlinearity …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Green’s-function method for the analysis of propagation in holey fibers",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOSAA-21-5-847",
            "Abstract": "A Green’s-function method is employed to provide a rigorous analysis to the propagation and coupling phenomena in holey fibers. The analysis is carried out for an arbitrary grid of circular air holes of the fiber guide, while the electromagnetic field is taken to be a vector quantity. Application of the Green’s-function concept leads to a coupled system of equations incorporating as unknowns the field expansion coefficients to cylindrical wave functions within the air holes. The propagation constants of the guided waves are computed accurately by determining the singular points of the corresponding system’s matrix. Field distribution and dispersion properties of guided modes as well as coupling phenomena between parallel-running holey fibers are investigated, and numerical results are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Low-Frequency scattering of a spherical wave due to an arbitrary dipole by a sphere",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8065415/",
            "Abstract": "A homogeneous dielectric sphere is excited by an internal dipole with arbitrary polarization and lying at an arbitrary location. The electric far-field pattern is determined analytically by applying a dyadic Green's function technique. Then, the derived exact far-field results are approximated in the low-frequency regime yielding simplified expressions which are expected to be utilized in inverse scattering problems concerning the determination of the scatterer's and the dipole's parameters.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mode Analysis by the Method of Auxiliary Sources With an Excitation Source",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9419792/",
            "Abstract": "The method of auxiliary sources (MAS) is one of the numerical methods employed for the determination of the cutoff wavenumbers (eigenvalues) of cylindrical waveguides. According to the general scheme of MAS, the eigenvalues are obtained by requiring the square impedance matrix to be singular and therefore its determinant to be zero (or its condition number to be large). For large matrices, such computations are complicated and time-consuming. Additionally, these schemes are frequently contaminated with spurious eigenvalues. To overcome the difficulties, an efficient method based on MAS along with an excitation source has been proposed. The eigenvalues are obtained by measuring the physical response of the waveguide's domain to this source; thus, an interior problem is always solved. This article is a comprehensive presentation of this method and its variants and aims to emphasize fundamental and …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Excitation of a layered medium by 𝑁 sources: Scattering relations, interaction cross sections and physical bounds",
            "Publication year": 2020,
            "Publication url": "https://www.ams.org/journals/qam/2021-79-02/S0033-569X-2020-01581-6/",
            "Abstract": "A layered medium is excited by  external or internal point sources. Boundary-value problems for the generated acoustic waves are formulated. General scattering and optical theorems are established relating the involved fields and far-field patterns due to groups of sources. Interaction scattering cross sections are defined and associated physical bounds are derived. The large- behavior of these cross sections is also investigated. Numerical results are presented demonstrating the variations of the interaction cross sections and their physical bounds.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Αριθμητική Επίλυση Ηλεκτρομαγνητικών Προβλημάτων Συνοριακών Τιμών με τη Μέθοδο των Ροπών (Numerical Solution of Electromagnetic Boundary-Value Problems with the Method of Moments)",
            "Publication year": 2020,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:1qzjygNMrQYC",
            "Publisher": "ΕΑΠ"
        },
        {
            "Title": "Stimulation of a Layered Medium by  External Dipoles",
            "Publication year": 0,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9560485/",
            "Abstract": "A layered spherical medium is excited by a number of external electric dipoles. Boundary-value problems for the involved individual and overall electromagnetic fields are formulated. The direct scattering problem is solved by a T-Matrix method. Explicit formulas for the far-field, the overall cross section and the total interaction cross sections are derived. Some preliminary numerical results on the variations of these cross sections are presented.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient inversion algorithms of block matrices arising in the Method of Auxiliary Sources.",
            "Publication year": 0,
            "Publication url": "https://scholar.google.com/scholar?cluster=10269172276213240854&hl=en&oi=scholarr",
            "Abstract": "The Method of Auxiliary Sources (MAS) is a powerful numerical method for solving elliptic boundary-value problems. The mathematical foundation of MAS was given by Kupradze [1] and its main development by Zaridze [2]. We also note the independent contribution of Leviatan [3] to this method, named Multifilament Current Model. MAS is also referred to as Method of Fundamental Solutions in the terminology of Fairweather and Karageorghis [4]. MAS is applied for the mathematical modelling and investigation of a wide range of scattering and radiation problems, arising in several applications of Computational Electromagnetics. The application of MAS to certain electromagnetic scattering problems (analyzed in [5] and [6]) leads to square block matrices with circulant blocks. The number of the blocks depends on the geometry and the material of the scatterer. For example, in the cases of a circular layered cylinder …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Excitation of guided waves on a lossless dielectric slab by an E-polarized complex source point beam",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8705661/",
            "Abstract": "A lossless slab excited by an E-polarized two-dimensional (2-D) complex source point (CSP) beam is studied analytically. Such a source, unlike a Gaussian beam, satisfies exactly the Helmholtz equation and radiation condition, without paraxial approximation or formulation incompleteness. The guided-waves fields as well as the scattered fields in the regions above and below the slab are determined; in turn, the corresponding powers are directly calculated. Numerical results on the variations of these quantities with respect to the slab electrical thickness, the beam angle of incidence, the source aperture size and location are presented. Substantial power transfer from the finite directive source into each of the slab's guided waves is recorded especially in the case of near-grazing beam illumination. Such a finding may inspire further theoretical and experimental efforts towards numerous research directions like non …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scattering theorems for acoustic excitation of a layered obstacle by an interior point source",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1365-2966.2007.00375.x",
            "Abstract": "Interesting scientific and technological applications motivate the study of scattering problems, where a layered scatterer is excited by a spherical acoustic wave generated by a point‐source located in its interior. The scatterer's core may be acoustically soft, hard, resistive, or penetrable. This paper initiates the investigation of scattering theorems, corresponding to the excitation of a layered scatterer by a point source in its interior. Reciprocity and general scattering theorems are established, relating the total fields and the corresponding far‐field patterns. The optical theorem, relating the scattering cross‐section with the field in the layer containing the source, is recovered as a corollary of the general scattering theorem. Furthermore, for a scatterer excited by a spherical and a plane wave, mixed scattering theorems are derived. Numerical implementations of the optical theorem in concrete scattering applications are …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Blackwell Publishing Inc"
        },
        {
            "Title": "Electromagnetic wave scattering by quasi-homogeneous obstacles",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814322034_0018",
            "Abstract": "In this work we investigate the electromagnetic wave scattering phenomena by quasi-homogeneous obstacles, namely obstacles with wavenumber functions not exhibiting large variations from an average value . First, we express the field coefficients by means of a T-matrix method for the corresponding piecewise-homogeneous scatterer and then perform the best linear approximation by differentials to express these coefficients as linear combinations of the distances of the wavenumber samples from . Moreover, the total far-field pattern of the quasi-homogeneous scatterer is decomposed into that of the respective homogeneous scatterer with wavenumber  plus the perturbation far-field pattern, depending exclusively on the wavenumber's deviations from . Numerical results are presented concerning (i) the far-field patterns, computed by the proposed technique and the T-matrix method, (ii) the variations of the …",
            "Abstract entirety": 0,
            "Author pub id": "E2Jk3JQAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Excitation of a Layered Sphere by Multiple Point-generated Primary Fields",
            "Publication year": 2020,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ultrashort pulses and short-pulse equations in 2+ 1 dimensions",
            "Publication year": 2012,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.86.023841",
            "Abstract": "In this paper, we derive and study two versions of the short pulse equation (SPE) in (2+ 1) dimensions. Using Maxwell's equations as a starting point, and suitable Kramers-Kronig formulas for the permittivity and permeability of the medium, which are relevant, eg, to left-handed metamaterials and dielectric slab wave guides, we employ a multiple scales technique to obtain the relevant models. General properties of the resulting (2+ 1)-dimensional SPEs, including fundamental conservation laws, as well as the Lagrangian and Hamiltonian structure and numerical simulations for one-and two-dimensional initial data, are presented. Ultrashort one-dimensional breathers appear to be fairly robust, while rather general two-dimensional localized initial conditions are transformed into quasi-one-dimensional dispersing wave forms.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:8k81kl-MbHgC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "On methods employing auxiliary sources for non-circular scattering problems",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7991879/",
            "Abstract": "When methods employing auxiliary sources are applied to problems involving scatterers that are circular, it has been shown that convergent and correct fields are obtained by divergent and oscillatory amplitudes (currents) of the sources. In this work, we present some preliminary numerical results, which show that the above conclusions remain valid for non-circular scattering cases.",
            "Abstract entirety": 1,
            "Author pub id": "E2Jk3JQAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        }
    ]
}]