[{
    "name": "Νικόλαος Κονοφάος",
    "romanize name": "Nikolaos Konofaos",
    "School-Department": "Πληροφορικής",
    "University": "ΑΠΘ",
    "Rank": " Καθηγητής",
    "Apella_id": 18174,
    "Scholar name": "Nikos Konofaos",
    "Scholar id": "rC2jKL0AAAAJ",
    "Affiliation": "Professor, Aristotle University of Thessaloniki, Greece",
    "Citedby": 1166,
    "Interests": [
        "Microelectronics",
        "Nanoelectronics",
        "Semiconductor Devices",
        "Quantum Computing",
        "VLSI"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=rC2jKL0AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "New evidence on the relation between tunnelling and trap density at insulator/semiconductor interfaces",
            "Publication year": 2001,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0268-1242/16/8/317/meta",
            "Abstract": "Admittance spectroscopy measurements on metal-insulator-semiconductor (MIS) devices allow the determination of electronic states at the insulator/semiconductor interface. The contribution of the ac conductance on the measurements allows the calculation of the interface traps density and the relevant time constant. The experimental data can be analysed using either a model based on the Shockley-Read-Hall (SRH) recombination statistics or via the tunnelling process and recent results allowed both descriptions to be applied on various insulator/semiconductor structures. In the present investigation, the interface states for several MIS devices on a variety of thin film insulators deposited on Si substrates were studied. These devices included structures such as aC/Si, aC: H/Si, CN/Si and BaTiO 3/Si. Admittance spectroscopy took place and the SRH-based models as well as the tunnelling-based models were used …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:hqOjcs7Dif8C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Characterization of physical and electrical properties of BaTiO 3 films deposited on p-Si by modified polymeric precursors",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-005-0272-5",
            "Abstract": "Highly uniform BaTiO3 (BTO) films with thickness well below 100 nm were deposited on p-Si by spin coating using a modified polymeric precursor method. The polymeric precursor gel was redissolved into glacial acetic acid to improve the wetting property of the spinning solution to the Si substrates (2.5-in. diameter). The morphology, composition, thickness, and refractive index of the films were investigated using x-ray diffraction (XRD), scanning electron microscopy (SEM), energy-dispersive x-ray spectroscopy (EDS), and ellipsometry. The films are found to be polycrystalline. They exhibit uniformity over the whole wafer in regard to thickness, composition, and absence of surface features. The capacitors constructed with the BTO films on Si were further investigated by electrical characterizations. Current-voltage (I-V) measurements reveal a leakage current due to a Poole-Frenkel mechanism. The energy …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Quantum noise simulation: A software module for QuCirDET",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937636/",
            "Abstract": "An autonomous software module for the estimation of quantum circuit noise is preseneted. Quantum noise is stochastically generated in quantum systems as decoherence, or during gate operations. The simulation is allowed for a single data block made of qubits. A simple quantum error correction protocol runs with a selected quantum error correction code and the module estimates the probability that the code will fail to work under particular noise regimes. The error correction protocol is described and the estimation method is analysed. The adopted module is integrated into QuCirDET maintaining its independence from the interface. The design tool can be used to create and test decoding schemes under different quantum codes.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nitrogen induced states at the CNx/Si interface",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510799003980",
            "Abstract": "The deposition of carbon nitride (CNx) films onto n-type silicon wafers by rf magnetron sputtering at room temperature produces insulating films suitable for electronic applications. The traps at the CNx/Si interface may hamper the creation of electronic devices especially in VLSI applications. While amorphous carbon films have been studied for that purpose, the introduction of nitrogen inside the growth chamber adds an extra parameter in the process. CNx films were grown with the N2 concentration ranging between 1 and 25%. The effect of various N2 concentrations on the interface states is investigated in the present work. The interface states were characterized by admittance spectroscopy on metal-insulator-semiconductor (MIS) devices created by the deposition of A1 contacts. The density of interface states (Dit) and the corresponding time constants were obtained by the conductance technique. The Dit was …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A VHDL implementation of the Hummingbird cryptographic algorithm",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8259979/",
            "Abstract": "In this paper a VHDL implementation of the Hummingbird lightweight cryptographic algorithm is presented, with the initialization, encryption and decryption processes analyzed and simulated. All these processes include stream cipher and block cipher encryption or decryption techniques, such as transposition with linear transform and substitution with Substitution box (Sbox). These techniques are described in detail, and a full paradigm is presented. The Hummingbird algorithm exploits the extra safety provided by the Linear Feedback Shift Register (LFSR). Such a circuit is fully designed and analyzed, demonstrating a reliable and well performed system that can implement a successful encryption/decryption process. The analysis of both the forward and the reverse procedure are described together with a case study, using suitable programming via the Xilinx Design Suite. Following the analysis of the …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electrical characterization and carrier transport mechanisms of GaAs p/i/n devices for photovoltaic applications",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510700006413",
            "Abstract": "GaAs p/i/n diodes made by Metal-Organic Vapour Phase Epitaxy were examined by electrical measurements for evaluating the optimum i-region for use as solar cells. Four series of samples were prepared and studied each one with a different i-region width. The performance of the devices was examined by means of Admittance spectroscopy as well as classical current–voltage and capacitance–voltage characterization, allowing the calculation of the minority carriers lifetime (τeff) and the diodes ideality factors. The values of the τeff were found to lie between 8.7 ps and 0.14 ns for i-region widths between 0 and 0.8 μm. These results were used to model the multilayer structure with the two-diode representation and explain the conductance mechanisms inside the diodes. This modeling showed that the recombination/generation currents were dominating in forward biased diodes and the ohmic loss current in reverse …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Utilising noise effects on infrared pattern reception for position estimation on a grid plane",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4416799/",
            "Abstract": "In this paper we present a way to locate the position of a moving target on a grid plane of about 15 square meters with an estimation error of less than half of the grid node distance. The estimation method is based on the success rate that the infrared patterns transmitted from two constant positions is received by the moving target. Several aspects of the reception such as the number of the expected, scrambled or out of order patterns that are recognised are considered. They are all playing an important role in determining the coordinates of the target. An ultra low cost system architecture based on commercial components is presented. A proper carrier filter of 1 MHz centre frequency is also studied in order to achieve fast coordinate estimation. The accuracy of the position estimation algorithm is also discussed with respect to the effect of the grid node distance.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electrical characterization of  devices grown by magnetron sputtering at room temperature",
            "Publication year": 2001,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1352658",
            "Abstract": "Amorphous carbon (α-C) films were deposited on Si substrates by magnetron sputtering at room temperature, followed by a deposition of TiN on top of the carbon films to form heterojunction devices. The electrical properties of the TiN/α–C/Si devices were characterized by capacitance–voltage, conductance–voltage, and current–voltage measurements as a function of temperature. The results showed that the devices behaved like metal–insulator–semiconductor devices at low temperatures, while at higher temperatures, the carbon films exhibited a high internal conductivity and the overall performance was similar to that of heterojunction devices. The conductivity was adequately modeled and found to follow the thermionic field emission model. The TiN exhibited an excellent behavior as a metallic electrode of the devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:8k81kl-MbHgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Improving the performance of a position localization system based on infrared pattern recognition.",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:dfsIfKJdRG4C",
            "Publisher": "New Technologies Publications"
        },
        {
            "Title": "A complementary single-electron 4-bit multiplexer",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548250/",
            "Abstract": "The design and simulation of a single-electron 4-1 complementary multiplexer is being presented using two Monte Carlo based tools. Both the behavior and the stability of the circuit were verified while its free energy and its speed were also examined and analyzed. The results confirmed that the circuit behaved as a complementary multiplexer. Moreover, the currents through the circuit were examined under the operating temperature, while a stable operation of the circuit was verified without any noise present at the output points.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design, simulation and performance evaluation of a single-electron 2-4 decoder",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269208001821",
            "Abstract": "In this paper, we present a single-electron 2-4 decoder built using single-electron devices. The circuit is designed using a proper tool based on a Monte Carlo technique. First a single-electron AND gate is studied and then the 2-D decoder circuit is designed and studied. The results proved that the circuit was a 2-4 decoder, while the behaviour of the free energy of the system (which was calculated to be 4.90×10−1 eV) and the stability diagram verified the correct functioning of the circuit.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design, simulation and performance evaluation of a NAND based single-electron 2-4 decoder",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5350175/",
            "Abstract": "In this paper the design and simulation of a single-electron 2-4 decoder based on NAND gates is presented. The simulation was made using a Monte-Carlo based tool. The results confirmed that the circuit was behaving as a 2-4 decoder. The stability plot and the free energy history diagrams offer detailed analysis of the circuit. The results were compared to similar circuits reported in the literature and the advantages and disadvantages of this design were identified.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Examining the performance of an open space laser network link under various weather conditions",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electrical characterisation of SiON/n-Si structures for MOS VLSI electronics",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269204000047",
            "Abstract": "In the present work, we examine the properties of SiON films grown on Si substrates by CVD in order to investigate their suitability as potential materials in replacing SiO2 in metal-oxide-semiconductor (MOS) devices. Suitable metallization created MOS devices and electrical characterisation took place in order to identify their electrical properties. Electrical measurements included current–voltage (I–V), capacitance–conductance–voltage (C–V) measurements and admittance spectroscopy (Y−ω) allowing determination of the bulk charges and the dielectric response of the films. The analysis of the data also took into account the presence of traps at the Si/SiON interface calculated by a fast conductance technique. The interface states density was of the order of 1012 eV−1 cm−2. The dielectric constant was found to lie between 16 and 4.5 and the corresponding bulk trapped charges were found between 8 and 113 …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Memory performance of MOS structure embedded with laser annealed gold NCs",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110118300510",
            "Abstract": "Memory devices having the structure of n-Si(1 0 0)/SiO2/metal nanocrystals (NCs)/Y2O3/Au were fabricated and their structural and electrical characteristics have been studied extensively. Gold nanoparticles were formed via laser annealing (LA) of a thin Au layer. The aim was to investigate the use of laser annealing as an effective method to produce NC-based memory devices. In particular, laser annealing was used in order to obtain uniformly spaced NCs with an average diameter of 20 nm. Best results for Au NCs were obtained using fluence below 500 mJ/cm2 and a small number of laser pulses (1–5). After structural characterization using SEM, electrical characterization involving capacitance-voltage and current-voltage measurements revealed good (dis-)charging behavior and memory windows around 3 V. The analysis of the experimental data showed that LA is a promising annealing technique to …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "DSD 2019",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8875027/",
            "Abstract": "[Title page iii] - IEEE Conference Publication IEEE.org IEEE Xplore IEEE-SA IEEE Spectrum \nMore Sites Create Account Personal Sign In Personal Sign In For IEEE to continue sending \nyou helpful information on our products and services, please consent to our updated \nPrivacy Policy. I have read and accepted the IEEE Privacy Policy. Accept & Sign In Email \nAddress Password Sign In Forgot Password? [Title page iii] Abstract: Presents the title page \nof the proceedings record. Published in: 2019 22nd Euromicro Conference on Digital \nSystem Design (DSD) Article #: Date of Conference: 28-30 Aug. 2019 Date Added to IEEE \nXplore: 21 October 2019 ISBN Information: Electronic ISBN: 978-1-7281-2862-7 Print on \nDemand(PoD) ISBN: 978-1-7281-2863-4 INSPEC Accession Number: Persistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=8867828 \nMore » Publisher: IEEE IEEE Account Change Username/: …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electrical characterisation of SrTiO3/Si interfaces",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022309302009833",
            "Abstract": "Deposition of SrTiO3 (STO) thin films by ultra-high vacuum rf magnetron sputtering was performed in order to produce high-quality STO/p-Si (1 0 0) interfaces and STO insulator layers with high dielectric constants. The deposition temperatures were in the range from room temperature to 550 °C. Capacitance–voltage (C–V) and conductance–frequency measurements showed that the dielectric constant of the films ranges from 55 to 120. C–V measurements on Al/STO/p-Si structures clearly revealed the creation of metal–insulator–semiconductor diodes. The interface state densities (Dit) at the STO/p-Si interfaces were obtained from admittance spectroscopy measurements. The samples deposited at lower temperatures revealed values of Dit between 2×1011 and 3.5×1012 eV−1 cm−2 while the higher temperature deposited samples had a higher Dit ranging between 1×1011 and 1×1013 eV−1 cm−2. The above …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:ufrVoPGSRksC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Electrical characterization of the SiON/Si interface for applications on optical and MOS devices",
            "Publication year": 2002,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0268-1242/18/1/308/meta",
            "Abstract": "An investigation of the electrical properties of the SiON/n-Si interface is presented for applications in MOS and/or optical devices. The SiON films were deposited onto n-type Si substrates by CVD using different [O]/[N] ratios. Subsequent metallization led to the creation of metal-oxide-semiconductor (MOS) devices and electrical characterization took place in order to identify their electrical properties. Electrical measurements included current–voltage, capacitance–conductance–voltage (C–G–V) measurements and admittance spectroscopy, allowing the determination of the interface state density, the traps time constant and their distribution. Post-deposition annealing was also used and the annealed samples were subjected to the same investigation. The interface state density was found to lie between 1.74× 10 12 eV− 1 cm 2 and 1.72× 10 11 eV− 1 cm− 2 and the post-deposition annealing reduced these values.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:2osOgNQ5qMEC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Characterisation of the BaTiO3/p-Si interface and applications",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169433200004839",
            "Abstract": "Barium titanate (BaTiO3), because of its high dielectric constant ( εr), has proven to be a very promising candidate for use as dielectric layer in ac thin film electroluminescent (ACTFEL) devices and for use in thin film hybrid and integrated circuits. In the present work, BaTiO3 films were deposited on p-Si (100) substrates by rf-magnetron sputtering at a base temperature of 200°C. The electronic properties of the BaTiO3/p-Si interface were examined by means of admittance spectroscopy on metal–insulator–semiconductor (MIS) devices fabricated by thermal evaporation of Al. The density of interface states (Dit) was calculated by both the capacitive and the conductive response of the traps; values of the order of 1012 eV−1 cm−2 were obtained for the Dit and values of 10−5 s were calculated for the relevant time constants of the traps. These values, together with the dielectric constant of the films ranging between 40 and …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:Y0pCki6q_DkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Design and simulation of an embedded DRAM cell made up of MOSFETs having alternative gate dielectrics",
            "Publication year": 2005,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5837/0000/Design-and-simulation-of-an-embedded-DRAM-cell-made-up/10.1117/12.607757.short",
            "Abstract": "Design and construction of new sub-micron MOSFETs with alternative gate dielectrics has emerged as a new technology for use in high-performance logic or low power memory circuits. The modelling of the new devices needs to take into account the effects that the new dielectrics have on the MOS device performance. In this paper, we examine such effects in terms of both capacitance and leakage current effects. First, we investigate the role of the parasitic capacitances appearing at the MOS device due to either material related processes or metallization. These capacitances are modelled accordingly in order to derive the device characteristics. Then, leakage currents are taken into account and the whole device is simulated using a 90 nm technology based on the BSIM4 model equations, suitably modified to account for these effects. The application of such devices on memory circuits is examined in order to take …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:mVmsd5A6BfQC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Ultra-low-power and compact 8-bit CMOS priority encoder",
            "Publication year": 2017,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/21681724.2016.1196504",
            "Abstract": "An ultra-low-power, 55-transistor 8-bit priority encoder is proposed, based on a modified n-type dynamic scheme using feedback from higher- to lower-priority outputs. A comparative study, including other designs from literature, is performed on transistor level at 32 and 45 nm predictive technology. The simulation results showed that, compared to the other examined works, the proposed circuit achieves reduction in power dissipation as high as 88% and reduction in power delay product, up to 93.0% while having the smallest transistor count. It is thus proved to be an all-around efficient design in terms of power, performance and area.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Device characterization for amorphous diamond-like carbon–silicon heterojunctions",
            "Publication year": 1998,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.368690",
            "Abstract": "We report here on the electrical characterization of Al/a-C:H/n-Si devices, where the a-C:H films were ion implanted with boron. The current–voltage characteristics versus temperature demonstrated the creation of p-n heterojunctions and Schottky diodes. Maximum current outputs were reached faster for higher temperatures. Lower doses of boron implants produced Schottky diode characteristics, with a current saturation in the forward region due to the existing barrier. The values of the output currents increased with temperature and implanted dose.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:roLk4NBRz8UC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Noise investigation in a spin-based four-qubit GaAs block of self-assembled quantum dots",
            "Publication year": 2021,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0051446",
            "Abstract": "Optically controlled self-assembled quantum dots have received substantial attention in the quantum computing area, as techniques for initializing, manipulating, and reading out single spin qubits have been demonstrated in essence. The electron-spin coherence and hole-spin coherence are limited due to noisy quantum effects, and there is a significant need for further evaluation and investigation studies. In this work, the behavior of charge noise and spin noise for a fundamental logic unit of four qubit embedded in an AlAs/GaAs heterostructure is reported based on the modeling and simulation approach in the atomic level to provide a more in-depth analysis and evaluation of quantum noise. The numerical calculations are based on reliable simulation methods, which are consistent with experimental results. The approach presented here can become the basis for scaled-up advanced simulations expanding to …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:JoZmwDi-zQgC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "A Quantum Cellular Automata architecture with nearest neighbor interactions using one quantum gate type",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1610.06426",
            "Abstract": "We propose an architecture based on Quantum cellular Automata which allows the use of only one type of quantum gates per computational step in order to perform nearest neighbor interactions. The model is built in partial steps, each one of them analyzed using nearest neighbor interactions, starting with single qubit operations and continuing with two qubit ones. The effectiveness of the model is tested and valuated by developing a quantum circuit implementing the Quantum Fourier Transform. The important outcome of this validation was that the operations are performed in a local and controlled manner thus reducing the error rate of each computational step.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crossbar sector addressing scheme on SRAMs",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8259951/",
            "Abstract": "Typical memory addressing, where a row of cells that forms the memory word, is addressed every time the memory is accessed, has the disadvantage of decreased addressing flexibility, originating from the strict addressing method and leading to addressing limitations. In this work we present and implement the crossbar addressing scheme, where the memory is addressed in a two dimensional way, using two decoders on each direction. Although crossbar addressing is mentioned on references there is no known implementation on SRAM memories. We extend this scheme proposing the new Sector addressing scheme, based on crossbar addressing.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Conductance technique measurements of the density of states between Si and ZnS grown by molecular beam epitaxy",
            "Publication year": 1993,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.355303",
            "Abstract": "Electrical measurements have been performed on Al/ZnS/p−Si diodes, where the ZnS film was grown using the molecular beam epitaxy process. Capacitance‐voltage data confirm that the ZnS layer is conducting as shown by the fall of capacitance in accumulation and the associated feature of deep depletion that is frequency independent. A wide dispersion of capacitance at different ac signal frequencies is observed in depletion. Also, admittance measurements are taken, using the conductance technique. The discrete energy‐state model provided the best fit to the admittance data, inherently implying a low defect interface has been created. The density of interface states varies between 8.2×1010 cm−2 eV−1 at the Si Fermi‐level and 2.7×1010 cm−2 eV−1 at the Si midgap.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:QIV2ME_5wuYC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "An electrical, optical and electron paramagnetic resonance study of room temperature deposited CNx films on Si",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609004017377",
            "Abstract": "Carbon nitride films were deposited onto n-type silicon substrates by room temperature sputtering and suitable nitration. Two series of samples were prepared, differentiated by the applied substrate bias while growing. They were examined by means of electrical, optical and electron paramagnetic resonance (EPR) measurements in order to reveal their electronic properties. The electrical measurements showed that the films deposited under a positive bias (#1) were insulators, while those with a negative one (#2) were semiconductors. Then, EPR spectra were taken in order to clarify the role the inter-atomic bonding formation can play on the electrical properties of the films. The results showed that the sp2–sp3 ratio was 25:58 and 65:25, respectively, for the #1 and #2 films. Such behaviour was correlated to the deposition conditions and the films showed to be suitable for use in microelectronics devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Estimation of a target position based on infrared pattern reception quality",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.4103/0256-4602.58972",
            "Abstract": "A novel approach toward the indoor position localization of a mobile target is presented in this paper. It is based on the reception quality of infrared patterns that are sent by a small number of transmitters that are placed around the covered area. A pair of transmitters can cover an area of 15 m 2 that can be further extended if more transmitters are used. No signal strength or time intervals have to be accurately measured leading to low-cost implementations. Result validation rules and error correcting methods are employed to improve the position estimation accuracy. Several alternative architecture approaches concerning the infrared pattern structure are also presented in order to improve the estimation speed and the localization system robustness in noisy environments.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:_kc_bZDykSQC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Multi field SRAM access via intra-encoders and crossbar addressing scheme",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937630/",
            "Abstract": "In this work, a novel architecture that simultaneously accesses multiple and non-overlapped sub-regions of a static random access memory, is presented. The selection of the multi memory fields is succeeded via intra-encoders, placed one for every memory field. The addressing of the memory is done using a modified approach of the crossbar addressing scheme. At the presented implementation, each memory field comprises of 8 by 8 memory cell sectors. However, using the same design guidelines, memories and memory fields of bigger size, can be easily created. Each memory cell uses an 8T model. At the end, simulation results are presented, which verify the successful multi field access of the memory.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling and Simulation of Submicron MOSFETs with Alternative Gate Dielectrics for DRAM Cells",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1651007/",
            "Abstract": "In this study, we designed and simulated MOS devices having alternative gate dielectrics and examined their electrical behaviour as well as their effectiveness on the performance of a DRAM cell containing them. The devices under test had gate dielectrics of SrTiO 3 , (Ba 1-x Sr x )TiO 3 , TiO 2 , Ta 2 O 5 , Y 2 O 3  and (Pb 1  La x )TiO 3 . Equivalent oxide thicknesses were derived between 0.95 and 4 nm. Among the candidate materials, SrTiO 3  was the most promising when data retention is required, while Y 2 O 3  depicted the best I-V behavior. An increased cell capacitance resulted to higher memory refreshing times, improving substantially the device reliability",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Properties of Al-SrTiO/sub 3/-ITO capacitors for microelectronic device applications",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1308649/",
            "Abstract": "Growth of SrTiO/sub 3/ (STO) thin films on indium tin oxide (ITO) substrates took place by RF magnetron sputtering under various deposition conditions. Subsequent Al metallization created metal-insulator-metal (MIM) capacitors. The properties of such capacitors were investigated by means of structural and electrical measurements, revealing the films transparency, the dielectric constant, the switching time characteristics, and the trapped charges density. Dielectric constant values as high as 120 were obtained for low frequencies of around 2 kHz, the switching time was found to be 3.2 /spl mu/s and the trapped charges were found equal to 2.9 nCcm/sup -2/. The results showed that the films were suitable for use in electronic devices where high capacitance is required and for potential applications in optical devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reduced molybdenum oxide as an efficient electron injection layer in polymer light-emitting diodes",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3557502",
            "Abstract": "We report a significant improvement in the performance of single layer polymer light-emitting diodes (PLEDs), based on the green emitting copolymer poly[(9,9-dioctylfluorenyl-2,7-diyl)-co-(1,4-benzo-{2, 1′,3}-thiadiazole)], upon inserting a very thin layer of partially reduced molybdenum oxide (MoOx, where x=2.7) at the polymer/Al cathode interface. Both fully oxidized (x=3) and partially reduced (x=2.7) thin molybdenum oxide layers were investigated as electron injection layers and their influence on PLED device performance was examined. Improved current density, luminance, and efficiency was achieved only in the case of devices with a thin partially reduced MoO2.7 film as electron injection layer, as a result of improved electron injection and more facile transfer at the modified polymer/Al interface.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:_FxGoFyzp5QC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Electrical behaviour of metal/aC/Si and metal/CN/Si devices",
            "Publication year": 1999,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0008622398002887",
            "Abstract": "Electrical characterisation of metal/carbon/Si devices was performed. Amorphous carbon films rich in sp3 bonds were grown onto n-type Si substrates by RF magnetron sputtering at room temperature. Different deposition conditions were used to create different sp3 and sp2 configurations in order to examine their influence on the performance of electronic devices. Suitable metalisation was used to fabricate devices, which were then characterised electrically. Electrical characterisation using I–V, C–G–V and G–ω techniques showed temperature dependent currents through the devices which increase rapidly when forward bias is applied. This behaviour was found to be dependent on the sp3–sp2 contents of the films. The devices behaved like metal–insulator–semiconductor diodes with a defect insulator resulting in creating thermally activated currents through the devices. The effect of nitrogen introduced in the …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:Se3iqnhoufwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The design, installation and operation of a fully computerized, Automatic Weather Station for high quality Meteorological measurements",
            "Publication year": 2007,
            "Publication url": "http://users.csa.upatras.gr/~dmatthop/p31.pdf",
            "Abstract": "The design, installation and operation of an Automatic Weather Station (AWS) are described and analysed in the present paper. This station of high endurance is easy to be installed and capable for long-time operation without significant problems. The metadata of the station which are the characteristics of the instruments, electronic logic control and datalogging systems are described in detail, according to the Guides of the World Meteorological Organization (WMO). Moreover, a computer controlled environment is designed and implemented, with capabilities of data acquisition and control with flexible and high performing software and hardware capabilities. The AWS can easily communicate, so directly as remotely, with some modifications and both possibilities are examined in detail. Finally, an evaluation procedure is presented and analyzed, while the obtained results are used for testing the system. The evaluation depicted the unique and well established characteristics of the system and proved its potential application to meteorological data collection and calculation.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and evaluation of 6T SRAM layout designs at modern nanoscale CMOS processes",
            "Publication year": 2015,
            "Publication url": "http://mocast.physics.auth.gr/images/NewPapers/PAPER_18F.pdf",
            "Abstract": "Six layout variations of the 6T SRAM cell are examined and compared. The comparison includes four conventional cells, plus the thin cell commonly used in industry and a recently proposed ultra-thin cell. The layouts of the cells are presented and corresponding memory arrays are implemented at 65, 45 and 32 nm using 3-metal CMOS n-well process. The obtained designs are compared in terms of area, power dissipation and read/write delay, using proper BSIM4 level simulations. The thin cell presents the best results regarding area efficiency and delay. In terms of power dissipation, it performs poorly at 65 and 45 nm but appears to be the best at 32 nm, presenting great improvement with downscaling. The ultrathin cell provides a more lithographically friendly alternative to the thin cell, with lower power dissipation at 65 and 45 nm and higher at 32 nm. Overall, it performs worse in area and power relative to most conventional designs and gets worse with downscaling.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:ZHo1McVdvXMC",
            "Publisher": "Mocast"
        },
        {
            "Title": "Gate stack dielectric degradation of rare-earth oxides grown on high mobility Ge substrates",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4763478",
            "Abstract": "We report on the reliability characteristics and their analysis, of rare-earth oxides (REOs) dielectric degradation, when used as interfacial buffer layers together with HfO2 high-k films (REOs/HfO2) on high mobility Ge substrates. Metal-oxide-semiconductor (MOS) devices with these stacks, show dissimilar charge trapping phenomena under varying levels of constant-voltage-stress (CVS) conditions, influencing the measured densities of the interface (Nit) and border (NBT) traps. In the present study, we report on C-Vg hysteresis curves related to both Nit and NBT. We propose a new model based on the Maxwell-Wagner mechanism, and this model explains the current decay transient observed under CVS bias from low to higher fields of MOS gate stack devices grown on Ge substrates. The proposed model is unlike to those used for other MOS devices. Finally, CVS measurements for very long times at moderate fields …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:TQgYirikUcIC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Dielectric properties and electronic transitions of porous and nanostructured cerium oxide films",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510703005452",
            "Abstract": "Cerium dioxide (CeO2) exhibits exceptional electronic properties such as optical transparency and high refractive index (n) and high dc dielectric constant (k). Therefore, it is an attractive material for ultra-thin gate oxide in CMOS technology, where high-k dielectrics are required. We study the electronic properties of nanostructured and porous cerium oxide (CeOx) films, 110–500 nm thick, grown on Si by electron beam evaporation (EBE) and ion beam assisted deposition (IBAD). The film microstructure and morphology (grain size, porosity, defect concentration, surface and interface roughness) are controlled by varying the process parameters appropriately. They have been studied by high-resolution and transmission electron microscopy (HRTEM). The optical properties have been studied by spectroscopic ellipsometry (SE) and k was determined by capacitance measurements. We have found that the values of k …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Properties of barium titanate (BaTiO3) thin films grown on silicon by rf magnetron sputtering",
            "Publication year": 2000,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13642810008208599",
            "Abstract": "Thin films of BaTiO3 were deposited on p-Si substrates by rf magnetron sputtering in order to investigate their suitability for use in ac thin film electroluminescent (ACTFEL) devices and dynamic RAM (DRAM) applications. Post-growth annealing at 700°C and the subseauent deposition of Al contacts resulted in the creation of Al/BaTiO3/p-Si metal-insulator-semiconductor devices. The electronic and structural properties of the films were examined by admittance spectroscopy, current-voltage and transient current measurements, and X-ray diffraction (XRD) characterization. Analysis of the XRD spectra showed the polycrystalline nature of the films but also the presence of an amorphous phase. The electrical measurements revealed a high dielectric constant, around 60, a charge storage capacity exceeding 3 μC cm−2 and a total charge trapped inside the oxide of around 50 nC cm−2 while the density of traps at …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "DSD Proceedings",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crystal quality and conductivity type of epitaxial (002) ZnO films on (100) Si substrates for device applications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5378112/",
            "Abstract": "Zinc oxide is a wide band-gap (3.37eV) semiconductor with high exciton binding energy (60meV) and excellent piezoelectric properties, showing promise for UV lasers, optical detection, sensors, and solar cells. Epitaxial growth of ZnO on Si is challenging due to lattice mismatch and thermal expansion coefficient differences, but it is important to develop such film growth in order to enhance the functionality of Si and provide optoelectronic and gas sensing capabilities in CMOS based ICs. Furthermore, ZnO grown by most techniques is nominally ntype and p-type films are hard to achieve; hampering the development of p-n junction devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-power high-performance CMOS 5-2 compressor with 58 transistors",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/document/8304715/",
            "Abstract": "Compressors are the fundamental components in the partial product reduction stage of CMOS multipliers. A new design is presented for the CMOS 5-2 compressor with 58 transistors, which is the lowest reported device count for such a circuit. Simulation results show that the proposed 5-2 compressor has significantly improved power-delay performance compared to previously proposed approaches.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IET"
        },
        {
            "Title": "Safe Use of Defibrillators: A Case Study in Greek Registered Nurses",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-57348-9_26",
            "Abstract": "International literature reveals the deficit of nurses’ knowledge on the defibrillator and the need to implement continuing education training courses relative to clinical issues.The purpose of this study was the evaluation of Greek registered nurses’ knowledge on the safe use of the defibrillator before and after a 2-h workshop. Anonymous self-administered validated questionnaire consisted of two parts was used to collect the data, after the written consent of the participants. The sample consisted of 65 participants (12 men and 53 women) and the output data were analyzed with SPSS v. 19.0 (SPSS Inc., Chicago, IL). The quantitative variables are expressed as mean values (SD) or as median values (interquartile range = IQR) while the qualitative variables are expressed as absolute and relative frequencies. For the comparison of the proportions of the correct answers before and after the intervention …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Simultaneous accessing of multiple SRAM subregions forming configurable and automatically generated memory fields",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cta.3024",
            "Abstract": "A novel SRAM architecture that simultaneously accesses multiple and non‐overlapped memory subregions, located even inside the same memory page, is presented in this work. This new memory architecture is called multi‐field SRAM, and the multiple selection of its subregions—referred to as the memory fields—is succeeded using special designed intra‐encoders, placed as one for every memory field. The block diagram of the typical SRAM model is extended in order to support the addressing of the multi‐field SRAM using a modified crossbar addressing approach. The support of this new memory is based on the automated generation of intra‐encoders that are adjacent to the memory fields. A test circuit, consisting of 16 memory fields, is developed in order to prove the correct operation of this new memory. Each memory storage cell uses an 8T model in order to support the crossbar addressing scheme …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and Simulation of Mixed Logic 2 - to - 4 Line Decoders at 32 nm CMOS technology",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New challenges emerging on the design of VLSI circuits made of MOSFETs using new gate dielectric materials",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1283656/",
            "Abstract": "While Quality Electronic Design issues regarding typical MOSFETs constructed by well established techniques and made of SiO/sub 2/ gate dielectrics are yet to optimised, new issues regarding the implementation of MOSFETs having gates made of high-k dielectric materials other than SiO/sub 2/ are being raised during the last years. Parameters such as the high dielectric constant values, extra oxide charges and process related defects have to be taken into account. In this paper, such issues are addressed. The case replacing commonly used parameters of the MOSFET modelling with new ones that will take into account the presence of a material with different properties than that of SiO/sub 2/ is presented and proposals are made. Moreover, a case study is presented, where a memory device is examined. An overall estimation of the proposed procedure is attempted and further work is proposed.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power single electron OR/NOR gate operating at 10GHz",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5572785/",
            "Abstract": "The design and simulation of a single-electron OR/NOR gate is being presented using a Monte Carlo based tool. Both the OR/NOR behavior and the stability were verified while the free energy behavior of the circuit was also examined. The results confirmed that the circuit behaved as an OR/NOR gate, depicting improved characteristics than previously published single electron OR circuits, achieving a really fast operational speed at low power. Moreover, the noise through the circuit was nearly diminished, while a stable behavior of the circuit was verified without any noise present at the output points.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of pulse oximetry knowledge of Greek registered nurses",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-56246-9_7",
            "Abstract": "Proper use and evaluation of the pulse oximeter readings in everyday clinical practice are related to patient safety and quality of provided patient healthcare. Purpose of this study was the evaluation of Greek registered nurses’ knowledge in pulse oximetry before and after an educational intervention implemented in a 2-h educational intervention (workshop). Anonymous self-administered validated questionnaire consisted of two parts was used to collect the data, after the written consent of the author, in a sample consisted of 78 participants (12 men and 66 women) and the output data were analyzed with SPSS v. 19.0 (SPSS Inc., Chicago, IL). The quantitative variables are expressed as mean values (SD) or as median values (interquartile range = IQR) while the qualitative variables are expressed as absolute and relative frequencies. For the comparison of the proportions of the correct answers before and …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:738O_yMBCRsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The effects of interface and bulk defects on the electrical performance of amorphous carbon/silicon heterojunctions",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S092151070101025X",
            "Abstract": "Amorphous diamond-like carbon (DLC)–silicon heterojunctions developed by rf magnetron sputtering from a carbon target on n-type Si(100) substrates at room temperature (RT) with TiN as a metal contact showed a high rectification ratio and asymmetric p–n junction characteristics. Classical current–voltage (I–V) measurements at various temperatures allowed to derive the conduction mechanisms which are directly related to the number of defects in the bulk of the material or at the interface between the Si and the amorphous carbon. Low frequency noise measurements at RT provided the concentration of states or traps that create the fluctuation of the current through the device and was used to clarify their role as far as the electrical properties of the material are concerned. Low temperature admittance spectroscopy was also used to measure the density of interface traps and the results were found to agree with …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Modelling the MOS Device Conductance Using an Extended Tunnelling Model and Subsequent Determination of Interface Traps.",
            "Publication year": 2005,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/modelling-the-mos-device-conductance-using-an-extended-tunnelling-model-and-subsequent-determination-of-interface-traps/DC4B8488E993E5FD5E798C1A09637C09",
            "Abstract": "The contribution of the AC conductance on admittance spectroscopy measurements on Metal-Insulator-Semiconductor (MIS) devices allows the calculation of the interface traps density and the relevant time constant. Two equivalent model approaches can be applied in order to explain the experimental results. One model is the statistical model based on the Shockley- Read-Hall (S-R-H) recombination statistics and the other one is a model based on the quantum tunneling effect. Recent evidence suggest that the tunneling model can be equivalent to the statistical one if a continuum of states is also considered in the modeling, creating an extended tunneling model. In the present paper, a further investigation on the extended model is attempted. Admittance spectroscopy data were collected for various Insulator/Si combinations, such as SrTiO3 and BaTiO3 deposited on Si. Both the S-R-H based and the extended …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:35N4QoGY0k4C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Organic photovoltaic performance improvement using atomic layer deposited ZnO electron-collecting layers",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110114001671",
            "Abstract": "Inverted organic photovoltaic (OPV) cells based on poly(3-hexylthiophene (P3HT) as the electron donor and [6,6]-phenyl-C71-butyric acid methyl ester (PC71BM) as the electron acceptor, were fabricated and characterized. To improve the photovoltaic performance, ZnO films were used as electron collection layers, while an under-stoichiometric molybdenum oxide MoOx was employed as the hole collection layer. Two types of ZnO layers were employed; one deposited by atomic layer deposition (ALD-ZnO) and another deposited using the sol–gel method (sg-ZnO). OPV cells with a 20 nm thick ALD-ZnO layer exhibited significant efficiency enhancement compared with those based on the sg-ZnO layer with the same thickness. The ALD-ZnO film exhibited reduced defect/trap concentration compared with the sg-ZnO counterpart, as confirmed by steady state photoluminescence spectroscopy, showing a promising …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:ldfaerwXgEUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Tungsten oxides as interfacial layers for improved performance in hybrid optoelectronic devices",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609010018730",
            "Abstract": "Tungsten oxide (WO3) films with thicknesses ranging from 30 to 100 nm were grown by Hot Filament Vapor Deposition (HFVD). Films were studied by X-Ray Photoemission Spectroscopy (XPS) and were found to be stoichiometric. The surface morphology of the films was characterized by Atomic Force Microscopy (AFM). Samples had a granular form with grains in the order of 100 nm. The surface roughness was found to increase with film thickness. HFVD WO3 films were used as conducting interfacial layers in advanced hybrid organic–inorganic optoelectronic devices. Hybrid-Organic Light Emitting Diodes (Hy-OLEDs) and Organic Photovoltaics (Hy-OPVs) were fabricated with these films as anode and/or as cathode interfacial conducting layers. The Hy-OLEDs showed significantly higher current density and a lower turn-on voltage when a thin WO3 layer was inserted at the anode/polymer interface, while when …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:5nxA0vEk-isC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Electrical properties of carbon nitride films on silicon",
            "Publication year": 2002,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1479479",
            "Abstract": "Carbon nitride (CNx) films grown onto n-type Si by rf magnetron sputtering at room temperature were studied by electrical measurements in order to identify the effects of nitrogen concentration on the electrical characteristics of the films. The CNx films, developed with various nitrogen concentrations in the plasma, showed very good insulating properties. The bulk-trapped charge was calculated, showing a dependence on the nitrogen content, indicating the existence of free charges inside the bulk. The dielectric constant of the films and the loss factor (tan δ) were examined as a function of frequency and found to differ with the relative increase of the nitrogen concentration. The examination showed that the films were suitable for use as insulators in metal-insulator-semiconductor devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:UebtZRa9Y70C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A quantum computer architecture based on semiconductor recombination statistics",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_55",
            "Abstract": "A new architecture for the practical implementation of a quantum computer is presented in this paper. The architecture makes use of the recombination statistics that govern semiconductor devices and I particular quantum phenomena occurring inside the forbidden gap of a semiconductor filled with a controlled amount of impurities. The occupation of a single trap by an electron is used for the representation of the qubit, whereas illuminating techniques are used for the controlled transition of the electrons between gap levels. The way these transitions correspond to the logical equivalent of quantum gates is being demonstrated by the implementation of the quantum Controlled-NOT (CNOT) gate. Measuring techniques of the final computational outcome based on macroscopic properties of a semiconductor are discussed.The above techniques are then combined for the design of a quantum circuit …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Electrical properties of  thin films on Si deposited by magnetron sputtering at low temperature",
            "Publication year": 2001,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1398321",
            "Abstract": "Deposition of SrTiO3 (STO) thin films by radio-frequency magnetron sputtering in an ultrahigh vacuum system at a low substrate temperature (∼200 °C) was performed in order to produce high-quality STO/p-Si (100) interfaces and STO insulator layers with dielectric constants of high magnitude. The STO films were identified as polycrystalline by x-ray diffraction, and were approximated with a layered structure according to the best fitting results of raw data from both Rutherford backscattering spectroscopy and variable angle spectroscopic ellipsometry. Room-temperature current–voltage and capacitance–voltage (C–V) measurements on Al/STO/p-Si diodes clearly revealed metal–insulator–semiconductor behavior, and the STO/p-Si interface state densities were of the order of 1011 eV−1 cm−2. The dielectric constant of the STO film was 65, and the dielectric loss factor varied between 0.05 and 0.55 for a …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:d1gkVwhDpl0C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A wireless infrared sensor network for the estimation of the position and orientation of a moving target",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.868.9771&rep=rep1&type=pdf",
            "Abstract": "The location of a moving person or vehicle in a virtual reality environment is a critical issue. A wireless infrared sensor network capable of estimating the position of a target on a plane and its orientation is presented in this paper. This is actually an extension of the position estimation system that was presented in [1-2] where the target was allowed to move on a plane but not to rotate. In [1-2] the estimation of the position was based on a network consisting of a few low cost infrared transmitters and a pair of infrared receivers mounted on the target. In this paper we discuss how a third infrared sensor properly positioned at the side of the receiver can also allow the estimation of the target orientation.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantum recovery protocols for stabilizer codes: Deterministic Monte-Carlo simulation",
            "Publication year": 2018,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5024661",
            "Abstract": "The quantum noise encumbrance caused by quantum error-correcting protocols is studied via numerical treatments. Noise evolution implies that the noise magnitude order may change dynamically during quantum computations. The rate of noise level deterioration is a function of the computer’s architecture and physical implementation. Various stabilizer codes with small blocks are studied under dynamic noise regimes, which change the noise magnitude order within a specified time period. The Monte-Carlo sampling simulation method is used to determine the survival probabilities for these codes under evolving error rates. A hypothetical q-step quantum algorithm is stabilized by the repeated application of the recovery protocol, and the proposed estimation method is applied. The estimation method is applied concurrently with the execution of the algorithm. The recovery process is simulated with the aid of a …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:geHnlv5EZngC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Rare earth oxides as high-k dielectrics for Ge based MOS devices: An electrical study of Pt/Gd2O3/Ge capacitors",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003811010600342X",
            "Abstract": "Germanium technology aiming at the fabrication of functional devices strongly depends on the electrical behaviour of both the oxide bulk and the oxide/Ge interface. Field effect transistors underperform and express non ideal characteristics due to high values of interface defects in conjunction with bulk states. In this paper, we show that rare earth oxide layers of Gd2O3 prepared by molecular beam deposition on Ge substrates produce improved insulating characteristics. The current density at 1 V was as low as J = 50 nA/cm2. The calculated value of the dielectric constant was around 10 and an EOT value equal to 3.7 nm was obtained, while the density of the interface states was approximately 2 × 1012 cm−2 eV−1. A detailed analysis of the electrical measurements of MOS capacitors revealed the existence of bulk electron traps in the semiconductor which need special attention if rare earth oxides are to be used in …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:W7OEmFMy1HYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Developing quantum nanocomputing for pervasive health environments",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1579114.1579182",
            "Abstract": "A model of quantum information processing is proposed for applications in health-care and assistive environments. It uses implanted nano-chips which could incorporate quantum computing technology and make use of the advantages of high computing and large memory capacity of a quantum system to the data storage procedure of a medical sensor. Quantum information and its storage has not yet been physically demonstrated due to the problem of decoherence that dominates such quantum systems. Fault-tolerant quantum error-correction (QEC) circuits have done great efforts to reduce the noise level. In this work a QEC circuit simulator is proposed which takes into consideration the memory noise and the gate noise produced during the evolving process of qubits. For any computational step the probability crash is estimated under different error rates and various parameters. A case study is presented …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and simulation of 6T SRAM cell architectures in 32nm technology",
            "Publication year": 2016,
            "Publication url": "https://www.jestr.org/downloads/Volume9Issue5/fulltext23952016.pdf",
            "Abstract": "A comparative study of various 6T SRAM cell layouts is presented at 32 nm, including four symmetric topologies. The comparison comprises two conventional cells, a thin cell, which is the current industry standard, and a recently proposed ultrathin cell. The evaluation is based on area efficiency, power dissipation and read/write delay, all of which are calculated with proper BSIM4 level simulations. The thin-cell appears to be the best topology in both power/delay performance and area.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characteristics of SrTiO3 thin films deposited on Si by rf magnetron sputtering at various substrate temperatures",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13642810208218351",
            "Abstract": "SrTiO3 (STO) thin films were deposited on p-type Si(100) substrates by rf magnetron sputtering at various substrate temperatures, and their structural and electrical properties were investigated without post-deposition annealing. The thickness of the films was in the range from 300 to 500 nm while the deposition temperature was varied between room temperature and 550°C. Compositional and structural characterizations included X-ray diffraction, Rutherford back-scattering spectroscopy and variable-angle spectroscopic ellipsometry. Metal-insulator-semiconductor diodes with the configuration of Al/STO/p-Si/Al were fabricated and characterized by capacitance-voltage, current-voltage and admittance spectroscopy measurements. Depending on the substrate temperatures, the dielectric constant of the films varied between 60 and 120 and the loss factor between 0.019 and 0.051 at 100 kHz. All films showed …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Heavy-ion RBS characterization of multilayer TiNx-SiO2-Si structures",
            "Publication year": 2020,
            "Publication url": "https://eproceedings.epublishing.ekt.gr/index.php/hnps/article/view/2793",
            "Abstract": "Multilayer structures consisting of TiNx-SiO2-Si layers operating as MOS devices were constructed and tested for their electrical properties. RBS measurements were performed for the characterization of the structure of the devices. The results show a correlation between the structure found by RBS and the electrical performance of the devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A four base computational method for the implementation of a quantum computer using silicon devices: Circuit and simulation",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895717709002593",
            "Abstract": "In this paper a technique for a quantum computer architecture is demonstrated using the discrete energy levels of an impurity doped semiconductor to represent the quantum computational basis. External signals are used to perform quantum logical gates and recombination mechanisms are suitably modelled in order to demonstrate quantum information processing. The physical mechanism which performs the logical equivalent of the Controlled-NOT (CNOT) gate is presented along with a mechanism obtaining an output with a similar statistical behavior with the Hadamard Gate. The computational basis was checked for errors when used for solving a quantum algorithm. Hence, using suitable simulation on a silicon structure, the computational errors that degrade the quantum information processing are considered and computed. These error results are found to be fairly small.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Interface engineering for efficient organic optoelectronic devices using nanostructured transition metal oxides",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6135181/",
            "Abstract": "With the advent of nanotechnology the synthesis of nanostructured materials and their useful applications have become increasingly prominent. Nanostructuring can enhance the performance of functional materials and provides them with unique properties. Exceptional qualities of nanostructured materials compared to the bulk include: (i) increased surface-to-volume ratio, which provides more surface area for both chemical and physical interactions, (ii) significantly altered surface energies that allow tuning and engineering of the materials properties, as atomic species near the surface have different bond structures than those embedded in the bulk, and (iii) quantum confinement effects, due to the inherently small size of nanostructured materials, that significantly influences, charge transport, electronic band structure and optical properties.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Formation of stoichiometric, sub-stoichiometric undoped and hydrogen doped tungsten oxide films, enabled by pulsed introduction of O2 or H2 during hot-wire vapor deposition",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609013006366",
            "Abstract": "Tungsten oxide films with various stoichiometries, undoped and hydrogen doped were deposited by heating a W wire at 660 °C and at a base pressure of 13 Pa set by various gasses (O2, N2, H2) or gas mixtures (N2–O2 10% in O2, forming gas, FG) and pulsed injection of O2 or H2. Using this method and dependent on the deposition conditions four classes of hot-wire (hw) tungsten oxide films were synthesized: i) stoichiometric (hwWO3), ii) oxygen deficient (sub-stoichiometric, hwWOx with x < 3), iii) stoichiometric and hydrogen doped (hwWO3:H), and iv) sub-stoichiometric and hydrogen doped (hwWOx:H). Due to the pulsed injection of O2 the W wire re-oxidizes during deposition thus creating WO3 vapors continuously, so films deposited by this method do not suffer by thickness limitations and, moreover, exhibit high porosity. The optical properties of these classes of films, studied with spectroscopic ellipsometry …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "PSK OFDM optical wireless communication systems with receiver's diversity over gamma-gamma turbulence channels and spatial jitter",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937668/",
            "Abstract": "Radio on Free-space optical communication systems have been gaining much attention due to their high bandwidth capabilities, addressing the emerging high demands for massive data transfers in wireless communication networks without the need for optical fibers. Thus in this work, we present a single-input multiple-output orthogonal frequency division multiplexing wireless optical communication system with phase shift keying and maximum ratio combining on the receivers' side. Analytical closed-form expressions are extracted for the estimation of the system's average BER, taking into account the atmospheric turbulence and pointing errors effects. The latter is modeled by the gamma-gamma distribution. Finally, numerical results are presented for various realistic turbulence conditions, spatial jitter influence and diversity options.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using future position restriction rules for stabilizing the results of a noise-sensitive indoor localization system",
            "Publication year": 2007,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-46/issue-6/067202/Using-future-position-restriction-rules-for-stabilizing-the-results-of/10.1117/1.2746822.short",
            "Abstract": "The testing and evaluation of a low cost system capable of estimating the position of a moving target within an extendible indoor area with low error is presented. Based on a recently developed system architecture, which makes use of a noise-sensitive indoor localization system made up of ir sensors, the position estimation error is based on comparing the number of the digital ir patterns received at the moving target with the expected one. To overcome the problem of instant noise that appears despite the effective system shielding, we employ a number of rules that take into consideration the previous position estimations. These rules are based on the fact that the speed of the target is always limited and its track is smooth most of the time. The test for the rules was made by running a series of experiments on the sensors system, and as a result, we verified that the maximum absolute error in the experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:KlAtU1dfN6UC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "QuCirDET: A design and simulation tool for quantum circuits",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495162/",
            "Abstract": "An electronic design and evaluation tool for quantum circuit design is presented. It allows easy implementation of quantum algorithms based on the circuit model of quantum computation. The layout of an ideal circuit network can be designed in the logical layer and then automatically get converted into an encoded form closer to the physical layer. The possibility to select and apply the desired quantum error-correcting code enables to study a particular circuit from the aspect of error correction. Various constructions of the same logical network can be designed in order to compare the gate loads of different implementations and encoding or decoding schemas. It is a well structured software tool enabling expansion of other useful functions for realistic studies on quantum computation.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-power, high-performance 64-bit CMOS priority encoder using static-dynamic parallel architecture",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495160/",
            "Abstract": "The performance of priority encoder circuits is usually limited by the delay associated with the propagation of the priority token, however, proper design in the architectural level can reduce the delay stages to the order of O(log n). Furthermore, power dissipation and area pose an increasingly important concern in modern circuit design, thus the development of suitable techniques is essential. This paper introduces a new 64-bit priority encoder based in a static-dynamic parallel priority lookahead architecture and a newly designed 4-bit PE cell. Compared to conventional works, it achieves up to 34% reduction in transistors, 80% reduction in power and 53% improvement in performance.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effect of the layered structure on the electronic properties of amorphous carbon films on n-Si",
            "Publication year": 1999,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.371384",
            "Abstract": "Amorphous carbon (a-C) films rich in sp3 bonds were grown onto n-type (100) silicon substrates by rf magnetron sputtering. The electrical defects created in the bulk of the carbon films as well as those at the a-C/Si interface during the deposition of the films were characterized electrically. Devices having the metal–insulator–semiconductor structure were fabricated and investigated by means of current–voltage (I–V) and capacitance–voltage (C–V) profiling and admittance spectroscopy. The construction of the films and in particular the presence of layered and bilayer structures was shown to affect the device characteristics. This behavior was attributed to Ar+ ions trapped inside the carbon bulk as well as to charge deficiencies due to the specific growth conditions of the amorphous carbon layers. The density of the interface states was found to depend considerably on the film construction, ranging from 1011 to 1013 …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:LkGwnXOMwfcC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Α Quantum Pattern Recognition Method for Improving Pairwise Sequence Alignment",
            "Publication year": 2019,
            "Publication url": "https://www.nature.com/articles/s41598-019-43697-3",
            "Abstract": "Quantum pattern recognition techniques have recently raised attention as potential candidates in analyzing vast amount of data. The necessity to obtain faster ways to process data is imperative where data generation is rapid. The ever-growing size of sequence databases caused by the development of high throughput sequencing is unprecedented. Current alignment methods have blossomed overnight but there is still the need for more efficient methods that preserve accuracy in high levels. In this work, a complex method is proposed to treat the alignment problem better than its classical counterparts by means of quantum computation. The basic principal of the standard dot-plot method is combined with a quantum algorithm, giving insight into the effect of quantum pattern recognition on pairwise alignment. The central feature of quantum algorithmic-quantum parallelism-and the diffraction patterns of x-rays are …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Target localization utilizing the success rate in infrared pattern recognition",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1703498/",
            "Abstract": "The architecture of an indoor target localization system employing a small number of infrared-emitting diodes and sensors is presented in this paper. The properties of infrared light and magnetic fields have already been exploited for position localization in distances of several centimeters. Ultrasonic waves and laser light can be used for longer distance estimation if the system is capable of accurately measuring the time of flight of the reflected signals. The proposed approach intends to cover a distance of several meters without requiring high accuracy measurements and sensors of increased precision. The digital infrared patterns that are transmitted from a constant position are recognized by a pair of sensors mounted on the moving target, with varying success rate depending on the distance and the angular displacement from the transmitter. Processing the success rate instead of the analogue signal intensity …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A New Concept On A Quantum Computer Based On Schockley‐Read‐Hall Recombination Statistics In Microelectronic Devices",
            "Publication year": 2005,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1994667",
            "Abstract": "In this paper a quantum computer based on the recombination processes happening in semiconductor devices is presented. A “data element” and a “computational element” are derived based on Schokley‐Read‐Hall statistics and they can later be used in order to manifest a simple and known quantum algorithm. Such a paradigm is shown by the application of the proposed technology onto the Shor’s period‐finding algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:dhFuZR0502QC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A quantum computer based on recombination processes in microelectronic devices",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/021/meta",
            "Abstract": "In this paper a quantum computer based on the recombination processes happening in semiconductor devices is presented. A\" data element\" and a\" computational element\" are derived based on Schokley-Read-Hall statistics and they can later be used to manifest a simple and known quantum computing process. Such a paradigm is shown by the application of the proposed computer onto a well known physical system involving traps in semiconductor devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:R3hNpaxXUhUC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Testing IR photon sensors for target localization applications",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=12049561561582901793&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementation of a Hadamard Gate Using Laser Light on a Phosphorus Doped Si Device",
            "Publication year": 2007,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2836208",
            "Abstract": "The dynamics of a single qubit, encoded in the charge states of a singly ionized phosphorus atom embedded in silicon bulk material are studied. For the simulation of the system a suitably modified version of the MATLAB package SCHRODINGER was used. Preliminary results were in agreement with previously published work regarding single qubit rotations. For the Hadamard Gate, the duration of the pulse T was computed as a function of input parameters the results produced outputs of the order of 9×10−10 sec.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:RHpTSmoSYBkC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Charge carrier response time in sputtered  heterojunctions",
            "Publication year": 2001,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1404403",
            "Abstract": "Amorphous carbon (a-C)/n-Si heterojunctions were developed by rf magnetron sputtering from a carbon target on Si(100) n-type substrates kept at room temperature. Subsequent metallization by the deposition of sputtered TiN on top of the carbon films resulted in the creation of effective heterojunction devices as shown by electrical characterization. The electrical performance of the devices was further investigated by admittance spectroscopy, allowing the calculation of the charge carrier response time which was found to be of the order of 10−6 s at room temperature, the lower value reported so far when compared to similar values reported for chemically vapor deposited films. These results showed that the devices were suitable for use in fast electronics working in hard environments.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:WF5omc3nYNoC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Properties and density of states of the interface between silicon and carbon films rich in  bonds",
            "Publication year": 1997,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.366402",
            "Abstract": "The interface states between n-type Si and amorphous carbon films rich in sp3 bonds grown by rf magnetron sputtering at room temperature have been examined. The investigation aimed to examine the effects of the low substrate temperature and the absence of hydrogen during the growth process on the density of interface states. Thus, comparing the values of the interface states to those reported for devices grown by other techniques, the best possible interface required for electronic applications is suggested. The conductance technique was used to measure the density of the interface states. This method revealed a value of the traps for the n-Si(100)-carbon interface of the order of 1010 cm−2 eV−1, nearly one order of magnitude lower than any other previously reported for the same configuration.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Characterisation of the Interface States between Amorphous Diamond‐Like Carbon Films and (100) Silicon",
            "Publication year": 1997,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/1521-396X(199705)161:1%3C111::AID-PSSA111%3E3.0.CO;2-U",
            "Abstract": "Amorphous diamond‐like carbon films were grown onto (100) Si substrates using rf plasma CVD of methane. Then the interface states were examined using the conductance technique. Metal–insulator–semiconductor (MIS) devices were made and proper modeling was used. The statistical model was used to fit the experimental data and calculate the density of interface states. The technique revealed a density of interface states between 1011 and 1012 eV—1 cm—2. Subsequent thermal annealing reduced this density.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:9yKSN-GCB0IC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Oxygen Contamination of Multilayer TiNx—SiO2—Si Structures found by Resonant RBS Analysis",
            "Publication year": 2020,
            "Publication url": "https://eproceedings.epublishing.ekt.gr/index.php/hnps/article/view/2241",
            "Abstract": "Multi layer structures consisting of TiN—SÌO2—Si layers operating as MOS devices were constructed and tested for their electrical properties. RBS and resonance reaction analysis were performed for the characterisation of the structure of the devices. The results show a correlation between the structure found by RBS and the electrical performance of the devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-performance and energy-efficient 64-bit incrementer/decrementer using Multiple-Output Monotonic CMOS",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926017305497",
            "Abstract": "In this paper, we introduce the Multiple-Output Monotonic CMOS (M2CMOS) logic style, which is applied on the design of a high-performance and energy-efficient 64-bit incrementer/decrementer circuit. M2CMOS is proposed as an enhancement to standard monotonic-static logic and a viable alternative to domino logic for high-performance applications. A simulation-based comparative analysis at the 32 nm concludes that, compared to other state-of-the-art designs, the proposed incrementer/decrementer achieves the best results in terms of gate/transistor count, delay, energy-delay-product and standby power.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:sSrBHYA8nusC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Characterization of magnetron sputtering deposited thin films of TiN for use as a metal electrode on  metal–oxide–semiconductor devices",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1322068",
            "Abstract": "Titanium nitride (TiN) thin films were deposited by dc magnetron sputtering on SiO2/n-Si substrates in order to study their use as gate electrodes in metal–oxide–semiconductor (MOS) devices. Rutherford backscattering spectroscopy was used to determine the composition of the films and the results were correlated to those obtained by electrical measurements of the constructed MOS devices. Oxygen contamination of the TiN layers was observed, with percentage and spatial variations depending on the various deposition parameters such as the deposition temperature and the substrate bias. The best electrical performance was achieved for devices where the exposed TiN surface had low oxygen contamination. From these samples, the TiNx–Si barrier height was calculated to be equal to 0.52 eV.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:0EnyYjriUFMC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Electrical reliability characteristics and dielectrics degradation in gate stacks (REO-HfO2) grown on the high mobility Ge substrates",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6135221/",
            "Abstract": "Gate stacks (rare-earth oxides, REOs-HfO 2 ) grown on Germanium substrates using REOs (e.g. CeO 2 , Dy 2 O 3 , La 2 O 3 ) as an interfacial buffer layer which are also friendly with Ge, demonstrating better passivation and electrical properties [1]. However, it is imperative to study a number of reliability concerns such as, accumulation of charge at the interface of the two dielectric, charge trapping, defects generation, SILC and oxides degradation issues to understand completely the gate stacks. The films were prepared by MBE on p-type (001) Ge substrates with resistivity of 1.6-1.9 Ω-cm. The oxides were deposited at temperature 225°C. Pt was used as the gate electrode while the back ohmic contact was realized using eutectic In-Ga alloy. The present work we report electrical reliability and dielectrics degradation of Dy 2 O 3 /HfO 2  gate stacks during constant voltage stress (CVS) and all the measurements were …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Studying compatibilities between quantum cellular automata and Kane's semiconductor based quantum computer",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200780184",
            "Abstract": "The aim of our work is to demonstrate a way of combining two different methods of achieving Quantum Computation: a) Kane's semiconductor based quantum computer and b) Quantum Cellular Automata (QCA). In our work, we demonstrate the physics, we propose the model and the circuit and we estimate the error in computation. The amount of error due to decoherence is estimated as a function of the input size and a lower bound for that size is given for which the proposed circuit can calculate in an error free mode, provided that in our simulated system the decoherence times for a single qubit (tϕ) predicted by Kane are applied. The numerical values are tϕ = 103 sec, and for the error fidelity e = 10‐5, which are within the limits of the values proposed by the Kane computer. Hence, in our case, compatibility between QCAs and Kane implementation is shown to be feasible. (© 2008 WILEY‐VCH Verlag GmbH & …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:k_IJM867U9cC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Reduced transition metal oxides as electron injection layers in hybrid-PLEDs",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931711005132",
            "Abstract": "Here we report on the improved performance of hybrid polymer light emitting diodes (HyPLEDs) upon inserting an ultra thin layer of partially reduced tungsten oxide (WO2.5) or molybdenum oxide (MoO2.7), deposited (by heating a W or Mo filament while hydrogen was flowing through the chamber) at the polymer/Al cathode interface. Improved current densities, luminances and efficiencies were achieved as a result of improved electron injection and transport at its interface with Al. The observed electron injection improvement is attributed to the lowering of the effective cathode interfacial barrier due to the occupation of gap states with electrons after partial reduction.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Defect related effects on the reliability and performance of an embedded DRAM cell designed with MOSFETs with alternative gate dielectrics",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/089/meta",
            "Abstract": "The design of an embedded DRAM based on MOSFETs with alternative gate dielectrics is presented and analysed. Design and evaluation of NMOS devices with high-k dielectric gate insulators and DRAM circuits took place. Reliability parameters of the NMOS devices constructed with (Ba, Sr) TiO 3 gate dielectrics were examined. A 90 nm technology model and the BSIM4 Spice equations were used in order to derive the device behaviour and the DRAM circuit performance. The simulation revealed low output currents for the MOSFETs and higher decay times for the DRAM circuits constructed using the devices with the alternative gate dielectrics.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:ZeXyd9-uunAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Electronic transport phenomena in devices containing amorphous diamond-like films on silicon",
            "Publication year": 1998,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038109897100953",
            "Abstract": "The electronic properties of amorphous diamond-like carbon (DLC) films grown by r-f plasma assisted CVD of methane at low temperature on n-type silicon substrates were examined for potential electronic applications. Metal contacts (Al and Au) were deposited on the films and the constructed devices were characterised using temperature dependent current voltage (I-V) measurements. Proper modelling and suitable techniques were applied on the experimental data, to analyze the measured quantities. As a result, a Schottky type conductivity was observed and analyzed. The barrier height of the metal contacts was found to be 0.35 eV for Au and 0.75 eV for Al.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Utilizing infrared pattern recognition features for indoor localization validated by future position restrictions",
            "Publication year": 2006,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp_20060656",
            "Abstract": "In this paper we present a system that is capable of estimating the position of a moving target on a grid plane covered by a pair of infrared transmitters. The area of this plane can be up to 15m2, further expandable if multiple transmitters are used. The position estimation method is based on comparing the number of infrared patterns received to the expected ones in a specific time interval (success rate). Using this method, no signal strength or time of flight has to be precisely measured, leading to an ultra low cost architecture. A proper topology of the infrared transmitters that optimally cover the desired area is discussed. The history of movements of the target is utilized in order to reject false estimations. The error achieved is below the half of the grid node distance. (5 pages)",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hot-wire substoichiometric tungsten oxide films deposited in hydrogen environment with n-type conductivity",
            "Publication year": 2012,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0022-3727/45/44/445101/meta",
            "Abstract": "Substoichiometric tungsten oxide nanostructured films were synthesized by a hot-wire deposition technique in hydrogen-rich environment and characterized for their structural and electrical properties. A semiconducting behaviour was identified, allowing n-type conductivity even at room temperature which is an important result since it is well known that fully stoichiometric tungsten trioxide is nearly an insulator. Current–voltage characteristics for various temperatures were measured for tungsten oxide/Si heterostructures and analysed using proper modelling. As a result, the conduction mechanism inside the films was identified and found to be of a dual nature, with variable range hopping being dominant at near room temperatures. The saturation current was found to be thermally activated and the activation energy was calculated at 0.40 eV and the grain boundaries barrier at 150 meV. From Hall measurements it …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:j3f4tGmQtD8C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Temperature dependence of the barrier at the tetrahedral amorphous carbon-silicon interface",
            "Publication year": 2001,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0268-1242/16/6/310/meta",
            "Abstract": "Tetrahedral amorphous carbon film (ta-C, rich in sp 3 bonds), 50 nm thick, was deposited by magnetron sputtering on n-type Si substrate at room temperature. Ohmic contact to the ta-C film was formed by depositing stoichiometric titanium nitride (TiN) by magnetron sputtering or aluminum (Al) by electron-gun evaporation at room temperature. The capacitance-voltage characteristics at different temperatures show negligible hysteresis, indicating low concentration of mobile charges. Electrical conduction in the TiN (Al)/ta-C/n-Si structure, with the TiN or Al biased positively with respect to Si, was investigated in the temperature range 80-300 K. Under high-field conditions, the electrical conduction is consistent with thermally assisted Fowler-Nordheim tunnelling of electrons from the Si substrate into the ta-C film for temperatures for 80-260 K and trap-assisted band-to-band indirect tunnelling for higher temperatures …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:qUcmZB5y_30C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Crystal quality and conductivity type of (0 0 2) ZnO films on (1 0 0) Si substrates for device applications",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110110002005",
            "Abstract": "Undoped high quality (0 0 2) zinc oxide thin films were grown on (1 0 0) silicon substrates by pulsed laser deposition (PLD). The films were developed at low growth temperatures between 200 and 300 °C, and a range of oxygen pressures from 8.5 × 10−5 to 2.6 × 10−4 Torr. X-ray photoelectron spectroscopy (XPS), X-ray diffraction (XRD), and room temperature photoluminescence (PL) have been carried out in order to verify the formation of ZnO layers and evaluate the structural and optical properties of the grown layers. Four-point Van Der Pauw Hall effect measurements were performed to evaluate the electrical conduction in the films. The grown ZnO films on Si were found to be perfectly (0 0 2) aligned polycrystalline structures with a best full-width at half-maximum (FWHM) value of 0.24° obtained for the optimum growth conditions. The PL study showed high optical quality with a substantially suppressed defect …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:aqlVkmm33-oC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Modeling the MOS Device Conductance Using an Extended Tunneling Model and Subsequent Determination of Interface Traps",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=15222366922020779508&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:tkaPQYYpVKoC",
            "Publisher": "Warrendale, Pa.; Materials Research Society; 1999"
        },
        {
            "Title": "Temperature dependence of the electrical properties of MOS devices constructed by sol gel deposited BaTiO3 films on p-Si",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/013/meta",
            "Abstract": "The electrical properties of MOS devices with high-k insulating BaTiO 3 sol gel films fabricated onto p-Si substrates, were investigated by a variety of electrical techniques. The aim was to identify the temperature dependence of the electrical properties of the MOS devices. All samples exhibit a typical MOS behaviour. The density of interface states D it was found to decrease with decreasing temperature and lies between 1× 10 11 eV− 1 cm− 2 at near midgap and 3× 10 12 eV− 1 cm− 2 near the gap edges. The bulk-trapped charges were calculated to be between 40 and 120 nCb cm− 2. The samples depicted high dielectric constants reaching values of 120. The results revealed that the sol-gel technique creates effective microelectronic devices.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:mB3voiENLucC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Dielectric properties of CVD grown SiON thin films on Si for MOS microelectronic devices",
            "Publication year": 2003,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0268-1242/19/1/008/meta",
            "Abstract": "The bulk properties of SiON films grown on n-Si substrates by CVD are examined by means of electrical measurements and Rutherford backscattering spectroscopy (RBS). The main aim of this project was to investigate the performance of the films in order to test their suitability for the construction of CMOS devices with SiON being the gate insulator. The CVD technique was used to produce the films and subsequent metallization leads to the creation of MOS devices. Rutherford backscattering spectroscopy (RBS) was used to verify the film bulk properties. Electrical measurements including current–voltage, capacitance–conductance–voltage (C–G–V) measurements and admittance spectroscopy were performed allowing determination of the bulk trapped charges and the dielectric constant of the films. These charges were calculated to have values between 0.76 nCb and 2.54 nCb, while the dielectric constant of the …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:qjMakFHDy7sC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Improving the sequence alignment method by quantum multi-pattern recognition",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201041",
            "Abstract": "A dot matrix approach for sequence alignment is combined with a known quantum multi-pattern recognition method in order to improve the problem of sequence alignment. This dot matrix technique allows the application of some quantum computing principles on the pattern recognition problems like those used in the Grover's algorithm. When the recognized patterns exceed the limit of the 1/3 of the overall patterns, the multi-pattern recognition is accomplished simultaneously with the probability of 100%. The contribution concerns the way that the adopted quantum pattern recognition algorithm is applied speeding up the sequence alignment process. An example application demonstrates the effectiveness of the proposed method. String alignments isn't an essential task only in bioinformatics, but also in calculating the edit distance cost between strings in a natural language or in financial data.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterization of heterojunction devices constructed by amorphous diamondlike films on silicon",
            "Publication year": 1997,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.364412",
            "Abstract": "The electronic properties of amorphous diamondlike carbon (DLC) films on silicon were examined for their capability for application to electronic devices. Metal-insulator-semiconductor (MIS) diodes and p-n heterojunction devices were created and characterized. The films used were grown using rf plasma assisted CVD of methane. They were grown on n-type silicon (100) wafers. Their structural composition was identified by Raman spectroscopy, ellipsometry, and x rays. They showed an insulating behavior and they were suitable for the creation of MIS devices. They showed extremely low internal conductivity due to defect currents. This conductivity showed a behavior of the form I∼T1/4. Then the density of trapping states at the silicon/carbon interface was measured using the conductance technique. The aim of investigating the nature and behavior of these states was to determine the magnitude of the density of …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:u-x6o8ySG0sC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Highly porous tungsten oxides for electrochromic applications",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931713002566",
            "Abstract": "The electrochromic (EC) properties of porous and highly porous tungsten oxide films deposited by heating a metallic wire in rough vacuum, without and with the injection of oxygen pulses on the filament, respectively, were investigated by proton intercalation using conventional and polymeric electrolytes. It was found that the EC properties like coloration efficiency and cyclic durability of coloration–bleaching process of the hot wire deposited tungsten oxide (HW–WO3) films strongly depend on the deposition environment and growth parameters. The highly porous films are initially very transparent (more transparent than fused silica, for example) and exhibit high coloration efficiency due to easier intercalation of the proton within their structure. These results suggest that the highly porous films obtained with the hot wire method combined with rapid injection of O2 exhibit superior EC performances than denser films …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Sensors System for Indoor Localisation of a Moving Target Based on Infrared Pattern Recognition",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=STqhDwAAQBAJ&oi=fnd&pg=PA283&dq=info:YbleTHOmwHYJ:scholar.google.com&ots=UcIYwaoFTP&sig=PfqDkAOrZiEpsKftycQUWNQilUU",
            "Abstract": "Estimating the position of a robot, a vehicle or a person in an indoor area is a significant issue for a number of applications in Robotics, Automation and Ubiquitous/Pervasive Computing. Several approaches have already been proposed in order to locate indoors the position of a moving target. These approaches rely on a wide range of media including RF signals, lasers, ultrasound, magnetic fields, visible light, infrared beams, speedometers etc. A combination of heterogeneous approaches is often adopted (Borenstein et al., 1996) in order to increase the accuracy of the position estimation. Cameras are widely used in a number of robotics applications (Jin et al, 2004);(Porta & Krose, 2006);(Clerentin et al, 2005);(Kzecka et al, 2005);(Gramegna et al, 2004);(Arras et al, 2001). The views captured by these cameras are processed in order to locate scale invariant landmarks that indicate the position of the robot in a familiar area (Tovar et al, 2006). Moreover, the function of the human eyes can be imitated by a pair of cameras focusing at the same direction (Seet al, 2002). The shape, the depth and the distance of the surrounding objects may be estimated by comparing the images retrieved by these cameras. It is obvious that both the computational and the architectural cost of such a solution is high. Laser scanning is often used in conjunction with the image processing techniques mentioned above (Miura et al, 2006);(Clerentin et al, 2005);(Victorino et al, 2003);(Arras et al, 2001);(Thrun, 2001). A rotating beacon is transmitting a laser beam which is reflected by the surrounding objects. The round trip time of the signal can be used for the estimation of …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:EUQCXRtRnyEC",
            "Publisher": "Book edited by: Rustam Stolkin"
        },
        {
            "Title": "Characterization of BaTiO3 thin films on p-Si",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1369800100001098",
            "Abstract": "Polycrystalline BaTiO3 thin films grown on p-Si (1 0 0) substrates by RF sputtering and subjected to a post-thermal annealing at 700°C, were characterized for potential applications as cladding insulators in AC thin-film electroluminescent devices. Building such a device requires the study of an insulator/semiconductor and an insulator/phosphor interface. The study of the BaTiO3 surface in the present work provides information on the creation of defects due to the deposition process. Rutherford backscattering spectroscopy and X-ray photoelectron spectroscopy were used to investigate the surface and bulk created defects. They showed the existence of Ba and Ti oxides formed on the surface probably due to the post thermal annealing. These oxides may be responsible for the creation of interface states between the BaTiO3 film and the subsequent deposited ZnS films in order to build an AC thin-film …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Amorphous diamondlike carbon‐silicon heterojunction devices formed by ion implantation",
            "Publication year": 1992,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.108481",
            "Abstract": "Amorphous carbon films grown onto silicon substrates and characterized as diamondlike have been ion implanted with boron and nitrogen to achieve p‐type and n‐type conductivity, respectively. Energies of 120 keV were used for the ion implantation. After isothermal heat treatment, the films revealed diode characteristics for both p‐carbon/n‐carbon and n‐carbon/p‐silicon structures. Current‐voltage characteristics and capacitance‐voltage curves show that the devices performed as heterojunctions between the carbon and the silicon. The difference between the currents for reverse and forward bias were as high as six orders of magnitude.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A Quantum Cellular Automata Type Architecture with Quantum Teleportation for Quantum Computing",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/597412",
            "Abstract": "We propose an architecture based on Quantum Cellular Automata which allows the use of only one type of quantum gate per computational step, using nearest neighbor interactions. The model is built in partial steps, each one of them analyzed using nearest neighbor interactions, starting with single-qubit operations and continuing with two-qubit ones. A demonstration of the model is given, by analyzing how the techniques can be used to design a circuit implementing the Quantum Fourier Transform. Since the model uses only one type of quantum gate at each phase of the computation, physical implementation can be easier since at each step only one kind of input pulse needs to be applied to the apparatus. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:olpn-zPbct0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Nanostructured metal oxides as cathode interfacial layers for Hybrid-polymer electronic devices",
            "Publication year": 2011,
            "Publication url": "https://www.scientific.net/AST.75.74",
            "Abstract": "We report the use of nanostructured metal oxides as cathode interfacial layers for improved performance hybrid polymer electronic devices such as light-emitting diodes (PLEDs) and solar cells. In particular, we employ a stoichiometric (WO3) and a partially reduced tungsten metal oxide (WOx)(x< 3), both deposited as very thin layers between an aluminum (Al) cathode and the active polymer layer in hybrid PLEDs and achieve improved PLED device performance reflected as an increase in the current density and luminance and a reduction of the operating voltage. On the other hand, we investigate the use of a stoichiometric tungsten oxide layer as a thin cathode interfacial layer in hybrid polymer photovoltaic cells (Hy-PVs). We demonstrate improved photovoltaic cell performance, primarily as a result of the substantial increase in the short-circuit photocurrent. The improved PLED device characteristics are attributed …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and implementation of quantum circuits for fault-tolerant architectures",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8259984/",
            "Abstract": "The circuit model of quantum computation is the most common way to achieve a high-level representation of the computing evolution in a quantum computer. By using an already proposed software tool, the design and implementation processes are described for different architectures. The utility and potency of this tool is tested. Some representative examples are demonstrated to depict how it actually contributes to the implementation of a quantum circuit. Particular facilities may speedup the implementation process. A logic circuit's implementation can be automatically transformed into a fault-tolerant one by including the auxiliary encoding circuit overhead. Different design techniques are supported and recovery mechanisms can be included.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:vRqMK49ujn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-performance and energy-efficient 256-bit CMOS priority encoder",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7987506/",
            "Abstract": "A high-performance and energy-efficient 256-bit CMOS priority encoder is presented and realized on transistor level using 32 nm predictive technology. The new circuit is designed with a full custom approach and incorporates 2 novel logic styles: the Multiple-Output Monotonic CMOS (M2CMOS) and the Dynamic Inversion technique (DI). The achieved performance is in the order of O(log2(N)), with respect to the input size. A simulation-based comparative analysis concludes that, compared to the conventional design, the proposed circuit achieves up to 57% improvement in delay, 8% improvement in energy consumption and 39% improvement in EDP, while maintaining 20% smaller transistor count.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and simulation of NAND gates made of single electron devices",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621550/",
            "Abstract": "In this paper we present NAND gates designed using single electron logic. First the single-electron NAND behaviour is studied and then the energy performance of the circuit is examined. The whole design and simulation is made using a Monte-Carlo based tool. The results proved that the circuits were behaving as NAND gates, while the free energy study of the system and the stability diagram verified the correct functioning of the circuit.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A methodology for the implementation of MOSFETs with a high-k dielectric gate material on the design of 90 nm technology circuits",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210801976461",
            "Abstract": "Up to date, MOSFETs have been made through well established techniques that use SiO2 as the gate dielectric and the related design issues are well established. The need to scale down device dimensions allowed researchers to seek for alternative materials, in order to replace SiO2 as the gate dielectric. The implementation of such MOS devices in memory or logic circuits needs to take into account the effects that the use of the new gate dielectrics has on parameters such as the threshold voltage and the drain current. Hence, parameters such as the high dielectric constant values, extra oxide charges and process related defects at the physical level must be taken into account during the device design. As far as circuit applications are concerned, these changes may substantially affect the required performance. This paper presents and provides proposals about the issue of replacing commonly used parameters …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Position Estimation on a Grid Based on Infrared Pattern Reception Features",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/66442028/e602c600dea1fdd1f2387452685a15493171.pdf",
            "Abstract": "The location of the position of a moving target on a grid plane is studied in this paper. The estimation method is based on encountering the number of infrared patterns that arrive to the target as expected, unexpected or out of order. Since the position of the target is not determined by an analog signal intensity, no high precision sensors and measurements are required and the coordinate estimation can be carried out by a pair of transmitters and a pair of sensors on the moving target. The speed of the estimation is adjustable according to the desired accuracy. An error of less than 5% can be reached in most of the covered area. The presented system can be used in a number of automation, robotics, virtual reality and ubiquitous applications.",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterisation of Diamond-like thin films and heterodiodes",
            "Publication year": 1993,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rC2jKL0AAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the use of fdtd and ray-tracing schemes in the nanonetwork environment",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6892966/",
            "Abstract": "In this letter, the finite difference time-domain (FDTD) method and the ray-tracing (RT) technique are systematically revisited and compared as potential tools that can reliably characterize new protocols for emerging nanonetwork applications. To this aim, a set of efficient simulation schemes for the precise prediction of the reception quality in various communication scenarios is presented. In particular, each algorithm involves a similar configuration with a realistic transmitter/receiver model and multiple obstacles sized up to some micrometers. The proposed analysis reveals that, unlike conventional assessments, the RT approach can be successfully employed at nanoscale dimensions, with increasing accuracy at higher frequencies, as a tool for fast received-energy estimations, since its results are in acceptable agreement with the respective FDTD data. These significant deductions are, finally, substantiated by a …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of Low-Power High-Performance 2–4 and 4–16 Mixed-Logic Line Decoders",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7453163/",
            "Abstract": "This brief introduces a mixed-logic design method for line decoders, combining transmission gate logic, pass transistor dual-value logic, and static complementary metal-oxide semiconductor (CMOS). Two novel topologies are presented for the 2-4 decoder: a 14-transistor topology aiming on minimizing transistor count and power dissipation and a 15-transistor topology aiming on high power-delay performance. Both normal and inverting decoders are implemented in each case, yielding a total of four new designs. Furthermore, four new 4-16 decoders are designed by using mixed-logic 2-4 predecoders combined with standard CMOS postdecoder. All proposed decoders have full-swinging capability and reduced transistor count compared to their conventional CMOS counterparts. Finally, a variety of comparative spice simulations at 32 nm shows that the proposed circuits present a significant improvement in power …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantum pattern recognition for local sequence alignment",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8269076/",
            "Abstract": "Over the last two decades, there have been some challenging proposals on the field of pattern recognition by means of quantum technology. The application of them is considered for a popular branch of bioinformatics which analyzes massive amounts of sequence data for genes and proteins. More specific, the Smith-Waterman algorithm is studied under the more general term of local sequence alignment. The steps of this algorithm are totally reformed and powered by the quantum mechanics computing theory. The proposed method is based on R. Schützhold's pattern recognition quantum algorithm. A binary and unstructured data set is formed after the comparison of the sequences under alignment which is used by R. Schützhold's algorithm to identify and locate potential patterns. It is achieved with the aid of a spatial light modulator. The adopted quantum algorithm exhibits an exponential speed-up in …",
            "Abstract entirety": 0,
            "Author pub id": "rC2jKL0AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        }
    ]
}]